Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_kmeans_digits.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_kmeans_digits.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_kmeans_digits.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: A demo of K-Means clustering on the handwritten digits data
es_es: Demostración (demo) del agrupamiento por K-Medias en los datos de dígitos escritos a mano

source: In this example we compare the various initialization strategies for K-means in terms of runtime and quality of the results.
es_es: En este ejemplo comparamos las distintas estrategias de inicialización para K-medias en términos de tiempo de ejecución y calidad de los resultados.

source: As the ground truth is known here, we also apply different cluster quality metrics to judge the goodness of fit of the cluster labels to the ground truth.
es_es: Como la verdad fundamental es conocida aquí, también aplicamos diferentes métricas de calidad de los conglomerados para juzgar la bondad de ajuste de las etiquetas de los conglomerados a la verdad fundamental.

source: Cluster quality metrics evaluated (see :ref:`clustering_evaluation` for definitions and discussions of the metrics):
es_es: Métricas de calidad del conglomerado evaluadas (consulta :ref:`clustering_evaluation` para las definiciones y discusiones de las métricas):

source: Shorthand
es_es: Abreviatura

source: full name
es_es: nombre completo

source: homogeneity score
es_es: homogeneity score (puntuación de homogeneidad)

source: completeness score
es_es: completeness score (puntuación de completitud)

source: V measure
es_es: V measure (Medida V)

source: adjusted Rand index
es_es: adjusted Rand index (índice de Rand ajustado)

source: adjusted mutual information
es_es: adjusted mutual information (información mutua ajustada)

source: silhouette coefficient
es_es: silhouette coefficient (coeficiente de silueta)

source: Load the dataset
es_es: Cargar el conjunto de datos

source: We will start by loading the `digits` dataset. This dataset contains handwritten digits from 0 to 9. In the context of clustering, one would like to group images such that the handwritten digits on the image are the same.
es_es: Empezaremos cargando el conjunto de datos `digits`. Este conjunto de datos contiene dígitos escritos a mano del 0 al 9. En el contexto del conglomerado, se quiere agrupar las imágenes de manera que los dígitos escritos a mano en la imagen sean los mismos.

source: Define our evaluation benchmark
es_es: Define nuestro punto de referencia para la evaluación

source: We will first our evaluation benchmark. During this benchmark, we intend to compare different initialization methods for KMeans. Our benchmark will:
es_es: Primero veremos nuestro punto de referencia de evaluación. Durante este punto de referencia, pretendemos comparar diferentes métodos de inicialización para KMeans. Nuestro punto de referencia será:

source: create a pipeline which will scale the data using a :class:`~sklearn.preprocessing.StandardScaler`;
es_es: crea un pipeline que escalará los datos usando un :class:`~sklearn.preprocessing.StandardScaler`;

source: train and time the pipeline fitting;
es_es: entrena y cronometra el ajuste del pipeline;

source: measure the performance of the clustering obtained via different metrics.
es_es: mide el rendimiento del agrupamiento obtenido a través de diferentes métricas.

source: Run the benchmark
es_es: Ejecutar el punto de referencia

source: We will compare three approaches:
es_es: Compararemos tres enfoques:

source: an initialization using `kmeans++`. This method is stochastic and we will run the initialization 4 times;
es_es: una inicialización utilizando `kmeans++`. Este método es estocástico y ejecutaremos la inicialización 4 veces;

source: a random initialization. This method is stochastic as well and we will run the initialization 4 times;
es_es: una inicialización aleatoria. Este método también es estocástico y ejecutaremos la inicialización 4 veces;

source: an initialization based on a :class:`~sklearn.decomposition.PCA` projection. Indeed, we will use the components of the :class:`~sklearn.decomposition.PCA` to initialize KMeans. This method is deterministic and a single initialization suffice.
es_es: una inicialización basada en una proyección :class:`~sklearn.decomposition.PCA`. De hecho, utilizaremos los componentes de :class:`~sklearn.decomposition.PCA` para inicializar KMeans. Este método es determinista y una sola inicialización es suficiente.

source: Visualize the results on PCA-reduced data
es_es: Visualiza los resultados de los datos reducidos por el PCA

source: :class:`~sklearn.decomposition.PCA` allows to project the data from the original 64-dimensional space into a lower dimensional space. Subsequently, we can use :class:`~sklearn.decomposition.PCA` to project into a 2-dimensional space and plot the data and the clusters in this new space.
es_es: :class:`~sklearn.decomposition.PCA` permite proyectar los datos desde el espacio original de 64 dimensiones a un espacio de menor dimensión. Posteriormente, podemos utilizar :class:`~sklearn.decomposition.PCA` para proyectar en un espacio de 2 dimensiones y graficar los datos y los conglomerados en este nuevo espacio.

source: **Total running time of the script:** ( 0 minutes 2.567 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.567 segundos)

source: :download:`Download Python source code: plot_kmeans_digits.py <plot_kmeans_digits.py>`
es_es: :download:`Descargar el código fuente de Python: plot_kmeans_digits.py <plot_kmeans_digits.py>`

source: :download:`Download Jupyter notebook: plot_kmeans_digits.ipynb <plot_kmeans_digits.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_kmeans_digits.ipynb <plot_kmeans_digits.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
