Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_adjusted_for_chance_measures.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_adjusted_for_chance_measures.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_adjusted_for_chance_measures.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Adjustment for chance in clustering performance evaluation
es_es: Ajuste al azar en la evaluación del rendimiento del agrupamiento

source: The following plots demonstrate the impact of the number of clusters and number of samples on various clustering performance evaluation metrics.
es_es: Los siguientes gráficos demuestran el impacto del número de conglomerados y del número de muestras en varias métricas de evaluación del rendimiento del agrupamiento.

source: Non-adjusted measures such as the V-Measure show a dependency between the number of clusters and the number of samples: the mean V-Measure of random labeling increases significantly as the number of clusters is closer to the total number of samples used to compute the measure.
es_es: Las medidas no ajustadas, como la Medida V, muestran una dependencia entre el número de conglomerados y el número de muestras: la media de la Medida V del etiquetado aleatorio aumenta significativamente a medida que el número de conglomerados se acerca al número total de muestras utilizadas para calcular la medida.

source: Adjusted for chance measure such as ARI display some random variations centered around a mean score of 0.0 for any number of samples and clusters.
es_es: Las medidas ajustadas al azar, como el ARI, muestran algunas variaciones aleatorias centradas en una puntuación media de 0.0 para cualquier número de muestras y conglomerados.

source: Only adjusted measures can hence safely be used as a consensus index to evaluate the average stability of clustering algorithms for a given value of k on various overlapping sub-samples of the dataset.
es_es: Por tanto, sólo las medidas ajustadas pueden utilizarse con seguridad como índice de consenso para evaluar la estabilidad promedio de los algoritmos de agrupamiento para un valor determinado de k en varias submuestras superpuestas del conjunto de datos.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 1.202 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.202 segundos)

source: :download:`Download Python source code: plot_adjusted_for_chance_measures.py <plot_adjusted_for_chance_measures.py>`
es_es: :download:`Descargar el código fuente de Python: plot_adjusted_for_chance_measures.py <plot_adjusted_for_chance_measures.py>`

source: :download:`Download Jupyter notebook: plot_adjusted_for_chance_measures.ipynb <plot_adjusted_for_chance_measures.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_adjusted_for_chance_measures.ipynb <plot_adjusted_for_chance_measures.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
