Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_linkage_comparison.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_linkage_comparison.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_linkage_comparison.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparing different hierarchical linkage methods on toy datasets
es_es: Comparación de diferentes métodos de enlazamiento jerárquico en conjuntos de datos de juguete

source: This example shows characteristics of different linkage methods for hierarchical clustering on datasets that are "interesting" but still in 2D.
es_es: Este ejemplo muestra las características de diferentes métodos de enlazamiento para el agrupamiento jerárquico en conjuntos de datos "interesantes" pero todavía en 2D.

source: The main observations to make are:
es_es: Las principales observaciones que hay que hacer son:

source: single linkage is fast, and can perform well on non-globular data, but it performs poorly in the presence of noise.
es_es: el enlazamiento simple es rápido y puede funcionar bien con datos no globulares, pero funciona mal en presencia de ruido.

source: average and complete linkage perform well on cleanly separated globular clusters, but have mixed results otherwise.
es_es: el enlazamiento promedio y completo funciona bien en los conglomerados globulares limpiamente separados, pero tiene resultados mixtos en los demás casos.

source: Ward is the most effective method for noisy data.
es_es: Ward es el método más eficaz para los datos ruidosos.

source: While these examples give some intuition about the algorithms, this intuition might not apply to very high dimensional data.
es_es: Si bien estos ejemplos permiten intuir los algoritmos, esta intuición podría no aplicarse a datos de dimensiones muy altas.

source: Generate datasets. We choose the size big enough to see the scalability of the algorithms, but not too big to avoid too long running times
es_es: Generar conjuntos de datos. Elegimos el tamaño lo suficientemente grande para ver la escalabilidad de los algoritmos, pero no demasiado grande para evitar tiempos de ejecución demasiado largos

source: Run the clustering and plot
es_es: Ejecuta el agrupamiento y el gráfico

source: **Total running time of the script:** ( 0 minutes 2.334 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.334 segundos)

source: :download:`Download Python source code: plot_linkage_comparison.py <plot_linkage_comparison.py>`
es_es: :download:`Descargar el código fuente de Python: plot_linkage_comparison.py <plot_linkage_comparison.py>`

source: :download:`Download Jupyter notebook: plot_linkage_comparison.ipynb <plot_linkage_comparison.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_linkage_comparison.ipynb <plot_linkage_comparison.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
