Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_cluster_comparison.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_cluster_comparison.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_cluster_comparison.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparing different clustering algorithms on toy datasets
es_es: Comparación de diferentes algoritmos de agrupamiento en conjuntos de datos de juguete

source: This example shows characteristics of different clustering algorithms on datasets that are "interesting" but still in 2D. With the exception of the last dataset, the parameters of each of these dataset-algorithm pairs has been tuned to produce good clustering results. Some algorithms are more sensitive to parameter values than others.
es_es: Este ejemplo muestra las características de diferentes algoritmos de agrupamiento en conjuntos de datos "interesantes" pero todavía en 2D. Con la excepción del último conjunto de datos, los parámetros de cada uno de estos pares conjunto de datos-algoritmo se han ajustado para producir buenos resultados de agrupamiento. Algunos algoritmos son más sensibles a los valores de los parámetros que otros.

source: The last dataset is an example of a 'null' situation for clustering: the data is homogeneous, and there is no good clustering. For this example, the null dataset uses the same parameters as the dataset in the row above it, which represents a mismatch in the parameter values and the data structure.
es_es: El último conjunto de datos es un ejemplo de una situación 'nula' para el agrupamiento: los datos son homogéneos y no hay un buen conglomeradi. Para este ejemplo, el conjunto de datos nulo utiliza los mismos parámetros que el conjunto de datos de la fila anterior, lo que representa un desajuste en los valores de los parámetros y la estructura de los datos.

source: While these examples give some intuition about the algorithms, this intuition might not apply to very high dimensional data.
es_es: Si bien estos ejemplos permiten intuir los algoritmos, esta intuición podría no aplicarse a datos de dimensiones muy altas.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 46.603 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 46.603 segundos)

source: :download:`Download Python source code: plot_cluster_comparison.py <plot_cluster_comparison.py>`
es_es: :download:`Descargar el código fuente de Python: plot_cluster_comparison.py <plot_cluster_comparison.py>`

source: :download:`Download Jupyter notebook: plot_cluster_comparison.ipynb <plot_cluster_comparison.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_cluster_comparison.ipynb <plot_cluster_comparison.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
