Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_kmeans_silhouette_analysis.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_kmeans_silhouette_analysis.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_kmeans_silhouette_analysis.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Selecting the number of clusters with silhouette analysis on KMeans clustering
es_es: Selección del número de conglomerados con el análisis de silueta en el agrupamiento KMedias (KMeans)

source: Silhouette analysis can be used to study the separation distance between the resulting clusters. The silhouette plot displays a measure of how close each point in one cluster is to points in the neighboring clusters and thus provides a way to assess parameters like number of clusters visually. This measure has a range of [-1, 1].
es_es: El análisis de siluetas puede utilizarse para estudiar la distancia de separación entre los conglomerados resultantes. El gráfico de silueta muestra una medida de la proximidad de cada punto de un conglomerados a los puntos de los conglomerados vecinos y, por tanto, proporciona una forma de evaluar visualmente parámetros como el número de conglomerados. Esta medida tiene un rango de [-1, 1].

source: Silhouette coefficients (as these values are referred to as) near +1 indicate that the sample is far away from the neighboring clusters. A value of 0 indicates that the sample is on or very close to the decision boundary between two neighboring clusters and negative values indicate that those samples might have been assigned to the wrong cluster.
es_es: Los coeficientes de silueta (como se denominan estos valores) cercanos a +1 indican que la muestra está lejos de los conglomerados vecinos. Un valor de 0 indica que la muestra está en la frontera de decisión entre dos conglomerados vecinos o muy cerca de ella, y los valores negativos indican que esas muestras podrían haber sido asignadas al conglomerado equivocado.

source: In this example the silhouette analysis is used to choose an optimal value for ``n_clusters``. The silhouette plot shows that the ``n_clusters`` value of 3, 5 and 6 are a bad pick for the given data due to the presence of clusters with below average silhouette scores and also due to wide fluctuations in the size of the silhouette plots. Silhouette analysis is more ambivalent in deciding between 2 and 4.
es_es: En este ejemplo se utiliza el análisis de siluetas para elegir un valor óptimo de ``n_clusters``. El gráfico de silueta muestra que los valores de ``n_clusters`` de 3, 5 y 6 son una mala elección para los datos dados debido a la presencia de conglomerados con puntuaciones de silueta inferiores al promedio y también debido a las amplias fluctuaciones en el tamaño de los gráficos de silueta. El análisis de siluetas es más ambivalente a la hora de decidir entre 2 y 4.

source: Also from the thickness of the silhouette plot the cluster size can be visualized. The silhouette plot for cluster 0 when ``n_clusters`` is equal to 2, is bigger in size owing to the grouping of the 3 sub clusters into one big cluster. However when the ``n_clusters`` is equal to 4, all the plots are more or less of similar thickness and hence are of similar sizes as can be also verified from the labelled scatter plot on the right.
es_es: También se puede visualizar el tamaño del conglomerado a partir del grosor del gráfico de silueta. El gráfico de silueta del conglomerado 0, cuando ``n_clusters`` es igual a 2, es más grande debido a la agrupación de los 3 subconglomerados en un gran conglomerado. Sin embargo, cuando el valor de ``n_clusters`` es igual a 4, todos los gráficos tienen un grosor más o menos similar y, por lo tanto, son de tamaños similares, como puede comprobarse también en el gráfico de dispersión etiquetado a la derecha.

source: **Total running time of the script:** ( 0 minutes 2.054 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.054 segundos)

source: :download:`Download Python source code: plot_kmeans_silhouette_analysis.py <plot_kmeans_silhouette_analysis.py>`
es_es: :download:`Descargar el código fuente de Python: plot_kmeans_silhouette_analysis.py <plot_kmeans_silhouette_analysis.py>`

source: :download:`Download Jupyter notebook: plot_kmeans_silhouette_analysis.ipynb <plot_kmeans_silhouette_analysis.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_kmeans_silhouette_analysis.ipynb <plot_kmeans_silhouette_analysis.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
