Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_inductive_clustering.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_inductive_clustering.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_inductive_clustering.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Inductive Clustering
es_es: Agrupamiento Inductivo

source: Clustering can be expensive, especially when our dataset contains millions of datapoints. Many clustering algorithms are not :term:`inductive` and so cannot be directly applied to new data samples without recomputing the clustering, which may be intractable. Instead, we can use clustering to then learn an inductive model with a classifier, which has several benefits:
es_es: El agrupamiento puede ser costoso, especialmente cuando nuestro conjunto de datos contiene millones de puntos de datos. Muchos algoritmos de agrupamiento no son :term:`inductivos <inductive>` y, por tanto, no pueden aplicarse directamente a nuevas muestras de datos sin volver a calcular el conglomerado, lo que puede resultar intratable. En cambio, podemos utilizar el agrupamiento para aprender un modelo inductivo con un clasificador, lo que tiene varias ventajas:

source: it allows the clusters to scale and apply to new data
es_es: permite a los conglomerados escalar y aplicarse a nuevos datos

source: unlike re-fitting the clusters to new samples, it makes sure the labelling procedure is consistent over time
es_es: a diferencia de reajustar los conglomerados a las nuevas muestras, se asegura que el procedimiento de etiquetado sea consistente a lo largo del tiempo

source: it allows us to use the inferential capabilities of the classifier to describe or explain the clusters
es_es: nos permite utilizar las capacidades inferenciales del clasificador para describir o explicar los conglomerados

source: This example illustrates a generic implementation of a meta-estimator which extends clustering by inducing a classifier from the cluster labels.
es_es: Este ejemplo ilustra una implementación genérica de un meta-estimador que extiende el agrupamiento induciendo un clasificador a partir de las etiquetas del conglomerado.

source: **Total running time of the script:** ( 0 minutes 2.367 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.367 segundos)

source: :download:`Download Python source code: plot_inductive_clustering.py <plot_inductive_clustering.py>`
es_es: :download:`Descargar el código fuente de Python: plot_inductive_clustering.py <plot_inductive_clustering.py>`

source: :download:`Download Jupyter notebook: plot_inductive_clustering.ipynb <plot_inductive_clustering.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_inductive_clustering.ipynb <plot_inductive_clustering.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
