Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_color_quantization.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_color_quantization.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_color_quantization.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Color Quantization using K-Means
es_es: Cuantificación del color utilizando K-Medias

source: Performs a pixel-wise Vector Quantization (VQ) of an image of the summer palace (China), reducing the number of colors required to show the image from 96,615 unique colors to 64, while preserving the overall appearance quality.
es_es: Realiza una cuantificación vectorial (VQ) por píxeles de una imagen del palacio de verano (China), reduciendo el número de colores necesarios para mostrar la imagen de 96,615 colores únicos a 64, al tiempo que se conserva la calidad de apariencia general.

source: In this example, pixels are represented in a 3D-space and K-means is used to find 64 color clusters. In the image processing literature, the codebook obtained from K-means (the cluster centers) is called the color palette. Using a single byte, up to 256 colors can be addressed, whereas an RGB encoding requires 3 bytes per pixel. The GIF file format, for example, uses such a palette.
es_es: En este ejemplo, los píxeles se representan en un espacio 3D y se utiliza K-medias para encontrar 64 conglomerados de color. En la literatura de procesamiento de imágenes, el libro de códigos obtenido a partir de K-medias (los centros de los conglomerados) se denominan paleta de colores. Utilizando un solo byte, se pueden abordar hasta 256 colores, mientras que una codificación RGB requiere 3 bytes por píxel. El formato de archivo GIF, por ejemplo, utiliza una paleta de este tipo.

source: For comparison, a quantized image using a random codebook (colors picked up randomly) is also shown.
es_es: A modo de comparación, también se muestra una imagen cuantificada utilizando un libro de códigos aleatorio (colores elegidos aleatoriamente).

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 2.704 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.704 segundos)

source: :download:`Download Python source code: plot_color_quantization.py <plot_color_quantization.py>`
es_es: :download:`Descargar el código fuente de Python: plot_color_quantization.py <plot_color_quantization.py>`

source: :download:`Download Jupyter notebook: plot_color_quantization.ipynb <plot_color_quantization.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_color_quantization.ipynb <plot_color_quantization.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
