Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/cluster/plot_coin_segmentation.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_cluster_plot_coin_segmentation.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_cluster_plot_coin_segmentation.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Segmenting the picture of greek coins in regions
es_es: Segmentación de la imagen de las monedas griegas en regiones

source: This example uses :ref:`spectral_clustering` on a graph created from voxel-to-voxel difference on an image to break this image into multiple partly-homogeneous regions.
es_es: Este ejemplo utiliza :ref:`spectral_clustering` en un grafo creado a partir de la diferencia entre vóxeles de una imagen para dividir esta imagen en múltiples regiones parcialmente homogéneas.

source: This procedure (spectral clustering on an image) is an efficient approximate solution for finding normalized graph cuts.
es_es: Este procedimiento (agrupamiento espectral sobre una imagen) es una solución aproximada eficiente para encontrar cortes de grafos normalizados.

source: There are two options to assign labels:
es_es: Hay dos opciones para asignar etiquetas:

source: with 'kmeans' spectral clustering will cluster samples in the embedding space using a kmeans algorithm
es_es: con el agrupamiento espectral 'kmedias' agrupará las muestras en el espacio de incrustación utilizando un algoritmo kmeans

source: whereas 'discrete' will iteratively search for the closest partition space to the embedding space.
es_es: mientras que 'discrete' buscará iterativamente el espacio de partición más cercano al espacio de incrustación.

source: Visualize the resulting regions
es_es: Visualizar las regiones resultantes

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 12.463 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 12.463 segundos)

source: :download:`Download Python source code: plot_coin_segmentation.py <plot_coin_segmentation.py>`
es_es: :download:`Descargar el código fuente de Python: plot_coin_segmentation.py <plot_coin_segmentation.py>`

source: :download:`Download Jupyter notebook: plot_coin_segmentation.ipynb <plot_coin_segmentation.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_coin_segmentation.ipynb <plot_coin_segmentation.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
