Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/inspection/plot_linear_model_coefficient_interpretation.po
Languages: es_es

source: Lasso models (see the :ref:`lasso` User Guide section) estimates sparse coefficients. LassoCV applies cross validation in order to determine which value of the regularization parameter (`alpha`) is best suited for the model estimation.
es_es: Los modelos Lasso (ver la sección del Manual de Usuario :ref:`lasso`) estiman coeficientes dispersos. LassoCV aplica la validación cruzada para determinar qué valor del parámetro de regularización (`alpha`) es el más adecuado para la estimación del modelo.

source: First we verify which value of :math:`\alpha` has been selected.
es_es: Primero verificamos qué valor de :math:`\alpha` ha sido seleccionado.

source: For our dataset, again the model is not very predictive.
es_es: Para nuestro conjunto de datos, de nuevo el modelo no es muy predictivo.

source: A Lasso model identifies the correlation between AGE and EXPERIENCE and suppresses one of them for the sake of the prediction.
es_es: Un modelo Lasso identifica la correlación entre AGE y EXPERIENCE y suprime uno de ellas en aras de la predicción.

source: It is important to keep in mind that the coefficients that have been dropped may still be related to the outcome by themselves: the model chose to suppress them because they bring little or no additional information on top of the other features. Additionnaly, this selection is unstable for correlated features, and should be interpreted with caution.
es_es: Es importante tener en cuenta que los coeficientes que se han eliminado aún pueden estar relacionados con el resultado por sí mismos: el modelo decidió suprimirlos porque aportan poca o ninguna información adicional sobre las otras características. Además, esta selección es inestable para las características correlacionadas, y debe interpretarse con precaución.

source: Lessons learned
es_es: Lecciones aprendidas

source: Coefficients must be scaled to the same unit of measure to retrieve feature importance. Scaling them with the standard-deviation of the feature is a useful proxy.
es_es: Los coeficientes deben escalarse a la misma unidad de medida para recuperar la importancia de las características. Una aproximación útil es escalarlos con la desviación estándar de la característica.

source: Coefficients in multivariate linear models represent the dependency between a given feature and the target, **conditional** on the other features.
es_es: Los coeficientes de los modelos lineales multivariantes representan la dependencia entre una característica determinada y el objetivo, **condicionada** a las demás características.

source: Correlated features induce instabilities in the coefficients of linear models and their effects cannot be well teased apart.
es_es: Las características correlacionadas inducen inestabilidades en los coeficientes de los modelos lineales y sus efectos no se pueden separar bien.

source: Different linear models respond differently to feature correlation and coefficients could significantly vary from one another.
es_es: Los distintos modelos lineales responden de manera diferente a la correlación de las característica y los coeficientes podrían variar significativamente entre sí.

source: Inspecting coefficients across the folds of a cross-validation loop gives an idea of their stability.
es_es: La inspección de los coeficientes en los pliegues de un bucle de validación cruzada da una idea de su estabilidad.

source: **Total running time of the script:** ( 0 minutes 17.976 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 17.976 segundos)

source: :download:`Download Python source code: plot_linear_model_coefficient_interpretation.py <plot_linear_model_coefficient_interpretation.py>`
es_es: :download:`Descargar el código fuente de Python: plot_linear_model_coefficient_interpretation.py <plot_linear_model_coefficient_interpretation.py>`

source: :download:`Download Jupyter notebook: plot_linear_model_coefficient_interpretation.ipynb <plot_linear_model_coefficient_interpretation.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_linear_model_coefficient_interpretation.ipynb <plot_linear_model_coefficient_interpretation.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
