Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/inspection/plot_partial_dependence.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_inspection_plot_partial_dependence.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_inspection_plot_partial_dependence.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Partial Dependence and Individual Conditional Expectation Plots
es_es: Gráficos de Dependencia Parcial y de Expectativa Condicional Individual

source: Partial dependence plots show the dependence between the target function [2]_ and a set of features of interest, marginalizing over the values of all other features (the complement features). Due to the limits of human perception, the size of the set of features of interest must be small (usually, one or two) thus they are usually chosen among the most important features.
es_es: Los gráficos de dependencia parcial muestran la dependencia entre la función objetivo [2]_ y un conjunto de características de interés, marginando sobre los valores de todas las demás características (las características del complemento). Debido a los límites de la percepción humana, el tamaño del conjunto de características de interés debe ser pequeño (normalmente, uno o dos), por lo que se suelen elegir entre las características más importantes.

source: Similarly, an individual conditional expectation (ICE) plot [3]_ shows the dependence between the target function and a feature of interest. However, unlike partial dependence plots, which show the average effect of the features of interest, ICE plots visualize the dependence of the prediction on a feature for each :term:`sample` separately, with one line per sample. Only one feature of interest is supported for ICE plots.
es_es: De forma similar, un gráfico de expectativa condicional individual (ICE) [3]_ muestra la dependencia entre la función objetivo y una característica de interés. Sin embargo, a diferencia de los gráficos de dependencia parcial, que muestran el efecto promedio de las características de interés, los gráficos ICE visualizan la dependencia de la predicción de una característica para cada :term:`muestra` por separado, con una línea por muestra. Sólo se admite una característica de interés para los gráficos ICE.

source: This example shows how to obtain partial dependence and ICE plots from a :class:`~sklearn.neural_network.MLPRegressor` and a :class:`~sklearn.ensemble.HistGradientBoostingRegressor` trained on the California housing dataset. The example is taken from [1]_.
es_es: Este ejemplo muestra cómo obtener gráficos de dependencia parcial e ICE de un :class:`~sklearn.neural_network.MLPRegressor` y un :class:`~sklearn.ensemble.HistGradientBoostingRegressor` entrenados en el conjunto de datos de viviendas de California. El ejemplo está tomado de [1]_.

source: For classification you can think of it as the regression score before the link function.
es_es: En el caso de la clasificación, se puede considerar como la puntuación de regresión antes de la función de enlace.

source: California Housing data preprocessing
es_es: Preprocesamiento de los datos de las Viviendas de California

source: Center target to avoid gradient boosting init bias: gradient boosting with the 'recursion' method does not account for the initial estimator (here the average target, by default).
es_es: Objetivo central para evitar el sesgo inicial de la potenciación de gradiente: la potenciación de gradiente con el método 'recursion' no tiene en cuenta el estimador inicial (aquí el objetivo promedio, por defecto).

source: 1-way partial dependence with different models
es_es: Dependencia parcial unidireccional con diferentes modelos

source: In this section, we will compute 1-way partial dependence with two different machine-learning models: (i) a multi-layer perceptron and (ii) a gradient-boosting. With these two models, we illustrate how to compute and interpret both partial dependence plot (PDP) and individual conditional expectation (ICE).
es_es: En esta sección, calcularemos la dependencia parcial unidereccional con dos modelos diferentes de aprendizaje automático: (i) un perceptrón multicapa y (ii) una potenciación del gradiente. Con estos dos modelos, ilustramos cómo calcular e interpretar tanto el gráfico de dependencia parcial (PDP) como la expectativa condicional individual (ICE).

source: Multi-layer perceptron
es_es: Perceptrón multicapa

source: Let's fit a :class:`~sklearn.neural_network.MLPRegressor` and compute single-variable partial dependence plots.
es_es: Vamos a ajustar un :class:`~sklearn.neural_network.MLPRegressor` y calcular gráficos de dependencia parcial de una sola variable.

source: We configured a pipeline to scale the numerical input features and tuned the neural network size and learning rate to get a reasonable compromise between training time and predictive performance on a test set.
es_es: Configuramos un pipeline para escalar las características numéricas de entrada y ajustamos el tamaño de la red neuronal y la tasa de aprendizaje para obtener un compromiso razonable entre el tiempo de entrenamiento y el rendimiento predictivo en un conjunto de pruebas.

source: Importantly, this tabular dataset has very different dynamic ranges for its features. Neural networks tend to be very sensitive to features with varying scales and forgetting to preprocess the numeric feature would lead to a very poor model.
es_es: Es importante destacar que este conjunto de datos tabulares tiene rangos dinámicos muy diferentes para sus características. Las redes neuronales tienden a ser muy sensibles a las características con escalas variables y olvidarse de preprocesar la característica numérica conduciría a un modelo muy pobre.

source: It would be possible to get even higher predictive performance with a larger neural network but the training would also be significantly more expensive.
es_es: Sería posible obtener un rendimiento predictivo aún mayor con una red neuronal más grande, pero el entrenamiento también sería significativamente más costoso.

source: Note that it is important to check that the model is accurate enough on a test set before plotting the partial dependence since there would be little use in explaining the impact of a given feature on the prediction function of a poor model.
es_es: Ten en cuenta que es importante comprobar que el modelo es lo suficientemente preciso en un conjunto de pruebas antes de graficar la dependencia parcial, ya que de poco serviría explicar el impacto de una característica determinada en la función de predicción de un modelo deficiente.

source: We will plot the partial dependence, both individual (ICE) and averaged one (PDP). We limit to only 50 ICE curves to not overcrowd the plot.
es_es: Graficaremos la dependencia parcial, tanto individual (ICE) como promediada (PDP). Nos limitamos a sólo 50 curvas ICE para no saturar el gráfico.

source: Gradient boosting
es_es: Potenciación del gradiente

source: Let's now fit a :class:`~sklearn.ensemble.HistGradientBoostingRegressor` and compute the partial dependence on the same features.
es_es: Ahora vamos a ajustar un :class:`~sklearn.ensemble.HistGradientBoostingRegressor` y calcular la dependencia parcial de las mismas características.

source: Here, we used the default hyperparameters for the gradient boosting model without any preprocessing as tree-based models are naturally robust to monotonic transformations of numerical features.
es_es: En este caso, utilizamos los hiperparámetros predeterminados para el modelo de potenciación del gradiente sin ningún tipo de preprocesamiento, ya que los modelos basados en árboles son naturalmente robustos a las transformaciones monótonas de las características numéricas.

source: Note that on this tabular dataset, Gradient Boosting Machines are both significantly faster to train and more accurate than neural networks. It is also significantly cheaper to tune their hyperparameters (the defaults tend to work well while this is not often the case for neural networks).
es_es: Observa que, en este conjunto de datos tabulares, las Máquinas de Potenciación del Gradiente son significativamente más rápidas de entrenar y más precisas que las redes neuronales. También es mucho más barato ajustar sus hiperparámetros (los valores predeterminados suelen funcionar bien, mientras que esto no suele ocurrir con las redes neuronales).

source: Analysis of the plots
es_es: Análisis de los gráficos

source: We can clearly see on the PDPs (thick blue line) that the median house price shows a linear relationship with the median income (top left) and that the house price drops when the average occupants per household increases (top middle). The top right plot shows that the house age in a district does not have a strong influence on the (median) house price; so does the average rooms per household.
es_es: Podemos ver claramente en los PDP (línea azul gruesa) que el precio medio de la vivienda muestra una relación lineal con el ingreso medio (arriba a la izquierda) y que el precio de la vivienda baja cuando aumenta el promedio de ocupantes por hogar (arriba al centro). El gráfico de arriba a la derecha muestra que la edad de la vivienda en un distrito no tiene una gran influencia en el precio (medio) de la vivienda; lo mismo ocurre con el promedio de habitaciones por hogar.

source: The ICE curves (light blue lines) complement the analysis: we can see that there are some exceptions, where the house price remain constant with median income and average occupants. On the other hand, while the house age (top right) does not have a strong influence on the median house price on average, there seems to be a number of exceptions where the house price increase when between the ages 15-25. Similar exceptions can be observed for the average number of rooms (bottom left). Therefore, ICE plots show some individual effect which are attenuated by taking the averages.
es_es: Las curvas ICE (líneas azul claro) complementan el análisis: podemos ver que hay algunas excepciones, en las que el precio de la vivienda permanece constante con el ingreso medio y los ocupantes promedio. Por otra parte, aunque la edad de la vivienda (arriba a la derecha) no tiene una gran influencia en el precio medio de la vivienda, parece que hay algunas excepciones en las que el precio de la vivienda aumenta cuando se encuentra entre los 15 y los 25 años. Se observan excepciones similares para el número promedio de habitaciones (abajo a la izquierda). Por lo tanto, los gráficos ICE muestran algún efecto individual que se atenúa al tomar los promedios.

source: In all plots, the tick marks on the x-axis represent the deciles of the feature values in the training data.
es_es: En todos los gráficos, las marcas en el eje x representan los deciles de los valores de las características en los datos de entrenamiento.

source: We also observe that :class:`~sklearn.neural_network.MLPRegressor` has much smoother predictions than :class:`~sklearn.ensemble.HistGradientBoostingRegressor`.
es_es: También observamos que :class:`~sklearn.neural_network.MLPRegressor` tiene predicciones mucho más suaves que :class:`~sklearn.ensemble.HistGradientBoostingRegressor`.

source: However, it is worth noting that we are creating potential meaningless synthetic samples if features are correlated.
es_es: Sin embargo, hay que tener en cuenta que estamos creando posibles muestras sintéticas sin sentido si las características están correlacionadas.

source: 2D interaction plots
es_es: Gráficos de interacción 2D

source: PDPs with two features of interest enable us to visualize interactions among them. However, ICEs cannot be plotted in an easy manner and thus interpreted. Another consideration is linked to the performance to compute the PDPs. With the tree-based algorithm, when only PDPs are requested, they can be computed on an efficient way using the `'recursion'` method.
es_es: Las PDP con dos características de interés nos permiten visualizar las interacciones entre ellas. Sin embargo, los ICE no se pueden trazar de forma sencilla y, por tanto, interpretar. Otra consideración está relacionada con el rendimiento para calcular los PDP. Con el algoritmo basado en el árbol, cuando sólo se solicitan los PDP, éstos pueden calcularse de forma eficiente utilizando el método `'recursion'`.

source: The two-way partial dependence plot shows the dependence of median house price on joint values of house age and average occupants per household. We can clearly see an interaction between the two features: for an average occupancy greater than two, the house price is nearly independent of the house age, whereas for values less than two there is a strong dependence on age.
es_es: El gráfico de dependencia parcial bidireccional muestra la dependencia del precio medio de la vivienda en los valores conjuntos de la edad de la vivienda y el promedio de ocupantes por hogar. Podemos ver claramente una interacción entre las dos características: para una ocupación promedio mayor a dos, el precio de la vivienda es casi independiente de la edad de la vivienda, mientras que para valores menores a dos hay una fuerte dependencia de la edad.

source: 3D interaction plots
es_es: Gráficos de interacción 3D

source: Let's make the same partial dependence plot for the 2 features interaction, this time in 3 dimensions.
es_es: Vamos a hacer el mismo gráfico de dependencia parcial para la interacción de 2 características, esta vez en 3 dimensiones.

source: **Total running time of the script:** ( 0 minutes 20.574 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 20.574 segundos)

source: :download:`Download Python source code: plot_partial_dependence.py <plot_partial_dependence.py>`
es_es: :download:`Descargar el código fuente de Python: plot_partial_dependence.py <plot_partial_dependence.py>`

source: :download:`Download Jupyter notebook: plot_partial_dependence.ipynb <plot_partial_dependence.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_partial_dependence.ipynb <plot_partial_dependence.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
