Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/inspection/plot_permutation_importance_multicollinear.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_inspection_plot_permutation_importance_multicollinear.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_inspection_plot_permutation_importance_multicollinear.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Permutation Importance with Multicollinear or Correlated Features
es_es: Importancia de la Permutación con Características Multicolineales o Correlacionadas

source: In this example, we compute the permutation importance on the Wisconsin breast cancer dataset using :func:`~sklearn.inspection.permutation_importance`. The :class:`~sklearn.ensemble.RandomForestClassifier` can easily get about 97% accuracy on a test dataset. Because this dataset contains multicollinear features, the permutation importance will show that none of the features are important. One approach to handling multicollinearity is by performing hierarchical clustering on the features' Spearman rank-order correlations, picking a threshold, and keeping a single feature from each cluster.
es_es: En este ejemplo, calculamos la importancia de la permutación en el conjunto de datos de cáncer de mama de Wisconsin utilizando :func:`~sklearn.inspection.permutation_importance`. El :class:`~sklearn.ensemble.RandomForestClassifier` puede obtener fácilmente alrededor del 97% de precisión en un conjunto de datos de prueba. Dado que este conjunto de datos contiene características multicolineales, la importancia de la permutación mostrará que ninguna de las características es importante. Un enfoque para manejar la multicolinealidad es realizar un agrupamiento jerárquico en las correlaciones de rangos de Spearman de las características, eligiendo un umbral y manteniendo una sola característica de cada grupo o conglomerado.

source: See also :ref:`sphx_glr_auto_examples_inspection_plot_permutation_importance.py`
es_es: Ver también :ref:`sphx_glr_auto_examples_inspection_plot_permutation_importance.py`

source: Random Forest Feature Importance on Breast Cancer Data
es_es: Importancia de las Características Bosques Aleatorios en los Datos del Cáncer de Mama

source: First, we train a random forest on the breast cancer dataset and evaluate its accuracy on a test set:
es_es: Primero, entrenamos un bosque aleatorio en el conjunto de datos de cáncer de mama y evaluamos su precisión en un conjunto de pruebas:

source: Out:
es_es: Salida:

source: Next, we plot the tree based feature importance and the permutation importance. The permutation importance plot shows that permuting a feature drops the accuracy by at most `0.012`, which would suggest that none of the features are important. This is in contradiction with the high test accuracy computed above: some feature must be important. The permutation importance is calculated on the training set to show how much the model relies on each feature during training.
es_es: A continuación, trazamos la importancia de la característica basada en el árbol y la importancia de la permutación. El gráfico de la importancia de la permutación muestra que la permutación de una característica reduce la precisión en un máximo de `0.012`, lo que sugiere que ninguna de las características es importante. Esto se contradice con la alta precisión de la prueba calculada anteriormente: alguna característica debe ser importante. La importancia de la permutación se calcula en el conjunto de entrenamiento para mostrar en qué medida el modelo depende de cada característica durante el entrenamiento.

source: Handling Multicollinear Features
es_es: Manejo de Características Multicolineales

source: When features are collinear, permutating one feature will have little effect on the models performance because it can get the same information from a correlated feature. One way to handle multicollinear features is by performing hierarchical clustering on the Spearman rank-order correlations, picking a threshold, and keeping a single feature from each cluster. First, we plot a heatmap of the correlated features:
es_es: Cuando las características son colineales, la permutación de una característica tendrá poco efecto en el rendimiento del modelo, ya que puede obtener la misma información de una característica correlacionada. Una forma de tratar las características multicolineales es realizar un agrupamiento jerárquico en las correlaciones de rangos de Spearman, eligiendo un umbral y manteniendo una única característica de cada grupo o conglomerado. En primer lugar, trazamos un mapa de calor de las características correlacionadas:

source: Next, we manually pick a threshold by visual inspection of the dendrogram to group our features into clusters and choose a feature from each cluster to keep, select those features from our dataset, and train a new random forest. The test accuracy of the new random forest did not change much compared to the random forest trained on the complete dataset.
es_es: A continuación, elegimos manualmente un umbral mediante inspección visual del dendrograma para agrupar nuestras características en conglomerados y elegimos una característica de cada conglomerado para mantenerla, seleccionamos esas características de nuestro conjunto de datos y entrenamos un nuevo bosque aleatorio. La precisión de la prueba del nuevo bosque aleatorio no cambió mucho en comparación con el bosque aleatorio entrenado en el conjunto de datos completo.

source: **Total running time of the script:** ( 0 minutes 6.398 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 6,398 segundos)

source: :download:`Download Python source code: plot_permutation_importance_multicollinear.py <plot_permutation_importance_multicollinear.py>`
es_es: :download:`Descarga el código fuente de Python: plot_permutation_importance_multicollinear.py <plot_permutation_importance_multicollinear.py>`

source: :download:`Download Jupyter notebook: plot_permutation_importance_multicollinear.ipynb <plot_permutation_importance_multicollinear.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_permutation_importance_multicollinear.ipynb <plot_permutation_importance_multicollinear.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
