Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/inspection/plot_permutation_importance.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_inspection_plot_permutation_importance.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_inspection_plot_permutation_importance.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Permutation Importance vs Random Forest Feature Importance (MDI)
es_es: Importancia de la Permutación vs la Importancia de las Características del Bosque Aleatorio (MDI)

source: In this example, we will compare the impurity-based feature importance of :class:`~sklearn.ensemble.RandomForestClassifier` with the permutation importance on the titanic dataset using :func:`~sklearn.inspection.permutation_importance`. We will show that the impurity-based feature importance can inflate the importance of numerical features.
es_es: En este ejemplo, compararemos la importancia de las características basadas en las impurezas de :class:`~sklearn.ensemble.RandomForestClassifier` con la importancia de la permutación en el conjunto de datos titanic utilizando :func:`~sklearn.inspection.permutation_importance`. Mostraremos que la importancia de la característica basada en impurezas puede inflar la importancia de las características numéricas.

source: Furthermore, the impurity-based feature importance of random forests suffers from being computed on statistics derived from the training dataset: the importances can be high even for features that are not predictive of the target variable, as long as the model has the capacity to use them to overfit.
es_es: Además, la importancia de las características basadas en las impurezas de los bosques aleatorios se ve afectada por el hecho de que se calculan a partir de las estadísticas derivadas del conjunto de datos de entrenamiento: las importancias pueden ser altas incluso para las características que no son predictivas de la variable objetivo, siempre y cuando el modelo tenga la capacidad de utilizarlas para sobreajustar.

source: This example shows how to use Permutation Importances as an alternative that can mitigate those limitations.
es_es: Este ejemplo muestra cómo utilizar las Importancias de Permutación como una alternativa que puede mitigar esas limitaciones.

source: Data Loading and Feature Engineering
es_es: Carga de Datos e Ingeniería de Características

source: Let's use pandas to load a copy of the titanic dataset. The following shows how to apply separate preprocessing on numerical and categorical features.
es_es: Utilicemos pandas para cargar una copia del conjunto de datos del titanic. A continuación se muestra cómo aplicar el preprocesamiento por separado en características numéricas y categóricas.

source: We further include two random variables that are not correlated in any way with the target variable (``survived``):
es_es: Además, incluimos dos variables aleatorias que no están correlacionadas de ninguna manera con la variable objetivo (``survived``):

source: ``random_num`` is a high cardinality numerical variable (as many unique values as records).
es_es: ``random_num`` es una variable numérica de alta cardinalidad (tantos valores únicos como registros).

source: ``random_cat`` is a low cardinality categorical variable (3 possible values).
es_es: ``random_cat`` es una variable categórica de baja cardinalidad (3 valores posibles).

source: Accuracy of the Model
es_es: Precisión del modelo

source: Prior to inspecting the feature importances, it is important to check that the model predictive performance is high enough. Indeed there would be little interest of inspecting the important features of a non-predictive model.
es_es: Antes de inspeccionar la importancia de las características, es fundamental comprobar que el rendimiento predictivo del modelo es lo suficientemente alto. De hecho, no tendría mucho interés inspeccionar las características importantes de un modelo no predictivo.

source: Here one can observe that the train accuracy is very high (the forest model has enough capacity to completely memorize the training set) but it can still generalize well enough to the test set thanks to the built-in bagging of random forests.
es_es: Aquí se puede observar que la precisión del entrenamiento es muy alta (el modelo de bosque tiene suficiente capacidad para memorizar completamente el conjunto de entrenamiento) pero todavía puede generalizar lo suficientemente bien al conjunto de prueba gracias al empaquetado incorporado de los bosques aleatorios.

source: It might be possible to trade some accuracy on the training set for a slightly better accuracy on the test set by limiting the capacity of the trees (for instance by setting ``min_samples_leaf=5`` or ``min_samples_leaf=10``) so as to limit overfitting while not introducing too much underfitting.
es_es: Podría ser posible intercambiar algo de precisión en el conjunto de entrenamiento por una precisión ligeramente mejor en el conjunto de prueba limitando la capacidad de los árboles (por ejemplo, estableciendo ``min_samples_leaf=5`` o ``min_samples_leaf=10``) para limitar el sobreajuste sin introducir demasiado subajuste.

source: However let's keep our high capacity random forest model for now so as to illustrate some pitfalls with feature importance on variables with many unique values.
es_es: Sin embargo, vamos a mantener nuestro modelo de bosque aleatorio de alta capacidad por ahora para ilustrar algunas dificultades con la importancia de las características en las variables con muchos valores únicos.

source: Tree's Feature Importance from Mean Decrease in Impurity (MDI)
es_es: Importancia de la Característica del Árbol a partir de la Disminución Media de la Impureza (MDI)

source: The impurity-based feature importance ranks the numerical features to be the most important features. As a result, the non-predictive ``random_num`` variable is ranked the most important!
es_es: La importancia de la característica basada en impurezas clasifica las características numéricas como las características más importantes. Como resultado, ¡la variable no predictiva ``random_num`` se clasifica como la más importante!

source: This problem stems from two limitations of impurity-based feature importances:
es_es: Este problema se debe a dos limitaciones de la importancia de las características basadas en las impurezas:

source: impurity-based importances are biased towards high cardinality features;
es_es: las importancias basadas en las impurezas están sesgadas hacia las características de alta cardinalidad;

source: impurity-based importances are computed on training set statistics and therefore do not reflect the ability of feature to be useful to make predictions that generalize to the test set (when the model has enough capacity).
es_es: las importancias basadas en las impurezas se calculan sobre las estadísticas del conjunto de entrenamiento y por tanto, no reflejan la capacidad de la característica de ser útil para hacer predicciones que se generalicen al conjunto de prueba (cuando el modelo tiene suficiente capacidad).

source: As an alternative, the permutation importances of ``rf`` are computed on a held out test set. This shows that the low cardinality categorical feature, ``sex`` is the most important feature.
es_es: Como alternativa, las importancias de la permutación de ``rf`` se calculan en un conjunto de pruebas retenido. Esto muestra que la característica categórica de baja cardinalidad, "sex", es la característica más importante.

source: Also note that both random features have very low importances (close to 0) as expected.
es_es: Observa también que ambas características aleatorias tienen importancias muy bajas (cercanas a 0), como era de esperar.

source: It is also possible to compute the permutation importances on the training set. This reveals that ``random_num`` gets a significantly higher importance ranking than when computed on the test set. The difference between those two plots is a confirmation that the RF model has enough capacity to use that random numerical feature to overfit. You can further confirm this by re-running this example with constrained RF with min_samples_leaf=10.
es_es: También es posible calcular las importancias de las permutaciones en el conjunto de entrenamiento. Esto revela que ``random_num`` obtiene una clasificación de importancias significativamente mayor que cuando se calcula en el conjunto de prueba. La diferencia entre esos dos gráficos es una confirmación de que el modelo de RF tiene suficiente capacidad para utilizar esa característica numérica aleatoria para sobreajustar. Puedes confirmarlo aún más volviendo a ejecutar este ejemplo con RF restringida con min_samples_leaf=10.

source: **Total running time of the script:** ( 0 minutes 4.634 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 4.634 segundos)

source: :download:`Download Python source code: plot_permutation_importance.py <plot_permutation_importance.py>`
es_es: :download:`Descargar el código fuente de Python: plot_permutation_importance_multicollinear.py <plot_permutation_importance.py>`

source: :download:`Download Jupyter notebook: plot_permutation_importance.ipynb <plot_permutation_importance.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_permutation_importance.ipynb <plot_permutation_importance.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
