Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/inspection/plot_linear_model_coefficient_interpretation.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Common pitfalls in interpretation of coefficients of linear models
es_es: Errores comunes en la interpretación de los coeficientes de los modelos lineales

source: In linear models, the target value is modeled as a linear combination of the features (see the :ref:`linear_model` User Guide section for a description of a set of linear models available in scikit-learn). Coefficients in multiple linear models represent the relationship between the given feature, :math:`X_i` and the target, :math:`y`, assuming that all the other features remain constant (`conditional dependence <https://en.wikipedia.org/wiki/Conditional_dependence>`_). This is different from plotting :math:`X_i` versus :math:`y` and fitting a linear relationship: in that case all possible values of the other features are taken into account in the estimation (marginal dependence).
es_es: En los modelos lineales, el valor objetivo se modela como una combinación lineal de las características (consulta la sección del Manual de Usuario :ref:`linear_model` para una descripción de un conjunto de modelos lineales disponibles en scikit-learn). Los coeficientes en los modelos lineales múltiples representan la relación entre la característica dada, :math:`X_i` y el objetivo, :math:`y`, asumiendo que todas las demás características permanecen constantes (`dependencia condicional <https://en.wikipedia.org/wiki/Conditional_dependence>`_). Esto es diferente de graficar :math:`X_i` versus :math:`y` y ajustar una relación lineal: en ese caso todos los valores posibles de las otras características se tienen en cuenta en la estimación (dependencia marginal).

source: This example will provide some hints in interpreting coefficient in linear models, pointing at problems that arise when either the linear model is not appropriate to describe the dataset, or when features are correlated.
es_es: Este ejemplo proporcionará algunas pistas para interpretar los coeficientes en los modelos lineales, señalando los problemas que surgen cuando el modelo lineal no es apropiado para describir el conjunto de datos o cuando las características están correlacionadas.

source: We will use data from the `"Current Population Survey" <https://www.openml.org/d/534>`_ from 1985 to predict wage as a function of various features such as experience, age, or education.
es_es: Utilizaremos datos de la `"Current Population Survey" <https://www.openml.org/d/534>`_ de 1985 para predecir el salario en función de diversas características como la experiencia, la edad o la educación.

source: The dataset: wages
es_es: El conjunto de datos: salarios (wages)

source: We fetch the data from `OpenML <http://openml.org/>`_. Note that setting the parameter `as_frame` to True will retrieve the data as a pandas dataframe.
es_es: Obtenemos los datos de `OpenML <http://openml.org/>`_. Ten en cuenta que al establecer el parámetro `as_frame` en True se recuperarán los datos como un dataframe de pandas.

source: Then, we identify features `X` and targets `y`: the column WAGE is our target variable (i.e., the variable which we want to predict).
es_es: Luego, identificamos las características `X` y los objetivos `y`: la columna WAGE es nuestra variable objetivo (es decir, la variable que queremos predecir).

source: Note that the dataset contains categorical and numerical variables. We will need to take this into account when preprocessing the dataset thereafter.
es_es: Ten en cuenta que el conjunto de datos contiene variables categóricas y numéricas. Tendremos que tener esto en cuenta al preprocesar el conjunto de datos a partir de entonces.

source: Our target for prediction: the wage. Wages are described as floating-point number in dollars per hour.
es_es: Nuestro objetivo de predicción: el salario. Los salarios se describen como un número de punto flotante en dólares por hora.

source: Out:
es_es: Salida:

source: We split the sample into a train and a test dataset. Only the train dataset will be used in the following exploratory analysis. This is a way to emulate a real situation where predictions are performed on an unknown target, and we don't want our analysis and decisions to be biased by our knowledge of the test data.
es_es: Dividimos la muestra en un conjunto de datos de entrenamiento y otro de prueba. En el siguiente análisis exploratorio sólo se utilizará el conjunto de datos de entrenamiento. Esta es una forma de emular una situación real en la que las predicciones se realizan sobre un objetivo desconocido, y no queremos que nuestros análisis y decisiones estén sesgados por nuestro conocimiento de los datos de prueba.

source: First, let's get some insights by looking at the variable distributions and at the pairwise relationships between them. Only numerical variables will be used. In the following plot, each dot represents a sample.
es_es: Primero, obtengamos algunas ideas observando las distribuciones de las variables y las relaciones por pares entre ellas. Sólo se utilizarán variables numéricas. En el siguiente gráfico, cada punto representa una muestra.

source: Looking closely at the WAGE distribution reveals that it has a long tail. For this reason, we should take its logarithm to turn it approximately into a normal distribution (linear models such as ridge or lasso work best for a normal distribution of error).
es_es: Si observamos detenidamente la distribución del salario (WAGE), veremos que tiene una cola larga. Por ello, debemos tomar su logaritmo para convertirla aproximadamente en una distribución normal (los modelos lineales como el cresta o el lasso funcionan mejor para una distribución normal del error).

source: The WAGE is increasing when EDUCATION is increasing. Note that the dependence between WAGE and EDUCATION represented here is a marginal dependence, i.e., it describes the behavior of a specific variable without keeping the others fixed.
es_es: El salario (WAGE) es creciente cuando la educación (EDUCATION) es creciente. Ten en cuenta que la dependencia entre WAGE y EDUCATION representada aquí es una dependencia marginal, es decir, describe el comportamiento de una variable específica sin mantener fijas las demás.

source: Also, the EXPERIENCE and AGE are strongly linearly correlated.
es_es: Además, la experiencia (EXPERIENCE) y la edad (AGE) están fuertemente correlacionadas de forma lineal.

source: The machine-learning pipeline
es_es: El pipeline del aprendizaje automático

source: To design our machine-learning pipeline, we first manually check the type of data that we are dealing with:
es_es: Para diseñar nuestro pipeline de aprendizaje automático, primero comprobamos manualmente el tipo de datos con los que estamos tratando:

source: As seen previously, the dataset contains columns with different data types and we need to apply a specific preprocessing for each data types. In particular categorical variables cannot be included in linear model if not coded as integers first. In addition, to avoid categorical features to be treated as ordered values, we need to one-hot-encode them. Our pre-processor will
es_es: Como se ha visto anteriormente, el conjunto de datos contiene columnas con diferentes tipos de datos y tenemos que aplicar un preprocesamiento específico para cada tipo de datos. En particular, las variables categóricas no pueden incluirse en el modelo lineal si no se codifican primero como números enteros. Además, para evitar que las características categóricas se traten como valores ordenados, necesitamos aplicarles una codificación one-hot. Nuestro preprocesador

source: one-hot encode (i.e., generate a column by category) the categorical columns;
es_es: codificará one-hot (es decir, generará una columna por categoría) las columnas categóricas;

source: as a first approach (we will see after how the normalisation of numerical values will affect our discussion), keep numerical values as they are.
es_es: como primer enfoque (veremos después cómo afectará la normalización de los valores numéricos a nuestra discusión), mantendrá los valores numéricos tal y como están.

source: To describe the dataset as a linear model we use a ridge regressor with a very small regularization and to model the logarithm of the WAGE.
es_es: Para describir el conjunto de datos como un modelo lineal utilizamos un regresor ridge (de cresta) con una regularización muy pequeña y para modelar el logaritmo del WAGE.

source: Processing the dataset
es_es: Procesamiento del conjunto de datos

source: First, we fit the model.
es_es: Primero, ajustamos el modelo.

source: Then we check the performance of the computed model plotting its predictions on the test set and computing, for example, the median absolute error of the model.
es_es: Luego comprobamos el rendimiento del modelo calculado graficando sus predicciones en el conjunto de pruebas y calculando, por ejemplo, el error absoluto medio del modelo.

source: The model learnt is far from being a good model making accurate predictions: this is obvious when looking at the plot above, where good predictions should lie on the red line.
es_es: El modelo aprendido está lejos de ser un buen modelo para hacer predicciones precisas: esto es obvio al observar el gráfico anterior, donde las buenas predicciones deberían situarse en la línea roja.

source: In the following section, we will interpret the coefficients of the model. While we do so, we should keep in mind that any conclusion we draw is about the model that we build, rather than about the true (real-world) generative process of the data.
es_es: En la siguiente sección, interpretaremos los coeficientes del modelo. Mientras lo hacemos, debemos tener en cuenta que cualquier conclusión que saquemos es sobre el modelo que construimos, y no sobre el verdadero proceso generativo (del mundo real) de los datos.

source: Interpreting coefficients: scale matters
es_es: Interpretación de los coeficientes: la escala importa

source: First of all, we can take a look to the values of the coefficients of the regressor we have fitted.
es_es: En primer lugar, podemos echar un vistazo a los valores de los coeficientes del regresor que hemos ajustado.

source: The AGE coefficient is expressed in "dollars/hour per living years" while the EDUCATION one is expressed in "dollars/hour per years of education". This representation of the coefficients has the benefit of making clear the practical predictions of the model: an increase of :math:`1` year in AGE means a decrease of :math:`0.030867` dollars/hour, while an increase of :math:`1` year in EDUCATION means an increase of :math:`0.054699` dollars/hour. On the other hand, categorical variables (as UNION or SEX) are adimensional numbers taking either the value 0 or 1. Their coefficients are expressed in dollars/hour. Then, we cannot compare the magnitude of different coefficients since the features have different natural scales, and hence value ranges, because of their different unit of measure. This is more visible if we plot the coefficients.
es_es: El coeficiente de la edad (AGE) se expresa en "dólares/hora por años de vida", mientras que el de la educación (EDUCATION) se expresa en "dólares/hora por años de educación". Esta representación de los coeficientes tiene la ventaja de dejar claras las predicciones prácticas del modelo: un aumento de :math:`1` año en AGE significa una disminución de :math:`0,030867` dólares/hora, mientras que un aumento de :math:`1` año en EDUCATION significa un aumento de :math:`0,054699` dólares/hora. Por otro lado, las variables categóricas (como UNION o SEX) son números adimensionales que toman el valor 0 o 1. Sus coeficientes se expresan en dólares/hora. Entonces, no podemos comparar la magnitud de los distintos coeficientes, ya que las características tienen escalas naturales diferentes, y por tanto rangos de valores, debido a su diferente unidad de medida. Esto es más visible si graficamos los coeficientes.

source: Indeed, from the plot above the most important factor in determining WAGE appears to be the variable UNION, even if our intuition might tell us that variables like EXPERIENCE should have more impact.
es_es: De hecho, según el gráfico anterior, el factor más importante para determinar el salario (WAGE) parece ser la variable UNION, aunque nuestra intuición nos diga que variables como EXPERIENCE deberían tener más impacto.

source: Looking at the coefficient plot to gauge feature importance can be misleading as some of them vary on a small scale, while others, like AGE, varies a lot more, several decades.
es_es: Observar el gráfico de coeficientes para medir la importancia de las características puede ser engañoso, ya que algunas de ellas varían a pequeña escala, mientras que otras, como AGE, varían mucho más, varias décadas.

source: This is visible if we compare the standard deviations of different features.
es_es: Esto es visible si comparamos las desviaciones estándar de las diferentes características.

source: Multiplying the coefficients by the standard deviation of the related feature would reduce all the coefficients to the same unit of measure. As we will see :ref:`after<scaling_num>` this is equivalent to normalize numerical variables to their standard deviation, as :math:`y = \sum{coef_i \times X_i} = \sum{(coef_i \times std_i) \times (X_i / std_i)}`.
es_es: Multiplicar los coeficientes por la desviación estándar de la característica relacionada reduciría todos los coeficientes a la misma unidad de medida. Como veremos :ref:`después <scaling_num>` esto equivale a normalizar las variables numéricas a su desviación estándar, como :math:`y = \sum{coef_i \times X_i} = \sum{(coef_i \times std_i) \times (X_i / std_i)}`.

source: In that way, we emphasize that the greater the variance of a feature, the larger the weight of the corresponding coefficient on the output, all else being equal.
es_es: De este modo, destacamos que cuanto mayor sea la varianza de una característica, mayor será la ponderación del coeficiente correspondiente en la salida, en igualdad de condiciones.

source: Now that the coefficients have been scaled, we can safely compare them.
es_es: Ahora que se han escalado los coeficientes, podemos compararlos con seguridad.

source: Why does the plot above suggest that an increase in age leads to a decrease in wage? Why the :ref:`initial pairplot <marginal_dependencies>` is telling the opposite?
es_es: ¿Por qué el gráfico anterior sugiere que un aumento de la edad conduce a una disminución del salario? ¿Por qué el :ref:`initial pairplot <marginal_dependencies>` dice lo contrario?

source: The plot above tells us about dependencies between a specific feature and the target when all other features remain constant, i.e., **conditional dependencies**. An increase of the AGE will induce a decrease of the WAGE when all other features remain constant. On the contrary, an increase of the EXPERIENCE will induce an increase of the WAGE when all other features remain constant. Also, AGE, EXPERIENCE and EDUCATION are the three variables that most influence the model.
es_es: El gráfico anterior nos informa sobre las dependencias entre una característica específica y el objetivo cuando todas las demás características permanecen constantes, es decir, las **dependencias condicionales**. Un aumento de la edad (AGE) inducirá una disminución del salario (WAGE) cuando todas las demás características permanecen constantes. Por el contrario, un aumento de la experiencia (EXPERIENCE) inducirá un aumento de WAGE cuando todas las demás características permanezcan constantes. Además, AGE, EXPERIENCE y EDUCATION son las tres variables que más influyen en el modelo.

source: Checking the variability of the coefficients
es_es: Comprobación de la variabilidad de los coeficientes

source: We can check the coefficient variability through cross-validation: it is a form of data perturbation (related to `resampling <https://en.wikipedia.org/wiki/Resampling_(statistics)>`_).
es_es: Podemos comprobar la variabilidad de los coeficientes mediante la validación cruzada: es una forma de perturbación de los datos (relacionada con el `remuestreo <https://en.wikipedia.org/wiki/Resampling_(statistics)>`_).

source: If coefficients vary significantly when changing the input dataset their robustness is not guaranteed, and they should probably be interpreted with caution.
es_es: Si los coeficientes varían significativamente al cambiar el conjunto de datos de entrada, su robustez no está garantizada, y probablemente deban interpretarse con precaución.

source: The problem of correlated variables
es_es: El problema de las variables correlacionadas

source: The AGE and EXPERIENCE coefficients are affected by strong variability which might be due to the collinearity between the 2 features: as AGE and EXPERIENCE vary together in the data, their effect is difficult to tease apart.
es_es: Los coeficientes de AGE y EXPERIENCE están afectados por una fuerte variabilidad que podría deberse a la colinealidad entre las dos características: como AGE y EXPERIENCE varían juntas en los datos, su efecto es difícil de separar.

source: To verify this interpretation we plot the variability of the AGE and EXPERIENCE coefficient.
es_es: Para verificar esta interpretación, graficamos la variabilidad del coeficiente de AGE y EXPERIENCE.

source: Two regions are populated: when the EXPERIENCE coefficient is positive the AGE one is negative and viceversa.
es_es: Dos regiones están pobladas: cuando el coeficiente de EXPERIENCE es positivo el de AGE es negativo y viceversa.

source: To go further we remove one of the 2 features and check what is the impact on the model stability.
es_es: Para ir más lejos, eliminamos una de las dos características y comprobamos cuál es el impacto en la estabilidad del modelo.

source: The estimation of the EXPERIENCE coefficient is now less variable and remain important for all models trained during cross-validation.
es_es: La estimación del coeficiente de EXPERIENCE es ahora menos variable y sigue siendo importante para todos los modelos entrenados durante la validación cruzada.

source: Preprocessing numerical variables
es_es: Preprocesamiento de variables numéricas

source: As said above (see ":ref:`the-pipeline`"), we could also choose to scale numerical values before training the model. This can be useful to apply a similar amount regularization to all of them in the Ridge. The preprocessor is redefined in order to subtract the mean and scale variables to unit variance.
es_es: Como se dijo anteriormente (ver ":ref:`the-pipeline`"), también podríamos optar por escalar los valores numéricos antes de entrenar el modelo. Esto puede ser útil para aplicar una regularización de cantidad similar a todos ellos en la Cresta. El preprocesador se redefine para restar la media y escalar las variables a la varianza unitaria.

source: The model will stay unchanged.
es_es: El modelo se mantendrá sin cambios.

source: Again, we check the performance of the computed model using, for example, the median absolute error of the model and the R squared coefficient.
es_es: De nuevo, comprobamos el rendimiento del modelo calculado utilizando, por ejemplo, el error absoluto mediano del modelo y el coeficiente R cuadrado.

source: For the coefficient analysis, scaling is not needed this time.
es_es: Para el análisis de los coeficientes, esta vez no es necesario el escalamiento.

source: We now inspect the coefficients across several cross-validation folds.
es_es: Ahora inspeccionamos los coeficientes en varios pliegues (folds) de validación cruzada.

source: The result is quite similar to the non-normalized case.
es_es: El resultado es bastante similar al caso no normalizado.

source: Linear models with regularization
es_es: Modelos lineales con regularización

source: In machine-learning practice, Ridge Regression is more often used with non-negligible regularization.
es_es: En la práctica del aprendizaje automático, la Regresión de Cresta se utiliza más a menudo con una regularización no despreciable.

source: Above, we limited this regularization to a very little amount. Regularization improves the conditioning of the problem and reduces the variance of the estimates. RidgeCV applies cross validation in order to determine which value of the regularization parameter (`alpha`) is best suited for prediction.
es_es: Arriba, limitamos esta regularización a una cantidad muy pequeña. La regularización mejora el condicionamiento del problema y reduce la varianza de las estimaciones. RidgeCV aplica la validación cruzada para determinar qué valor del parámetro de regularización (`alpha`) es el más adecuado para la predicción.

source: First we check which value of :math:`\alpha` has been selected.
es_es: Primero comprobamos qué valor de :math:`\alpha` ha sido seleccionado.

source: Then we check the quality of the predictions.
es_es: Luego comprobamos la calidad de las predicciones.

source: The ability to reproduce the data of the regularized model is similar to the one of the non-regularized model.
es_es: La capacidad de reproducir los datos del modelo regularizado es similar a la del modelo no regularizado.

source: The coefficients are significantly different. AGE and EXPERIENCE coefficients are both positive but they now have less influence on the prediction.
es_es: Los coeficientes son significativamente diferentes. Los coeficientes de AGE y EXPERIENCE son positivos, pero ahora tienen menos influencia en la predicción.

source: The regularization reduces the influence of correlated variables on the model because the weight is shared between the two predictive variables, so neither alone would have strong weights.
es_es: La regularización reduce la influencia de las variables correlacionadas en el modelo porque la ponderación se comparte entre las dos variables predictivas, por lo que ninguna de las dos por sí sola tendría ponderaciones fuertes.

source: On the other hand, the weights obtained with regularization are more stable (see the :ref:`ridge_regression` User Guide section). This increased stability is visible from the plot, obtained from data perturbations, in a cross validation. This plot can be compared with the :ref:`previous one<covariation>`.
es_es: Por otra parte, las ponderaciones obtenidas con la regularización son más estables (ver la sección del Manual de Usuario :ref:`ridge_regression`). Esta mayor estabilidad es visible en el gráfico, obtenido a partir de las perturbaciones de los datos, en una validación cruzada. Este gráfico puede compararse con el :ref:`anterior<covariation>`.

source: Linear models with sparse coefficients
es_es: Modelos lineales con coeficientes dispersos

source: Another possibility to take into account correlated variables in the dataset, is to estimate sparse coefficients. In some way we already did it manually when we dropped the AGE column in a previous Ridge estimation.
es_es: Otra posibilidad para tener en cuenta sobre las variables correlacionadas en el conjunto de datos, es estimar coeficientes dispersos. En cierto modo, ya lo hicimos manualmente cuando eliminamos la columna AGE en la estimación de Cresta anterior.
