Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/datasets/loading_other_datasets.po
Languages: es_es

source: Loading other datasets
es_es: Cargando otros conjuntos de datos

source: Sample images
es_es: Imágenes de ejemplo

source: Scikit-learn also embeds a couple of sample JPEG images published under Creative Commons license by their authors. Those images can be useful to test algorithms and pipelines on 2D data.
es_es: Scikit-learn también incorpora un par de imágenes JPEG de muestra publicadas bajo licencia Creative Commons por sus autores. Estas imágenes pueden ser útiles para probar los algoritmos y las líneas de producción en datos 2D.

source: Load sample images for image manipulation.
es_es: Cargar imágenes de muestra para la manipulación de imágenes.

source: Load the numpy array of a single sample image
es_es: Carga el arreglo numpy de una sola imagen de muestra

source: The default coding of images is based on the ``uint8`` dtype to spare memory. Often machine learning algorithms work best if the input is converted to a floating point representation first. Also, if you plan to use ``matplotlib.pyplpt.imshow``, don't forget to scale to the range 0 - 1 as done in the following example.
es_es: La codificación por defecto de las imágenes se basa en el dtype ``uint8`` para ahorrar memoria. A menudo los algoritmos de aprendizaje automático funcionan mejor si la entrada se convierte primero a una representación de punto flotante. Además, si planeas usar ``matplotlib.pyplpt.imshow``, no olvides escalar al rango 0 - 1 como se hace en el siguiente ejemplo.

source: Datasets in svmlight / libsvm format
es_es: Conjuntos de datos en formato svmlight / libsvm

source: scikit-learn includes utility functions for loading datasets in the svmlight / libsvm format. In this format, each line takes the form ``<label> <feature-id>:<feature-value> <feature-id>:<feature-value> ...``. This format is especially suitable for sparse datasets. In this module, scipy sparse CSR matrices are used for ``X`` and numpy arrays are used for ``y``.
es_es: scikit-learn incluye funciones de utilidad para cargar conjuntos de datos en el formato svmlight / libsvm. En este formato, cada línea tiene la forma ``<label> <feature-id>:<feature-value> <feature-id>:<feature-value> ...``. Este formato es especialmente adecuado para conjuntos de datos dispersos. En este módulo, se utilizan matrices CSR dispersas de scipy para ``X`` y arreglos de numpy para ``y``.

source: You may load a dataset like as follows::
es_es: Puedes cargar un conjunto de datos como los siguientes::

source: You may also load two (or more) datasets at once::
es_es: También puedes cargar dos conjuntos de datos (o más) a la vez::

source: In this case, ``X_train`` and ``X_test`` are guaranteed to have the same number of features. Another way to achieve the same result is to fix the number of features::
es_es: En este caso, se garantiza que ``X_train`` y ``X_test`` tengan el mismo número de características. Otra forma de lograr el mismo resultado es arreglar el número de características::

source: Related links:
es_es: Enlaces relacionados:

source: _`Public datasets in svmlight / libsvm format`: https://www.csie.ntu.edu.tw/~cjlin/libsvmtools/datasets
es_es: _`Conjuntos de datos públicos en formato svmlight / libsvm: https://www.csie.ntu.edu.tw/~cjlin/libsvmtools/datasets

source: _`Faster API-compatible implementation`: https://github.com/mblondel/svmlight-loader
es_es: _`Implementación más rápida compatible con API`: https://github.com/mblondel/svmlight-loader

source: Downloading datasets from the openml.org repository
es_es: Descargando conjuntos de datos desde el repositorio openml.org

source: `openml.org <https://openml.org>`_ is a public repository for machine learning data and experiments, that allows everybody to upload open datasets.
es_es: `openml.org <https://openml.org>`_ es un repositorio público para datos de aprendizaje automático y experimentos, que permite a todos subir conjuntos de datos abiertos.

source: The ``sklearn.datasets`` package is able to download datasets from the repository using the function :func:`sklearn.datasets.fetch_openml`.
es_es: El paquete ``sklearn.datasets`` es capaz de descargar conjuntos de datos del repositorio usando la función :func:`sklearn.datasets.fetch_openml`.

source: For example, to download a dataset of gene expressions in mice brains::
es_es: Por ejemplo, para descargar un conjunto de datos de expresiones genéticas en cerebros de ratones::

source: To fully specify a dataset, you need to provide a name and a version, though the version is optional, see :ref:`openml_versions` below. The dataset contains a total of 1080 examples belonging to 8 different classes::
es_es: Para especificar completamente un conjunto de datos, debes proporcionar un nombre y una versión, aunque la versión es opcional, ver :ref:`openml_versions` a continuación. El conjunto de datos contiene un total de 1080 ejemplos pertenecientes a 8 clases diferentes::

source: You can get more information on the dataset by looking at the ``DESCR`` and ``details`` attributes::
es_es: Puedes obtener más información sobre el conjunto de datos mirando los atributos ``DESCR`` y ``details``::

source: The ``DESCR`` contains a free-text description of the data, while ``details`` contains a dictionary of meta-data stored by openml, like the dataset id. For more details, see the `OpenML documentation <https://docs.openml.org/#data>`_ The ``data_id`` of the mice protein dataset is 40966, and you can use this (or the name) to get more information on the dataset on the openml website::
es_es: El ``DESCR`` contiene una descripción de texto libre de los datos, mientras que ``details`` contiene un diccionario de metadatos almacenados por openml, como el id del conjunto de datos. Para más detalles, consulta la documentación de OpenML <https://docs.openml.org/#data>`_ El ``data_id`` del conjunto de datos de proteínas de ratones es 40966, y puede utilizarlo (o el nombre) para obtener más información sobre el conjunto de datos en el sitio web de openml::

source: The ``data_id`` also uniquely identifies a dataset from OpenML::
es_es: El ``data_id`` también identifica de forma única un conjunto de datos de OpenML::

source: Dataset Versions
es_es: Versiones del conjunto de datos

source: A dataset is uniquely specified by its ``data_id``, but not necessarily by its name. Several different "versions" of a dataset with the same name can exist which can contain entirely different datasets. If a particular version of a dataset has been found to contain significant issues, it might be deactivated. Using a name to specify a dataset will yield the earliest version of a dataset that is still active. That means that ``fetch_openml(name="miceprotein")`` can yield different results at different times if earlier versions become inactive. You can see that the dataset with ``data_id`` 40966 that we fetched above is the first version of the "miceprotein" dataset::
es_es: Un conjunto de datos se especifica de forma exclusiva por su ``data_id``, pero no necesariamente por su nombre. Pueden existir varias "versiones" diferentes de un conjunto de datos con el mismo nombre que pueden contener conjuntos de datos totalmente diferentes. Si se descubre que una versión concreta de un conjunto de datos contiene problemas importantes, puede desactivarse. Si se utiliza un nombre para especificar un conjunto de datos, se obtendrá la versión más antigua de un conjunto de datos que aún esté activa. Esto significa que ``fetch_openml(name="miceprotein")`` puede dar diferentes resultados en diferentes momentos si las versiones anteriores se vuelven inactivas. Puedes ver que el conjunto de datos con ``data_id`` 40966 que hemos obtenido arriba es la primera versión del conjunto de datos "miceprotein"::

source: In fact, this dataset only has one version. The iris dataset on the other hand has multiple versions::
es_es: De hecho, este conjunto de datos sólo tiene una versión. El conjunto de datos iris por otro lado tiene múltiples versiones::

source: Specifying the dataset by the name "iris" yields the lowest version, version 1, with the ``data_id`` 61. To make sure you always get this exact dataset, it is safest to specify it by the dataset ``data_id``. The other dataset, with ``data_id`` 969, is version 3 (version 2 has become inactive), and contains a binarized version of the data::
es_es: Al especificar el conjunto de datos por el nombre "iris" se obtiene la versión más baja, la versión 1, con el ``data_id`` 61. Para asegurarte de obtener siempre este conjunto de datos exacto, lo más seguro es especificarlo por el conjunto de datos ``data_id``. El otro conjunto de datos, con ``data_id`` 969, es la versión 3 (la versión 2 ha quedado inactiva), y contiene una versión binarizada de los datos::

source: You can also specify both the name and the version, which also uniquely identifies the dataset::
es_es: También puedes especificar tanto el nombre como la versión, que también identifica de forma única el conjunto de datos::

source: Loading from external datasets
es_es: Cargando desde conjuntos de datos externos

source: scikit-learn works on any numeric data stored as numpy arrays or scipy sparse matrices. Other types that are convertible to numeric arrays such as pandas DataFrame are also acceptable.
es_es: scikit-learn funciona con cualquier dato numérico almacenado como arreglos numpy o matrices dispersas scipy. Otros tipos que son convertibles a arreglos numéricos como pandas DataFrame también son aceptables.

source: Here are some recommended ways to load standard columnar data into a format usable by scikit-learn:
es_es: Aquí hay algunas formas recomendadas de cargar datos de columnas estándar en un formato utilizable por scikit-learn:

source: `pandas.io <https://pandas.pydata.org/pandas-docs/stable/io.html>`_ provides tools to read data from common formats including CSV, Excel, JSON and SQL. DataFrames may also be constructed from lists of tuples or dicts. Pandas handles heterogeneous data smoothly and provides tools for manipulation and conversion into a numeric array suitable for scikit-learn.
es_es: `pandas.io <https://pandas.pydata.org/pandas-docs/stable/io.html>`_ proporciona herramientas para leer datos desde formatos comunes como CSV, Excel, JSON y SQL. Los DataFrames también pueden construirse a partir de listas de tuplas o dicts. Pandas maneja datos heterogéneos sin problemas y proporciona herramientas para la manipulación y la conversión en una matriz numérica adecuada para scikit-learn.

source: `scipy.io <https://docs.scipy.org/doc/scipy/reference/io.html>`_ specializes in binary formats often used in scientific computing context such as .mat and .arff
es_es: `scipy.io <https://docs.scipy.org/doc/scipy/reference/io.html>`_ se especializa en formatos binarios a menudo utilizados en el contexto científico de computación como .mat y .arff

source: `numpy/routines.io <https://docs.scipy.org/doc/numpy/reference/routines.io.html>`_ for standard loading of columnar data into numpy arrays
es_es: `numpy/routines.io <https://docs.scipy.org/doc/numpy/reference/routines.io.html>`_ para la carga estándar de datos columnares en arreglos numpy

source: scikit-learn's :func:`datasets.load_svmlight_file` for the svmlight or libSVM sparse format
es_es: :func:`datasets.load_svmlight_file` de scikit-learn para el formato svmlight o libSVM disperso

source: scikit-learn's :func:`datasets.load_files` for directories of text files where the name of each directory is the name of each category and each file inside of each directory corresponds to one sample from that category
es_es: :func:`datasets.load_files` de scikit-learn para directorios de archivos de texto donde el nombre de cada directorio es el nombre de cada categoría y cada archivo dentro de cada directorio corresponde a una muestra de esa categoría

source: For some miscellaneous data such as images, videos, and audio, you may wish to refer to:
es_es: Para algunos datos variados como imágenes, vídeos y audio, puedes referirte a:

source: `skimage.io <https://scikit-image.org/docs/dev/api/skimage.io.html>`_ or `Imageio <https://imageio.readthedocs.io/en/latest/userapi.html>`_ for loading images and videos into numpy arrays
es_es: `skimage.io <https://scikit-image.org/docs/dev/api/skimage.io.html>`_ o `Imageio <https://imageio.readthedocs.io/en/latest/userapi.html>`_ para cargar imágenes y vídeos en arreglos numéricos

source: `scipy.io.wavfile.read <https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.io.wavfile.read.html>`_ for reading WAV files into a numpy array
es_es: `scipy.io.wavfile.read <https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.io.wavfile.read.html>`_ para leer archivos WAV en un arreglo numpy

source: Categorical (or nominal) features stored as strings (common in pandas DataFrames) will need converting to numerical features using :class:`~sklearn.preprocessing.OneHotEncoder` or :class:`~sklearn.preprocessing.OrdinalEncoder` or similar. See :ref:`preprocessing`.
es_es: Características categóricas (o nominales) almacenadas como cadenas (comunes en pandas DataFrames) necesitarán convertir a características numéricas usando :class:`~sklearn.preprocessing.OneHotEncoder` o :class:`~sklearn.preprocessing.OrdinalEncoder` o similar. Vea :ref:`preprocessing`.

source: Note: if you manage your own numerical data it is recommended to use an optimized file format such as HDF5 to reduce data load times. Various libraries such as H5Py, PyTables and pandas provides a Python interface for reading and writing data in that format.
es_es: Nota: si administras tus propios datos numéricos se recomienda utilizar un formato de archivo optimizado como HDF5 para reducir los tiempos de carga de datos. Varias bibliotecas como H5Py, PyTables y pandas proporcionan una interfaz Python para leer y escribir datos en ese formato.
