Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/datasets/real_world.po
Languages: es_es

source: Real world datasets
es_es: Conjuntos de datos del mundo real

source: scikit-learn provides tools to load larger datasets, downloading them if necessary.
es_es: scikit-learn proporciona herramientas para cargar conjuntos de datos más grandes, descargándolos si es necesario.

source: They can be loaded using the following functions:
es_es: Se pueden cargar mediante las siguientes funciones:

source: Load the Olivetti faces data-set from AT&T (classification).
es_es: Carga el conjunto de datos de caras Olivetti de AT&T (clasificación).

source: Load the filenames and data from the 20 newsgroups dataset (classification).
es_es: Carga los nombres de archivo y los datos del conjunto de datos de 20 grupos de noticias (clasificación).

source: Load and vectorize the 20 newsgroups dataset (classification).
es_es: Carga y vectoriza el conjunto de datos de 20 grupos de noticias (clasificación).

source: Load the Labeled Faces in the Wild (LFW) people dataset (classification).
es_es: Carga el conjunto de datos de personas Labeled Faces in the Wild (LFW) (clasificación).

source: Load the Labeled Faces in the Wild (LFW) pairs dataset (classification).
es_es: Carga el conjunto de datos de pares Labeled Faces in the Wild (LFW) (clasificación).

source: Load the covertype dataset (classification).
es_es: Carga el conjunto de datos de covertype (clasificación).

source: Load the RCV1 multilabel dataset (classification).
es_es: Carga el conjunto de datos multietiqueta RCV1 (clasificación).

source: Load the kddcup99 dataset (classification).
es_es: Carga el conjunto de datos kddcup99 (clasificación).

source: Load the California housing dataset (regression).
es_es: Carga el conjunto de datos de viviendas de California (regresión).

source: The Olivetti faces dataset
es_es: El conjunto de datos de caras Olivetti

source: `This dataset contains a set of face images`_ taken between April 1992 and April 1994 at AT&T Laboratories Cambridge. The :func:`sklearn.datasets.fetch_olivetti_faces` function is the data fetching / caching function that downloads the data archive from AT&T.
es_es: `Este conjunto de datos contiene un conjunto de imágenes faciales`_ tomadas entre abril de 1992 y abril de 1994 en AT&T Laboratories Cambridge. La función :func:`sklearn.datasets.fetch_olivetti_faces` es la función de obtención/almacenamiento en caché de datos que descarga el archivo de datos de AT&T.

source: As described on the original website:
es_es: Como se describe en el sitio web original:

source: There are ten different images of each of 40 distinct subjects. For some subjects, the images were taken at different times, varying the lighting, facial expressions (open / closed eyes, smiling / not smiling) and facial details (glasses / no glasses). All the images were taken against a dark homogeneous background with the subjects in an upright, frontal position (with tolerance for some side movement).
es_es: Hay diez imágenes diferentes de cada uno de los 40 sujetos distintos. En el caso de algunos sujetos, las imágenes se tomaron en diferentes momentos, variando la iluminación, las expresiones faciales (ojos abiertos/cerrados, sonriendo/no sonriendo) y los detalles faciales (con lentes/sin lentes). Todas las imágenes se tomaron sobre un fondo oscuro homogéneo, con los sujetos en posición vertical y frontal (con tolerancia para algún movimiento lateral).

source: **Data Set Characteristics:**
es_es: **Características del Conjunto de Datos:**

source: Classes
es_es: Clases

source: Samples total
es_es: Total de muestras

source: Dimensionality
es_es: Dimensionalidad

source: Features
es_es: Características

source: real, between 0 and 1
es_es: real, entre 0 y 1

source: The image is quantized to 256 grey levels and stored as unsigned 8-bit integers; the loader will convert these to floating point values on the interval [0, 1], which are easier to work with for many algorithms.
es_es: La imagen se cuantifica en 256 niveles de gris y se almacena como enteros de 8 bits sin signo; el cargador los convertirá en valores de punto flotante en el intervalo [0, 1], que son más fáciles de trabajar para muchos algoritmos.

source: The "target" for this database is an integer from 0 to 39 indicating the identity of the person pictured; however, with only 10 examples per class, this relatively small dataset is more interesting from an unsupervised or semi-supervised perspective.
es_es: El "target" para esta base de datos es un número entero de 0 a 39 que indica la identidad de la persona fotografiada; sin embargo, con sólo 10 ejemplos por clase, este conjunto de datos relativamente pequeño es más interesante desde una perspectiva no supervisada o semisupervisada.

source: The original dataset consisted of 92 x 112, while the version available here consists of 64x64 images.
es_es: El conjunto de datos original constaba de 92 x 112, mientras que la versión disponible aquí consta de 64x64 imágenes.

source: When using these images, please give credit to AT&T Laboratories Cambridge.
es_es: Al utilizar estas imágenes, por favor, dar crédito a AT&T Laboratories Cambridge.

source: The 20 newsgroups text dataset
es_es: El conjunto de datos de texto de 20 grupos de noticias

source: The 20 newsgroups dataset comprises around 18000 newsgroups posts on 20 topics split in two subsets: one for training (or development) and the other one for testing (or for performance evaluation). The split between the train and test set is based upon a messages posted before and after a specific date.
es_es: El conjunto de datos de 20 grupos de noticias comprende unos 18000 posts de grupos de noticias sobre 20 temas divididos en dos subconjuntos: uno para el entrenamiento (o desarrollo) y el otro para pruebas (o para la evaluación del rendimiento). La división entre el conjunto de entrenamiento y el de prueba se basa en los mensajes publicados antes y después de una fecha específica.

source: This module contains two loaders. The first one, :func:`sklearn.datasets.fetch_20newsgroups`, returns a list of the raw texts that can be fed to text feature extractors such as :class:`~sklearn.feature_extraction.text.CountVectorizer` with custom parameters so as to extract feature vectors. The second one, :func:`sklearn.datasets.fetch_20newsgroups_vectorized`, returns ready-to-use features, i.e., it is not necessary to use a feature extractor.
es_es: Este módulo contiene dos cargadores. El primero, :func:`sklearn.datasets.fetch_20newsgroups`, devuelve una lista de los textos en bruto que pueden ser alimentados a extractores de características de texto como :class:`~sklearn.feature_extraction.text.CountVectorizer` con parámetros personalizados para extraer vectores de características. El segundo, :func:`sklearn.datasets.fetch_20newsgroups_vectorized`, devuelve características listas para usar, es decir, no es necesario utilizar un extractor de características.

source: text
es_es: texto

source: Usage
es_es: Uso

source: The :func:`sklearn.datasets.fetch_20newsgroups` function is a data fetching / caching functions that downloads the data archive from the original `20 newsgroups website`_, extracts the archive contents in the ``~/scikit_learn_data/20news_home`` folder and calls the :func:`sklearn.datasets.load_files` on either the training or testing set folder, or both of them::
es_es: :func:`sklearn.datasets.fetch_20newsgroups` es una función de obtención / almacenamiento en caché de datos que descarga el archivo de datos del sitio web original de `20 newsgroups`_, extrae el contenido del archivo en la carpeta ``~/scikit_learn_data/20news_home`` y llama a la función :func:`sklearn.datasets.load_files` en la carpeta del conjunto de entrenamiento o de pruebas, o en ambas::

source: The real data lies in the ``filenames`` and ``target`` attributes. The target attribute is the integer index of the category::
es_es: Los datos reales se encuentran en los atributos ``filenames`` y ``target``. El atributo target es el índice entero de la categoría::

source: It is possible to load only a sub-selection of the categories by passing the list of the categories to load to the :func:`sklearn.datasets.fetch_20newsgroups` function::
es_es: Es posible cargar sólo una sub-selección de las categorías pasando la lista de las categorías a cargar a la función :func:`sklearn.datasets.fetch_20newsgroups`::

source: Converting text to vectors
es_es: Convertir texto en vectores

source: In order to feed predictive or clustering models with the text data, one first need to turn the text into vectors of numerical values suitable for statistical analysis. This can be achieved with the utilities of the ``sklearn.feature_extraction.text`` as demonstrated in the following example that extract `TF-IDF`_ vectors of unigram tokens from a subset of 20news::
es_es: Para alimentar modelos predictivos o de análisis de conglomerados con los datos de texto, primero hay que convertir el texto en vectores de valores numéricos adecuados para el análisis estadístico. Esto se puede lograr con las utilidades de ``sklearn.feature_extraction.text`` como se demuestra en el siguiente ejemplo que extrae vectores `TF-IDF`_ de tokens de unigramas de un subconjunto de 20news::

source: The extracted TF-IDF vectors are very sparse, with an average of 159 non-zero components by sample in a more than 30000-dimensional space (less than .5% non-zero features)::
es_es: Los vectores TF-IDF extraídos son muy dispersos, con un promedio de 159 componentes distintos de cero por muestra en un espacio de más de 30000 dimensiones (menos del 0.5% de características distintas de cero)::

source: :func:`sklearn.datasets.fetch_20newsgroups_vectorized` is a function which returns ready-to-use token counts features instead of file names.
es_es: :func:`sklearn.datasets.fetch_20newsgroups_vectorized` es una función que devuelve características de recuento de tokens listas para usar en lugar de nombres de archivos.

source: Filtering text for more realistic training
es_es: Filtrar el texto para un entrenamiento más realista

source: It is easy for a classifier to overfit on particular things that appear in the 20 Newsgroups data, such as newsgroup headers. Many classifiers achieve very high F-scores, but their results would not generalize to other documents that aren't from this window of time.
es_es: Es fácil que un clasificador se sobreajuste a cosas particulares que aparecen en los datos de 20 Newsgroups, como los encabezados de los grupos de noticias. Muchos clasificadores consiguen puntuaciones F muy altas, pero sus resultados no se generalizarían a otros documentos que no son de esta ventana de tiempo.

source: For example, let's look at the results of a multinomial Naive Bayes classifier, which is fast to train and achieves a decent F-score::
es_es: Por ejemplo, veamos los resultados de un clasificador multinomial Naive Bayes, que es rápido de entrenar y consigue una puntuación F decente::

source: (The example :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` shuffles the training and test data, instead of segmenting by time, and in that case multinomial Naive Bayes gets a much higher F-score of 0.88. Are you suspicious yet of what's going on inside this classifier?)
es_es: (El ejemplo :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` revuelve los datos de entrenamiento y de prueba, en lugar de segmentar por tiempo, y en ese caso el Naive Bayes multinomial obtiene una puntuación F mucho más alta de 0.88. ¿Sospechas ya de lo que ocurre dentro de este clasificador?)

source: Let's take a look at what the most informative features are:
es_es: Veamos cuáles son las características más informativas:

source: You can now see many things that these features have overfit to:
es_es: Ahora puedes ver muchas cosas a las que estas características se han sobreajustado:

source: Almost every group is distinguished by whether headers such as ``NNTP-Posting-Host:`` and ``Distribution:`` appear more or less often.
es_es: Casi todos los grupos se distinguen por el hecho de que encabezados como ``NNTP-Posting-Host:`` y ``Distribution:`` aparecen con mayor o menor frecuencia.

source: Another significant feature involves whether the sender is affiliated with a university, as indicated either by their headers or their signature.
es_es: Otra característica significativa es si el remitente está afiliado a una universidad, como lo indican sus encabezados o su firma.

source: The word "article" is a significant feature, based on how often people quote previous posts like this: "In article [article ID], [name] <[e-mail address]> wrote:"
es_es: La palabra "article" es una característica significativa, basada en la frecuencia con la que la gente cita posts anteriores de esta manera: "In article [article ID], [name] <[e-mail address]> wrote:"

source: Other features match the names and e-mail addresses of particular people who were posting at the time.
es_es: Otras características coinciden con los nombres y direcciones de correo electrónico de personas particulares que estaban publicando en ese momento.

source: With such an abundance of clues that distinguish newsgroups, the classifiers barely have to identify topics from text at all, and they all perform at the same high level.
es_es: Con tal abundancia de pistas que distinguen a los grupos de noticias, los clasificadores apenas tienen que identificar los temas a partir del texto en absoluto, y todos ellos rinden al mismo alto nivel.

source: For this reason, the functions that load 20 Newsgroups data provide a parameter called **remove**, telling it what kinds of information to strip out of each file. **remove** should be a tuple containing any subset of ``('headers', 'footers', 'quotes')``, telling it to remove headers, signature blocks, and quotation blocks respectively.
es_es: Por esta razón, las funciones que cargan los datos de 20 Newsgroups proporcionan un parámetro llamado **remove**, que le indica qué tipo de información debe eliminar de cada archivo. **remove** debe ser una tupla que contenga cualquier subconjunto de ``('headers', 'footers', 'quotes')``, indicándole que elimine las cabeceras, los bloques de firmas y los bloques de citas respectivamente.

source: This classifier lost over a lot of its F-score, just because we removed metadata that has little to do with topic classification. It loses even more if we also strip this metadata from the training data:
es_es: Este clasificador perdió mucho de su puntuación F, sólo porque eliminamos metadatos que tienen poco que ver con la clasificación de temas. Pierde aún más si también eliminamos estos metadatos de los datos de entrenamiento:

source: Some other classifiers cope better with this harder version of the task. Try running :ref:`sphx_glr_auto_examples_model_selection_grid_search_text_feature_extraction.py` with and without the ``--filter`` option to compare the results.
es_es: Algunos otros clasificadores se adaptan mejor a esta versión más difícil de la tarea. Intenta ejecutar :ref:`sphx_glr_auto_examples_model_selection_grid_search_text_feature_extraction.py` con y sin la opción ``--filter`` para comparar los resultados.

source: Recommendation
es_es: Recomendación

source: When evaluating text classifiers on the 20 Newsgroups data, you should strip newsgroup-related metadata. In scikit-learn, you can do this by setting ``remove=('headers', 'footers', 'quotes')``. The F-score will be lower because it is more realistic.
es_es: Cuando se evalúan los clasificadores de texto en los datos de 20 Newsgroups, se deben eliminar los metadatos relacionados con los grupos de noticias. En scikit-learn, puedes hacerlo estableciendo ``remove=('headers', 'footers', 'quotes')``. La puntuación F será menor porque es más realista.

source: The Labeled Faces in the Wild face recognition dataset
es_es: El conjunto de datos de reconocimiento facial Labeled Faces in the Wild

source: This dataset is a collection of JPEG pictures of famous people collected over the internet, all details are available on the official website:
es_es: Este conjunto de datos es una colección de fotografías JPEG de personas famosas recopiladas en Internet; todos los detalles están disponibles en el sitio web oficial:

source: Each picture is centered on a single face. The typical task is called Face Verification: given a pair of two pictures, a binary classifier must predict whether the two images are from the same person.
es_es: Cada imagen se centra en un solo rostro. La tarea típica se llama Verificación Facial: dado un par de fotografías, un clasificador binario debe predecir si las dos imágenes son de la misma persona.

source: An alternative task, Face Recognition or Face Identification is: given the picture of the face of an unknown person, identify the name of the person by referring to a gallery of previously seen pictures of identified persons.
es_es: Una tarea alternativa, el Reconocimiento Facial o la Identificación Facial es: dada la imagen de la cara de una persona desconocida, identificar el nombre de la persona haciendo referencia a una galería de imágenes previamente vistas de personas identificadas.

source: Both Face Verification and Face Recognition are tasks that are typically performed on the output of a model trained to perform Face Detection. The most popular model for Face Detection is called Viola-Jones and is implemented in the OpenCV library. The LFW faces were extracted by this face detector from various online websites.
es_es: Tanto la Verificación Facial como el Reconocimiento Facial son tareas que suelen realizarse a partir de la salida de un modelo entrenado para realizar la Detección Facial. El modelo más popular para la Detección Facial se llama Viola-Jones y está implementado en la biblioteca OpenCV. Los rostros de LFW fueron extraídos por este detector de rostros de varios sitios web en línea.

source: real, between 0 and 255
es_es: real, entre 0 y 255

source: ``scikit-learn`` provides two loaders that will automatically download, cache, parse the metadata files, decode the jpeg and convert the interesting slices into memmapped numpy arrays. This dataset size is more than 200 MB. The first load typically takes more than a couple of minutes to fully decode the relevant part of the JPEG files into numpy arrays. If the dataset has been loaded once, the following times the loading times less than 200ms by using a memmapped version memoized on the disk in the ``~/scikit_learn_data/lfw_home/`` folder using ``joblib``.
es_es: ``scikit-learn`` proporciona dos cargadores que automáticamente descargarán, almacenarán en caché, analizarán los archivos de metadatos, decodificarán el jpeg y convertirán los cortes interesantes en arreglos numpy memmapped. Este conjunto de datos tiene un tamaño de más de 200 MB. La primera carga suele tardar más de un par de minutos en decodificar completamente la parte relevante de los archivos JPEG en arreglos numpy. Si el conjunto de datos ha sido cargado una vez, las próximas veces los tiempos de carga serán inferiores a 200ms utilizando una versión memmapped memorizada en el disco en la carpeta ``~/scikit_learn_data/lfw_home/`` utilizando ``joblib``.

source: The first loader is used for the Face Identification task: a multi-class classification task (hence supervised learning)::
es_es: El primer cargador se utiliza para la tarea de Identificación Facial: una tarea de clasificación multiclase (por tanto, aprendizaje supervisado)::

source: The default slice is a rectangular shape around the face, removing most of the background::
es_es: El corte por defecto es una forma rectangular alrededor de la cara, eliminando la mayor parte del fondo::

source: Each of the ``1140`` faces is assigned to a single person id in the ``target`` array::
es_es: Cada una de las ``1140`` caras se asigna a un único id de persona en el arreglo ``target``::

source: The second loader is typically used for the face verification task: each sample is a pair of two picture belonging or not to the same person::
es_es: El segundo cargador se utiliza normalmente para la tarea de Verificación Facial: cada muestra es un par de fotografías pertenecientes o no a la misma persona::

source: Both for the :func:`sklearn.datasets.fetch_lfw_people` and :func:`sklearn.datasets.fetch_lfw_pairs` function it is possible to get an additional dimension with the RGB color channels by passing ``color=True``, in that case the shape will be ``(2200, 2, 62, 47, 3)``.
es_es: Tanto para la función :func:`sklearn.datasets.fetch_lfw_people` como para la función :func:`sklearn.datasets.fetch_lfw_pairs` es posible obtener una dimensión adicional con los canales de colores RGB pasando ``color=True``, en ese caso la forma será ``(2200, 2, 62, 47, 3)``.

source: The :func:`sklearn.datasets.fetch_lfw_pairs` datasets is subdivided into 3 subsets: the development ``train`` set, the development ``test`` set and an evaluation ``10_folds`` set meant to compute performance metrics using a 10-folds cross validation scheme.
es_es: Los conjuntos de datos :func:`sklearn.datasets.fetch_lfw_pairs` se dividen en 3 subconjuntos: el conjunto de desarrollo ``train``, el conjunto de desarrollo ``test`` y un conjunto de evaluación ``10_folds`` destinado a calcular las métricas de rendimiento utilizando un esquema de validación cruzada de 10 pliegues (folds).

source: `Labeled Faces in the Wild: A Database for Studying Face Recognition in Unconstrained Environments. <http://vis-www.cs.umass.edu/lfw/lfw.pdf>`_ Gary B. Huang, Manu Ramesh, Tamara Berg, and Erik Learned-Miller. University of Massachusetts, Amherst, Technical Report 07-49, October, 2007.
es_es: `Labeled Faces in the Wild: A Database for Studying Face Recognition in Unconstrained Environments. <http://vis-www.cs.umass.edu/lfw/lfw.pdf>`_ Gary B. Huang, Manu Ramesh, Tamara Berg y Erik Learned-Miller. University of Massachusetts, Amherst, Technical Report 07-49, Octubre, 2007.

source: Examples
es_es: Ejemplos

source: Forest covertypes
es_es: Tipos de cobertura forestal

source: The samples in this dataset correspond to 30×30m patches of forest in the US, collected for the task of predicting each patch's cover type, i.e. the dominant species of tree. There are seven covertypes, making this a multiclass classification problem. Each sample has 54 features, described on the `dataset's homepage <https://archive.ics.uci.edu/ml/datasets/Covertype>`__. Some of the features are boolean indicators, while others are discrete or continuous measurements.
es_es: Las muestras de este conjunto de datos corresponden a parcelas de 30×30m de bosque en EE.UU., recopiladas para la tarea de predecir el tipo de cobertura de cada parcela, es decir, las especies dominantes de árboles. Hay siete tipos de cobertura, por lo que se trata de un problema de clasificación multiclase. Cada muestra tiene 54 características, descritas en la `página de inicio del conjunto de datos <https://archive.ics.uci.edu/ml/datasets/Covertype>`__. Algunas de las características son indicadores booleanos, mientras que otras son medidas discretas o continuas.
