Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/datasets/real_world.po
Languages: es_es

source: :func:`sklearn.datasets.fetch_covtype` will load the covertype dataset; it returns a dictionary-like 'Bunch' object with the feature matrix in the ``data`` member and the target values in ``target``. If optional argument 'as_frame' is set to 'True', it will return ``data`` and ``target`` as pandas data frame, and there will be an additional member ``frame`` as well. The dataset will be downloaded from the web if necessary.
es_es: :func:`sklearn.datasets.fetch_covtype` cargará el conjunto de datos covertype; devuelve un objeto dictionary-like 'Bunch' con la matriz de características en el miembro ``data`` y los valores objetivo en ``target``. Si el argumento opcional 'as_frame' se establece en 'True', devolverá ``data`` y ``target`` como un marco de datos de pandas, y también habrá un miembro adicional ``frame``. El conjunto de datos se descargará de la web si es necesario.

source: RCV1 dataset
es_es: Conjunto de datos RCV1

source: Reuters Corpus Volume I (RCV1) is an archive of over 800,000 manually categorized newswire stories made available by Reuters, Ltd. for research purposes. The dataset is extensively described in [1]_.
es_es: Reuters Corpus Volume I (RCV1) es un archivo de más de 800,000 noticias clasificadas manualmente que Reuters, Ltd. pone a disposición de los investigadores. El conjunto de datos se describe ampliamente en [1]_.

source: :func:`sklearn.datasets.fetch_rcv1` will load the following version: RCV1-v2, vectors, full sets, topics multilabels::
es_es: :func:`sklearn.datasets.fetch_rcv1` cargará la siguiente versión: RCV1-v2, vectores, conjuntos completos, temas multietiquetas::

source: It returns a dictionary-like object, with the following attributes:
es_es: Devuelve un objeto dictionary-like, con los siguientes atributos:

source: ``data``: The feature matrix is a scipy CSR sparse matrix, with 804414 samples and 47236 features. Non-zero values contains cosine-normalized, log TF-IDF vectors. A nearly chronological split is proposed in [1]_: The first 23149 samples are the training set. The last 781265 samples are the testing set. This follows the official LYRL2004 chronological split. The array has 0.16% of non zero values::
es_es: ``data``: La matriz de características es una matriz dispersa CSR de scipy, con 804414 muestras y 47236 características. Los valores distintos de cero contienen vectores coseno-normalizados, log TF-IDF. En [1]_ se propone una división casi cronológica: Las primeras 23149 muestras son el conjunto de entrenamiento. Las últimas 781265 muestras son el conjunto de pruebas. Esto sigue la división cronológica oficial de LYRL2004. El arreglo tiene un 0.16% de valores distintos de cero::

source: ``target``: The target values are stored in a scipy CSR sparse matrix, with 804414 samples and 103 categories. Each sample has a value of 1 in its categories, and 0 in others. The array has 3.15% of non zero values::
es_es: ``target``: Los valores objetivo se almacenan en una matriz dispersa CSR de scipy, con 804414 muestras y 103 categorías. Cada muestra tiene un valor de 1 en sus categorías, y 0 en las demás. El arreglo tiene un 3.15% de valores distintos de cero::

source: The dataset will be downloaded from the `rcv1 homepage`_ if necessary. The compressed size is about 656 MB.
es_es: El conjunto de datos se descargará de `rcv1 homepage`_ si es necesario. El tamaño comprimido es de unos 656 MB.

source: Lewis, D. D., Yang, Y., Rose, T. G., & Li, F. (2004). RCV1: A new benchmark collection for text categorization research. The Journal of Machine Learning Research, 5, 361-397.
es_es: Lewis, D. D., Yang, Y., Rose, T. G. y Li, F. (2004). RCV1: A new benchmark collection for text categorization research. The Journal of Machine Learning Research, 5, 361-397.

source: Kddcup 99 dataset
es_es: Conjunto de datos Kddcup 99

source: General KDD structure :
es_es: Estructura general KDD:

source: discrete (int) or continuous (float)
es_es: discreto (int) o continuo (float)

source: Targets
es_es: Objetivos

source: str, 'normal.' or name of the anomaly type
es_es: str, 'normal.' o nombre del tipo de anomalía

source: SA structure :
es_es: Estructura SA:

source: SF structure :
es_es: Estructura SF:

source: http structure :
es_es: Estructura http:

source: smtp structure :
es_es: Estructura smtp:

source: K. Yamanishi, J.-I. Takeuchi, G. Williams, and P. Milne. Online unsupervised outlier detection using finite mixtures with discounting learning algorithms. In Proceedings of the sixth ACM SIGKDD international conference on Knowledge discovery and data mining, pages 320-324. ACM Press, 2000.
es_es: K. Yamanishi, J.-I. Takeuchi, G. Williams y P. Milne. Online unsupervised outlier detection using finite mixtures with discounting learning algorithms. In Proceedings of the sixth ACM SIGKDD international conference on Knowledge discovery and data mining, páginas 320-324. ACM Press, 2000.

source: California Housing dataset
es_es: Conjunto de datos California Housing

source: Number of Instances
es_es: Número de Instancias

source: Number of Attributes
es_es: Número de Atributos

source: Missing Attribute Values
es_es: Valores de Atributos Faltantes

source: This dataset was obtained from the StatLib repository. http://lib.stat.cmu.edu/datasets/
es_es: Este conjunto de datos se obtuvo del repositorio StatLib. http://lib.stat.cmu.edu/datasets/

source: It can be downloaded/loaded using the :func:`sklearn.datasets.fetch_california_housing` function.
es_es: Puede descargarse/cargarse utilizando la función :func:`sklearn.datasets.fetch_california_housing`.

source: Pace, R. Kelley and Ronald Barry, Sparse Spatial Autoregressions, Statistics and Probability Letters, 33 (1997) 291-297
es_es: Pace, R. Kelley y Ronald Barry, Sparse Spatial Autoregressions, Statistics and Probability Letters, 33 (1997) 291-297
