Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/gaussian_process/plot_gpr_co2.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_co2.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_co2.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Gaussian process regression (GPR) on Mauna Loa CO2 data.
es_es: Regresión del proceso gaussiano (GPR) en los datos de CO2 de Mauna Loa.

source: This example is based on Section 5.4.3 of "Gaussian Processes for Machine Learning" [RW2006]. It illustrates an example of complex kernel engineering and hyperparameter optimization using gradient ascent on the log-marginal-likelihood. The data consists of the monthly average atmospheric CO2 concentrations (in parts per million by volume (ppmv)) collected at the Mauna Loa Observatory in Hawaii, between 1958 and 2001. The objective is to model the CO2 concentration as a function of the time t.
es_es: Este ejemplo se basa en la Sección 5.4.3 de "Gaussian Processes for Machine Learning" [RW2006]. Ilustra un ejemplo de ingeniería de kernel complejo y optimización de hiperparámetros utilizando el ascenso de gradiente en el logaritmo de la verosimilitud marginal. Los datos consisten en las concentraciones promedios mensuales de CO2 atmosférico (en partes por millón en volumen (ppmv)) recogidas en el Observatorio de Mauna Loa en Hawai, entre 1958 y 2001. El objetivo es modelar la concentración de CO2 en función del tiempo t.

source: The kernel is composed of several terms that are responsible for explaining different properties of the signal:
es_es: El núcleo se compone de varios términos que son responsables de explicar diferentes propiedades de la señal:

source: a long term, smooth rising trend is to be explained by an RBF kernel. The RBF kernel with a large length-scale enforces this component to be smooth; it is not enforced that the trend is rising which leaves this choice to the GP. The specific length-scale and the amplitude are free hyperparameters.
es_es: una tendencia suave y ascendente a largo plazo debe ser explicada por un núcleo RBF. El núcleo RBF con una gran escala de longitud obliga a que este componente sea suave; no se obliga a que la tendencia sea ascendente, lo que deja esta elección a la GP. La escala de longitud específica y la amplitud son hiperparámetros libres.

source: a seasonal component, which is to be explained by the periodic ExpSineSquared kernel with a fixed periodicity of 1 year. The length-scale of this periodic component, controlling its smoothness, is a free parameter. In order to allow decaying away from exact periodicity, the product with an RBF kernel is taken. The length-scale of this RBF component controls the decay time and is a further free parameter.
es_es: un componente estacional, que debe ser explicado por el núcleo periódico ExpSineSquared con una periodicidad fija de 1 año. La escala de longitud de este componente periódico, que controla su suavidad, es un parámetro libre. Para permitir el decaimiento de la periodicidad exacta, se toma el producto con un núcleo RBF. La escala de longitud de este componente RBF controla el tiempo de decaimiento y es otro parámetro libre.

source: smaller, medium term irregularities are to be explained by a RationalQuadratic kernel component, whose length-scale and alpha parameter, which determines the diffuseness of the length-scales, are to be determined. According to [RW2006], these irregularities can better be explained by a RationalQuadratic than an RBF kernel component, probably because it can accommodate several length-scales.
es_es: las irregularidades más pequeñas y a medio plazo deben explicarse mediante un componente núcleo RationalQuadratic, cuya escala de longitud y parámetro alfa, que determina la difusividad de las escalas de longitud, deben determinarse. Según [RW2006], estas irregularidades se pueden explicar mejor con un componente núcleo RationalQuadratic que con uno RBF, probablemente porque puede acomodar varias escalas de longitud.

source: a "noise" term, consisting of an RBF kernel contribution, which shall explain the correlated noise components such as local weather phenomena, and a WhiteKernel contribution for the white noise. The relative amplitudes and the RBF's length scale are further free parameters.
es_es: un término de "ruido", que consiste en una contribución del núcleo RBF, que explicará los componentes de ruido correlacionados, como los fenómenos meteorológicos locales, y una contribución del WhiteKernel para el ruido blanco. Las amplitudes relativas y la escala de longitud del RBF son otros parámetros libres.

source: Maximizing the log-marginal-likelihood after subtracting the target's mean yields the following kernel with an LML of -83.214::
es_es: Al maximizar la verosimilitud marginal logarítmica después de restar la media del objetivo, se obtiene el siguiente núcleo con un LML de -83,214::

source: Thus, most of the target signal (34.4ppm) is explained by a long-term rising trend (length-scale 41.8 years). The periodic component has an amplitude of 3.27ppm, a decay time of 180 years and a length-scale of 1.44. The long decay time indicates that we have a locally very close to periodic seasonal component. The correlated noise has an amplitude of 0.197ppm with a length scale of 0.138 years and a white-noise contribution of 0.197ppm. Thus, the overall noise level is very small, indicating that the data can be very well explained by the model. The figure shows also that the model makes very confident predictions until around 2015.
es_es: Así, la mayor parte de la señal objetivo (34,4ppm) se explica por una tendencia ascendente a largo plazo (escala de longitud de 41,8 años). El componente periódico tiene una amplitud de 3,27 ppm, un tiempo de decaimiento de 180 años y una escala de longitud de 1,44. El largo tiempo de decaimiento indica que tenemos una componente estacional localmente muy cercana a la periódica. El ruido correlacionado tiene una amplitud de 0,197ppm con una escala de longitud de 0,138 años y una contribución de ruido blanco de 0,197ppm. Por tanto, el nivel de ruido global es muy pequeño, lo que indica que los datos pueden ser explicados muy bien por el modelo. La figura muestra también que el modelo realiza predicciones muy seguras hasta aproximadamente 2015.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 26.744 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 26.744 segundos)

source: :download:`Download Python source code: plot_gpr_co2.py <plot_gpr_co2.py>`
es_es: :download:`Descarga el código fuente de Python: plot_gpr_co2.py <plot_gpr_co2.py>`

source: :download:`Download Jupyter notebook: plot_gpr_co2.ipynb <plot_gpr_co2.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_gpr_co2.ipynb <plot_gpr_co2.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
