Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/gaussian_process/plot_gpr_on_structured_data.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_on_structured_data.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_on_structured_data.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Gaussian processes on discrete data structures
es_es: Procesos Gaussianos en estructuras de datos discretos

source: This example illustrates the use of Gaussian processes for regression and classification tasks on data that are not in fixed-length feature vector form. This is achieved through the use of kernel functions that operates directly on discrete structures such as variable-length sequences, trees, and graphs.
es_es: Este ejemplo ilustra el uso de procesos gaussianos para tareas de regresión y clasificación en datos que no están en forma de vector de características de longitud fija. Esto se consigue mediante el uso de funciones núcleo que operan directamente sobre estructuras discretas como secuencias de longitud variable, árboles y gráficos.

source: Specifically, here the input variables are some gene sequences stored as variable-length strings consisting of letters 'A', 'T', 'C', and 'G', while the output variables are floating point numbers and True/False labels in the regression and classification tasks, respectively.
es_es: En concreto, aquí las variables de entrada son algunas secuencias de genes almacenadas como cadenas de longitud variable compuestas por letras "A", "T", "C" y "G", mientras que las variables de salida son números de punto flotante y etiquetas True/False en las tareas de regresión y clasificación, respectivamente.

source: A kernel between the gene sequences is defined using R-convolution [1]_ by integrating a binary letter-wise kernel over all pairs of letters among a pair of strings.
es_es: Un núcleo entre las secuencias del gen se define usando R-convolution [1]_ integrando un núcleo binario en sentido de las letras sobre todos los pares de letras entre un par de cadenas.

source: This example will generate three figures.
es_es: Este ejemplo generará tres cifras.

source: In the first figure, we visualize the value of the kernel, i.e. the similarity of the sequences, using a colormap. Brighter color here indicates higher similarity.
es_es: En la primera figura, visualizamos el valor del núcleo, p.ej. la similitud de las secuencias, usando un mapa de color, el color brillante aquí indica una mayor similitud.

source: In the second figure, we show some regression result on a dataset of 6 sequences. Here we use the 1st, 2nd, 4th, and 5th sequences as the training set to make predictions on the 3rd and 6th sequences.
es_es: En la segunda figura, mostramos algún resultado de regresión en un conjunto de datos de 6 secuencias. Aquí utilizamos las 1ra, 2da, 4ta y 5ta secuencias como entrenamiento para hacer predicciones sobre las secuencias 3ra y 6ta.

source: In the third figure, we demonstrate a classification model by training on 6 sequences and make predictions on another 5 sequences. The ground truth here is simply whether there is at least one 'A' in the sequence. Here the model makes four correct classifications and fails on one.
es_es: En la tercera figura, demostramos un modelo de clasificación entrenando en 6 secuencias y haciendo predicciones en otras 5 secuencias. La verdad básica aquí es simplemente si hay al menos una "A" en la secuencia. Aquí el modelo hace cuatro clasificaciones correctas y falla en una.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 0.351 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.351 segundos)

source: :download:`Download Python source code: plot_gpr_on_structured_data.py <plot_gpr_on_structured_data.py>`
es_es: :download:`Descarga el código fuente de Python: plot_gpr_on_structured_data.py <plot_gpr_on_structured_data.py>`

source: :download:`Download Jupyter notebook: plot_gpr_on_structured_data.ipynb <plot_gpr_on_structured_data.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_gpr_on_structured_data.ipynb <plot_gpr_on_structured_data.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
