Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/gaussian_process/plot_gpc.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_gaussian_process_plot_gpc.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_gaussian_process_plot_gpc.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Probabilistic predictions with Gaussian process classification (GPC)
es_es: Predicciones probabilistas con clasificación de procesos Gaussianos (GPC)

source: This example illustrates the predicted probability of GPC for an RBF kernel with different choices of the hyperparameters. The first figure shows the predicted probability of GPC with arbitrarily chosen hyperparameters and with the hyperparameters corresponding to the maximum log-marginal-likelihood (LML).
es_es: Este ejemplo ilustra la probabilidad pronosticada de GPC para un núcleo RBF con diferentes elecciones de los hiperparámetros. La primera figura muestra la probabilidad predicha de GPC con hiperparámetros elegidos arbitrariamente y con los hiperparámetros correspondientes a la máxima verosimilitud marginal logarítmica (LML).

source: While the hyperparameters chosen by optimizing LML have a considerable larger LML, they perform slightly worse according to the log-loss on test data. The figure shows that this is because they exhibit a steep change of the class probabilities at the class boundaries (which is good) but have predicted probabilities close to 0.5 far away from the class boundaries (which is bad) This undesirable effect is caused by the Laplace approximation used internally by GPC.
es_es: Aunque los hiperparámetros elegidos mediante la optimización de LML tienen un LML considerablemente mayor, su rendimiento es ligeramente inferior de acuerdo con la pérdida logarítmica en los datos de prueba. La figura muestra que esto se debe a que exhiben un cambio pronunciado de las probabilidades de clase en los límites de la clase (lo cual es bueno) pero tienen probabilidades predichas cercanas a 0,5 lejos de los límites de la clase (lo cual es malo) Este efecto indeseable es causado por la aproximación de Laplace utilizada internamente por GPC.

source: The second figure shows the log-marginal-likelihood for different choices of the kernel's hyperparameters, highlighting the two choices of the hyperparameters used in the first figure by black dots.
es_es: La segunda figura muestra la verosimilitud marginal logarítmica para diferentes opciones de los hiperparámetros del núcleo, destacando las dos opciones de los hiperparámetros utilizados en la primera figura mediante puntos negros.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 6.309 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 6.309 segundos)

source: :download:`Download Python source code: plot_gpc.py <plot_gpc.py>`
es_es: :download:`Descarga el código fuente de Python: plot_gpc.py <plot_gpc.py>`

source: :download:`Download Jupyter notebook: plot_gpc.ipynb <plot_gpc.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_gpc.ipynb <plot_gpc.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
