Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/gaussian_process/plot_gpr_noisy_targets.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_noisy_targets.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_gaussian_process_plot_gpr_noisy_targets.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Gaussian Processes regression: basic introductory example
es_es: Regresión de procesos Gaussianos: ejemplo introductorio básico

source: A simple one-dimensional regression example computed in two different ways:
es_es: Un ejemplo simple de regresión unidimensional calculado de dos maneras diferentes:

source: A noise-free case
es_es: Un caso libre de ruido

source: A noisy case with known noise-level per datapoint
es_es: Un caso ruidoso con un nivel de ruido conocido por punto de datos

source: In both cases, the kernel's parameters are estimated using the maximum likelihood principle.
es_es: En ambos casos, los parámetros del núcleo se calculan utilizando el principio de verosimilitud máxima.

source: The figures illustrate the interpolating property of the Gaussian Process model as well as its probabilistic nature in the form of a pointwise 95% confidence interval.
es_es: Las cifras ilustran la propiedad interpolante del modelo del Proceso Gaussiano así como su naturaleza probabilística en forma de un intervalo de confianza del 95% sin sentido.

source: Note that the parameter ``alpha`` is applied as a Tikhonov regularization of the assumed covariance between the training points.
es_es: Ten en cuenta que el parámetro ``alpha`` se aplica como una regularización Tikhonov de la covarianza asumida entre los puntos de entrenamiento.

source: **Total running time of the script:** ( 0 minutes 0.646 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.646 segundos)

source: :download:`Download Python source code: plot_gpr_noisy_targets.py <plot_gpr_noisy_targets.py>`
es_es: :download:`Descarga el código fuente de Python: plot_gpr_noisy_targets.py <plot_gpr_noisy_targets.py>`

source: :download:`Download Jupyter notebook: plot_gpr_noisy_targets.ipynb <plot_gpr_noisy_targets.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_gpr_noisy_targets.ipynb <plot_gpr_noisy_targets.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
