Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/statistical_inference/model_selection.po
Languages: es_es

source: Model selection: choosing estimators and their parameters
es_es: Selección de modelos: elección de estimadores y sus parámetros

source: Score, and cross-validated scores
es_es: Puntuación, y puntuaciones validadas de forma cruzada

source: As we have seen, every estimator exposes a ``score`` method that can judge the quality of the fit (or the prediction) on new data. **Bigger is better**.
es_es: Como hemos visto, cada estimador expone un método de ``puntuación`` que puede juzgar la calidad del ajuste (o de la predicción) sobre nuevos datos. **Cuanto más grande, mejor**.

source: To get a better measure of prediction accuracy (which we can use as a proxy for goodness of fit of the model), we can successively split the data in *folds* that we use for training and testing::
es_es: Para obtener una mejor medida de la precisión de la predicción (que podemos utilizar como indicador de la bondad del ajuste del modelo), podemos dividir sucesivamente los datos en *pliegues* que utilizaremos para el entrenamiento y la prueba::

source: This is called a :class:`KFold` cross-validation.
es_es: Esto se denomina validación cruzada :class:`KFold`.

source: Cross-validation generators
es_es: Generadores de validación cruzada

source: Scikit-learn has a collection of classes which can be used to generate lists of train/test indices for popular cross-validation strategies.
es_es: Scikit-learn tiene una colección de clases que se pueden utilizar para generar listas de índices de entrenamiento/prueba para estrategias populares de validación cruzada.

source: They expose a ``split`` method which accepts the input dataset to be split and yields the train/test set indices for each iteration of the chosen cross-validation strategy.
es_es: Exponen un método ``split`` que acepta el conjunto de datos de entrada que se va a dividir y produce los índices del conjunto de entrenamiento/prueba para cada iteración de la estrategia de validación cruzada elegida.

source: This example shows an example usage of the ``split`` method.
es_es: Este ejemplo muestra un ejemplo de uso del método ``split``.

source: The cross-validation can then be performed easily::
es_es: La validación cruzada puede entonces realizarse fácilmente::

source: The cross-validation score can be directly calculated using the :func:`cross_val_score` helper. Given an estimator, the cross-validation object and the input dataset, the :func:`cross_val_score` splits the data repeatedly into a training and a testing set, trains the estimator using the training set and computes the scores based on the testing set for each iteration of cross-validation.
es_es: La puntuación de validación cruzada puede calcularse directamente utilizando el ayudante :func:`cross_val_score`. Dado un estimador, el objeto de validación cruzada y el conjunto de datos de entrada, :func:`cross_val_score` divide los datos repetidamente en un conjunto de entrenamiento y otro de prueba, entrena el estimador utilizando el conjunto de entrenamiento y calcula las puntuaciones basadas en el conjunto de prueba para cada iteración de validación cruzada.

source: By default the estimator's ``score`` method is used to compute the individual scores.
es_es: Por defecto se utiliza el método de ``puntuación`` del estimador para calcular las puntuaciones individuales.

source: Refer the :ref:`metrics module <metrics>` to learn more on the available scoring methods.
es_es: Consulte el módulo :ref:`metrics <metrics>` para obtener más información sobre los métodos de puntuación disponibles.

source: `n_jobs=-1` means that the computation will be dispatched on all the CPUs of the computer.
es_es: `n_jobs=-1` significa que el cálculo se enviará a todas las CPUs de la computadora.

source: Alternatively, the ``scoring`` argument can be provided to specify an alternative scoring method.
es_es: Alternativamente, se puede proporcionar el argumento ``scoring`` para especificar un método de puntuación alternativo.

source: **Cross-validation generators**
es_es: **Generadores de validación cruzada**

source: Splits it into K folds, trains on K-1 and then tests on the left-out.
es_es: Lo divide en K pliegues, entrena en K-1 y luego prueba en la salida de la izquierda.

source: Same as K-Fold but preserves the class distribution within each fold.
es_es: Igual que K-Fold pero preserva la distribución de clases dentro de cada pliegue.

source: Ensures that the same group is not in both testing and training sets.
es_es: Garantiza que el mismo grupo no esté en los conjuntos de prueba y de entrenamiento.

source: Generates train/test indices based on random permutation.
es_es: Genera índices de entrenamiento/prueba basados en una permutación aleatoria.

source: Same as shuffle split but preserves the class distribution within each iteration.
es_es: Igual que la división aleatoria, pero preserva la distribución de clases dentro de cada iteración.

source: Takes a group array to group observations.
es_es: Toma un arreglo de grupos para agrupar las observaciones.

source: Leave P groups out.
es_es: Deja fuera a los grupos P.

source: Leave one observation out.
es_es: Deja de lado una observación.

source: :class:`PredefinedSplit`
es_es: :class:`LeavePOut` **(p)**

source: Leave P observations out.
es_es: Deja fuera las observaciones P.

source: Generates train/test indices based on predefined splits.
es_es: Genera índices de entrenamiento/prueba basados en divisiones predefinidas.

source: **Exercise**
es_es: **Ejercicio**

source: On the digits dataset, plot the cross-validation score of a :class:`SVC` estimator with an linear kernel as a function of parameter ``C`` (use a logarithmic grid of points, from 1 to 10).
es_es: En el conjunto de datos de los dígitos, trace la puntuación de validación cruzada de un estimador :class:`SVC` con un núcleo lineal como función del parámetro ``C`` (utilice una cuadrícula logarítmica de puntos, de 1 a 10).

source: **Solution:** :ref:`sphx_glr_auto_examples_exercises_plot_cv_digits.py`
es_es: **Solución:** :ref:`sphx_glr_auto_examples_exercises_plot_cv_digits.py`

source: Grid-search and cross-validated estimators
es_es: Búsqueda en cuadrícula y estimadores de validación cruzada

source: Grid-search
es_es: Búsqueda en cuadrícula

source: scikit-learn provides an object that, given data, computes the score during the fit of an estimator on a parameter grid and chooses the parameters to maximize the cross-validation score. This object takes an estimator during the construction and exposes an estimator API::
es_es: scikit-learn proporciona un objeto que, dados los datos, calcula la puntuación durante el ajuste de un estimador en una cuadrícula de parámetros y elige los parámetros para maximizar la puntuación de validación cruzada. Este objeto toma un estimador durante la construcción y expone una API de estimadores::

source: By default, the :class:`GridSearchCV` uses a 5-fold cross-validation. However, if it detects that a classifier is passed, rather than a regressor, it uses a stratified 5-fold.
es_es: Por defecto, :class:`GridSearchCV` utiliza una validación cruzada de 5 veces. Sin embargo, si detecta que se pasa un clasificador, en lugar de un regresor, utiliza una 5 veces estratificada.

source: Nested cross-validation
es_es: Validación cruzada anidada

source: Two cross-validation loops are performed in parallel: one by the :class:`GridSearchCV` estimator to set ``gamma`` and the other one by ``cross_val_score`` to measure the prediction performance of the estimator. The resulting scores are unbiased estimates of the prediction score on new data.
es_es: Se realizan dos bucles de validación cruzada en paralelo: uno por el estimador :class:`GridSearchCV` para establecer ``gamma`` y el otro por ``cross_val_score`` para medir el rendimiento de la predicción del estimador. Las puntuaciones resultantes son estimaciones insesgadas de la puntuación de la predicción en los nuevos datos.

source: You cannot nest objects with parallel computing (``n_jobs`` different than 1).
es_es: No se pueden anidar objetos con computación paralela (``n_jobs`` diferente a 1).

source: Cross-validated estimators
es_es: Estimadores con validación cruzada

source: Cross-validation to set a parameter can be done more efficiently on an algorithm-by-algorithm basis. This is why, for certain estimators, scikit-learn exposes :ref:`cross_validation` estimators that set their parameter automatically by cross-validation::
es_es: La validación cruzada para establecer un parámetro se puede hacer de manera más eficiente sobre una base de algoritmo por algoritmo. Por eso, para ciertos estimadores, scikit-learn expone estimadores :ref:`cross_validation` que establecen su parámetro automáticamente por validación cruzada::

source: These estimators are called similarly to their counterparts, with 'CV' appended to their name.
es_es: Estos estimadores se denominan de forma similar a sus homólogos, añadiendo "CV" a su nombre.

source: On the diabetes dataset, find the optimal regularization parameter alpha.
es_es: En el conjunto de datos de la diabetes, encuentre el parámetro óptimo de regularización alfa.

source: **Bonus**: How much can you trust the selection of alpha?
es_es: **Bonus**: ¿Cuánto puedes confiar en la selección de alfa?
