Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/statistical_inference/settings.po
Languages: es_es

source: Statistical learning: the setting and the estimator object in scikit-learn
es_es: Aprendizaje estadístico: la configuración y el objeto estimador en scikit-learn

source: Datasets
es_es: Conjuntos de datos

source: Scikit-learn deals with learning information from one or more datasets that are represented as 2D arrays. They can be understood as a list of multi-dimensional observations. We say that the first axis of these arrays is the **samples** axis, while the second is the **features** axis.
es_es: Scikit-learn se ocupa de aprender información de uno o más conjuntos de datos que se representan como arreglos 2D. Se pueden entender como una lista de observaciones multidimensionales. Decimos que el primer eje de estos arreglos es el eje de las **muestras**, mientras que el segundo es el eje de las **características**.

source: A simple example shipped with scikit-learn: iris dataset
es_es: Un ejemplo sencillo incluido en scikit-learn: conjunto de datos del iris

source: It is made of 150 observations of irises, each described by 4 features: their sepal and petal length and width, as detailed in ``iris.DESCR``.
es_es: Se compone de 150 observaciones de lirios, cada una descrita por 4 características: la longitud y la anchura de sus sépalos y pétalos, tal como se detalla en ``iris.DESCR``.

source: When the data is not initially in the ``(n_samples, n_features)`` shape, it needs to be preprocessed in order to be used by scikit-learn.
es_es: Cuando los datos no están inicialmente en la forma `(n_samples, n_features)``, necesitan ser preprocesados para poder ser utilizados por scikit-learn.

source: An example of reshaping data would be the digits dataset
es_es: Un ejemplo de remodelación de datos sería el conjunto de datos de dígitos

source: The digits dataset is made of 1797 8x8 images of hand-written digits ::
es_es: El conjunto de datos de dígitos está formado por 1797 imágenes de 8x8 de dígitos escritos a mano ::

source: To use this dataset with scikit-learn, we transform each 8x8 image into a feature vector of length 64 ::
es_es: Para utilizar este conjunto de datos con scikit-learn, transformamos cada imagen de 8x8 en un vector de características de longitud 64 ::

source: Estimators objects
es_es: Objetos estimadores

source: **Fitting data**: the main API implemented by scikit-learn is that of the `estimator`. An estimator is any object that learns from data; it may be a classification, regression or clustering algorithm or a *transformer* that extracts/filters useful features from raw data.
es_es: **Ajuste de datos**: la principal API implementada por scikit-learn es la del `estimador`. Un estimador es cualquier objeto que aprende de los datos; puede ser un algoritmo de clasificación, regresión o conglomerado o un *transformador* que extrae/filtra características útiles de los datos brutos.

source: All estimator objects expose a ``fit`` method that takes a dataset (usually a 2-d array):
es_es: Todos los objetos estimadores exponen un método ``fit`` que toma un conjunto de datos (normalmente un arreglo 2-d):

source: **Estimator parameters**: All the parameters of an estimator can be set when it is instantiated or by modifying the corresponding attribute::
es_es: **Parámetros del estimador**: Todos los parámetros de un estimador pueden establecerse al instanciarlo o modificando el atributo correspondiente::

source: **Estimated parameters**: When data is fitted with an estimator, parameters are estimated from the data at hand. All the estimated parameters are attributes of the estimator object ending by an underscore::
es_es: **Parámetros estimados**: Cuando los datos se ajustan con un estimador, los parámetros se estiman a partir de los datos disponibles. Todos los parámetros estimados son atributos del objeto estimador que terminan con un guión bajo::
