Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/statistical_inference/supervised_learning.po
Languages: es_es

source: Supervised learning: predicting an output variable from high-dimensional observations
es_es: Aprendizaje supervisado: predicción de una variable de salida a partir de observaciones de alta dimensión

source: The problem solved in supervised learning
es_es: El problema resuelto en el aprendizaje supervisado

source: :ref:`Supervised learning <supervised-learning>` consists in learning the link between two datasets: the observed data ``X`` and an external variable ``y`` that we are trying to predict, usually called "target" or "labels". Most often, ``y`` is a 1D array of length ``n_samples``.
es_es: :ref:`El aprendizaje supervisado <supervised-learning>` consiste en aprender el vínculo entre dos conjuntos de datos: los datos observados ``X`` y una variable externa ``y`` que estamos tratando de predecir, normalmente llamada "objetivo" o "etiquetas". La mayoría de las veces, ``y`` es un arreglo 1D de longitud ``n_samples``.

source: All supervised `estimators <https://en.wikipedia.org/wiki/Estimator>`_ in scikit-learn implement a ``fit(X, y)`` method to fit the model and a ``predict(X)`` method that, given unlabeled observations ``X``, returns the predicted labels ``y``.
es_es: Todos los `estimadores supervisados <https://en.wikipedia.org/wiki/Estimator>`_ en scikit-learn implementan un método ``fit(X, y)`` para ajustar el modelo y un método ``predict(X)`` que, dadas las observaciones sin etiquetar ``X``, devuelve las etiquetas predichas ``y``.

source: Vocabulary: classification and regression
es_es: Vocabulario: clasificación y regresión

source: If the prediction task is to classify the observations in a set of finite labels, in other words to "name" the objects observed, the task is said to be a **classification** task. On the other hand, if the goal is to predict a continuous target variable, it is said to be a **regression** task.
es_es: Si la tarea de predicción consiste en clasificar las observaciones en un conjunto de etiquetas finitas, es decir, en "nombrar" los objetos observados, se dice que la tarea es de **clasificación**. En cambio, si el objetivo es predecir una variable objetivo continua, se dice que es una tarea de **regresión**.

source: When doing classification in scikit-learn, ``y`` is a vector of integers or strings.
es_es: Al hacer la clasificación en scikit-learn, ``y`` es un vector de enteros o cadenas.

source: Note: See the :ref:`Introduction to machine learning with scikit-learn Tutorial <introduction>` for a quick run-through on the basic machine learning vocabulary used within scikit-learn.
es_es: Nota: Ver la :ref:`Introduction to machine learning with scikit-learn Tutorial <introduction>` para un rápido repaso del vocabulario básico de aprendizaje automático utilizado dentro de scikit-learn.

source: Nearest neighbor and the curse of dimensionality
es_es: El vecino más cercano y la maldición de la dimensionalidad

source: The iris dataset is a classification task consisting in identifying 3 different types of irises (Setosa, Versicolour, and Virginica) from their petal and sepal length and width::
es_es: El conjunto de datos del iris es una tarea de clasificación que consiste en identificar 3 tipos diferentes de iris (Setosa, Versicolor y Virginica) a partir de la longitud y anchura de sus pétalos y sépalos::

source: k-Nearest neighbors classifier
es_es: clasificador de vecinos más cercanos (k-Nearest neighbors)

source: The simplest possible classifier is the `nearest neighbor <https://en.wikipedia.org/wiki/K-nearest_neighbor_algorithm>`_: given a new observation ``X_test``, find in the training set (i.e. the data used to train the estimator) the observation with the closest feature vector. (Please see the :ref:`Nearest Neighbors section<neighbors>` of the online Scikit-learn documentation for more information about this type of classifier.)
es_es: El clasificador más simple posible es el `vecino más cercano<https://en.wikipedia.org/wiki/K-nearest_neighbor_algorithm>`_: dada una nueva observación ``X_test``, encontrar en el conjunto de entrenamiento (es decir, los datos utilizados para entrenar el estimador) la observación con el vector de características más cercano. (Por favor, ver la sección :ref:`Nearest Neighbors<neighbors>` de la documentación online de Scikit-learn para más información sobre este tipo de clasificador.)

source: Training set and testing set
es_es: Conjunto de entrenamiento y conjunto de pruebas

source: While experimenting with any learning algorithm, it is important not to test the prediction of an estimator on the data used to fit the estimator as this would not be evaluating the performance of the estimator on **new data**. This is why datasets are often split into *train* and *test* data.
es_es: Mientras se experimenta con cualquier algoritmo de aprendizaje, es importante no probar la predicción de un estimador en los datos utilizados para ajustar el estimador, ya que no se estaría evaluando el rendimiento del estimador en **nuevos datos**. Por eso los conjuntos de datos suelen dividirse en datos de *entrenamiento* y de *prueba*.

source: **KNN (k nearest neighbors) classification example**:
es_es: **Ejemplo de clasificación KNN (k vecinos más cercanos)**:

source: The curse of dimensionality
es_es: La maldición de la dimensionalidad

source: For an estimator to be effective, you need the distance between neighboring points to be less than some value :math:`d`, which depends on the problem. In one dimension, this requires on average :math:`n \sim 1/d` points. In the context of the above :math:`k`-NN example, if the data is described by just one feature with values ranging from 0 to 1 and with :math:`n` training observations, then new data will be no further away than :math:`1/n`. Therefore, the nearest neighbor decision rule will be efficient as soon as :math:`1/n` is small compared to the scale of between-class feature variations.
es_es: Para que un estimador sea eficiente, es necesario que la distancia entre puntos vecinos sea menor que algún valor :math:`d`, que depende del problema. En una dimensión, esto requiere una media de :math:`n \sim 1/d` puntos. En el contexto del ejemplo anterior de :math:`k`-NN, si los datos están descritos por una sola característica con valores que van de 0 a 1 y con :math:`n` observaciones de entrenamiento, entonces los nuevos datos no estarán más lejos que :math:`1/n`. Por lo tanto, la regla de decisión del vecino más cercano será eficiente en cuanto :math:`1/n` sea pequeño en comparación con la escala de variaciones de características entre clases.

source: If the number of features is :math:`p`, you now require :math:`n \sim 1/d^p` points. Let's say that we require 10 points in one dimension: now :math:`10^p` points are required in :math:`p` dimensions to pave the :math:`[0, 1]` space. As :math:`p` becomes large, the number of training points required for a good estimator grows exponentially.
es_es: Si el número de características es :math:`p`, ahora se requieren :math:`n \sim 1/d^p` puntos. Digamos que necesitamos 10 puntos en una dimensión: ahora se requieren :math:`10^p` puntos en las dimensiones :math:`p` para pavimentar el espacio :math:`[0, 1]`. A medida que :math:`p` se hace grande, el número de puntos de entrenamiento necesarios para un buen estimador crece exponencialmente.

source: For example, if each point is just a single number (8 bytes), then an effective :math:`k`-NN estimator in a paltry :math:`p \sim 20` dimensions would require more training data than the current estimated size of the entire internet (±1000 Exabytes or so).
es_es: Por ejemplo, si cada punto es un solo número (8 bytes), entonces un estimador :math:`k`-NN eficaz en una mísera dimensión :math:`p \sim 20` requeriría más datos de entrenamiento que el tamaño actual estimado de todo Internet (±1000 Exabytes más o menos).

source: This is called the `curse of dimensionality <https://en.wikipedia.org/wiki/Curse_of_dimensionality>`_ and is a core problem that machine learning addresses.
es_es: Esto se denomina `maldición de la dimensionalidad <https://en.wikipedia.org/wiki/Curse_of_dimensionality>`_ y es un problema central que aborda el aprendizaje automático.

source: Linear model: from regression to sparsity
es_es: Modelo lineal: de la regresión a la dispersión

source: Diabetes dataset
es_es: Conjunto de datos sobre la diabetes

source: The diabetes dataset consists of 10 physiological variables (age, sex, weight, blood pressure) measure on 442 patients, and an indication of disease progression after one year::
es_es: El conjunto de datos sobre la diabetes consta de 10 variables fisiológicas (edad, sexo, peso, presión arterial) medidas en 442 pacientes, y una indicación de la progresión de la enfermedad al cabo de un año::

source: The task at hand is to predict disease progression from physiological variables.
es_es: La tarea en cuestión es predecir la progresión de la enfermedad a partir de variables fisiológicas.

source: Linear regression
es_es: Regresión lineal

source: :class:`LinearRegression`, in its simplest form, fits a linear model to the data set by adjusting a set of parameters in order to make the sum of the squared residuals of the model as small as possible.
es_es: :class:`LinearRegression`, en su forma más sencilla, ajusta un modelo lineal al conjunto de datos ajustando un conjunto de parámetros para que la suma de los residuos al cuadrado del modelo sea lo más pequeña posible.

source: Linear models: :math:`y = X\beta + \epsilon`
es_es: Modelos lineales: :math:`y = X\beta + \epsilon`

source: :math:`X`: data
es_es: :math:`X`: datos

source: :math:`y`: target variable
es_es: :math:`y`: objetivo variable

source: :math:`\beta`: Coefficients
es_es: :math:`\beta`: Coeficientes

source: :math:`\epsilon`: Observation noise
es_es: :math:`\epsilon`: Ruido de observación

source: Shrinkage
es_es: Contracción

source: If there are few data points per dimension, noise in the observations induces high variance:
es_es: Si hay pocos puntos de datos por dimensión, el ruido en las observaciones induce una alta varianza:

source: A solution in high-dimensional statistical learning is to *shrink* the regression coefficients to zero: any two randomly chosen set of observations are likely to be uncorrelated. This is called :class:`Ridge` regression:
es_es: Una solución en el aprendizaje estadístico de alta dimensión es *reducir* los coeficientes de regresión a cero: es probable que dos conjuntos de observaciones elegidos al azar no estén correlacionados. Esto se denomina regresión :class:`Ridge`:

source: This is an example of **bias/variance tradeoff**: the larger the ridge ``alpha`` parameter, the higher the bias and the lower the variance.
es_es: Este es un ejemplo de **compensación entre sesgo y varianza**: cuanto mayor sea el parámetro ``alpha`` de la cresta, mayor será el sesgo y menor la varianza.

source: We can choose ``alpha`` to minimize left out error, this time using the diabetes dataset rather than our synthetic data::
es_es: Podemos elegir ``alpha`` para minimizar el error de la izquierda, esta vez utilizando el conjunto de datos de la diabetes en lugar de nuestros datos sintéticos::

source: Capturing in the fitted parameters noise that prevents the model to generalize to new data is called `overfitting <https://en.wikipedia.org/wiki/Overfitting>`_. The bias introduced by the ridge regression is called a `regularization <https://en.wikipedia.org/wiki/Regularization_%28machine_learning%29>`_.
es_es: La captura de ruido en los parámetros ajustados que impide que el modelo se generalice a nuevos datos se denomina `sobreajuste <https://en.wikipedia.org/wiki/Overfitting>`_. El sesgo introducido por la regresión ridge se denomina `regularización <https://en.wikipedia.org/wiki/Regularization_%28machine_learning%29>`_.

source: Sparsity
es_es: Dispersión

source: **Fitting only features 1 and 2**
es_es: **Sólo se ajusta a las características 1 y 2**

source: A representation of the full diabetes dataset would involve 11 dimensions (10 feature dimensions and one of the target variable). It is hard to develop an intuition on such representation, but it may be useful to keep in mind that it would be a fairly *empty* space.
es_es: Una representación del conjunto de datos de la diabetes completo implicaría 11 dimensiones (10 dimensiones de características y una de la variable objetivo). Es difícil desarrollar una intuición sobre dicha representación, pero puede ser útil tener en cuenta que sería un espacio bastante *vacío*.

source: We can see that, although feature 2 has a strong coefficient on the full model, it conveys little information on ``y`` when considered with feature 1.
es_es: Podemos ver que, aunque la característica 2 tiene un fuerte coeficiente en el modelo completo, transmite poca información sobre ``y`` cuando se considera con la característica 1.

source: To improve the conditioning of the problem (i.e. mitigating the :ref:`curse_of_dimensionality`), it would be interesting to select only the informative features and set non-informative ones, like feature 2 to 0. Ridge regression will decrease their contribution, but not set them to zero. Another penalization approach, called :ref:`lasso` (least absolute shrinkage and selection operator), can set some coefficients to zero. Such methods are called **sparse method** and sparsity can be seen as an application of Occam's razor: *prefer simpler models*.
es_es: Para mejorar el condicionamiento del problema (es decir, mitigar la :ref:`curse_of_dimensionality`), sería interesante seleccionar sólo las características informativas y poner a cero las no informativas, como la característica 2. La regresión Ridge disminuirá su contribución, pero no la pondrá a cero. Otro enfoque de penalización, llamado :ref:`lasso` (operador de contracción y reducción mínima absoluta), puede poner algunos coeficientes a cero. Estos métodos se denominan **método de dispersión** y la sparsity puede verse como una aplicación de la navaja de Occam: *prefiera los modelos más simples*.

source: **Different algorithms for the same problem**
es_es: **Diferentes algoritmos para el mismo problema**

source: Different algorithms can be used to solve the same mathematical problem. For instance the ``Lasso`` object in scikit-learn solves the lasso regression problem using a `coordinate descent <https://en.wikipedia.org/wiki/Coordinate_descent>`_ method, that is efficient on large datasets. However, scikit-learn also provides the :class:`LassoLars` object using the *LARS* algorithm, which is very efficient for problems in which the weight vector estimated is very sparse (i.e. problems with very few observations).
es_es: Se pueden utilizar diferentes algoritmos para resolver el mismo problema matemático. Por ejemplo, el objeto ``Lasso`` de scikit-learn resuelve el problema de regresión del lazo utilizando un método de `descenso por coordenadas <https://en.wikipedia.org/wiki/Coordinate_descent>`_, que es eficiente en grandes conjuntos de datos. Sin embargo, scikit-learn también proporciona el objeto :class:`LassoLars` utilizando el algoritmo *LARS*, que es muy eficiente para problemas en los que el vector de pesos estimado es muy disperso (es decir, problemas con muy pocas observaciones).

source: Classification
es_es: Clasificación

source: For classification, as in the labeling `iris <https://en.wikipedia.org/wiki/Iris_flower_data_set>`_ task, linear regression is not the right approach as it will give too much weight to data far from the decision frontier. A linear approach is to fit a sigmoid function or **logistic** function:
es_es: Para la clasificación, como en la tarea de etiquetado de `iris <https://en.wikipedia.org/wiki/Iris_flower_data_set>`_, la regresión lineal no es el enfoque adecuado, ya que dará demasiado peso a los datos alejados de la frontera de decisión. Un enfoque lineal consiste en ajustar una función sigmoidea o una función **logística**:

source: This is known as :class:`LogisticRegression`.
es_es: Esto se conoce como :class:`LogisticRegression`.

source: Multiclass classification
es_es: Clasificación multiclase

source: If you have several classes to predict, an option often used is to fit one-versus-all classifiers and then use a voting heuristic for the final decision.
es_es: Si tienes varias clases que predecir, una opción que se utiliza a menudo es ajustar clasificadores de uno contra todos y luego utilizar una heurística de votación para la decisión final.

source: Shrinkage and sparsity with logistic regression
es_es: Contracción y dispersión con regresión logística

source: The ``C`` parameter controls the amount of regularization in the :class:`LogisticRegression` object: a large value for ``C`` results in less regularization. ``penalty="l2"`` gives :ref:`shrinkage` (i.e. non-sparse coefficients), while ``penalty="l1"`` gives :ref:`sparsity`.
es_es: El parámetro ``C`` controla la cantidad de regularización en el objeto :class:`LogisticRegression`: un valor grande de ``C`` resulta en menos regularización. Con ``penalty="l2"`` se obtiene :ref:`shrinkage` (es decir, coeficientes no dispersos), mientras que con ``penalty="l1"`` se obtiene :ref:`sparsity`.

source: **Exercise**
es_es: **Ejercicio**

source: Try classifying the digits dataset with nearest neighbors and a linear model. Leave out the last 10% and test prediction performance on these observations.
es_es: Intenta clasificar el conjunto de datos de dígitos con los vecinos más cercanos y un modelo lineal. Deja fuera el último 10% y comprueba el rendimiento de la predicción con estas observaciones.

source: A solution can be downloaded :download:`here <../../auto_examples/exercises/plot_digits_classification_exercise.py>`.
es_es: Se puede descargar una solución :download:`aquí <../../auto_examples/exercises/plot_digits_classification_exercise.py>`.

source: Support vector machines (SVMs)
es_es: Máquinas de vectores de soporte (SVM)

source: Linear SVMs
es_es: SVM lineales

source: :ref:`svm` belong to the discriminant model family: they try to find a combination of samples to build a plane maximizing the margin between the two classes. Regularization is set by the ``C`` parameter: a small value for ``C`` means the margin is calculated using many or all of the observations around the separating line (more regularization); a large value for ``C`` means the margin is calculated on observations close to the separating line (less regularization).
es_es: :ref:`svm` pertenecen a la familia de los modelos discriminantes: tratan de encontrar una combinación de muestras para construir un plano que maximice el margen entre las dos clases. La regularización se establece mediante el parámetro ``C``: un valor pequeño de ``C`` significa que el margen se calcula utilizando muchas o todas las observaciones alrededor de la línea de separación (más regularización); un valor grande de ``C`` significa que el margen se calcula sobre las observaciones cercanas a la línea de separación (menos regularización).

source: **Unregularized SVM**
es_es: **SVM no regularizado**

source: **Regularized SVM (default)**
es_es: **SVM regularizada (por defecto)**

source: SVMs can be used in regression --:class:`SVR` (Support Vector Regression)--, or in classification --:class:`SVC` (Support Vector Classification).
es_es: Las SVM pueden utilizarse en regresión --:class:`SVR` (Regresión con Vectores de Soporte)--, o en clasificación --:class:`SVC` (Clasificación por Vectores de Soporte).

source: **Normalizing data**
es_es: **Normalización de los datos**

source: For many estimators, including the SVMs, having datasets with unit standard deviation for each feature is important to get good prediction.
es_es: Para muchos estimadores, incluidos los SVM, tener conjuntos de datos con desviación estándar unitaria para cada característica es importante para obtener una buena predicción.

source: Using kernels
es_es: Uso de los núcleos (kernels)

source: Classes are not always linearly separable in feature space. The solution is to build a decision function that is not linear but may be polynomial instead. This is done using the *kernel trick* that can be seen as creating a decision energy by positioning *kernels* on observations:
es_es: Las clases no siempre son linealmente separables en el espacio de características. La solución es construir una función de decisión que no sea lineal, sino polinómica. Esto se hace utilizando el *truco del núcleo* que puede verse como la creación de una energía de decisión mediante la colocación de *núcleos* en las observaciones:

source: Linear kernel
es_es: Núcleo lineal

source: Polynomial kernel
es_es: Núcleo polinomial

source: RBF kernel (Radial Basis Function)
es_es: Núcleo RBF (Función de Base Radial)

source: **Interactive example**
es_es: **Ejemplo interactivo**

source: See the :ref:`SVM GUI <sphx_glr_auto_examples_applications_svm_gui.py>` to download ``svm_gui.py``; add data points of both classes with right and left button, fit the model and change parameters and data.
es_es: Ver la :ref:`SVM GUI <sphx_glr_auto_examples_applications_svm_gui.py>` para descargar ``svm_gui.py``; añadir puntos de datos de ambas clases con el botón derecho e izquierdo, ajustar el modelo y cambiar parámetros y datos.

source: Try classifying classes 1 and 2 from the iris dataset with SVMs, with the 2 first features. Leave out 10% of each class and test prediction performance on these observations.
es_es: Intente clasificar las clases 1 y 2 del conjunto de datos del iris con SVMs, con las 2 primeras características. Deja fuera el 10% de cada clase y prueba el rendimiento de la predicción con estas observaciones.

source: **Warning**: the classes are ordered, do not leave out the last 10%, you would be testing on only one class.
es_es: **Atención**: las clases están ordenadas, no dejes de lado el último 10%, estarías probando en una sola clase.

source: **Hint**: You can use the ``decision_function`` method on a grid to get intuitions.
es_es: **Pista**: Puedes utilizar el método ``decision_function`` en una cuadrícula para obtener intuiciones.

source: A solution can be downloaded :download:`here <../../auto_examples/exercises/plot_iris_exercise.py>`
es_es: Se puede descargar una solución :download:`aquí <../../auto_examples/exercises/plot_iris_exercise.py>`
