Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/statistical_inference/unsupervised_learning.po
Languages: es_es

source: Unsupervised learning: seeking representations of the data
es_es: Aprendizaje no supervisado: búsqueda de representaciones de los datos

source: Clustering: grouping observations together
es_es: Conglomerado: grupo de observaciones

source: The problem solved in clustering
es_es: El problema resuelto en el conglomerado

source: Given the iris dataset, if we knew that there were 3 types of iris, but did not have access to a taxonomist to label them: we could try a **clustering task**: split the observations into well-separated group called *clusters*.
es_es: Dado el conjunto de datos del iris, si supiéramos que hay 3 tipos de iris, pero no tuviéramos acceso a un taxónomo para etiquetarlos: podríamos intentar una **tarea de conglomerado**: dividir las observaciones en grupos bien separados llamados *conglomerado*.

source: K-means clustering
es_es: Conglomerado de k-medias

source: Note that there exist a lot of different clustering criteria and associated algorithms. The simplest clustering algorithm is :ref:`k_means`.
es_es: Ten en cuenta que existen muchos criterios de conglomerado diferentes y algoritmos asociados. El algoritmo de conglomerado más sencillo es :ref:`k_means`.

source: There is absolutely no guarantee of recovering a ground truth. First, choosing the right number of clusters is hard. Second, the algorithm is sensitive to initialization, and can fall into local minima, although scikit-learn employs several tricks to mitigate this issue.
es_es: No hay ninguna garantía de que se recupere la verdad fundamental. En primer lugar, elegir el número correcto de conglomerados es difícil. En segundo lugar, el algoritmo es sensible a la inicialización y puede caer en mínimos locales, aunque scikit-learn emplea varios trucos para mitigar este problema.

source: **Bad initialization**
es_es: **Mala inicialización**

source: **8 clusters**
es_es: **8 conglomerados**

source: **Ground truth**
es_es: **verdad fundamental**

source: **Don't over-interpret clustering results**
es_es: **No hay que sobreinterpretar los resultados del conglomerado**

source: Clustering in general and KMeans, in particular, can be seen as a way of choosing a small number of exemplars to compress the information. The problem is sometimes known as `vector quantization <https://en.wikipedia.org/wiki/Vector_quantization>`_. For instance, this can be used to posterize an image::
es_es: El análisis de conglomerados en general y KMeans, en particular, puede verse como una forma de elegir un número reducido de ejemplares para comprimir la información. El problema se conoce a veces como `cuantización vectorial <https://en.wikipedia.org/wiki/Vector_quantization>`_. Por ejemplo, esto se puede utilizar para posterizar una imagen::

source: **Raw image**
es_es: **Imagen en bruto**

source: **K-means quantization**
es_es: **Cuantificación k-medias**

source: **Equal bins**
es_es: **Igualdad de intervalos**

source: **Image histogram**
es_es: **Histograma de la imagen**

source: Hierarchical agglomerative clustering: Ward
es_es: Conglomerado jerárquico aglomerado: Ward

source: A :ref:`hierarchical_clustering` method is a type of cluster analysis that aims to build a hierarchy of clusters. In general, the various approaches of this technique are either:
es_es: Un método de :ref:`hierarchical_clustering` es un tipo de análisis de conglomerados que pretende construir una jerarquía de conglomerados. En general, los distintos enfoques de esta técnica son:

source: **Agglomerative** - bottom-up approaches: each observation starts in its own cluster, and clusters are iteratively merged in such a way to minimize a *linkage* criterion. This approach is particularly interesting when the clusters of interest are made of only a few observations. When the number of clusters is large, it is much more computationally efficient than k-means.
es_es: **Aglomerativo** - enfoques ascendentes: cada observación comienza en su propio conglomerado, y los conglomerados se fusionan iterativamente de manera que se minimice un criterio de *enlace*. Este enfoque es especialmente interesante cuando los conglomerados de interés están formados por pocas observaciones. Cuando el número de conglomerados es grande, es mucho más eficiente desde el punto de vista computacional que k-medias.

source: **Divisive** - top-down approaches: all observations start in one cluster, which is iteratively split as one moves down the hierarchy. For estimating large numbers of clusters, this approach is both slow (due to all observations starting as one cluster, which it splits recursively) and statistically ill-posed.
es_es: **Divisivo** - enfoques descendentes: todas las observaciones comienzan en un conglomerado, que se divide iterativamente a medida que se desciende en la jerarquía. Para estimar un gran número de conglomerados, este enfoque es lento (debido a que todas las observaciones comienzan en un conglomerado, que se divide recursivamente) y estadísticamente mal planteado.

source: Connectivity-constrained clustering
es_es: Conglomerado de conectividad restringida

source: With agglomerative clustering, it is possible to specify which samples can be clustered together by giving a connectivity graph. Graphs in scikit-learn are represented by their adjacency matrix. Often, a sparse matrix is used. This can be useful, for instance, to retrieve connected regions (sometimes also referred to as connected components) when clustering an image.
es_es: Con el conglomerado aglomerativo, es posible especificar qué muestras pueden agruparse dando un gráfico de conectividad. Los grafos en scikit-learn se representan mediante su matriz de adyacencia. A menudo, se utiliza una matriz dispersa. Esto puede ser útil, por ejemplo, para recuperar regiones conectadas (a veces también denominadas componentes conectados) cuando se conglomera una imagen.

source: We need a vectorized version of the image. `'rescaled_coins'` is a down-scaled version of the coins image to speed up the process::
es_es: Necesitamos una versión vectorizada de la imagen. `'rescaled_coins'` es una versión reducida de la imagen de las monedas para acelerar el proceso::

source: Define the graph structure of the data. Pixels connected to their neighbors::
es_es: Define la estructura gráfica de los datos. Píxeles conectados a sus vecinos::

source: Feature agglomeration
es_es: Aglomeración de características

source: We have seen that sparsity could be used to mitigate the curse of dimensionality, *i.e* an insufficient amount of observations compared to the number of features. Another approach is to merge together similar features: **feature agglomeration**. This approach can be implemented by clustering in the feature direction, in other words clustering the transposed data.
es_es: Hemos visto que la dispersión podría utilizarse para mitigar la maldición de la dimensionalidad, es decir, una cantidad insuficiente de observaciones en comparación con el número de características. Otro enfoque consiste en fusionar características similares: **aglomeración de características**. Este enfoque puede aplicarse mediante el conglomerado en la dirección de las características, es decir, agrupando los datos transpuestos.

source: ``transform`` and ``inverse_transform`` methods
es_es: métodos ``transform`` y ``inverse_transform``

source: Some estimators expose a ``transform`` method, for instance to reduce the dimensionality of the dataset.
es_es: Algunos estimadores exponen un método de ``transform``, por ejemplo para reducir la dimensionalidad del conjunto de datos.

source: Decompositions: from a signal to components and loadings
es_es: Descomposiciones: de nombres de etiquetas a componentes y cargas

source: **Components and loadings**
es_es: **Componentes y cargas**

source: If X is our multivariate data, then the problem that we are trying to solve is to rewrite it on a different observational basis: we want to learn loadings L and a set of components C such that *X = L C*. Different criteria exist to choose the components
es_es: Si X son nuestros datos multivariantes, el problema que intentamos resolver es reescribirlo sobre una base observacional diferente: queremos aprender las cargas L y un conjunto de componentes C tal que *X = L C*. Existen diferentes criterios para elegir los componentes

source: Principal component analysis: PCA
es_es: Análisis de componentes principales: PCA

source: :ref:`PCA` selects the successive components that explain the maximum variance in the signal.
es_es: :ref:`PCA` selecciona los componentes sucesivos que explican la máxima varianza de la señal.

source: The point cloud spanned by the observations above is very flat in one direction: one of the three univariate features can almost be exactly computed using the other two. PCA finds the directions in which the data is not *flat*
es_es: La nube de puntos abarcada por las observaciones anteriores es muy plana en una dirección: una de las tres características univariantes puede calcularse casi exactamente con las otras dos. PCA encuentra las direcciones en las que los datos no son *planos*

source: When used to *transform* data, PCA can reduce the dimensionality of the data by projecting on a principal subspace.
es_es: Cuando se utiliza para *transformar* los datos, el PCA puede reducir la dimensionalidad de los datos proyectándolos en un subespacio principal.

source: Independent Component Analysis: ICA
es_es: Análisis de componentes independientes: ICA

source: :ref:`ICA` selects components so that the distribution of their loadings carries a maximum amount of independent information. It is able to recover **non-Gaussian** independent signals:
es_es: :ref:`ICA` selecciona los componentes de forma que la distribución de sus cargas contenga la máxima cantidad de información independiente. Es capaz de recuperar señales independientes **no gaussianas**:
