Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/neural_networks/plot_rbm_logistic_classification.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_neural_networks_plot_rbm_logistic_classification.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_neural_networks_plot_rbm_logistic_classification.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Restricted Boltzmann Machine features for digit classification
es_es: Características de la Máquina de Boltzmann restringida para la clasificación de dígitos

source: For greyscale image data where pixel values can be interpreted as degrees of blackness on a white background, like handwritten digit recognition, the Bernoulli Restricted Boltzmann machine model (:class:`BernoulliRBM <sklearn.neural_network.BernoulliRBM>`) can perform effective non-linear feature extraction.
es_es: Para los datos de imágenes en escala de grises en los que los valores de los píxeles pueden interpretarse como grados de negrura sobre un fondo blanco, como el reconocimiento de dígitos escritos a mano, el modelo de la máquina de Boltzmann restringida Bernoulli (:class:`BernoulliRBM <sklearn.neural_network.BernoulliRBM>`) puede realizar una eficaz extracción de características no lineales.

source: In order to learn good latent representations from a small dataset, we artificially generate more labeled data by perturbing the training data with linear shifts of 1 pixel in each direction.
es_es: Para aprender buenas representaciones latentes a partir de un conjunto de datos pequeño, generamos artificialmente más datos etiquetados perturbando los datos de entrenamiento con desplazamientos lineales de 1 píxel en cada dirección.

source: This example shows how to build a classification pipeline with a BernoulliRBM feature extractor and a :class:`LogisticRegression <sklearn.linear_model.LogisticRegression>` classifier. The hyperparameters of the entire model (learning rate, hidden layer size, regularization) were optimized by grid search, but the search is not reproduced here because of runtime constraints.
es_es: Este ejemplo muestra cómo construir un pipeline de clasificación con un extractor de características BernoulliRBM y un clasificador :class:`LogisticRegression <sklearn.linear_model.LogisticRegression>`. Los hiperparámetros de todo el modelo (tasa de aprendizaje, tamaño de la capa oculta, regularización) se optimizaron mediante la búsqueda en cuadrícula, pero la búsqueda no se reproduce aquí debido a las restricciones de tiempo de ejecución.

source: Logistic regression on raw pixel values is presented for comparison. The example shows that the features extracted by the BernoulliRBM help improve the classification accuracy.
es_es: A modo de comparación, se presenta una regresión logística sobre los valores en bruto de los píxeles. El ejemplo muestra que las características extraídas por la BernoulliRBM ayudan a mejorar la exactitud de la clasificación.

source: **Total running time of the script:** ( 0 minutes 13.379 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 13.379 segundos)

source: :download:`Download Python source code: plot_rbm_logistic_classification.py <plot_rbm_logistic_classification.py>`
es_es: :download:`Descargar el código fuente de Python: plot_rbm_logistic_classification.py <plot_rbm_logistic_classification.py>`

source: :download:`Download Jupyter notebook: plot_rbm_logistic_classification.ipynb <plot_rbm_logistic_classification.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_rbm_logistic_classification.ipynb <plot_rbm_logistic_classification.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
