Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_isolation_forest.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_isolation_forest.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_isolation_forest.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: IsolationForest example
es_es: Ejemplo de IsolationForest

source: An example using :class:`~sklearn.ensemble.IsolationForest` for anomaly detection.
es_es: Un ejemplo utilizando :class:`~sklearn.ensemble.IsolationForest` para la detección de anomalías.

source: The IsolationForest 'isolates' observations by randomly selecting a feature and then randomly selecting a split value between the maximum and minimum values of the selected feature.
es_es: El IsolationForest "aísla" las observaciones seleccionando aleatoriamente una característica y luego seleccionando aleatoriamente un valor de división entre los valores máximos y mínimos de la característica seleccionada.

source: Since recursive partitioning can be represented by a tree structure, the number of splittings required to isolate a sample is equivalent to the path length from the root node to the terminating node.
es_es: Dado que la partición recursiva puede representarse mediante una estructura de árbol, el número de particiones necesarias para aislar una muestra es equivalente a la longitud del camino desde el nodo raíz hasta el nodo final.

source: This path length, averaged over a forest of such random trees, is a measure of normality and our decision function.
es_es: Esta longitud del recorrido, promediada sobre un bosque de tales árboles aleatorios, es una medida de normalidad y nuestra función de decisión.

source: Random partitioning produces noticeable shorter paths for anomalies. Hence, when a forest of random trees collectively produce shorter path lengths for particular samples, they are highly likely to be anomalies.
es_es: La partición aleatoria produce trayectorias notablemente más cortas para las anomalías. Por lo tanto, cuando un bosque de árboles aleatorios produce colectivamente trayectorias más cortas para determinadas muestras, es muy probable que se trate de anomalías.

source: **Total running time of the script:** ( 0 minutes 0.591 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.591 segundos)

source: :download:`Download Python source code: plot_isolation_forest.py <plot_isolation_forest.py>`
es_es: :download:`Descargar el código fuente de Python: plot_isolation_forest.py <plot_isolation_forest.py>`

source: :download:`Download Jupyter notebook: plot_isolation_forest.ipynb <plot_isolation_forest.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_isolation_forest.ipynb <plot_isolation_forest.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
