Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_gradient_boosting_categorical.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_categorical.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_categorical.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Categorical Feature Support in Gradient Boosting
es_es: Soporte de características categóricas en Potenciación del Gradiente (Gradient Boosting)

source: In this example, we will compare the training times and prediction performances of :class:`~ensemble.HistGradientBoostingRegressor` with different encoding strategies for categorical features. In particular, we will evaluate:
es_es: En este ejemplo, compararemos los tiempos de entrenamiento y las prestaciones de predicción de :class:`~ensemble.HistGradientBoostingRegressor` con diferentes estrategias de codificación de características categóricas. En particular, evaluaremos:

source: dropping the categorical features
es_es: dejando de lado las características categóricas

source: using a :class:`~preprocessing.OneHotEncoder`
es_es: usando un :class:`~preprocessing.OneHotEncoder`

source: using an :class:`~preprocessing.OrdinalEncoder` and treat categories as ordered, equidistant quantities
es_es: utilizando un :class:`~preprocessing.OrdinalEncoder` y tratar las categorías como cantidades ordenadas y equidistantes

source: using an :class:`~preprocessing.OrdinalEncoder` and rely on the :ref:`native category support <categorical_support_gbdt>` of the :class:`~ensemble.HistGradientBoostingRegressor` estimator.
es_es: utilizando un :class:`~preprocessing.OrdinalEncoder` y confiar en el :ref:`native category support <categorical_support_gbdt>` del estimador :class:`~ensemble.HistGradientBoostingRegressor`.

source: We will work with the Ames Lowa Housing dataset which consists of numerical and categorical features, where the houses' sales prices is the target.
es_es: Trabajaremos con el conjunto de datos de Ames Lowa Housing, que consta de características numéricas y categóricas, y cuyo objetivo es el precio de venta de las viviendas.

source: Load Ames Housing dataset
es_es: Cargar conjunto de datos Ames Housing

source: First, we load the ames housing data as a pandas dataframe. The features are either categorical or numerical:
es_es: En primer lugar, cargamos los datos de Ames Housing como un dataframe de Pandas. Las características son categóricas o numéricas:

source: Gradient boosting estimator with dropped categorical features
es_es: Estimador de potenciación de gradiente con características categóricas eliminadas

source: As a baseline, we create an estimator where the categorical features are dropped:
es_es: Como línea de base, creamos un estimador en el que se eliminan las características categóricas:

source: Gradient boosting estimator with one-hot encoding
es_es: Estimador de potenciación de gradiente con codificación one-hot

source: Next, we create a pipeline that will one-hot encode the categorical features and let the rest of the numerical data to passthrough:
es_es: A continuación, creamos un pipeline que codificará las características categóricas con un one-hot y dejará pasar el resto de los datos numéricos:

source: Gradient boosting estimator with ordinal encoding
es_es: Estimador de potenciación de gradiente (gradient boosting) con codificación one-hot

source: Next, we create a pipeline that will treat categorical features as if they were ordered quantities, i.e. the categories will be encoded as 0, 1, 2, etc., and treated as continuous features.
es_es: A continuación, creamos un pipeline que tratará las características categóricas como si fueran cantidades ordenadas, es decir, las categorías se codificarán como 0, 1, 2, etc., y se tratarán como características continuas.

source: Gradient boosting estimator with native categorical support
es_es: Estimador de potenciación de gradiente con soporte categórico nativo

source: We now create a :class:`~ensemble.HistGradientBoostingRegressor` estimator that will natively handle categorical features. This estimator will not treat categorical features as ordered quantities.
es_es: Ahora creamos un estimador :class:`~ensemble.HistGradientBoostingRegressor` que manejará de forma nativa las características categóricas. Este estimador no tratará las características categóricas como cantidades ordenadas.

source: Since the :class:`~ensemble.HistGradientBoostingRegressor` requires category values to be encoded in `[0, n_unique_categories - 1]`, we still rely on an :class:`~preprocessing.OrdinalEncoder` to pre-process the data.
es_es: Dado que el :class:`~ensemble.HistGradientBoostingRegressor` requiere que los valores de las categorías se codifiquen en `[0, n_unique_categories - 1]`, seguimos dependiendo de un :class:`~preprocessing.OrdinalEncoder` para preprocesar los datos.

source: The main difference between this pipeline and the previous one is that in this one, we let the :class:`~ensemble.HistGradientBoostingRegressor` know which features are categorical.
es_es: La principal diferencia entre este pipeline y el anterior es que en éste, dejamos que el :class:`~ensemble.HistGradientBoostingRegressor` sepa qué características son categóricas.

source: Model comparison
es_es: Comparación de modelos

source: Finally, we evaluate the models using cross validation. Here we compare the models performance in terms of :func:`~metrics.mean_absolute_percentage_error` and fit times.
es_es: Por último, evaluamos los modelos mediante validación cruzada. Aquí comparamos el rendimiento de los modelos en términos de :func:`~metrics.mean_absolute_percentage_error` y tiempos de ajuste.

source: We see that the model with one-hot-encoded data is by far the slowest. This is to be expected, since one-hot-encoding creates one additional feature per category value (for each categorical feature), and thus more split points need to be considered during fitting. In theory, we expect the native handling of categorical features to be slightly slower than treating categories as ordered quantities ('Ordinal'), since native handling requires :ref:`sorting categories <categorical_support_gbdt>`. Fitting times should however be close when the number of categories is small, and this may not always be reflected in practice.
es_es: Vemos que el modelo con datos codificados one-hot es, con mucho, el más lento. Esto es de esperar, ya que la codificación one-hot crea una característica adicional por cada valor de categoría (para cada característica categórica), y por lo tanto hay que considerar más puntos de división durante el ajuste. En teoría, esperamos que el manejo nativo de las características categóricas sea ligeramente más lento que el tratamiento de las categorías como cantidades ordenadas ('Ordinal'), ya que el manejo nativo requiere :ref:`sorting categories <categorical_support_gbdt>`. Sin embargo, los tiempos de ajuste deberían ser cercanos cuando el número de categorías es pequeño, y esto puede no reflejarse siempre en la práctica.

source: In terms of prediction performance, dropping the categorical features leads to poorer performance. The three models that use categorical features have comparable error rates, with a slight edge for the native handling.
es_es: En cuanto al rendimiento de la predicción, la supresión de las características categóricas da lugar a un rendimiento inferior. Los tres modelos que utilizan características categóricas tienen tasas de error comparables, con una ligera ventaja para el tratamiento nativo.

source: Limitting the number of splits
es_es: Limitar el número de divisiones (splits)

source: In general, one can expect poorer predictions from one-hot-encoded data, especially when the tree depths or the number of nodes are limited: with one-hot-encoded data, one needs more split points, i.e. more depth, in order to recover an equivalent split that could be obtained in one single split point with native handling.
es_es: En general, cabe esperar predicciones más pobres a partir de los datos codificados one-hot, especialmente cuando la profundidad del árbol o el número de nodos son limitados: con los datos codificados con un solo punto, se necesitan más puntos de división, es decir, más profundidad, para recuperar una división equivalente a la que podría obtenerse en un solo punto de división con la manipulación nativa.

source: This is also true when categories are treated as ordinal quantities: if categories are `A..F` and the best split is `ACF - BDE` the one-hot-encoder model will need 3 split points (one per category in the left node), and the ordinal non-native model will need 4 splits: 1 split to isolate `A`, 1 split to isolate `F`, and 2 splits to isolate `C` from `BCDE`.
es_es: Esto también es cierto cuando las categorías se tratan como cantidades ordinales: si las categorías son `A..F` y la mejor división es `ACF - BDE`, el modelo de codificador one-hot necesitará 3 puntos de división (uno por categoría en el nodo izquierdo), y el modelo ordinal no nativo necesitará 4 divisiones: 1 división para aislar `A`, 1 división para aislar `F` y 2 divisiones para aislar `C` de `BCDE`.

source: How strongly the models' performances differ in practice will depend on the dataset and on the flexibility of the trees.
es_es: La diferencia de rendimiento de los modelos en la práctica dependerá del conjunto de datos y de la flexibilidad de los árboles.

source: To see this, let us re-run the same analysis with under-fitting models where we artificially limit the total number of splits by both limitting the number of trees and the depth of each tree.
es_es: Para ver esto, volvamos a realizar el mismo análisis con modelos de subajuste en los que limitamos artificialmente el número total de divisiones limitando tanto el número de árboles como la profundidad de cada uno de ellos.

source: The results for these under-fitting models confirm our previous intuition: the native category handling strategy performs the best when the splitting budget is constrained. The two other strategies (one-hot encoding and treating categories as ordinal values) lead to error values comparable to the baseline model that just dropped the categorical features altogether.
es_es: Los resultados de estos modelos de subajuste confirman nuestra intuición anterior: la estrategia de tratamiento de las categorías nativas es la que mejor funciona cuando el presupuesto de división es limitado. Las otras dos estrategias (codificación one-hot y tratamiento de las categorías como valores ordinales) conducen a valores de error comparables a los del modelo de referencia que simplemente elimina las características categóricas.

source: **Total running time of the script:** ( 0 minutes 16.601 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 16.601 segundos)

source: :download:`Download Python source code: plot_gradient_boosting_categorical.py <plot_gradient_boosting_categorical.py>`
es_es: :download:`Descarga el código fuente de Python: plot_gradient_boosting_categorical.py <plot_gradient_boosting_categorical.py>`

source: :download:`Download Jupyter notebook: plot_gradient_boosting_categorical.ipynb <plot_gradient_boosting_categorical.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_gradient_boosting_categorical.ipynb <plot_gradient_boosting_categorical.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
