Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_gradient_boosting_early_stopping.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_early_stopping.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_early_stopping.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Early stopping of Gradient Boosting
es_es: Parada anticipada de la Potenciación de Gradiente

source: Gradient boosting is an ensembling technique where several weak learners (regression trees) are combined to yield a powerful single model, in an iterative fashion.
es_es: El refuerzo de gradiente es una técnica de ensamblaje en la que se combinan varios algoritmos de aprendizaje débiles (árboles de regresión) para obtener un único modelo más poderoso, de forma iterativa.

source: Early stopping support in Gradient Boosting enables us to find the least number of iterations which is sufficient to build a model that generalizes well to unseen data.
es_es: El soporte de parada temprana en Potenciación de Gradiente nos permite encontrar el menor número de iteraciones que sea suficiente para construir un modelo que generalice bien a los datos no vistos.

source: The concept of early stopping is simple. We specify a ``validation_fraction`` which denotes the fraction of the whole dataset that will be kept aside from training to assess the validation loss of the model. The gradient boosting model is trained using the training set and evaluated using the validation set. When each additional stage of regression tree is added, the validation set is used to score the model. This is continued until the scores of the model in the last ``n_iter_no_change`` stages do not improve by atleast `tol`. After that the model is considered to have converged and further addition of stages is "stopped early".
es_es: El concepto de parada temprana es sencillo. Especificamos una ``validation_fraction`` que denota la fracción del conjunto de datos que se mantendrá al margen del entrenamiento para evaluar la pérdida de validación del modelo. El modelo de potenciación de gradiente se entrena utilizando el conjunto de entrenamiento y se evalúa utilizando el conjunto de validación. Cuando se añade cada etapa adicional del árbol de regresión, se utiliza el conjunto de validación para puntuar el modelo. Esto continúa hasta que las puntuaciones del modelo en las últimas etapas de ``n_iter_no_change`` no mejoren al menos en `tol`. Después de esto, se considera que el modelo ha convergido y se "detiene tempranamente" la adición de etapas.

source: The number of stages of the final model is available at the attribute ``n_estimators_``.
es_es: El número de etapas del modelo final está disponible en el atributo ``n_estimators_``.

source: This example illustrates how the early stopping can used in the :class:`~sklearn.ensemble.GradientBoostingClassifier` model to achieve almost the same accuracy as compared to a model built without early stopping using many fewer estimators. This can significantly reduce training time, memory usage and prediction latency.
es_es: Este ejemplo ilustra cómo la parada temprana puede utilizarse en el modelo :class:`~sklearn.ensemble.GradientBoostingClassifier` para lograr casi la misma precisión que un modelo construido sin parada temprana utilizando muchos menos estimadores. Esto puede reducir significativamente el tiempo de entrenamiento, el uso de memoria y la latencia de la predicción.

source: Compare scores with and without early stopping
es_es: Compara las puntuaciones con y sin parada anticipada

source: Compare fit times with and without early stopping
es_es: Compara los tiempos de ajuste con y sin parada anticipada

source: **Total running time of the script:** ( 1 minutes 2.903 seconds)
es_es: **Tiempo total de ejecución del script:** (1 minutos 2.903 segundos)

source: :download:`Download Python source code: plot_gradient_boosting_early_stopping.py <plot_gradient_boosting_early_stopping.py>`
es_es: :download:`Descargar código fuente de Python: plot_gradient_boosting_early_stopping.py <plot_gradient_boosting_early_stopping.py>`

source: :download:`Download Jupyter notebook: plot_gradient_boosting_early_stopping.ipynb <plot_gradient_boosting_early_stopping.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_gradient_boosting_early_stopping.ipynb <plot_gradient_boosting_early_stopping.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
