Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_stack_predictors.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_stack_predictors.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_stack_predictors.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Combine predictors using stacking
es_es: Combinar predictores mediante el apilamiento (stacking)

source: Stacking refers to a method to blend estimators. In this strategy, some estimators are individually fitted on some training data while a final estimator is trained using the stacked predictions of these base estimators.
es_es: El apilamiento (stacking) se refiere a un método para mezclar estimadores. En esta estrategia, algunos estimadores se ajustan individualmente a algunos datos de entrenamiento mientras que un estimador final se entrena utilizando las predicciones apiladas de estos estimadores base.

source: In this example, we illustrate the use case in which different regressors are stacked together and a final linear penalized regressor is used to output the prediction. We compare the performance of each individual regressor with the stacking strategy. Stacking slightly improves the overall performance.
es_es: En este ejemplo, ilustramos el caso de uso en el que se apilan diferentes regresores y se utiliza un regresor lineal penalizado final para realizar la predicción. Comparamos el rendimiento de cada regresor individual con la estrategia de apilamiento. El apilamiento mejora ligeramente el rendimiento general.

source: Download the dataset
es_es: Descargar conjunto de datos

source: We will use `Ames Housing`_ dataset which was first compiled by Dean De Cock and became better known after it was used in Kaggle challenge. It is a set of 1460 residential homes in Ames, Iowa, each described by 80 features. We will use it to predict the final logarithmic price of the houses. In this example we will use only 20 most interesting features chosen using GradientBoostingRegressor() and limit number of entries (here we won't go into the details on how to select the most interesting features).
es_es: Se utilizará el conjunto de datos `Ames Housing`_ que fue compilado por primera vez por Dean De Cock y que se hizo más conocido después de que se utilizara en el reto de Kaggle. Se trata de un conjunto de 1460 viviendas residenciales en Ames, Iowa, cada una descrita por 80 características. Lo utilizaremos para predecir el precio logarítmico final de las casas. En este ejemplo utilizaremos sólo las 20 características más interesantes elegidas mediante GradientBoostingRegressor() y limitaremos el número de entradas (aquí no entraremos en detalles sobre cómo seleccionar las características más interesantes).

source: The Ames housing dataset is not shipped with scikit-learn and therefore we will fetch it from `OpenML`_.
es_es: El conjunto de datos Ames Housing no se suministra con scikit-learn, por lo que lo obtendremos de `OpenML`_.

source: Make pipeline to preprocess the data
es_es: Hacer un pipeline para preprocesar los datos

source: Before we can use Ames dataset we still need to do some preprocessing. First, the dataset has many missing values. To impute them, we will exchange categorical missing values with the new category 'missing' while the numerical missing values with the 'mean' of the column. We will also encode the categories with either :class:`~sklearn.preprocessing.OneHotEncoder <sklearn.preprocessing.OneHotEncoder>` or :class:`~sklearn.preprocessing.OrdinalEncoder <sklearn.preprocessing.OrdinalEncoder>` depending for which type of model we will use them (linear or non-linear model). To facilitate this preprocessing we will make two pipelines. You can skip this section if your data is ready to use and does not need preprocessing
es_es: Antes de poder utilizar el conjunto de datos de Ames, tenemos que hacer un preprocesamiento. En primer lugar, el conjunto de datos tiene muchos valores faltantes. Para imputarlos, intercambiaremos los valores faltantes categóricos con la nueva categoría 'missing', mientras que los valores faltantes numéricos con la 'media' de la columna. También codificaremos las categorías con :class:`~sklearn.preprocessing.OneHotEncoder <sklearn.preprocessing.OneHotEncoder>` o :class:`~sklearn.preprocessing.OrdinalEncoder <sklearn.preprocessing.OrdinalEncoder>` dependiendo del tipo de modelo que vayamos a utilizar (modelo lineal o no lineal). Para facilitar este preprocesamiento haremos dos pipelines. Puedes saltarte esta sección si tus datos están listos para ser utilizados y no necesitan preprocesamiento

source: Stack of predictors on a single data set
es_es: Pila de predictores en un solo conjunto de datos

source: It is sometimes tedious to find the model which will best perform on a given dataset. Stacking provide an alternative by combining the outputs of several learners, without the need to choose a model specifically. The performance of stacking is usually close to the best model and sometimes it can outperform the prediction performance of each individual model.
es_es: A veces resulta tedioso encontrar el modelo que mejor funcione en un conjunto de datos determinado. El apilamiento ofrece una alternativa al combinar los resultados de varios aprendices, sin necesidad de elegir un modelo específico. El rendimiento del apilamiento suele acercarse al mejor modelo y a veces puede superar el rendimiento de predicción de cada modelo individual.

source: Here, we combine 3 learners (linear and non-linear) and use a ridge regressor to combine their outputs together.
es_es: Aquí combinamos 3 algoritmos de aprendizaje (lineales y no lineales) y utilizamos un regresor de cresta para combinar sus resultados.

source: Note: although we will make new pipelines with the processors which we wrote in the previous section for the 3 learners, the final estimator RidgeCV() does not need preprocessing of the data as it will be fed with the already preprocessed output from the 3 learners.
es_es: Nota: aunque haremos nuevos pipelines con los procesadores que escribimos en la sección anterior para los 3 algoritmos de aprendizaje, el estimador final RidgeCV() no necesita preprocesar los datos ya que se alimentará con la salida ya preprocesada de los 3 algoritmos.

source: Measure and plot the results
es_es: Medir y graficar los resultados

source: Now we can use Ames Housing dataset to make the predictions. We check the performance of each individual predictor as well as of the stack of the regressors.
es_es: Ahora podemos utilizar el conjunto de datos de Ames Housing para hacer las predicciones. Comprobamos el rendimiento de cada uno de los predictores individuales, así como del conjunto de los regresores.

source: The function ``plot_regression_results`` is used to plot the predicted and true targets.
es_es: La función ``plot_regression_results`` se utiliza para graficar los objetivos predichos y verdaderos.

source: The stacked regressor will combine the strengths of the different regressors. However, we also see that training the stacked regressor is much more computationally expensive.
es_es: El regresor apilado (stacked) combinará los puntos fuertes de los diferentes regresores. Sin embargo, también vemos que el entrenamiento del regresor apilado es mucho más caro computacionalmente.

source: **Total running time of the script:** ( 0 minutes 24.138 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 24.138 segundos)

source: :download:`Download Python source code: plot_stack_predictors.py <plot_stack_predictors.py>`
es_es: :download:`Descargar código fuente de Python: plot_stack_predictors.py <plot_stack_predictors.py>`

source: :download:`Download Jupyter notebook: plot_stack_predictors.ipynb <plot_stack_predictors.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_stack_predictors.ipynb <plot_stack_predictors.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
