Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_monotonic_constraints.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_monotonic_constraints.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_monotonic_constraints.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Monotonic Constraints
es_es: Restricciones monotónicas

source: This example illustrates the effect of monotonic constraints on a gradient boosting estimator.
es_es: Este ejemplo ilustra el efecto de las restricciones monótonas en un estimador de potenciación de gradiente.

source: We build an artificial dataset where the target value is in general positively correlated with the first feature (with some random and non-random variations), and in general negatively correlated with the second feature.
es_es: Construimos un conjunto de datos artificial en el que el valor objetivo está en general positivamente correlacionado con la primera característica (con algunas variaciones aleatorias y no aleatorias), y en general negativamente correlacionado con la segunda característica.

source: By imposing a positive (increasing) or negative (decreasing) constraint on the features during the learning process, the estimator is able to properly follow the general trend instead of being subject to the variations.
es_es: Al imponer una restricción positiva (creciente) o negativa (decreciente) a las características durante el proceso de aprendizaje, el estimador es capaz de seguir adecuadamente la tendencia general en lugar de estar sujeto a las variaciones.

source: This example was inspired by the `XGBoost documentation <https://xgboost.readthedocs.io/en/latest/tutorials/monotonic.html>`_.
es_es: Este ejemplo está inspirado en la documentación de `XGBoost <https://xgboost.readthedocs.io/en/latest/tutorials/monotonic.html>`_.

source: **Total running time of the script:** ( 0 minutes 4.811 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 4.811 segundos)

source: :download:`Download Python source code: plot_monotonic_constraints.py <plot_monotonic_constraints.py>`
es_es: :download:`Descargar el código fuente de Python: plot_monotonic_constraints.py <plot_monotonic_constraints.py>`

source: :download:`Download Jupyter notebook: plot_monotonic_constraints.ipynb <plot_monotonic_constraints.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_monotonic_constraints.ipynb <plot_monotonic_constraints.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
