Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_gradient_boosting_regression.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_regression.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_gradient_boosting_regression.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Gradient Boosting regression
es_es: Regresión de Potenciación de Gradiente

source: This example demonstrates Gradient Boosting to produce a predictive model from an ensemble of weak predictive models. Gradient boosting can be used for regression and classification problems. Here, we will train a model to tackle a diabetes regression task. We will obtain the results from :class:`~sklearn.ensemble.GradientBoostingRegressor` with least squares loss and 500 regression trees of depth 4.
es_es: Este ejemplo demuestra la potenciación de gradiente para producir un modelo predictivo a partir de un conjunto de modelos predictivos débiles. La potenciación de gradiente puede utilizarse para problemas de regresión y clasificación. Aquí entrenaremos un modelo para abordar una tarea de regresión de la diabetes. Obtendremos los resultados de :class:`~sklearn.ensemble.GradientBoostingRegressor` con pérdidas por mínimos cuadrados y 500 árboles de regresión de profundidad 4.

source: Note: For larger datasets (n_samples >= 10000), please refer to :class:`~sklearn.ensemble.HistGradientBoostingRegressor`.
es_es: Nota: Para conjuntos de datos más grandes (n_samples >= 10000), consulta :class:`~sklearn.ensemble.HistGradientBoostingRegressor`.

source: Load the data
es_es: Cargar los datos

source: First we need to load the data.
es_es: Primero tenemos que cargar los datos.

source: Data preprocessing
es_es: Preprocesamiento de datos

source: Next, we will split our dataset to use 90% for training and leave the rest for testing. We will also set the regression model parameters. You can play with these parameters to see how the results change.
es_es: A continuación, dividiremos nuestro conjunto de datos para utilizar el 90% para el entrenamiento y dejar el resto para las pruebas. También estableceremos los parámetros del modelo de regresión. Puedes jugar con estos parámetros para ver cómo cambian los resultados.

source: n_estimators : the number of boosting stages that will be performed. Later, we will plot deviance against boosting iterations.
es_es: n_estimadores : el número de etapas de potenciación (boosting) que se realizarán. Más adelante, graficaremos la desviación en función de las iteraciones de potenciación.

source: max_depth : limits the number of nodes in the tree. The best value depends on the interaction of the input variables.
es_es: max_depth : limita el número de nodos del árbol. El mejor valor depende de la interacción de las variables de entrada.

source: min_samples_split : the minimum number of samples required to split an internal node.
es_es: min_samples_split : el número mínimo de muestras necesarias para dividir un nodo interno.

source: learning_rate : how much the contribution of each tree will shrink.
es_es: learning_rate : cuánto se reducirá la contribución de cada árbol.

source: loss : loss function to optimize. The least squares function is used in this case however, there are many other options (see :class:`~sklearn.ensemble.GradientBoostingRegressor` ).
es_es: loss : función de pérdida a optimizar. En este caso se utiliza la función de mínimos cuadrados, sin embargo, hay muchas otras opciones (ver :class:`~sklearn.ensemble.GradientBoostingRegressor` ).

source: Fit regression model
es_es: Ajustar modelo de regresión

source: Now we will initiate the gradient boosting regressors and fit it with our training data. Let's also look and the mean squared error on the test data.
es_es: Ahora vamos a iniciar los regresores de potenciación de gradiente y a ajustarlos con nuestros datos de entrenamiento. Veamos también el error cuadrático medio en los datos de prueba.

source: Out:
es_es: Salida:

source: Plot training deviance
es_es: Graficar la desviación del entrenamiento

source: Finally, we will visualize the results. To do that we will first compute the test set deviance and then plot it against boosting iterations.
es_es: Por último, visualizaremos los resultados. Para ello, primero calcularemos la desviación del conjunto de pruebas y luego la representaremos en función de las iteraciones de la potenciación.

source: Plot feature importance
es_es: Graficar la importancia de las características

source: Careful, impurity-based feature importances can be misleading for high cardinality features (many unique values). As an alternative, the permutation importances of ``reg`` can be computed on a held out test set. See :ref:`permutation_importance` for more details.
es_es: Con cuidado, las importancias de las características basadas en las impurezas pueden ser engañosas para las características de alta cardinalidad (muchos valores únicos). Como alternativa, las importancias de permutación de ``reg`` pueden ser calculadas en un conjunto de prueba reservado. Ver :ref:`permutation_importance` para más detalles.

source: For this example, the impurity-based and permutation methods identify the same 2 strongly predictive features but not in the same order. The third most predictive feature, "bp", is also the same for the 2 methods. The remaining features are less predictive and the error bars of the permutation plot show that they overlap with 0.
es_es: En este ejemplo, los métodos basados en las impurezas y en la permutación identifican los mismos 2 rasgos fuertemente predictivos, pero no en el mismo orden. La tercera característica más predictiva, "bp", también es la misma para los 2 métodos. El resto de características son menos predictivas y las barras de error del gráfico de permutación muestran que se solapan con 0.

source: **Total running time of the script:** ( 0 minutes 2.372 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.372 segundos)

source: :download:`Download Python source code: plot_gradient_boosting_regression.py <plot_gradient_boosting_regression.py>`
es_es: :download:`Descargar el código fuente de Python: plot_gradient_boosting_regression.py <plot_gradient_boosting_regression.py>`

source: :download:`Download Jupyter notebook: plot_gradient_boosting_regression.ipynb <plot_gradient_boosting_regression.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_gradient_boosting_regression.ipynb <plot_gradient_boosting_regression.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
