Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_forest_iris.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_forest_iris.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_forest_iris.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot the decision surfaces of ensembles of trees on the iris dataset
es_es: Graficar las superficies de decisión de los ensembles de árboles en el conjunto de datos iris

source: Plot the decision surfaces of forests of randomized trees trained on pairs of features of the iris dataset.
es_es: Graficar las superficies de decisión de los bosques de árboles aleatorios entrenados en pares de características del conjunto de datos iris.

source: This plot compares the decision surfaces learned by a decision tree classifier (first column), by a random forest classifier (second column), by an extra- trees classifier (third column) and by an AdaBoost classifier (fourth column).
es_es: Este gráfico compara las superficies de decisión aprendidas por un clasificador de árbol de decisión (primera columna), por un clasificador de bosque aleatorio (segunda columna), por un clasificador de árboles extra (tercera columna) y por un clasificador AdaBoost (cuarta columna).

source: In the first row, the classifiers are built using the sepal width and the sepal length features only, on the second row using the petal length and sepal length only, and on the third row using the petal width and the petal length only.
es_es: En la primera fila, los clasificadores se construyen utilizando sólo las características de la anchura y la longitud del sépalo, en la segunda fila utilizando sólo la longitud del pétalo y la longitud del sépalo, y en la tercera fila utilizando sólo la anchura del pétalo y la longitud del pétalo.

source: In descending order of quality, when trained (outside of this example) on all 4 features using 30 estimators and scored using 10 fold cross validation, we see::
es_es: En orden descendente de calidad, cuando se entrena (fuera de este ejemplo) en las 4 características utilizando 30 estimadores y se puntúa utilizando una validación cruzada de 10 veces, vemos::

source: Increasing `max_depth` for AdaBoost lowers the standard deviation of the scores (but the average score does not improve).
es_es: El aumento de `max_depth` para AdaBoost reduce la desviación estándar de las puntuaciones (pero la puntuación media no mejora).

source: See the console's output for further details about each model.
es_es: Ver la salida de la consola para más detalles sobre cada modelo.

source: In this example you might try to:
es_es: En este ejemplo se podría intentar:

source: vary the ``max_depth`` for the ``DecisionTreeClassifier`` and ``AdaBoostClassifier``, perhaps try ``max_depth=3`` for the ``DecisionTreeClassifier`` or ``max_depth=None`` for ``AdaBoostClassifier``
es_es: variar la ``max_depth`` para el ``DecisionTreeClassifier`` y ``AdaBoostClassifier``, quizás probar ``max_depth=3`` para el ``DecisionTreeClassifier`` o ``max_depth=None`` por ``AdaBoostClassifier``

source: vary ``n_estimators``
es_es: variar ``n_estimators``

source: It is worth noting that RandomForests and ExtraTrees can be fitted in parallel on many cores as each tree is built independently of the others. AdaBoost's samples are built sequentially and so do not use multiple cores.
es_es: Cabe destacar que RandomForests y ExtraTrees pueden ajustarse en paralelo en muchos núcleos, ya que cada árbol se construye independientemente de los demás. Las muestras de AdaBoost se construyen de forma secuencial y, por tanto, no utilizan varios núcleos.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 8.865 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 8.865 segundos)

source: :download:`Download Python source code: plot_forest_iris.py <plot_forest_iris.py>`
es_es: :download:`Descargar el código fuente de Python: plot_forest_iris.py <plot_forest_iris.py>`

source: :download:`Download Jupyter notebook: plot_forest_iris.ipynb <plot_forest_iris.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_forest_iris.ipynb <plot_forest_iris.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
