Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_random_forest_embedding.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_random_forest_embedding.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_random_forest_embedding.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Hashing feature transformation using Totally Random Trees
es_es: Transformación de rasgos de hashing mediante Árboles Totalmente Aleatorios

source: RandomTreesEmbedding provides a way to map data to a very high-dimensional, sparse representation, which might be beneficial for classification. The mapping is completely unsupervised and very efficient.
es_es: RandomTreesEmbedding proporciona una forma de mapear los datos a una representación dispersa de muy alta dimensión, que podría ser beneficiosa para la clasificación. El mapeo es completamente no supervisado y muy eficiente.

source: This example visualizes the partitions given by several trees and shows how the transformation can also be used for non-linear dimensionality reduction or non-linear classification.
es_es: Este ejemplo visualiza las particiones dadas por varios árboles y muestra cómo la transformación puede utilizarse también para la reducción de la dimensionalidad no lineal o la clasificación no lineal.

source: Points that are neighboring often share the same leaf of a tree and therefore share large parts of their hashed representation. This allows to separate two concentric circles simply based on the principal components of the transformed data with truncated SVD.
es_es: Los puntos que son vecinos suelen compartir la misma hoja de un árbol y, por lo tanto, comparten gran parte de su representación hash. Esto permite separar dos círculos concéntricos simplemente basándose en los componentes principales de los datos transformados con SVD truncado.

source: In high-dimensional spaces, linear classifiers often achieve excellent accuracy. For sparse binary data, BernoulliNB is particularly well-suited. The bottom row compares the decision boundary obtained by BernoulliNB in the transformed space with an ExtraTreesClassifier forests learned on the original data.
es_es: En espacios de gran dimensión, los clasificadores lineales suelen alcanzar una precisión excelente. Para los datos binarios dispersos, BernoulliNB es especialmente adecuado. La fila inferior compara la frontera de decisión obtenido por BernoulliNB en el espacio transformado con un bosque ExtraTreesClassifier aprendido en los datos originales.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 0 minutes 0.794 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.794 segundos)

source: :download:`Download Python source code: plot_random_forest_embedding.py <plot_random_forest_embedding.py>`
es_es: :download:`Descargar el código fuente de Python: plot_random_forest_embedding.py <plot_random_forest_embedding.py>`

source: :download:`Download Jupyter notebook: plot_random_forest_embedding.ipynb <plot_random_forest_embedding.ipynb>`
es_es: :download:`Descargar el Cuaderno de Jupyter: plot_random_forest_embedding.ipynb <plot_random_forest_embedding.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
