Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/ensemble/plot_voting_regressor.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_ensemble_plot_voting_regressor.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_ensemble_plot_voting_regressor.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot individual and voting regression predictions
es_es: Graficar las predicciones de la regresión individual y de la votación

source: A voting regressor is an ensemble meta-estimator that fits several base regressors, each on the whole dataset. Then it averages the individual predictions to form a final prediction. We will use three different regressors to predict the data: :class:`~ensemble.GradientBoostingRegressor`, :class:`~ensemble.RandomForestRegressor`, and :class:`~linear_model.LinearRegression`). Then the above 3 regressors will be used for the :class:`~ensemble.VotingRegressor`.
es_es: Un regresor de votación es un meta-estimador de conjunto (ensemble) que ajusta varios regresores de base, cada uno de ellos en todo el conjunto de datos. A continuación, promedia las predicciones individuales para formar una predicción final. Utilizaremos tres regresores diferentes para predecir los datos: :class:`~ensemble.GradientBoostingRegressor`, :class:`~ensemble.RandomForestRegressor`, y :class:`~linear_model.LinearRegression`). A continuación, se utilizarán los tres regresores anteriores para la clase :class:`~ensemble.VotingRegressor`.

source: Finally, we will plot the predictions made by all models for comparison.
es_es: Por último, graficaremos las predicciones realizadas por todos los modelos para compararlas.

source: We will work with the diabetes dataset which consists of 10 features collected from a cohort of diabetes patients. The target is a quantitative measure of disease progression one year after baseline.
es_es: Trabajaremos con el conjunto de datos de la diabetes, que consta de 10 características recogidas de una cohorte de pacientes diabéticos. El objetivo es una medida cuantitativa de la progresión de la enfermedad un año después de la línea de base.

source: Training classifiers
es_es: Clasificadores de entrenamiento

source: First, we will load the diabetes dataset and initiate a gradient boosting regressor, a random forest regressor and a linear regression. Next, we will use the 3 regressors to build the voting regressor:
es_es: En primer lugar, cargaremos el conjunto de datos de la diabetes e iniciaremos un regresor de potenciación de gradiente, un regresor de bosque aleatorio y una regresión lineal. A continuación, utilizaremos los 3 regresores para construir el regresor de votación:

source: Making predictions
es_es: Haciendo predicciones

source: Now we will use each of the regressors to make the 20 first predictions.
es_es: Ahora utilizaremos cada uno de los regresores para hacer las 20 primeras predicciones.

source: Plot the results
es_es: Graficar los resultados

source: Finally, we will visualize the 20 predictions. The red stars show the average prediction made by :class:`~ensemble.VotingRegressor`.
es_es: Por último, visualizaremos las 20 predicciones. Las estrellas rojas muestran la predicción media realizada por :class:`~ensemble.VotingRegressor`.

source: **Total running time of the script:** ( 0 minutes 0.876 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.876 segundos)

source: :download:`Download Python source code: plot_voting_regressor.py <plot_voting_regressor.py>`
es_es: :download:`Descargar el código fuente de Python: plot_voting_regressor.py <plot_voting_regressor.py>`

source: :download:`Download Jupyter notebook: plot_voting_regressor.ipynb <plot_voting_regressor.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_voting_regressor.ipynb <plot_voting_regressor.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
