Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_multi_metric_evaluation.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_multi_metric_evaluation.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_multi_metric_evaluation.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Demonstration of multi-metric evaluation on cross_val_score and GridSearchCV
es_es: Demostración de la evaluación multimétrica en cross_val_score y GridSearchCV

source: Multiple metric parameter search can be done by setting the ``scoring`` parameter to a list of metric scorer names or a dict mapping the scorer names to the scorer callables.
es_es: La búsqueda de parámetros para múltiples métricas puede realizarse estableciendo el parámetro ``scoring`` en una lista(list) de nombres de puntuadores de métricas o en un diccionario(dict) que mapee los nombres de los puntuadores a las llamadas de los puntuadores.

source: The scores of all the scorers are available in the ``cv_results_`` dict at keys ending in ``'_<scorer_name>'`` (``'mean_test_precision'``, ``'rank_test_precision'``, etc...)
es_es: Las puntuaciones de todos los puntuadores están disponibles en el diccionario ``cv_results_`` en las claves que terminan en ``'_<scorer_name>'`` (``'mean_test_precision'``, ``'rank_test_precision'``, etc...)

source: The ``best_estimator_``, ``best_index_``, ``best_score_`` and ``best_params_`` correspond to the scorer (key) that is set to the ``refit`` attribute.
es_es: Los ``best_estimator_``, ``best_index_``, ``best_score_`` y ``best_params_`` corresponden al puntuador (clave) que se establece en el atributo ``refit``.

source: Running ``GridSearchCV`` using multiple evaluation metrics
es_es: Ejecutando ``GridSearchCV`` utilizando múltiples métricas de evaluación

source: Plotting the result
es_es: Graficando el resultado

source: **Total running time of the script:** ( 0 minutes 29.546 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 29.546 segundos)

source: :download:`Download Python source code: plot_multi_metric_evaluation.py <plot_multi_metric_evaluation.py>`
es_es: :download:`Descargar código fuente de Python: plot_multi_metric_evaluation.py <plot_multi_metric_evaluation.py>`

source: :download:`Download Jupyter notebook: plot_multi_metric_evaluation.ipynb <plot_multi_metric_evaluation.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_multi_metric_evaluation.ipynb <plot_multi_metric_evaluation.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
