Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_successive_halving_heatmap.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_successive_halving_heatmap.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_successive_halving_heatmap.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparison between grid search and successive halving
es_es: Comparación entre la búsqueda en cuadrícula y la reducción sucesiva a la mitad

source: This example compares the parameter search performed by :class:`~sklearn.model_selection.HalvingGridSearchCV` and :class:`~sklearn.model_selection.GridSearchCV`.
es_es: Este ejemplo compara la búsqueda de parámetros realizada por :class:`~sklearn.model_selection.HalvingGridSearchCV` y :class:`~sklearn.model_selection.GridSearchCV`.

source: We first define the parameter space for an :class:`~sklearn.svm.SVC` estimator, and compute the time required to train a :class:`~sklearn.model_selection.HalvingGridSearchCV` instance, as well as a :class:`~sklearn.model_selection.GridSearchCV` instance.
es_es: Primero definimos el espacio de parámetros para un estimador :class:`~sklearn.svm.SVC`, y calculamos el tiempo necesario para entrenar una instancia :class:`~sklearn.model_selection.HalvingGridSearchCV`, así como una instancia :class:`~sklearn.model_selection.GridSearchCV`.

source: We now plot heatmaps for both search estimators.
es_es: A continuación, graficamos los mapas de calor para ambos estimadores de búsqueda.

source: The heatmaps show the mean test score of the parameter combinations for an :class:`~sklearn.svm.SVC` instance. The :class:`~sklearn.model_selection.HalvingGridSearchCV` also shows the iteration at which the combinations where last used. The combinations marked as ``0`` were only evaluated at the first iteration, while the ones with ``5`` are the parameter combinations that are considered the best ones.
es_es: Los mapas de calor muestran la puntuación media de prueba de las combinaciones de parámetros para una instancia :class:`~sklearn.svm.SVC`. La :class:`~sklearn.model_selection.HalvingGridSearchCV` también muestra la iteración en la que las combinaciones fueron utilizadas por última vez. Las combinaciones marcadas como ``0`` sólo se evaluaron en la primera iteración, mientras que las que tienen ``5`` son las combinaciones de parámetros que se consideran las mejores.

source: We can see that the :class:`~sklearn.model_selection.HalvingGridSearchCV` class is able to find parameter combinations that are just as accurate as :class:`~sklearn.model_selection.GridSearchCV`, in much less time.
es_es: Podemos ver que la clase :class:`~sklearn.model_selection.HalvingGridSearchCV` es capaz de encontrar combinaciones de parámetros tan precisas como :class:`~sklearn.model_selection.GridSearchCV`, en mucho menos tiempo.

source: **Total running time of the script:** ( 0 minutes 9.307 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 9.307 segundos)

source: :download:`Download Python source code: plot_successive_halving_heatmap.py <plot_successive_halving_heatmap.py>`
es_es: :download:`Descargar código fuente de Python: plot_successive_halving_heatmap.py <plot_successive_halving_heatmap.py>`

source: :download:`Download Jupyter notebook: plot_successive_halving_heatmap.ipynb <plot_successive_halving_heatmap.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_successive_halving_heatmap.ipynb <plot_successive_halving_heatmap.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
