Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_grid_search_stats.po
Languages: es_es

source: We can carry out our pairwise comparisons the same way as in the first section:
es_es: Podemos realizar nuestras comparaciones por pares de la misma manera que en la primera sección:

source: Using the Bayesian approach we can compute the probability that a model performs better, worse or practically equivalent to another.
es_es: Utilizando el enfoque bayesiano podemos calcular la probabilidad de que un modelo tenga un rendimiento mejor, peor o prácticamente equivalente a otro.

source: Results show that the model ranked first by :class:`~sklearn.model_selection.GridSearchCV` `'rbf'`, has approximately a 6.8% chance of being worse than `'linear'`, and a 1.8% chance of being worse than `'3_poly'`. `'rbf'` and `'linear'` have a 43% probability of being practically equivalent, while `'rbf'` and `'3_poly'` have a 10% chance of being so.
es_es: Los resultados muestran que el modelo clasificado en primer lugar por :class:`~sklearn.model_selection.GridSearchCV` `'rbf'`, tiene aproximadamente un 6.8% de incertidumbre (chance) de ser peor que `'linear'`, y un 1.8% de incertidumbre de ser peor que `'3_poly'`. `'rbf'` y `'linear'` tienen un 43% de probabilidad de ser prácticamente equivalentes, mientras que `'rbf'` y `'3_poly'` tienen un 10% de probabilidad de serlo.

source: Similarly to the conclusions obtained using the frequentist approach, all models have a 100% probability of being better than `'2_poly'`, and none have a practically equivalent performance with the latter.
es_es: Al igual que las conclusiones obtenidas con el enfoque frecuentista, todos los modelos tienen una probabilidad del 100% de ser mejores que `'2_poly'`, y ninguno tiene un rendimiento prácticamente equivalente con este último.

source: Take-home messages
es_es: Mensajes para llevar a casa

source: Small differences in performance measures might easily turn out to be merely by chance, but not because one model predicts systematically better than the other. As shown in this example, statistics can tell you how likely that is.
es_es: Las pequeñas diferencias en las medidas de rendimiento pueden resultar fácilmente ser mera casualidad, pero no porque un modelo prediga sistemáticamente mejor que el otro. Como se muestra en este ejemplo, las estadísticas pueden indicar la probabilidad de que eso ocurra.

source: When statistically comparing the performance of two models evaluated in GridSearchCV, it is necessary to correct the calculated variance which could be underestimated since the scores of the models are not independent from each other.
es_es: Al comparar estadísticamente el rendimiento de dos modelos evaluados en GridSearchCV, es necesario corregir la varianza calculada, que podría estar subestimada, ya que las puntuaciones de los modelos no son independientes entre sí.

source: A frequentist approach that uses a (variance-corrected) paired t-test can tell us if the performance of one model is better than another with a degree of certainty above chance.
es_es: Un enfoque frecuentista que utiliza una prueba t pareada (con corrección de la varianza) puede decirnos si el rendimiento de un modelo es mejor que el de otro con un grado de certeza superior al del azar.

source: A Bayesian approach can provide the probabilities of one model being better, worse or practically equivalent than another. It can also tell us how confident we are of knowing that the true differences of our models fall under a certain range of values.
es_es: Un enfoque bayesiano puede proporcionar las probabilidades de que un modelo sea mejor, peor o prácticamente equivalente a otro. También puede indicarnos el grado de confianza que tenemos para saber que las verdaderas diferencias de nuestros modelos se encuentran bajo un determinado rango de valores.

source: If multiple models are statistically compared, a multiple comparisons correction is needed when using the frequentist approach.
es_es: Si se comparan estadísticamente múltiples modelos, se necesita una corrección de comparaciones múltiples cuando se utiliza el enfoque frecuentista.

source: Nadeau, C., & Bengio, Y. (2000). `Inference for the generalization error <https://papers.nips.cc/paper/1661-inference-for-the-generalization-error.pdf>`_. In Advances in neural information processing systems.
es_es: Nadeau, C., y Bengio, Y. (2000). `Inference for the generalization error <https://papers.nips.cc/paper/1661-inference-for-the-generalization-error.pdf>`_. In Advances in neural information processing systems.

source: Bouckaert, R. R., & Frank, E. (2004). `Evaluating the replicability of significance tests for comparing learning algorithms <https://www.cms.waikato.ac.nz/~ml/publications/2004/bouckaert-frank.pdf>`_. In Pacific-Asia Conference on Knowledge Discovery and Data Mining.
es_es: Bouckaert, R. R., y Frank, E. (2004). `Evaluating the replicability of significance tests for comparing learning algorithms <https://www.cms.waikato.ac.nz/~ml/publications/2004/bouckaert-frank.pdf>`_. In Pacific-Asia Conference on Knowledge Discovery and Data Mining.

source: Benavoli, A., Corani, G., Demšar, J., & Zaffalon, M. (2017). `Time for a change: a tutorial for comparing multiple classifiers through Bayesian analysis <http://www.jmlr.org/papers/volume18/16-305/16-305.pdf>`_. The Journal of Machine Learning Research, 18(1). See the Python library that accompanies this paper `here <https://github.com/janezd/baycomp>`_.
es_es: Benavoli, A., Corani, G., Demšar, J., y Zaffalon, M. (2017). `Time for a change: a tutorial for comparing multiple classifiers through Bayesian analysis <http://www.jmlr.org/papers/volume18/16-305/16-305.pdf>`_. The Journal of Machine Learning Research, 18(1). Consulta la biblioteca de Python que acompaña a este documento `aquí <https://github.com/janezd/baycomp>`_.

source: Diebold, F.X. & Mariano R.S. (1995). `Comparing predictive accuracy <http://www.est.uc3m.es/esp/nueva_docencia/comp_col_get/lade/tecnicas_prediccion/Practicas0708/Comparing%20Predictive%20Accuracy%20(Dielbold).pdf>`_ Journal of Business & economic statistics, 20(1), 134-144.
es_es: Diebold, F.X. y Mariano R.S. (1995). `Comparing predictive accuracy <http://www.est.uc3m.es/esp/nueva_docencia/comp_col_get/lade/tecnicas_prediccion/Practicas0708/Comparing%20Predictive%20Accuracy%20(Dielbold).pdf>`_ Journal of Business & economic statistics, 20(1), 134-144.

source: **Total running time of the script:** ( 0 minutes 1.736 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.736 segundos)

source: :download:`Download Python source code: plot_grid_search_stats.py <plot_grid_search_stats.py>`
es_es: :download:`Descargar código fuente de Python: plot_grid_search_stats.py <plot_grid_search_stats.py>`

source: :download:`Download Jupyter notebook: plot_grid_search_stats.ipynb <plot_grid_search_stats.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_grid_search_stats.ipynb <plot_grid_search_stats.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
