Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_precision_recall.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_precision_recall.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_precision_recall.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Precision-Recall
es_es: Precisión-Exhaustividad

source: Example of Precision-Recall metric to evaluate classifier output quality.
es_es: Ejemplo de la métrica Precisión-Exhaustividad(Precision-recall) para evaluar la calidad del resultado del clasificador.

source: Precision-Recall is a useful measure of success of prediction when the classes are very imbalanced. In information retrieval, precision is a measure of result relevancy, while recall is a measure of how many truly relevant results are returned.
es_es: La precisión-exhaustividad es una medida útil del éxito de la predicción cuando las clases están muy desequilibradas. En la recuperación de información, la precisión es una medida de la relevancia de los resultados, mientras que la exhaustibidad es una medida de cuántos resultados realmente relevantes se devuelven.

source: The precision-recall curve shows the tradeoff between precision and recall for different threshold. A high area under the curve represents both high recall and high precision, where high precision relates to a low false positive rate, and high recall relates to a low false negative rate. High scores for both show that the classifier is returning accurate results (high precision), as well as returning a majority of all positive results (high recall).
es_es: La curva de precisión-exhaustividad muestra el equilibrio entre la precisión y la exhaustividad para diferentes umbrales. Un área alta bajo la curva representa tanto una alta exhaustividad como una alta precisión, donde una alta precisión se relaciona con una baja tasa de falsos positivos, y una alta exhaustividad se relaciona con una baja tasa de falsos negativos. Unas puntuaciones altas en ambos casos indican que el clasificador está devolviendo resultados exactos (alta precisión), además de devolver la mayoría de los resultados positivos (alta exhaustividad).

source: A system with high recall but low precision returns many results, but most of its predicted labels are incorrect when compared to the training labels. A system with high precision but low recall is just the opposite, returning very few results, but most of its predicted labels are correct when compared to the training labels. An ideal system with high precision and high recall will return many results, with all results labeled correctly.
es_es: Un sistema con un alto grado de exhaustividad pero una baja precisión devuelve muchos resultados, pero la mayoría de sus etiquetas predichas son incorrectas cuando se comparan con las etiquetas de entrenamiento. Un sistema con alta precisión pero baja exhaustividad es justo lo contrario, ya que devuelve muy pocos resultados, pero la mayoría de sus etiquetas predichas son correctas cuando se comparan con las etiquetas de entrenamiento. Un sistema ideal con alta precisión y alta exhaustividad devolverá muchos resultados, con todos los resultados etiquetados correctamente.

source: Precision (:math:`P`) is defined as the number of true positives (:math:`T_p`) over the number of true positives plus the number of false positives (:math:`F_p`).
es_es: La precisión (:math:`P`) se define como el número de verdaderos positivos (:math:`T_p`) sobre el número de verdaderos positivos más el número de falsos positivos (:math:`F_p`).

source: Recall (:math:`R`) is defined as the number of true positives (:math:`T_p`) over the number of true positives plus the number of false negatives (:math:`F_n`).
es_es: La exhaustividad (:math:`R`) se define como el número de verdaderos positivos (:math:`T_p`) sobre el número de verdaderos positivos más el número de falsos negativos (:math:`F_n`).

source: These quantities are also related to the (:math:`F_1`) score, which is defined as the harmonic mean of precision and recall.
es_es: Estas cantidades también están relacionadas con la puntuación (:math:`F_1`), que se define como la media armónica de la precisión y la exhaustividad.

source: Note that the precision may not decrease with recall. The definition of precision (:math:`\frac{T_p}{T_p + F_p}`) shows that lowering the threshold of a classifier may increase the denominator, by increasing the number of results returned. If the threshold was previously set too high, the new results may all be true positives, which will increase precision. If the previous threshold was about right or too low, further lowering the threshold will introduce false positives, decreasing precision.
es_es: Ten en cuenta que la precisión puede no disminuir con la exhaustividad. La definición de precisión (:math:`\frac{T_p}{T_p + F_p}`) muestra que la reducción del umbral de un clasificador puede aumentar el denominador, al aumentar el número de resultados devueltos. Si el umbral era demasiado alto, los nuevos resultados pueden ser todos verdaderos positivos, lo que aumentará la precisión. Si el umbral anterior era más o menos correcto o demasiado bajo, si se sigue bajando el umbral se introducirán falsos positivos, lo que disminuirá la precisión.

source: Recall is defined as :math:`\frac{T_p}{T_p+F_n}`, where :math:`T_p+F_n` does not depend on the classifier threshold. This means that lowering the classifier threshold may increase recall, by increasing the number of true positive results. It is also possible that lowering the threshold may leave recall unchanged, while the precision fluctuates.
es_es: La exhaustividad se define como :math:`frac{T_p}{T_p+F_n}`, donde :math:`T_p+F_n` no depende del umbral del clasificador. Esto significa que reducir el umbral del clasificador puede aumentar la recuperación, al aumentar el número de resultados verdaderos positivos. También es posible que la reducción del umbral deje la exhaustividad sin cambios, mientras que la precisión fluctúa.

source: The relationship between recall and precision can be observed in the stairstep area of the plot - at the edges of these steps a small change in the threshold considerably reduces precision, with only a minor gain in recall.
es_es: La relación entre la exhaustividad y la precisión puede observarse en la zona de los escalones del gráfico: en los bordes de estos escalones, un pequeño cambio en el umbral reduce considerablemente la precisión, con sólo una pequeña ganancia en la exhaustividad.

source: **Average precision** (AP) summarizes such a plot as the weighted mean of precisions achieved at each threshold, with the increase in recall from the previous threshold used as the weight:
es_es: **La precisión media** (Average precision, AP) resume dicho gráfico como la media ponderada de las precisiones alcanzadas en cada umbral, utilizando como ponderación el aumento de la exhaustividad desde el umbral anterior:

source: where :math:`P_n` and :math:`R_n` are the precision and recall at the nth threshold. A pair :math:`(R_k, P_k)` is referred to as an *operating point*.
es_es: donde :math:`P_n` y :math:`R_n` son la precisión y la exhaustividad en el enésimo umbral. Un par :math:`(R_k, P_k)` se denomina *punto de operación*.

source: AP and the trapezoidal area under the operating points (:func:`sklearn.metrics.auc`) are common ways to summarize a precision-recall curve that lead to different results. Read more in the :ref:`User Guide <precision_recall_f_measure_metrics>`.
es_es: AP y el área trapezoidal bajo los puntos de operación (:func:`sklearn.metrics.auc`) son formas comunes de resumir una curva de precisión-exhaustividad que conducen a diferentes resultados. Lee más en el :ref:`Manual del usuario <precision_recall_f_measure_metrics>`.

source: Precision-recall curves are typically used in binary classification to study the output of a classifier. In order to extend the precision-recall curve and average precision to multi-class or multi-label classification, it is necessary to binarize the output. One curve can be drawn per label, but one can also draw a precision-recall curve by considering each element of the label indicator matrix as a binary prediction (micro-averaging).
es_es: Las curvas de precisión-exhaustividad se utilizan normalmente en la clasificación binaria para estudiar el resultado de un clasificador. Para ampliar la curva de precisión-exhaustividad y la precisión media a la clasificación multiclase o multietiqueta, es necesario binarizar el resultado. Se puede dibujar una curva por etiqueta, pero también se puede dibujar una curva de precisión-exhaustividad considerando cada elemento de la matriz de indicatriz de etiquetas como una predicción binaria (micropromedio).

source: See also :func:`sklearn.metrics.average_precision_score`,
es_es: Ver también :func:`sklearn.metrics.average_precision_score`,

source: In binary classification settings
es_es: En configuraciones de clasificación binaria

source: Create simple data
es_es: Crea datos simples

source: Try to differentiate the two first classes of the iris data
es_es: Intenta diferenciar las dos primeras clases de los datos iris

source: Compute the average precision score
es_es: Calcula la puntuación media de precisión

source: Plot the Precision-Recall curve
es_es: Grafica la curva de Precisión-Exhaustividad

source: In multi-label settings
es_es: En configuraciones multietiqueta

source: Create multi-label data, fit, and predict
es_es: Crea datos multietiqueta, ajusta y predice

source: We create a multi-label dataset, to illustrate the precision-recall in multi-label settings
es_es: Creamos un conjunto de datos multietiqueta, para ilustrar la precisión-exhaustividad en configuraciones multietiqueta

source: The average precision score in multi-label settings
es_es: La puntuación media de la precisión en configuraciones multietiqueta

source: Plot the micro-averaged Precision-Recall curve
es_es: Grafica la curva de precisión-exhaustividad micropromediada

source: Plot Precision-Recall curve for each class and iso-f1 curves
es_es: Grafica la curva de Precisión-Exhaustividad para cada clase y las curvas iso-f1

source: **Total running time of the script:** ( 0 minutes 0.596 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.596 segundos)

source: :download:`Download Python source code: plot_precision_recall.py <plot_precision_recall.py>`
es_es: :download:`Descargar código fuente de Python: plot_precision_recall.py <plot_precision_recall.py>`

source: :download:`Download Jupyter notebook: plot_precision_recall.ipynb <plot_precision_recall.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_precision_recall.ipynb <plot_precision_recall.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
