Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_nested_cross_validation_iris.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_nested_cross_validation_iris.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_nested_cross_validation_iris.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Nested versus non-nested cross-validation
es_es: Validación cruzada anidada y no anidada

source: This example compares non-nested and nested cross-validation strategies on a classifier of the iris data set. Nested cross-validation (CV) is often used to train a model in which hyperparameters also need to be optimized. Nested CV estimates the generalization error of the underlying model and its (hyper)parameter search. Choosing the parameters that maximize non-nested CV biases the model to the dataset, yielding an overly-optimistic score.
es_es: Este ejemplo compara las estrategias de validación cruzada anidada y no anidada en un clasificador del conjunto de datos iris. La validación cruzada anidada (CV) se utiliza a menudo para entrenar un modelo en el que también hay que optimizar los hiperparámetros. La CV anidada estima el error de generalización del modelo subyacente y su búsqueda de (hiper)parámetros. La elección de los parámetros que maximizan la CV no anidada sesga el modelo hacia el conjunto de datos, lo que produce una puntuación demasiado optimista.

source: Model selection without nested CV uses the same data to tune model parameters and evaluate model performance. Information may thus "leak" into the model and overfit the data. The magnitude of this effect is primarily dependent on the size of the dataset and the stability of the model. See Cawley and Talbot [1]_ for an analysis of these issues.
es_es: La selección de modelos sin CV anidada utiliza los mismos datos para ajustar los parámetros del modelo y evaluar su rendimiento. Así, la información puede "filtrarse" en el modelo y sobreajustar los datos. La magnitud de este efecto depende principalmente del tamaño del conjunto de datos y de la estabilidad del modelo. Ver Cawley y Talbot [1]_ para un análisis de estas incidencias.

source: To avoid this problem, nested CV effectively uses a series of train/validation/test set splits. In the inner loop (here executed by :class:`GridSearchCV <sklearn.model_selection.GridSearchCV>`), the score is approximately maximized by fitting a model to each training set, and then directly maximized in selecting (hyper)parameters over the validation set. In the outer loop (here in :func:`cross_val_score <sklearn.model_selection.cross_val_score>`), generalization error is estimated by averaging test set scores over several dataset splits.
es_es: Para evitar este problema, la CV anidada utiliza efectivamente una serie de divisiones de conjuntos de entrenamiento/validación/prueba. En el bucle interno (aquí ejecutado por :class:`GridSearchCV <sklearn.model_selection.GridSearchCV>`), la puntuación se maximiza aproximadamente ajustando un modelo a cada conjunto de entrenamiento, y luego se maximiza directamente en la selección de (hiper)parámetros sobre el conjunto de validación. En el bucle externo (aquí en :func:`cross_val_score <sklearn.model_selection.cross_val_score>`), el error de generalización se estima promediando las puntuaciones de los conjuntos de prueba en varias divisiones de conjuntos de datos.

source: The example below uses a support vector classifier with a non-linear kernel to build a model with optimized hyperparameters by grid search. We compare the performance of non-nested and nested CV strategies by taking the difference between their scores.
es_es: El siguiente ejemplo utiliza un clasificador de vectores de soporte con un kernel no lineal para construir un modelo con hiperparámetros optimizados mediante la búsqueda en cuadrícula. Comparamos el rendimiento de las estrategias de CV no anidada y anidada tomando la diferencia entre sus puntuaciones.

source: **Total running time of the script:** ( 0 minutes 9.320 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 9.320 segundos)

source: :download:`Download Python source code: plot_nested_cross_validation_iris.py <plot_nested_cross_validation_iris.py>`
es_es: :download:`Descargar código fuente de Python: plot_nested_cross_validation_iris.py <plot_nested_cross_validation_iris.py>`

source: :download:`Download Jupyter notebook: plot_nested_cross_validation_iris.ipynb <plot_nested_cross_validation_iris.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_nested_cross_validation_iris.ipynb <plot_nested_cross_validation_iris.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
