Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_roc.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_roc.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_roc.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Receiver Operating Characteristic (ROC)
es_es: Característica operativa del receptor (ROC)

source: Example of Receiver Operating Characteristic (ROC) metric to evaluate classifier output quality.
es_es: Ejemplo de la métrica Característica operativa del receptor (ROC, Receiver Operating Characteristic) para evaluar la calidad de los resultados del clasificador.

source: ROC curves typically feature true positive rate on the Y axis, and false positive rate on the X axis. This means that the top left corner of the plot is the "ideal" point - a false positive rate of zero, and a true positive rate of one. This is not very realistic, but it does mean that a larger area under the curve (AUC) is usually better.
es_es: Las curvas ROC suelen presentar la tasa de verdaderos positivos en el eje Y y la tasa de falsos positivos en el eje X. Esto significa que la esquina superior izquierda del gráfico es el punto "ideal" - una tasa de falsos positivos de cero y una tasa de verdaderos positivos de uno-. Esto no es muy realista, pero significa que un área bajo la curva (AUC) mayor suele ser mejor.

source: The "steepness" of ROC curves is also important, since it is ideal to maximize the true positive rate while minimizing the false positive rate.
es_es: La "inclinación(steepness)" de las curvas ROC también es importante, ya que lo ideal es maximizar la tasa de verdaderos positivos y minimizar la tasa de falsos positivos.

source: ROC curves are typically used in binary classification to study the output of a classifier. In order to extend ROC curve and ROC area to multi-label classification, it is necessary to binarize the output. One ROC curve can be drawn per label, but one can also draw a ROC curve by considering each element of the label indicator matrix as a binary prediction (micro-averaging).
es_es: Las curvas ROC se utilizan normalmente en la clasificación binaria para estudiar el resultado de un clasificador. Para ampliar la curva ROC y el área ROC a la clasificación multietiqueta, es necesario binarizar la salida. Se puede dibujar una curva ROC por etiqueta, pero también se puede dibujar una curva ROC considerando cada elemento de la matriz indicatriz de etiquetas como una predicción binaria (micropromedio).

source: Another evaluation measure for multi-label classification is macro-averaging, which gives equal weight to the classification of each label.
es_es: Otra medida de evaluación para la clasificación multietiqueta es el macropromedio, que da la misma ponderación a la clasificación de cada etiqueta.

source: See also :func:`sklearn.metrics.roc_auc_score`,
es_es: Ver también :func:`sklearn.metrics.roc_auc_score`,

source: Plot of a ROC curve for a specific class
es_es: Gráfico de una curva ROC para una clase específica

source: Plot ROC curves for the multilabel problem
es_es: Grafica curvas ROC para el problema multietiqueta

source: Compute macro-average ROC curve and ROC area
es_es: Calcula la curva ROC macropromedio y el área ROC

source: Area under ROC for the multiclass problem
es_es: Área bajo la curva ROC para el problema multiclase

source: The :func:`sklearn.metrics.roc_auc_score` function can be used for multi-class classification. The multi-class One-vs-One scheme compares every unique pairwise combination of classes. In this section, we calculate the AUC using the OvR and OvO schemes. We report a macro average, and a prevalence-weighted average.
es_es: La función :func:`sklearn.metrics.roc_auc_score` puede utilizarse para la clasificación multiclase. El esquema multiclase Uno vs Uno(One-vs-One) compara cada combinación única de clases por pares. En esta sección, calculamos el AUC utilizando los esquemas OvR y OvO. Reportamos un macropromedio y un promedio ponderado por prevalencia.

source: **Total running time of the script:** ( 0 minutes 0.311 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.311 segundos)

source: :download:`Download Python source code: plot_roc.py <plot_roc.py>`
es_es: :download:`Descargar código fuente de Python: plot_roc.py <plot_roc.py>`

source: :download:`Download Jupyter notebook: plot_roc.ipynb <plot_roc.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_roc.ipynb <plot_roc.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
