Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_successive_halving_iterations.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_successive_halving_iterations.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_successive_halving_iterations.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Successive Halving Iterations
es_es: Iteraciones sucesivas a la mitad

source: This example illustrates how a successive halving search (:class:`~sklearn.model_selection.HalvingGridSearchCV` and :class:`~sklearn.model_selection.HalvingRandomSearchCV`) iteratively chooses the best parameter combination out of multiple candidates.
es_es: Este ejemplo ilustra cómo una búsqueda sucesiva a la mitad (:class:`~sklearn.model_selection.HalvingGridSearchCV` y :class:`~sklearn.model_selection.HalvingRandomSearchCV`) elige iterativamente la mejor combinación de parámetros entre múltiples candidatos.

source: We first define the parameter space and train a :class:`~sklearn.model_selection.HalvingRandomSearchCV` instance.
es_es: Primero definimos el espacio de parámetros y entrenamos una instancia :class:`~sklearn.model_selection.HalvingRandomSearchCV`.

source: We can now use the `cv_results_` attribute of the search estimator to inspect and plot the evolution of the search.
es_es: Ahora podemos utilizar el atributo `cv_results_` del estimador de búsqueda para inspeccionar y graficar la evolución de la búsqueda.

source: Number of candidates and amount of resource at each iteration
es_es: Número de candidatos y cantidad de recursos en cada iteración

source: At the first iteration, a small amount of resources is used. The resource here is the number of samples that the estimators are trained on. All candidates are evaluated.
es_es: En la primera iteración, se utiliza una pequeña cantidad de recursos. El recurso aquí es el número de muestras con las que se entrenan los estimadores. Se evalúan todos los candidatos.

source: At the second iteration, only the best half of the candidates is evaluated. The number of allocated resources is doubled: candidates are evaluated on twice as many samples.
es_es: En la segunda iteración, sólo se evalúa la mejor mitad de los candidatos. El número de recursos asignados se duplica: los candidatos se evalúan en el doble de muestras.

source: This process is repeated until the last iteration, where only 2 candidates are left. The best candidate is the candidate that has the best score at the last iteration.
es_es: Este proceso se repite hasta la última iteración, en la que sólo quedan 2 candidatos. El mejor candidato es el que tiene la mejor puntuación en la última iteración.

source: **Total running time of the script:** ( 0 minutes 9.623 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 9.623 segundos)

source: :download:`Download Python source code: plot_successive_halving_iterations.py <plot_successive_halving_iterations.py>`
es_es: :download:`Descargar código fuente de Python: plot_successive_halving_iterations.py <plot_successive_halving_iterations.py>`

source: :download:`Download Jupyter notebook: plot_successive_halving_iterations.ipynb <plot_successive_halving_iterations.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_successive_halving_iterations.ipynb <plot_successive_halving_iterations.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
