Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_randomized_search.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_randomized_search.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_randomized_search.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparing randomized search and grid search for hyperparameter estimation
es_es: Comparando la búsqueda aleatorizada y la búsqueda en cuadrícula para la estimación de hiperparámetros

source: Compare randomized search and grid search for optimizing hyperparameters of a linear SVM with SGD training. All parameters that influence the learning are searched simultaneously (except for the number of estimators, which poses a time / quality tradeoff).
es_es: Compara la búsqueda aleatorizada y la búsqueda en cuadrícula para optimizar los hiperparámetros de una SVM lineal con entrenamiento SGD. Todos los parámetros que influyen en el aprendizaje se buscan simultáneamente (excepto el número de estimadores, que plantea una compensación de tiempo/calidad).

source: The randomized search and the grid search explore exactly the same space of parameters. The result in parameter settings is quite similar, while the run time for randomized search is drastically lower.
es_es: La búsqueda aleatorizada y la búsqueda en cuadrícula exploran exactamente el mismo espacio de parámetros. El resultado en la configuración de los parámetros es bastante similar, mientras que el tiempo de ejecución de la búsqueda aleatorizada es drásticamente inferior.

source: The performance is may slightly worse for the randomized search, and is likely due to a noise effect and would not carry over to a held-out test set.
es_es: El rendimiento puede ser ligeramente peor para la búsqueda aleatorizada, y es probable que se deba a un efecto de ruido y no se trasladaría a un conjunto de pruebas retenidas.

source: Note that in practice, one would not search over this many different parameters simultaneously using grid search, but pick only the ones deemed most important.
es_es: Ten en cuenta que, en la práctica, no se buscaría entre tantos parámetros diferentes simultáneamente utilizando la búsqueda en cuadrícula, sino que se elegirían sólo los que se consideran más importantes.

source: Out:
es_es: Salida:

source: **Total running time of the script:** ( 3 minutes 26.776 seconds)
es_es: **Tiempo total de ejecución del script:** (3 minutos 26.776 segundos)

source: :download:`Download Python source code: plot_randomized_search.py <plot_randomized_search.py>`
es_es: :download:`Descargar código fuente de Python: plot_randomized_search.py <plot_randomized_search.py>`

source: :download:`Download Jupyter notebook: plot_randomized_search.ipynb <plot_randomized_search.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_randomized_search.ipynb <plot_randomized_search.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
