Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_roc_crossval.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_roc_crossval.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_roc_crossval.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Receiver Operating Characteristic (ROC) with cross validation
es_es: Característica operativa del receptor (Receiver Operating Characteristic, ROC) con validación cruzada

source: Example of Receiver Operating Characteristic (ROC) metric to evaluate classifier output quality using cross-validation.
es_es: Ejemplo de la métrica Característica operativa del receptor (ROC, Receiver Operating Characteristic) para evaluar la calidad de los resultados del clasificador mediante validación cruzada.

source: ROC curves typically feature true positive rate on the Y axis, and false positive rate on the X axis. This means that the top left corner of the plot is the "ideal" point - a false positive rate of zero, and a true positive rate of one. This is not very realistic, but it does mean that a larger area under the curve (AUC) is usually better.
es_es: Las curvas ROC suelen presentar la tasa de verdaderos positivos en el eje Y y la tasa de falsos positivos en el eje X. Esto significa que la esquina superior izquierda del gráfico es el punto "ideal" - una tasa de falsos positivos de cero y una tasa de verdaderos positivos de uno-. Esto no es muy realista, pero significa que un área bajo la curva (AUC) mayor suele ser mejor.

source: The "steepness" of ROC curves is also important, since it is ideal to maximize the true positive rate while minimizing the false positive rate.
es_es: La "inclinación" de las curvas ROC también es importante, ya que lo ideal es maximizar la tasa de verdaderos positivos y minimizar la tasa de falsos positivos.

source: This example shows the ROC response of different datasets, created from K-fold cross-validation. Taking all of these curves, it is possible to calculate the mean area under curve, and see the variance of the curve when the training set is split into different subsets. This roughly shows how the classifier output is affected by changes in the training data, and how different the splits generated by K-fold cross-validation are from one another.
es_es: Este ejemplo muestra la respuesta ROC de diferentes conjuntos de datos, creados a partir de la validación cruzada K-fold. Tomando todas estas curvas, es posible calcular el área media bajo la curva, y ver la varianza de la curva cuando el conjunto de entrenamiento se divide en diferentes subconjuntos. Esto muestra, a grandes rasgos, cómo se ve afectada la salida del clasificador por los cambios en los datos de entrenamiento, y cuán diferentes son las divisiones generadas por la validación cruzada K-fold entre sí.

source: See also :func:`sklearn.metrics.roc_auc_score`,
es_es: Véase también :func:`sklearn.metrics.roc_auc_score`,

source: **Total running time of the script:** ( 0 minutes 0.282 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.282 segundos)

source: :download:`Download Python source code: plot_roc_crossval.py <plot_roc_crossval.py>`
es_es: :download:`Descargar código fuente de Python: plot_roc_crossval.py <plot_roc_crossval.py>`

source: :download:`Download Jupyter notebook: plot_roc_crossval.ipynb <plot_roc_crossval.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_roc_crossval.ipynb <plot_roc_crossval.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
