Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_cv_indices.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_cv_indices.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_cv_indices.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Visualizing cross-validation behavior in scikit-learn
es_es: Visualización del comportamiento de la validación cruzada en scikit-learn

source: Choosing the right cross-validation object is a crucial part of fitting a model properly. There are many ways to split data into training and test sets in order to avoid model overfitting, to standardize the number of groups in test sets, etc.
es_es: La elección del objeto de validación cruzada adecuado es una parte crucial para ajustar un modelo correctamente. Hay muchas formas de dividir los datos en conjuntos de entrenamiento y de prueba para evitar el sobreajuste del modelo, para estandarizar el número de grupos en los conjuntos de prueba, etc.

source: This example visualizes the behavior of several common scikit-learn objects for comparison.
es_es: Este ejemplo visualiza el comportamiento de varios objetos comunes de scikit-learn para su comparación.

source: Visualize our data
es_es: Visualizar nuestros datos

source: First, we must understand the structure of our data. It has 100 randomly generated input datapoints, 3 classes split unevenly across datapoints, and 10 "groups" split evenly across datapoints.
es_es: En primer lugar, debemos entender la estructura de nuestros datos. Tiene 100 puntos de datos de entrada generados aleatoriamente, 3 clases divididas de forma desigual entre los puntos de datos y 10 "grupos" divididos de forma uniforme entre los puntos de datos.

source: As we'll see, some cross-validation objects do specific things with labeled data, others behave differently with grouped data, and others do not use this information.
es_es: Como veremos, algunos objetos de validación cruzada hacen cosas específicas con los datos etiquetados, otros se comportan de forma diferente con los datos agrupados y otros no utilizan esta información.

source: To begin, we'll visualize our data.
es_es: Para empezar, visualizaremos nuestros datos.

source: Define a function to visualize cross-validation behavior
es_es: Definir una función para visualizar el comportamiento de la validación cruzada

source: We'll define a function that lets us visualize the behavior of each cross-validation object. We'll perform 4 splits of the data. On each split, we'll visualize the indices chosen for the training set (in blue) and the test set (in red).
es_es: Definiremos una función que nos permita visualizar el comportamiento de cada objeto de validación cruzada. Realizaremos 4 divisiones de los datos. En cada división, visualizaremos los índices elegidos para el conjunto de entrenamiento (en azul) y el conjunto de prueba (en rojo).

source: Let's see how it looks for the :class:`~sklearn.model_selection.KFold` cross-validation object:
es_es: Veamos cómo se ve el objeto de validación cruzada :class:`~sklearn.model_selection.KFold`:

source: As you can see, by default the KFold cross-validation iterator does not take either datapoint class or group into consideration. We can change this by using the ``StratifiedKFold`` like so.
es_es: Como puedes ver, por defecto el iterador de validación cruzada KFold no tiene en cuenta ni la clase del punto de datos ni el grupo. Podemos cambiar esto utilizando el ``StratifiedKFold`` así.

source: In this case, the cross-validation retained the same ratio of classes across each CV split. Next we'll visualize this behavior for a number of CV iterators.
es_es: En este caso, la validación cruzada mantuvo la misma razón(ratio) de clases en cada división de CV. A continuación, visualizaremos este comportamiento para una serie de iteradores de CV.

source: Visualize cross-validation indices for many CV objects
es_es: Visualizar los índices de validación cruzada para muchos objetos de CV

source: Let's visually compare the cross validation behavior for many scikit-learn cross-validation objects. Below we will loop through several common cross-validation objects, visualizing the behavior of each.
es_es: Vamos a comparar visualmente el comportamiento de la validación cruzada para muchos objetos de validación cruzada de scikit-learn. A continuación, haremos un bucle a través de varios objetos de validación cruzada comunes, visualizando el comportamiento de cada uno.

source: Note how some use the group/class information while others do not.
es_es: Ten en cuenta que algunos utilizan la información del grupo/clase mientras que otros no lo hacen.

source: **Total running time of the script:** ( 0 minutes 1.446 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.446 segundos)

source: :download:`Download Python source code: plot_cv_indices.py <plot_cv_indices.py>`
es_es: :download:`Descargar código fuente de Python: plot_cv_indices.py <plot_cv_indices.py>`

source: :download:`Download Jupyter notebook: plot_cv_indices.ipynb <plot_cv_indices.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_cv_indices.ipynb <plot_cv_indices.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
