Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/model_selection/plot_grid_search_stats.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_model_selection_plot_grid_search_stats.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_model_selection_plot_grid_search_stats.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Statistical comparison of models using grid search
es_es: Comparación estadística de modelos utilizando la búsqueda en cuadrícula

source: This example illustrates how to statistically compare the performance of models trained and evaluated using :class:`~sklearn.model_selection.GridSearchCV`.
es_es: Este ejemplo ilustra cómo comparar estadísticamente el rendimiento de los modelos entrenados y evaluados utilizando :class:`~sklearn.model_selection.GridSearchCV`.

source: We will start by simulating moon shaped data (where the ideal separation between classes is non-linear), adding to it a moderate degree of noise. Datapoints will belong to one of two possible classes to be predicted by two features. We will simulate 50 samples for each class:
es_es: Empezaremos simulando datos con forma de luna (donde la separación ideal entre clases no es lineal), añadiendo a ello un grado moderado de ruido. Los puntos de datos pertenecerán a una de las dos clases posibles, que serán predichas por dos características. Simularemos 50 muestras para cada clase:

source: We will compare the performance of :class:`~sklearn.svm.SVC` estimators that vary on their `kernel` parameter, to decide which choice of this hyper-parameter predicts our simulated data best. We will evaluate the performance of the models using :class:`~sklearn.model_selection.RepeatedStratifiedKFold`, repeating 10 times a 10-fold stratified cross validation using a different randomization of the data in each repetition. The performance will be evaluated using :class:`~sklearn.metrics.roc_auc_score`.
es_es: Compararemos el rendimiento de los estimadores :class:`~sklearn.svm.SVC` que varían en su parámetro `kernel`, para decidir qué elección de este hiperparámetro predice mejor nuestros datos simulados. Evaluaremos el rendimiento de los modelos utilizando :class:`~sklearn.model_selection.RepeatedStratifiedKFold`, repitiendo 10 veces una validación cruzada estratificada de 10-pliegues (fold) utilizando una aleatorización diferente de los datos en cada repetición. El rendimiento se evaluará utilizando :class:`~sklearn.metrics.roc_auc_score`.

source: We can now inspect the results of our search, sorted by their `mean_test_score`:
es_es: Ahora podemos inspeccionar los resultados de nuestra búsqueda, ordenados por su `mean_test_score`:

source: We can see that the estimator using the `'rbf'` kernel performed best, closely followed by `'linear'`. Both estimators with a `'poly'` kernel performed worse, with the one using a two-degree polynomial achieving a much lower perfomance than all other models.
es_es: Podemos ver que el estimador que utiliza el kernel "rbf" es el que mejor funciona, seguido de cerca por el `'linear'`. Ambos estimadores con un kernel `'poly'` se comportaron peor, con el que utiliza un polinomio de segundo grado logrando un rendimiento mucho menor que todos los demás modelos.

source: Usually, the analysis just ends here, but half the story is missing. The output of :class:`~sklearn.model_selection.GridSearchCV` does not provide information on the certainty of the differences between the models. We don't know if these are **statistically** significant. To evaluate this, we need to conduct a statistical test. Specifically, to contrast the performance of two models we should statistically compare their AUC scores. There are 100 samples (AUC scores) for each model as we repreated 10 times a 10-fold cross-validation.
es_es: Normalmente, el análisis termina aquí, pero falta la mitad de la historia. La salida de :class:`~sklearn.model_selection.GridSearchCV` no proporciona información sobre la certeza de las diferencias entre los modelos. No sabemos si son **estadísticamente** significativas. Para evaluar esto, necesitamos realizar una prueba estadística. En concreto, para contrastar el rendimiento de dos modelos debemos comparar estadísticamente sus puntuaciones AUC. Hay 100 muestras (puntuaciones AUC) para cada modelo, ya que repetimos 10 veces una validación cruzada de 10 pliegues (fold).

source: However, the scores of the models are not independent: all models are evaluated on the **same** 100 partitions, increasing the correlation between the performance of the models. Since some partitions of the data can make the distinction of the classes particularly easy or hard to find for all models, the models scores will co-vary.
es_es: Sin embargo, las puntuaciones de los modelos no son independientes: todos los modelos se evalúan en las **mismas** 100 particiones, lo que aumenta la correlación entre el rendimiento de los modelos. Dado que algunas particiones de los datos pueden hacer que la distinción de las clases sea particularmente fácil o difícil de encontrar para todos los modelos, las puntuaciones de los modelos covarían.

source: Let's inspect this partition effect by plotting the performance of all models in each fold, and calculating the correlation between models across folds:
es_es: Inspeccionemos este efecto de partición graficando el rendimiento de todos los modelos en cada pliegue y calculando la correlación entre los modelos en todos los pliegues:

source: We can observe that the performance of the models highly depends on the fold.
es_es: Podemos observar que el rendimiento de los modelos depende en gran medida del pliegue.

source: As a consequence, if we assume independence between samples we will be underestimating the variance computed in our statistical tests, increasing the number of false positive errors (i.e. detecting a significant difference between models when such does not exist) [1]_.
es_es: Como consecuencia, si asumimos independencia entre las muestras estaremos subestimando la varianza calculada en nuestras pruebas estadísticas, aumentando el número de errores falsos positivos (es decir, detectar una diferencia significativa entre los modelos cuando esta no existe) [1]_.

source: Several variance-corrected statistical tests have been developed for these cases. In this example we will show how to implement one of them (the so called Nadeau and Bengio's corrected t-test) under two different statistical frameworks: frequentist and Bayesian.
es_es: Se han desarrollado varias pruebas estadísticas con corrección de la varianza para estos casos. En este ejemplo mostraremos cómo implementar una de ellas (la llamada prueba t corregida de Nadeau y Bengio) bajo dos enfoques estadísticos diferentes: frecuentista y bayesiano.

source: Comparing two models: frequentist approach
es_es: Comparando dos modelos: enfoque frecuentista

source: We can start by asking: "Is the first model significantly better than the second model (when ranked by `mean_test_score`)?"
es_es: Podemos empezar preguntando: "¿Es el primer modelo significativamente mejor que el segundo (cuando se clasifica por `mean_test_score`)?"

source: To answer this question using a frequentist approach we could run a paired t-test and compute the p-value. This is also known as Diebold-Mariano test in the forecast literature [5]_. Many variants of such a t-test have been developed to account for the 'non-independence of samples problem' described in the previous section. We will use the one proven to obtain the highest replicability scores (which rate how similar the performance of a model is when evaluating it on different random partitions of the same dataset) while mantaining a low rate of false postitives and false negatives: the Nadeau and Bengio's corrected t-test [2]_ that uses a 10 times repeated 10-fold cross validation [3]_.
es_es: Para responder a esta pregunta utilizando un enfoque frecuentista, podríamos ejecutar una prueba t pareada y calcular el valor p. Esto también se conoce como prueba de Diebold-Mariano en la literatura de pronósticos [5]_. Se han desarrollado muchas variantes de dicha prueba t para tener en cuenta el "problema de la no independencia de las muestras" descrito en la sección anterior. Utilizaremos la que ha demostrado obtener las puntuaciones de replicabilidad más altas (que califica qué tan similar es el rendimiento de un modelo cuando se evalúa en diferentes particiones aleatorias del mismo conjunto de datos), manteniendo al mismo tiempo una tasa baja de falsos positivos y falsos negativos: la prueba t corregida de Nadeau y Bengio [2]_ que utiliza una validación cruzada de 10-pliegues 10 veces repetida [3]_.

source: This corrected paired t-test is computed as:
es_es: Esta prueba t pareada corregida se calcula como:

source: where :math:`k` is the number of folds, :math:`r` the number of repetitions in the cross-validation, :math:`x` is the difference in performance of the models, :math:`n_{test}` is the number of samples used for testing, :math:`n_{train}` is the number of samples used for training, and :math:`\hat{\sigma}^2` represents the variance of the observed differences.
es_es: donde :math:`k` es el número de pliegues (folds), :math:`r` el número de repeticiones en la validación cruzada, :math:`x` es la diferencia en el rendimiento de los modelos, :math:`n_{test}` es el número de muestras utilizadas para las pruebas, :math:`n_{train}` es el número de muestras utilizadas para el entrenamiento, y :math:`hat{\sigma}^2` representa la varianza de las diferencias observadas.

source: Let's implement a corrected right-tailed paired t-test to evaluate if the performance of the first model is significantly better than that of the second model. Our null hypothesis is that the second model performs at least as good as the first model.
es_es: Implementemos una prueba t pareada corregida de cola derecha para evaluar si el rendimiento del primer modelo es significativamente mejor que el del segundo. Nuestra hipótesis nula es que el segundo modelo funciona al menos tan bien como el primero.

source: We can compare the corrected t- and p-values with the uncorrected ones:
es_es: Podemos comparar los valores t y p corregidos con los no corregidos:

source: Using the conventional significance alpha level at `p=0.05`, we observe that the uncorrected t-test concludes that the first model is significantly better than the second.
es_es: Utilizando el nivel de significación alfa convencional a `p=0.05`, observamos que la prueba t no corregida concluye que el primer modelo es significativamente mejor que el segundo.

source: With the corrected approach, in contrast, we fail to detect this difference.
es_es: En contraste, con el enfoque corregido no detectamos esta diferencia.

source: In the latter case, however, the frequentist approach does not let us conclude that the first and second model have an equivalent performance. If we wanted to make this assertion we need to use a Bayesian approach.
es_es: En este último caso, sin embargo, el enfoque frecuentista no nos permite concluir que el primer y el segundo modelo tengan un rendimiento equivalente. Si quisiéramos hacer esta afirmación, tendríamos que utilizar un enfoque bayesiano.

source: Comparing two models: Bayesian approach
es_es: Comparando dos modelos: enfoque Bayesiano

source: We can use Bayesian estimation to calculate the probability that the first model is better than the second. Bayesian estimation will output a distribution followed by the mean :math:`\mu` of the differences in the performance of two models.
es_es: Podemos utilizar la estimación bayesiana para calcular la probabilidad de que el primer modelo sea mejor que el segundo. La estimación bayesiana dará como resultado una distribución seguida de la media :math:`\mu` de las diferencias en el rendimiento de dos modelos.

source: To obtain the posterior distribution we need to define a prior that models our beliefs of how the mean is distributed before looking at the data, and multiply it by a likelihood function that computes how likely our observed differences are, given the values that the mean of differences could take.
es_es: Para obtener la distribución posterior tenemos que definir una distribución a priori que modele nuestras creencias sobre cómo se distribuye la media antes de observar los datos, y multiplicarlo por una función de verosimilitud que calcule la probabilidad de nuestras diferencias observadas, dados los valores que podría tomar la media de las diferencias.

source: Bayesian estimation can be carried out in many forms to answer our question, but in this example we will implement the approach suggested by Benavoli and collegues [4]_.
es_es: La estimación bayesiana puede llevarse a cabo de muchas formas para responder a nuestra pregunta, pero en este ejemplo implementaremos el enfoque sugerido por Benavoli y colegas [4]_.

source: One way of defining our posterior using a closed-form expression is to select a prior conjugate to the likelihood function. Benavoli and collegues [4]_ show that when comparing the performance of two classifiers we can model the prior as a Normal-Gamma distribution (with both mean and variance unknown) conjugate to a normal likelihood, to thus express the posterior as a normal distribution. Marginalizing out the variance from this normal posterior, we can define the posterior of the mean parameter as a Student's t-distribution. Specifically:
es_es: Una forma de definir nuestra distribución posterior utilizando una expresión de forma cerrada es seleccionar una distribución a priori conjugada a la función de verosimilitud. Benavoli y sus colegas [4]_ muestran que cuando se compara el rendimiento de dos clasificadores podemos modelar la a priori como una distribución Normal-Gamma (con media y varianza desconocidas) conjugada con una verosimilitud normal, para así expresar la posterior como una distribución normal. Marginalizando la varianza de esta distribución posterior normal, podemos definir la posterior del parámetro de la media como una distribución t de Student. Específicamente:

source: where :math:`n` is the total number of samples, :math:`\overline{x}` represents the mean difference in the scores, :math:`n_{test}` is the number of samples used for testing, :math:`n_{train}` is the number of samples used for training, and :math:`\hat{\sigma}^2` represents the variance of the observed differences.
es_es: donde :math:`n` es el número total de muestras, :math:`overline{x}` representa la diferencia media de las puntuaciones, :math:`n_{test}` es el número de muestras utilizadas para las pruebas, :math:`n_{train}` es el número de muestras utilizadas para el entrenamiento, y :math:`hat{\sigma}^2` representa la varianza de las diferencias observadas.

source: Notice that we are using Nadeau and Bengio's corrected variance in our Bayesian approach as well.
es_es: Ten en cuenta que también utilizamos la varianza corregida de Nadeau y Bengio en nuestro enfoque bayesiano.

source: Let's compute and plot the posterior:
es_es: Calculemos y grafiquemos la distribución posterior:

source: Let's plot the posterior distribution:
es_es: Vamos a graficar la distribución posterior:

source: We can calculate the probability that the first model is better than the second by computing the area under the curve of the posterior distirbution from zero to infinity. And also the reverse: we can calculate the probability that the second model is better than the first by computing the area under the curve from minus infinity to zero.
es_es: Podemos calcular la probabilidad de que el primer modelo sea mejor que el segundo calculando el área bajo la curva de la distribución posterior de cero a infinito. Y también a la inversa: podemos calcular la probabilidad de que el segundo modelo sea mejor que el primero calculando el área bajo la curva de menos infinito a cero.

source: In contrast with the frequentist approach, we can compute the probability that one model is better than the other.
es_es: En contraste con el enfoque frecuentista, podemos calcular la probabilidad de que un modelo sea mejor que el otro.

source: Note that we obtained similar results as those in the frequentist approach. Given our choice of priors, we are essentially performing the same computations, but we are allowed to make different assertions.
es_es: Ten en cuenta que obtuvimos resultados similares a los del enfoque frecuentista. Dada nuestra elección de las distribuciones a priori, estamos realizando esencialmente los mismos cálculos, pero podemos hacer diferentes afirmaciones.

source: Region of Practical Equivalence
es_es: Región de equivalencia práctica

source: Sometimes we are interested in determining the probabilities that our models have an equivalent performance, where "equivalent" is defined in a practical way. A naive approach [4]_ would be to define estimators as practically equivalent when they differ by less than 1% in their accuracy. But we could also define this practical equivalence taking into account the problem we are trying to solve. For example, a difference of 5% in accuracy would mean an increase of $1000 in sales, and we consider any quantity above that as relevant for our business.
es_es: A veces nos interesa determinar las probabilidades de que nuestros modelos tengan un rendimiento equivalente, donde "equivalente" se define de forma práctica. Un enfoque ingenuo [4]_ sería definir los estimadores como prácticamente equivalentes cuando difieren en menos de un 1% en su exactitud. Pero también podríamos definir esta equivalencia práctica teniendo en cuenta el problema que intentamos resolver. Por ejemplo, una diferencia del 5% en la exactitud significaría un aumento de 1.000$ en las ventas, y consideramos que cualquier cantidad superior a esa es relevante para nuestro negocio.

source: In this example we are going to define the Region of Practical Equivalence (ROPE) to be :math:`[-0.01, 0.01]`. That is, we will consider two models as practically equivalent if they differ by less than 1% in their performance.
es_es: En este ejemplo vamos a definir la Región de Equivalencia Práctica (ROPE) como :math:`[-0.01, 0.01]`. Es decir, consideraremos que dos modelos son prácticamente equivalentes si difieren en menos de un 1% en su rendimiento.

source: To compute the probabilities of the classifiers being practically equivalent, we calculate the area under the curve of the posterior over the ROPE interval:
es_es: Para calcular las probabilidades de que los clasificadores sean prácticamente equivalentes, calculamos el área bajo la curva de la distribución posterior sobre el intervalo ROPE:

source: We can plot how the posterior is distributed over the ROPE interval:
es_es: Podemos graficar cómo se distribuye la posterior sobre el intervalo ROPE:

source: As suggested in [4]_, we can further interpret these probabilities using the same criteria as the frequentist approach: is the probability of falling inside the ROPE bigger than 95% (alpha value of 5%)? In that case we can conclude that both models are practically equivalent.
es_es: Como se sugiere en [4]_, podemos seguir interpretando estas probabilidades utilizando los mismos criterios que el enfoque frecuentista: ¿es la probabilidad de caer dentro del ROPE mayor del 95% (valor alfa del 5%)? En ese caso, podemos concluir que ambos modelos son prácticamente equivalentes.

source: The Bayesian estimation approach also allows us to compute how uncertain we are about our estimation of the difference. This can be calculated using credible intervals. For a given probability, they show the range of values that the estimated quantity, in our case the mean difference in performance, can take. For example, a 50% credible interval [x, y] tells us that there is a 50% probability that the true (mean) difference of performance between models is between x and y.
es_es: El enfoque de la estimación bayesiana también nos permite calcular el grado de incertidumbre de nuestra estimación de la diferencia. Esto puede calcularse utilizando intervalos de credibilidad. Para una probabilidad dada, muestran el rango de valores que puede tomar la cantidad estimada, en nuestro caso la diferencia media de rendimiento. Por ejemplo, un intervalo de credibilidad del 50% [x, y] nos dice que hay un 50% de probabilidad de que la verdadera (media) diferencia de rendimiento entre los modelos esté entre x e y.

source: Let's determine the credible intervals of our data using 50%, 75% and 95%:
es_es: Vamos a determinar los intervalos de credibilidad de nuestros datos utilizando el 50%, el 75% y el 95%:

source: As shown in the table, there is a 50% probability that the true mean difference between models will be between 0.000977 and 0.019023, 70% probability that it will be between -0.005422 and 0.025422, and 95% probability that it will be between -0.016445 and 0.036445.
es_es: Como se muestra en la tabla, hay un 50% de probabilidad de que la verdadera diferencia media entre los modelos esté entre 0.000977 y 0.019023, un 70% de probabilidad de que esté entre -0.005422 y 0.025422, y un 95% de probabilidad de que esté entre -0.016445 y 0.036445.

source: Pairwise comparison of all models: frequentist approach
es_es: Comparación por pares de todos los modelos: enfoque frecuentista

source: We could also be interested in comparing the performance of all our models evaluated with :class:`~sklearn.model_selection.GridSearchCV`. In this case we would be running our statistical test multiple times, which leads us to the `multiple comparisons problem <https://en.wikipedia.org/wiki/Multiple_comparisons_problem>`_.
es_es: También podríamos estar interesados en comparar el rendimiento de todos nuestros modelos evaluados con :class:`~sklearn.model_selection.GridSearchCV`. En este caso estaríamos ejecutando nuestra prueba estadística múltiples veces, lo que nos lleva al `problema de las comparaciones múltiples <https://en.wikipedia.org/wiki/Multiple_comparisons_problem>`_.

source: There are many possible ways to tackle this problem, but a standard approach is to apply a `Bonferroni correction <https://en.wikipedia.org/wiki/Bonferroni_correction>`_. Bonferroni can be computed by multiplying the p-value by the number of comparisons we are testing.
es_es: Hay muchas formas posibles de abordar este problema, pero un enfoque estándar es aplicar una `corrección de Bonferroni <https://en.wikipedia.org/wiki/Bonferroni_correction>`_. El Bonferroni se puede calcular multiplicando el valor p por el número de comparaciones que estamos probando.

source: Let's compare the performance of the models using the corrected t-test:
es_es: Comparemos el rendimiento de los modelos utilizando la prueba t corregida:

source: We observe that after correcting for multiple comparisons, the only model that significantly differs from the others is `'2_poly'`. `'rbf'`, the model ranked first by :class:`~sklearn.model_selection.GridSearchCV`, does not significantly differ from `'linear'` or `'3_poly'`.
es_es: Observamos que, tras corregir las comparaciones múltiples, el único modelo que difiere significativamente de los demás es `'2_poly'`. `'rbf'`, el modelo clasificado en primer lugar por :class:`~sklearn.model_selection.GridSearchCV`, no difiere significativamente de `'linear'` o `'3_poly'`.

source: Pairwise comparison of all models: Bayesian approach
es_es: Comparación por pares de todos los modelos: Enfoque bayesiano

source: When using Bayesian estimation to compare multiple models, we don't need to correct for multiple comparisons (for reasons why see [4]_).
es_es: Cuando se utiliza la estimación bayesiana para comparar múltiples modelos, no es necesario corregir las comparaciones múltiples (para saber por qué, consulta [4]_).
