Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/basic/tutorial.po
Languages: es_es

source: An introduction to machine learning with scikit-learn
es_es: Introducción al aprendizaje automático con scikit-learn

source: Section contents
es_es: Sección de contenidos

source: In this section, we introduce the `machine learning <https://en.wikipedia.org/wiki/Machine_learning>`_ vocabulary that we use throughout scikit-learn and give a simple learning example.
es_es: En esta sección, introducimos el vocabulario `machine learning <https://en.wikipedia.org/wiki/Machine_learning>`_ que utilizamos en todo scikit-learn y damos un ejemplo sencillo de aprendizaje.

source: Machine learning: the problem setting
es_es: Aprendizaje automático: el escenario del problema

source: In general, a learning problem considers a set of n `samples <https://en.wikipedia.org/wiki/Sample_(statistics)>`_ of data and then tries to predict properties of unknown data. If each sample is more than a single number and, for instance, a multi-dimensional entry (aka `multivariate <https://en.wikipedia.org/wiki/Multivariate_random_variable>`_ data), it is said to have several attributes or **features**.
es_es: En general, un problema de aprendizaje considera un conjunto de n `muestras <https://en.wikipedia.org/wiki/Sample_(statistics)>`_ de datos y, a continuación, intenta predecir propiedades de datos desconocidos. Si cada muestra es más que un solo número y, por ejemplo, una entrada multidimensional (también conocida como `datos multivariantes <https://en.wikipedia.org/wiki/Multivariate_random_variable>`_), se dice que tiene varios atributos o **características**.

source: Learning problems fall into a few categories:
es_es: Los problemas de aprendizaje se dividen en varias categorías:

source: `supervised learning <https://en.wikipedia.org/wiki/Supervised_learning>`_, in which the data comes with additional attributes that we want to predict (:ref:`Click here <supervised-learning>` to go to the scikit-learn supervised learning page).This problem can be either:
es_es: `aprendizaje supervisado <https://en.wikipedia.org/wiki/Supervised_learning>`_, en el que los datos vienen con atributos adicionales que queremos predecir (:ref:`Haz clic aquí <supervised-learning>` para ir a la página de aprendizaje supervisado de scikit-learn).Este problema puede ser:

source: `classification <https://en.wikipedia.org/wiki/Classification_in_machine_learning>`_: samples belong to two or more classes and we want to learn from already labeled data how to predict the class of unlabeled data. An example of a classification problem would be handwritten digit recognition, in which the aim is to assign each input vector to one of a finite number of discrete categories. Another way to think of classification is as a discrete (as opposed to continuous) form of supervised learning where one has a limited number of categories and for each of the n samples provided, one is to try to label them with the correct category or class.
es_es: `clasificación <https://en.wikipedia.org/wiki/Classification_in_machine_learning>`_: las muestras pertenecen a dos o más clases y queremos aprender, a partir de datos ya etiquetados, a predecir la clase de los datos no etiquetados. Un ejemplo de problema de clasificación sería el reconocimiento de dígitos escritos a mano, en el que el objetivo es asignar cada vector de entrada a una de un número finito de categorías discretas. Otra forma de pensar en la clasificación es como una forma discreta (en contraposición a la continua) de aprendizaje supervisado en la que se tiene un número limitado de categorías y para cada una de las n muestras proporcionadas, se trata de etiquetarlas con la categoría o clase correcta.

source: `regression <https://en.wikipedia.org/wiki/Regression_analysis>`_: if the desired output consists of one or more continuous variables, then the task is called *regression*. An example of a regression problem would be the prediction of the length of a salmon as a function of its age and weight.
es_es: `regresión <https://en.wikipedia.org/wiki/Regression_analysis>`_: si la salida deseada consiste en una o más variables continuas, entonces la tarea se llama *regresión*. Un ejemplo de problema de regresión sería la predicción de la longitud de un salmón en función de su edad y peso.

source: `unsupervised learning <https://en.wikipedia.org/wiki/Unsupervised_learning>`_, in which the training data consists of a set of input vectors x without any corresponding target values. The goal in such problems may be to discover groups of similar examples within the data, where it is called `clustering <https://en.wikipedia.org/wiki/Cluster_analysis>`_, or to determine the distribution of data within the input space, known as `density estimation <https://en.wikipedia.org/wiki/Density_estimation>`_, or to project the data from a high-dimensional space down to two or three dimensions for the purpose of *visualization* (:ref:`Click here <unsupervised-learning>` to go to the Scikit-Learn unsupervised learning page).
es_es: `aprendizaje no supervisado <https://en.wikipedia.org/wiki/Unsupervised_learning>`_, en el que los datos de entrenamiento consisten en un conjunto de vectores de entrada x sin ningún valor objetivo correspondiente. El objetivo de estos problemas puede ser descubrir grupos de ejemplos similares dentro de los datos, lo que se denomina `conglomerado <https://en.wikipedia.org/wiki/Cluster_analysis>`_, o determinar la distribución de los datos dentro del espacio de entrada, lo que se conoce como `estimación de la densidad <https://en.wikipedia.org/wiki/Density_estimation>`_, o proyectar los datos desde un espacio de alta dimensión hasta dos o tres dimensiones con el fin de *visualizarlos* (:ref:`Haga clic aquí <unsupervised-learning>` para ir a la página de aprendizaje no supervisado de Scikit-Learn).

source: Training set and testing set
es_es: Conjunto de entrenamiento y conjunto de pruebas

source: Machine learning is about learning some properties of a data set and then testing those properties against another data set. A common practice in machine learning is to evaluate an algorithm by splitting a data set into two. We call one of those sets the **training set**, on which we learn some properties; we call the other set the **testing set**, on which we test the learned properties.
es_es: El aprendizaje automático consiste en aprender algunas propiedades de un conjunto de datos y, a continuación, comprobar esas propiedades con otro conjunto de datos. Una práctica habitual en el aprendizaje automático es evaluar un algoritmo dividiendo un conjunto de datos en dos. Llamamos a uno de esos conjuntos el **conjunto de entrenamiento**, sobre el que aprendemos algunas propiedades; llamamos al otro conjunto el **conjunto de prueba**, sobre el que probamos las propiedades aprendidas.

source: Loading an example dataset
es_es: Carga de un conjunto de datos de ejemplo

source: `scikit-learn` comes with a few standard datasets, for instance the `iris <https://en.wikipedia.org/wiki/Iris_flower_data_set>`_ and `digits <https://archive.ics.uci.edu/ml/datasets/Pen-Based+Recognition+of+Handwritten+Digits>`_ datasets for classification and the `diabetes dataset <https://www4.stat.ncsu.edu/~boos/var.select/diabetes.html>`_ for regression.
es_es: `scikit-learn` viene con unos cuantos conjuntos de datos estándar, por ejemplo los conjuntos de datos `iris <https://en.wikipedia.org/wiki/Iris_flower_data_set>`_ y `digits <https://archive.ics.uci.edu/ml/datasets/Pen-Based+Recognition+of+Handwritten+Digits>`_ para clasificación y el conjunto de datos `diabetes <https://www4.stat.ncsu.edu/~boos/var.select/diabetes.html>`_ para regresión.

source: In the following, we start a Python interpreter from our shell and then load the ``iris`` and ``digits`` datasets. Our notational convention is that ``$`` denotes the shell prompt while ``>>>`` denotes the Python interpreter prompt::
es_es: A continuación, iniciamos un intérprete de Python desde nuestro shell y luego cargamos los conjuntos de datos ``iris`` y ``digits``. Nuestra convención de notación es que ``$`` denota el prompt del terminal mientras que ``>>`` denota el prompt del intérprete de Python::

source: A dataset is a dictionary-like object that holds all the data and some metadata about the data. This data is stored in the ``.data`` member, which is a ``n_samples, n_features`` array. In the case of supervised problem, one or more response variables are stored in the ``.target`` member. More details on the different datasets can be found in the :ref:`dedicated section <datasets>`.
es_es: Un conjunto de datos es un objeto tipo diccionario que contiene todos los datos y algunos metadatos sobre los datos. Estos datos se almacenan en el miembro ``.data``, que es un arreglo ``n_samples, n_features``. En el caso del problema supervisado, una o más variables de respuesta se almacenan en el miembro ``.target``. Puedes encontrar más detalles sobre los diferentes conjuntos de datos en la sección :ref:`dedicada a los conjuntos de datos <datasets>`.

source: For instance, in the case of the digits dataset, ``digits.data`` gives access to the features that can be used to classify the digits samples::
es_es: Por ejemplo, en el caso del conjunto de datos de dígitos, ``digits.data`` da acceso a las características que pueden utilizarse para clasificar las muestras de dígitos::

source: and ``digits.target`` gives the ground truth for the digit dataset, that is the number corresponding to each digit image that we are trying to learn::
es_es: y ``digits.target`` da la verdad fundamental para el conjunto de datos de dígitos, es decir, el número correspondiente a cada imagen de dígitos que estamos tratando de aprender::

source: Shape of the data arrays
es_es: Forma de los arreglos de datos

source: The data is always a 2D array, shape ``(n_samples, n_features)``, although the original data may have had a different shape. In the case of the digits, each original sample is an image of shape ``(8, 8)`` and can be accessed using::
es_es: Los datos son siempre un arreglo 2D, de forma ``(n_samples, n_features)``, aunque los datos originales pueden haber tenido una forma diferente. En el caso de los dígitos, cada muestra original es una imagen de forma ``(8, 8)`` y se puede acceder a ella mediante::

source: The :ref:`simple example on this dataset <sphx_glr_auto_examples_classification_plot_digits_classification.py>` illustrates how starting from the original problem one can shape the data for consumption in scikit-learn.
es_es: El ejemplo :ref:`simple sobre este conjunto de datos <sphx_glr_auto_examples_classification_plot_digits_classification.py>` ilustra cómo partiendo del problema original se pueden moldear los datos para su consumo en scikit-learn.

source: Loading from external datasets
es_es: Carga de conjuntos de datos externos

source: To load from an external dataset, please refer to :ref:`loading external datasets <external_datasets>`.
es_es: Para cargar desde un conjunto de datos externo, consulte :ref:`cargar conjuntos de datos externos <external_datasets>`.

source: Learning and predicting
es_es: Aprendizaje y predicción

source: In the case of the digits dataset, the task is to predict, given an image, which digit it represents. We are given samples of each of the 10 possible classes (the digits zero through nine) on which we *fit* an `estimator <https://en.wikipedia.org/wiki/Estimator>`_ to be able to *predict* the classes to which unseen samples belong.
es_es: En el caso del conjunto de datos de dígitos, la tarea consiste en predecir, dada una imagen, qué dígito representa. Se nos dan muestras de cada una de las 10 clases posibles (los dígitos del cero al nueve) sobre las que *ajustamos* un `estimador <https://en.wikipedia.org/wiki/Estimator>`_ para poder *predecir* las clases a las que pertenecen las muestras no vistas.

source: In scikit-learn, an estimator for classification is a Python object that implements the methods ``fit(X, y)`` and ``predict(T)``.
es_es: En scikit-learn, un estimador para la clasificación es un objeto Python que implementa los métodos ``fit(X, y)`` y ``predict(T)``.

source: An example of an estimator is the class ``sklearn.svm.SVC``, which implements `support vector classification <https://en.wikipedia.org/wiki/Support_vector_machine>`_. The estimator's constructor takes as arguments the model's parameters.
es_es: Un ejemplo de estimador es la clase ``sklearn.svm.SVC``, que implementa la `clasificación por vectores de soporte <https://en.wikipedia.org/wiki/Support_vector_machine>`_. El constructor del estimador toma como argumentos los parámetros del modelo.

source: For now, we will consider the estimator as a black box::
es_es: Por ahora, consideraremos el estimador como una caja negra::

source: Choosing the parameters of the model
es_es: Elección de los parámetros del modelo

source: In this example, we set the value of ``gamma`` manually. To find good values for these parameters, we can use tools such as :ref:`grid search <grid_search>` and :ref:`cross validation <cross_validation>`.
es_es: En este ejemplo, establecemos el valor de ``gamma`` manualmente. Para encontrar buenos valores para estos parámetros, podemos utilizar herramientas como :ref:`grid search <grid_search>` y :ref:`cross validation <cross_validation>`.

source: The ``clf`` (for classifier) estimator instance is first fitted to the model; that is, it must *learn* from the model. This is done by passing our training set to the ``fit`` method. For the training set, we'll use all the images from our dataset, except for the last image, which we'll reserve for our predicting. We select the training set with the ``[:-1]`` Python syntax, which produces a new array that contains all but the last item from ``digits.data``::
es_es: La instancia del estimador ``clf`` (para clasificador) se ajusta primero al modelo; es decir, debe *aprender* del modelo. Esto se hace pasando nuestro conjunto de entrenamiento al método ``fit``. Para el conjunto de entrenamiento, utilizaremos todas las imágenes de nuestro conjunto de datos, excepto la última imagen, que reservaremos para nuestra predicción. Seleccionamos el conjunto de entrenamiento con la sintaxis ``[:-1]`` de Python, que produce un nuevo arreglo que contiene todos los elementos menos el último de ``digits.data``::

source: Now you can *predict* new values. In this case, you'll predict using the last image from ``digits.data``. By predicting, you'll determine the image from the training set that best matches the last image.
es_es: Ahora puedes *predecir* nuevos valores. En este caso, predecirás utilizando la última imagen de ``digits.data``. Al predecir, determinarás la imagen del conjunto de entrenamiento que mejor corresponda con la última imagen.

source: The corresponding image is:
es_es: La imagen correspondiente es:

source: As you can see, it is a challenging task: after all, the images are of poor resolution. Do you agree with the classifier?
es_es: Como puedes ver, es una tarea difícil: al fin y al cabo, las imágenes tienen poca resolución. ¿Estás de acuerdo con el clasificador?

source: A complete example of this classification problem is available as an example that you can run and study: :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py`.
es_es: Un ejemplo completo de este problema de clasificación está disponible como ejemplo que puede ejecutar y estudiar: :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py`.

source: Conventions
es_es: Convenciones

source: scikit-learn estimators follow certain rules to make their behavior more predictive. These are described in more detail in the :ref:`glossary`.
es_es: los estimadores de scikit-learn siguen ciertas reglas para hacer su comportamiento más predictivo. Estas se describen con más detalle en el :ref:`glosario`.

source: Type casting
es_es: Fundición de tipo

source: Unless otherwise specified, input will be cast to ``float64``::
es_es: A menos que se especifique lo contrario, la entrada se convertirá en ``float64``::

source: In this example, ``X`` is ``float32``, which is cast to ``float64`` by ``fit_transform(X)``.
es_es: En este ejemplo, ``X`` es ``float32``, que se convierte en ``float64`` mediante ``fit_transform(X)``.

source: Regression targets are cast to ``float64`` and classification targets are maintained::
es_es: Los objetivos de regresión se convierten en ``float64`` y los objetivos de clasificación se mantienen::

source: Here, the first ``predict()`` returns an integer array, since ``iris.target`` (an integer array) was used in ``fit``. The second ``predict()`` returns a string array, since ``iris.target_names`` was for fitting.
es_es: Aquí, el primer ``predict()`` devuelve un arreglo de enteros, ya que ``iris.target`` (un arreglo de enteros) fue utilizado en ``fit``. El segundo ``predict()`` devuelve un arreglo de cadenas, ya que ``iris.target_names`` fue para el ajuste.
