Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/miscellaneous/plot_isotonic_regression.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_miscellaneous_plot_isotonic_regression.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_miscellaneous_plot_isotonic_regression.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Isotonic Regression
es_es: Regresión Isotónica

source: An illustration of the isotonic regression on generated data (non-linear monotonic trend with homoscedastic uniform noise).
es_es: Una ilustración de la regresión isotónica sobre los datos generados (tendencia monótona no lineal con ruido uniforme homoscedástico).

source: The isotonic regression algorithm finds a non-decreasing approximation of a function while minimizing the mean squared error on the training data. The benefit of such a non-parametric model is that it does not assume any shape for the target function besides monotonicity. For comparison a linear regression is also presented.
es_es: El algoritmo de regresión isotónica encuentra una aproximación no decreciente de una función minimizando el error cuadrático medio en los datos de entrenamiento. El beneficio de este modelo no paramétrico es que no asume ninguna forma para la función objetivo además de la monotonicidad. A modo de comparación, también se presenta una regresión lineal.

source: The plot on the right-hand side shows the model prediction function that results from the linear interpolation of thresholds points. The thresholds points are a subset of the training input observations and their matching target values are computed by the isotonic non-parametric fit.
es_es: El gráfico de la derecha muestra la función de predicción del modelo que resulta de la interpolación lineal de los puntos de los umbrales. Los puntos de umbral son un subconjunto de las observaciones de entrada de entrenamiento y sus valores objetivo correspondientes se calculan mediante el ajuste isotónico no paramétrico.

source: Fit IsotonicRegression and LinearRegression models:
es_es: Ajustar los modelos IsotonicRegression y LinearRegression:

source: Plot results:
es_es: Gráfico de los resultados:

source: Note that we explicitly passed `out_of_bounds="clip"` to the constructor of `IsotonicRegression` to control the way the model extrapolates outside of the range of data observed in the training set. This "clipping" extrapolation can be seen on the plot of the decision function on the right-hand.
es_es: Ten en cuenta que pasamos explícitamente `out_of_bounds="clip"` al constructor de `IsotonicRegression` para controlar la forma en que el modelo extrapola fuera del rango de datos observados en el conjunto de entrenamiento. Esta extrapolación de "recorte" puede verse en el gráfico de la función de decisión de la derecha.

source: **Total running time of the script:** ( 0 minutes 0.323 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0,323 segundos)

source: :download:`Download Python source code: plot_isotonic_regression.py <plot_isotonic_regression.py>`
es_es: :download:`Descargar el código fuente de Python: plot_isotonic_regression.py <plot_isotonic_regression.py>`

source: :download:`Download Jupyter notebook: plot_isotonic_regression.ipynb <plot_isotonic_regression.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_isotonic_regression.ipynb <plot_isotonic_regression.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
