Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/miscellaneous/plot_display_object_visualization.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_miscellaneous_plot_display_object_visualization.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_miscellaneous_plot_display_object_visualization.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Visualizations with Display Objects
es_es: Visualizaciones con Objetos de Visualización

source: In this example, we will construct display objects, :class:`ConfusionMatrixDisplay`, :class:`RocCurveDisplay`, and :class:`PrecisionRecallDisplay` directly from their respective metrics. This is an alternative to using their corresponding plot functions when a model's predictions are already computed or expensive to compute. Note that this is advanced usage, and in general we recommend using their respective plot functions.
es_es: En este ejemplo, construiremos objetos de visualización, :class:`ConfusionMatrixDisplay`, :class:`RocCurveDisplay`, y :class:`PrecisionRecallDisplay` directamente desde sus respectivas métricas. Se trata de una alternativa al uso de sus correspondientes funciones de graficación cuando las predicciones de un modelo ya están calculadas o son costosas de calcular. Ten en cuenta que se trata de un uso avanzado y que, en general, se recomienda utilizar sus respectivas funciones de trazado.

source: Load Data and train model
es_es: Cargar Datos y entrenar el modelo

source: For this example, we load a blood transfusion service center data set from `OpenML <https://www.openml.org/d/1464>`. This is a binary classification problem where the target is whether an individual donated blood. Then the data is split into a train and test dataset and a logistic regression is fitted wtih the train dataset.
es_es: Para este ejemplo, cargamos un conjunto de datos del centro de servicios de transfusión de sangre de `OpenML <https://www.openml.org/d/1464>`. Se trata de un problema de clasificación binaria cuyo objetivo es saber si un individuo ha donado sangre. Luego, los datos se dividen en un conjunto de datos de entrenamiento y otro de prueba y se ajusta una regresión logística con el conjunto de datos de entrenamiento.

source: Create :class:`ConfusionMatrixDisplay`
es_es: Crear una :class:`ConfusionMatrixDisplay`

source: With the fitted model, we compute the predictions of the model on the test dataset. These predictions are used to compute the confustion matrix which is plotted with the :class:`ConfusionMatrixDisplay`
es_es: Con el modelo ajustado, calculamos las predicciones del modelo en el conjunto de datos de prueba. Estas predicciones se utilizan para calcular la matriz de confusión que se representa con la clase :class:`ConfusionMatrixDisplay`

source: Create :class:`RocCurveDisplay`
es_es: Crear una :class:`RocCurveDisplay`

source: The roc curve requires either the probabilities or the non-thresholded decision values from the estimator. Since the logistic regression provides a decision function, we will use it to plot the roc curve:
es_es: La curva roc requiere las probabilidades o los valores de decisión sin umbral del estimador. Dado que la regresión logística proporciona una función de decisión, la utilizaremos para graficar la curva roc:

source: Create :class:`PrecisionRecallDisplay`
es_es: Crear :class:`PrecisionRecallDisplay`

source: Similarly, the precision recall curve can be plotted using `y_score` from the prevision sections.
es_es: Del mismo modo, la curva de precisión y exhaustividad se puede graficar utilizando `y_score` de las secciones de previsión.

source: Combining the display objects into a single plot
es_es: Combinar los objetos de visualización en un único gráfico

source: The display objects store the computed values that were passed as arguments. This allows for the visualizations to be easliy combined using matplotlib's API. In the following example, we place the displays next to each other in a row.
es_es: Los objetos de visualización almacenan los valores calculados que se pasaron como argumentos. Esto permite combinar fácilmente las visualizaciones utilizando la API de matplotlib. En el siguiente ejemplo, colocamos las visualizaciones una al lado de la otra en una fila.

source: **Total running time of the script:** ( 0 minutes 0.461 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.461 segundos)

source: :download:`Download Python source code: plot_display_object_visualization.py <plot_display_object_visualization.py>`
es_es: :download:`Descargar el código fuente de Python: plot_display_object_visualization.py <plot_display_object_visualization.py>`

source: :download:`Download Jupyter notebook: plot_display_object_visualization.ipynb <plot_display_object_visualization.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_display_object_visualization.ipynb <plot_display_object_visualization.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
