Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/miscellaneous/plot_multilabel.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_miscellaneous_plot_multilabel.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_miscellaneous_plot_multilabel.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Multilabel classification
es_es: Clasificación multietiqueta

source: This example simulates a multi-label document classification problem. The dataset is generated randomly based on the following process:
es_es: Este ejemplo simula un problema de clasificación de documentos multietiqueta. El conjunto de datos se genera aleatoriamente basado en el siguiente proceso:

source: pick the number of labels: n ~ Poisson(n_labels)
es_es: elegir el número de etiquetas: n ~ Poisson(n_labels)

source: n times, choose a class c: c ~ Multinomial(theta)
es_es: n veces, elegir una clase c: c ~ Multinomial(theta)

source: pick the document length: k ~ Poisson(length)
es_es: elegir la longitud del documento: k ~ Poisson(length)

source: k times, choose a word: w ~ Multinomial(theta_c)
es_es: k veces, elegir una palabra: w ~ Multinomial(theta_c)

source: In the above process, rejection sampling is used to make sure that n is more than 2, and that the document length is never zero. Likewise, we reject classes which have already been chosen. The documents that are assigned to both classes are plotted surrounded by two colored circles.
es_es: En el proceso anterior, se utiliza el muestreo de rechazo para asegurarse de que n sea mayor que 2, y que la longitud del documento nunca sea cero. Asimismo, rechazamos las clases que ya han sido elegidas. Los documentos que se asignan a ambas clases se representan rodeados de dos círculos de color.

source: The classification is performed by projecting to the first two principal components found by PCA and CCA for visualisation purposes, followed by using the :class:`~sklearn.multiclass.OneVsRestClassifier` metaclassifier using two SVCs with linear kernels to learn a discriminative model for each class. Note that PCA is used to perform an unsupervised dimensionality reduction, while CCA is used to perform a supervised one.
es_es: La clasificación se realiza proyectando a los dos primeros componentes principales encontrados por PCA y CCA con fines de visualización, seguido de la utilización del metaclasificador :class:`~sklearn.multiclass.OneVsRestClassifier` usando dos SVC con kernels lineales para aprender un modelo discriminativo para cada clase. Ten en cuenta que el PCA se utiliza para realizar una reducción de dimensionalidad no supervisada, mientras que el CCA se utiliza para realizar una supervisada.

source: Note: in the plot, "unlabeled samples" does not mean that we don't know the labels (as in semi-supervised learning) but that the samples simply do *not* have a label.
es_es: Nota: en el gráfico, "unlabeled samples" no significa que no conozcamos las etiquetas (como en el aprendizaje semisupervisado), sino que las muestras simplemente *no* tienen una etiqueta.

source: **Total running time of the script:** ( 0 minutes 0.456 seconds)
es_es: ** Tiempo total de ejecución del script: ** (0 minutos 0,456 segundos)

source: :download:`Download Python source code: plot_multilabel.py <plot_multilabel.py>`
es_es: :download:`Descargar el código fuente de Python: plot_multilabel.py <plot_multilabel.py>`

source: :download:`Download Jupyter notebook: plot_multilabel.ipynb <plot_multilabel.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_multilabel.ipynb <plot_multilabel.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
