Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/miscellaneous/plot_roc_curve_visualization_api.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_miscellaneous_plot_roc_curve_visualization_api.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_miscellaneous_plot_roc_curve_visualization_api.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: ROC Curve with Visualization API
es_es: Curva ROC con API de visualización

source: Scikit-learn defines a simple API for creating visualizations for machine learning. The key features of this API is to allow for quick plotting and visual adjustments without recalculation. In this example, we will demonstrate how to use the visualization API by comparing ROC curves.
es_es: Scikit-learn define una API simple para crear visualizaciones para el aprendizaje automático. Las características clave de esta API es permitir un graficado rápido y ajustes visuales sin recalcular. En este ejemplo, demostraremos cómo utilizar la API de visualización comparando curvas ROC.

source: Load Data and Train a SVC
es_es: Cargar los Datos y Entrenar un SVC

source: First, we load the wine dataset and convert it to a binary classification problem. Then, we train a support vector classifier on a training dataset.
es_es: Primero, cargamos el conjunto de datos sobre vinos y lo convertimos en un problema de clasificación binaria. Luego, entrenamos un clasificador de vectores de soporte en un conjunto de datos de entrenamiento.

source: Plotting the ROC Curve
es_es: Gráfico de la curva ROC

source: Next, we plot the ROC curve with a single call to :func:`sklearn.metrics.plot_roc_curve`. The returned `svc_disp` object allows us to continue using the already computed ROC curve for the SVC in future plots.
es_es: A continuación, graficamos la curva ROC con una sola invocación a :func:`sklearn.metrics.plot_roc_curve`. El objeto `svc_disp` devuelto nos permite seguir utilizando la curva ROC ya calculada para el SVC en futuros gráficos.

source: Training a Random Forest and Plotting the ROC Curve
es_es: Entrenamiento de un Bosque Aleatorio y Graficación de la Curva ROC

source: We train a random forest classifier and create a plot comparing it to the SVC ROC curve. Notice how `svc_disp` uses :func:`~sklearn.metrics.RocCurveDisplay.plot` to plot the SVC ROC curve without recomputing the values of the roc curve itself. Furthermore, we pass `alpha=0.8` to the plot functions to adjust the alpha values of the curves.
es_es: Entrenamos un clasificador de bosque aleatorio y creamos un gráfico comparándolo con la curva ROC de SVC. Observa que `svc_disp` utiliza :func:`~sklearn.metrics.RocCurveDisplay.plot` para trazar la curva ROC de SVC sin volver a calcular los valores de la propia curva roc. Además, pasamos `alpha=0.8` a las funciones del gráfico para ajustar los valores alfa de las curvas.

source: **Total running time of the script:** ( 0 minutes 0.302 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0,302 segundos)

source: :download:`Download Python source code: plot_roc_curve_visualization_api.py <plot_roc_curve_visualization_api.py>`
es_es: :download:`Descargar el código fuente de Python: plot_roc_curve_visualization_api.py <plot_roc_curve_visualization_api.py>`

source: :download:`Download Jupyter notebook: plot_roc_curve_visualization_api.ipynb <plot_roc_curve_visualization_api.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_roc_curve_visualization_api.ipynb <plot_roc_curve_visualization_api.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
