Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/miscellaneous/plot_johnson_lindenstrauss_bound.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_miscellaneous_plot_johnson_lindenstrauss_bound.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_miscellaneous_plot_johnson_lindenstrauss_bound.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: The Johnson-Lindenstrauss bound for embedding with random projections
es_es: El límite de Johnson-Lindenstrauss para la incrustación con proyecciones aleatorias

source: The `Johnson-Lindenstrauss lemma`_ states that any high dimensional dataset can be randomly projected into a lower dimensional Euclidean space while controlling the distortion in the pairwise distances.
es_es: El `Johnson-Lindenstrauss lemma`_ afirma que cualquier conjunto de datos de alta dimensión puede proyectarse aleatoriamente en un espacio Euclidiano de menor dimensión controlando la distorsión en las distancias por pares.

source: Theoretical bounds
es_es: Límites teóricos

source: The distortion introduced by a random projection `p` is asserted by the fact that `p` is defining an eps-embedding with good probability as defined by:
es_es: La distorsión introducida por una proyección aleatoria `p` se afirma por el hecho de que `p` está definiendo una incrustación eps con buena probabilidad como se define por:

source: Where u and v are any rows taken from a dataset of shape (n_samples, n_features) and p is a projection by a random Gaussian N(0, 1) matrix of shape (n_components, n_features) (or a sparse Achlioptas matrix).
es_es: Donde u y v son cualquier fila tomada de un conjunto de datos de forma (n_samples, n_features) y p es una proyección de una matriz Gaussiana aleatoria N(0, 1) de forma (n_components, n_features) (o una matriz Achlioptas dispersa).

source: The minimum number of components to guarantees the eps-embedding is given by:
es_es: El número mínimo de componentes para garantizar la incrustación eps viene dado por:

source: The first plot shows that with an increasing number of samples ``n_samples``, the minimal number of dimensions ``n_components`` increased logarithmically in order to guarantee an ``eps``-embedding.
es_es: El primer gráfico muestra que con un número creciente de muestras ``n_samples``, el número mínimo de dimensiones ``n_components`` aumenta logarítmicamente para garantizar una incrustación ``eps``.

source: The second plot shows that an increase of the admissible distortion ``eps`` allows to reduce drastically the minimal number of dimensions ``n_components`` for a given number of samples ``n_samples``
es_es: El segundo gráfico muestra que un aumento de la distorsión admisible ``eps`` permite reducir drásticamente el número mínimo de dimensiones ``n_components`` para un número determinado de muestras ``n_samples``

source: Empirical validation
es_es: Validación empírica

source: We validate the above bounds on the 20 newsgroups text document (TF-IDF word frequencies) dataset or on the digits dataset:
es_es: Validamos los límites anteriores en el conjunto de datos del documento de texto de 20 grupos de noticias (frecuencias de palabras TF-IDF) o en el conjunto de datos de dígitos:

source: for the 20 newsgroups dataset some 500 documents with 100k features in total are projected using a sparse random matrix to smaller euclidean spaces with various values for the target number of dimensions ``n_components``.
es_es: para el conjunto de datos de 20 grupos de noticias se proyectan unos 500 documentos con 100k características en total utilizando una matriz aleatoria dispersa a espacios euclidianos más pequeños con varios valores para el número de dimensiones objetivo ``n_components``.

source: for the digits dataset, some 8x8 gray level pixels data for 500 handwritten digits pictures are randomly projected to spaces for various larger number of dimensions ``n_components``.
es_es: para el conjunto de datos de dígitos, algunos datos de píxeles de nivel de gris de 8x8 para 500 imágenes de dígitos escritos a mano se proyectan aleatoriamente en espacios para varios números mayores de dimensiones ``n_components``.

source: The default dataset is the 20 newsgroups dataset. To run the example on the digits dataset, pass the ``--use-digits-dataset`` command line argument to this script.
es_es: El conjunto de datos predeterminados es el conjunto de datos de 20 grupos de noticias. Para ejecutar el ejemplo en el conjunto de datos de dígitos, pasa el argumento de línea de comandos ``--use-digits-dataset`` a este script.

source: For each value of ``n_components``, we plot:
es_es: Para cada valor de ``n_components``, graficamos:

source: 2D distribution of sample pairs with pairwise distances in original and projected spaces as x and y axis respectively.
es_es: Distribución 2D de los pares de muestras con las distancias por pares en los espacios original y proyectado como ejes x e y respectivamente.

source: 1D histogram of the ratio of those distances (projected / original).
es_es: Histograma 1D de la razón de esas distancias (proyectada / original).

source: Out:
es_es: Salida:

source: We can see that for low values of ``n_components`` the distribution is wide with many distorted pairs and a skewed distribution (due to the hard limit of zero ratio on the left as distances are always positives) while for larger values of n_components the distortion is controlled and the distances are well preserved by the random projection.
es_es: Podemos ver que para valores bajos de ``n_components`` la distribución es amplia con muchos pares distorsionados y una distribución sesgada (debido al límite estricto de la relación cero a la izquierda ya que las distancias son siempre positivas) mientras que para valores mayores que n_components la distorsión está controlada y las distancias están bien conservadas por la proyección aleatoria.

source: Remarks
es_es: Observaciones

source: According to the JL lemma, projecting 500 samples without too much distortion will require at least several thousands dimensions, irrespective of the number of features of the original dataset.
es_es: Según el lema JL, proyectar 500 muestras sin demasiada distorsión requerirá al menos varias miles de dimensiones, independientemente del número de características del conjunto de datos original.

source: Hence using random projections on the digits dataset which only has 64 features in the input space does not make sense: it does not allow for dimensionality reduction in this case.
es_es: Por lo tanto, utilizar proyecciones aleatorias en el conjunto de datos de los dígitos, que sólo tiene 64 características en el espacio de entrada, no tiene sentido: no permite reducir la dimensionalidad en este caso.

source: On the twenty newsgroups on the other hand the dimensionality can be decreased from 56436 down to 10000 while reasonably preserving pairwise distances.
es_es: Por otro lado, en los veinte grupos de noticias la dimensionalidad puede reducirse de 56436 a 10000 preservando razonablemente las distancias entre pares.

source: **Total running time of the script:** ( 0 minutes 20.243 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 20,243 segundos)

source: :download:`Download Python source code: plot_johnson_lindenstrauss_bound.py <plot_johnson_lindenstrauss_bound.py>`
es_es: :download:`Descargar el código fuente de Python: plot_johnson_lindenstrauss_bound.py <plot_johnson_lindenstrauss_bound.py>`

source: :download:`Download Jupyter notebook: plot_johnson_lindenstrauss_bound.ipynb <plot_johnson_lindenstrauss_bound.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_johnson_lindenstrauss_bound.ipynb <plot_johnson_lindenstrauss_bound.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
