Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/oas-function.po
Languages: es_es

source: Estimate covariance with the Oracle Approximating Shrinkage algorithm.
es_es: Estima la covarianza con el algoritmo Oracle Approximating Shrinkage.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Data from which to compute the covariance estimate.
es_es: Datos a partir de los cuales se calcula la estimación de la covarianza.

source: If True, data will not be centered before computation. Useful to work with data whose mean is significantly equal to zero but is not exactly zero. If False, data will be centered before computation.
es_es: Si es True, los datos no se centrarán antes del cálculo. Útil para trabajar con datos cuya media es significativamente igual a cero pero no es exactamente cero. Si es False, los datos se centrarán antes del cálculo.

source: Returns
es_es: Devuelve

source: array-like of shape (n_features, n_features)
es_es: array-like de forma (n_features, n_features)

source: Shrunk covariance.
es_es: Covarianza reducida.

source: Coefficient in the convex combination used for the computation of the shrunk estimate.
es_es: Coeficiente en la combinación convexa utilizada para el cálculo de la estimación reducida.

source: Notes
es_es: Notas

source: The regularised (shrunk) covariance is:
es_es: La covarianza regularizada (reducida) es:

source: where mu = trace(cov) / n_features
es_es: donde mu = trace(cov) / n_features

source: The formula we used to implement the OAS is slightly modified compared to the one given in the article. See :class:`OAS` for more details.
es_es: La fórmula que hemos utilizado para implementar el OAS está ligeramente modificada en comparación con la que se da en el artículo. Consulta :class:`OAS` para obtener más detalles.
