Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_extraction.image.extract_patches_2d.po
Languages: es_es

source: Reshape a 2D image into a collection of patches
es_es: Reforma una imagen 2D en una colección de fragmentos

source: The resulting patches are allocated in a dedicated array.
es_es: Los fragmentos resultantes se asignan en un arreglo dedicado.

source: Read more in the :ref:`User Guide <image_feature_extraction>`.
es_es: Lee más en el :ref:`Manual de usuario <image_feature_extraction>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (image_height, image_width) or (image_height, image_width, n_channels)
es_es: ndarray de forma (image_height, image_width) o (image_height, image_width, n_channels)

source: The original image data. For color images, the last dimension specifies the channel: a RGB image would have `n_channels=3`.
es_es: Los datos de la imagen original. Para las imágenes en color, la última dimensión especifica el canal: una imagen RGB tendría `n_canales=3`.

source: tuple of int (patch_height, patch_width)
es_es: tuple de int (patch_height, patch_width)

source: The dimensions of one patch.
es_es: Las dimensiones de un fragmento.

source: int or float, default=None
es_es: int o float, default=None

source: The maximum number of patches to extract. If `max_patches` is a float between 0 and 1, it is taken to be a proportion of the total number of patches.
es_es: El número máximo de fragmentos a extraer. Si `max_patches` es un número de punto flotante (float) entre 0 y 1, se toma como una proporción del número total de fragmentos.

source: Determines the random number generator used for random sampling when `max_patches` is not None. Use an int to make the randomness deterministic. See :term:`Glossary <random_state>`.
es_es: Determina el generador de números aleatorios utilizado para el muestreo aleatorio cuando `max_patches` no es None. Utiliza un número entero (int) para que la aleatoriedad sea determinista. Mira el :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: array of shape (n_patches, patch_height, patch_width) or (n_patches, patch_height, patch_width, n_channels)
es_es: array de la forma (n_patches, patch_height, patch_width) o (n_patches, patch_height, patch_width, n_channels)

source: The collection of patches extracted from the image, where `n_patches` is either `max_patches` or the total number of patches that can be extracted.
es_es: La colección de fragmentos extraídos de la imagen, donde `n_patches` es `max_patches` o el número total de fragmentos que se pueden extraer.

source: Examples
es_es: Ejemplos
