Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.davies_bouldin_score.po
Languages: es_es

source: Computes the Davies-Bouldin score.
es_es: Calcula la puntuación Davies-Bouldin.

source: The score is defined as the average similarity measure of each cluster with its most similar cluster, where similarity is the ratio of within-cluster distances to between-cluster distances. Thus, clusters which are farther apart and less dispersed will result in a better score.
es_es: La puntuación se define como la medida de similitud media de cada conglomerado con su conglomerado más similar, donde la similitud es la relación entre las distancias dentro-de-conglomerado y las distancias entre-conglomerados. Así, las agrupaciones que están más separadas y menos dispersas resultarán en una mejor puntuación.

source: The minimum score is zero, with lower values indicating better clustering.
es_es: La puntuación mínima es cero, con valores más bajos indicando una mejor agrupación.

source: Read more in the :ref:`User Guide <davies-bouldin_index>`.
es_es: Más información en el :ref:`Manual de usuario <davies-bouldin_index>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples, n_features)
es_es: tipo de arreglo de forma (n_samples, n_features)

source: A list of ``n_features``-dimensional data points. Each row corresponds to a single data point.
es_es: Una lista de puntos de datos de ``n_features`` dimensiones. Cada fila corresponde a un único punto de datos.

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: Predicted labels for each sample.
es_es: Etiquetas predichas para cada muestra.

source: Returns
es_es: Devuelve

source: score: float
es_es: puntuación: flotante

source: The resulting Davies-Bouldin score.
es_es: La puntuación resultante Davies-Bouldin.

source: References
es_es: Referencias
