Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.silhouette_score.po
Languages: es_es

source: Compute the mean Silhouette Coefficient of all samples.
es_es: Calcula el Coeficiente de Silueta medio de todas las muestras.

source: The Silhouette Coefficient is calculated using the mean intra-cluster distance (``a``) and the mean nearest-cluster distance (``b``) for each sample. The Silhouette Coefficient for a sample is ``(b - a) / max(a, b)``. To clarify, ``b`` is the distance between a sample and the nearest cluster that the sample is not a part of. Note that Silhouette Coefficient is only defined if number of labels is ``2 <= n_labels <= n_samples - 1``.
es_es: El Coeficiente de Silueta se calcula utilizando la distancia media dentro del conglomerado (``a``) y la distancia media entre conglomerados más cercanos (``b``) para cada muestra. El Coeficiente de Silueta de una muestra es ``(b - a) / max(a, b)``. Para aclarar, ``b`` es la distancia entre una muestra y el conglomerado más cercano que no forma parte la muestra. Ten en cuenta que el Coeficiente de Silueta sólo se define si el número de etiquetas es ``2 <= n_labels <= n_samples - 1``.

source: This function returns the mean Silhouette Coefficient over all samples. To obtain the values for each sample, use :func:`silhouette_samples`.
es_es: Esta función devuelve el Coeficiente de Silueta medio sobre todas las muestras. Para obtener los valores de cada muestra, utiliza :func:`silhouette_samples`.

source: The best value is 1 and the worst value is -1. Values near 0 indicate overlapping clusters. Negative values generally indicate that a sample has been assigned to the wrong cluster, as a different cluster is more similar.
es_es: El mejor valor es 1 y el peor es -1. Los valores cercanos a 0 indican conglomerados superpuestos. Los valores negativos suelen indicar que una muestra ha sido asignada al conglomerado equivocado, ya que otro conglomerado es más similar.

source: Read more in the :ref:`User Guide <silhouette_coefficient>`.
es_es: Lee más en el :ref:`Manual de usuario <silhouette_coefficient>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples_a, n_samples_a) if metric == "precomputed" or (n_samples_a, n_features) otherwise
es_es: array-like de forma (n_samples_a, n_samples_a) si metric == "precomputed" o (n_samples_a, n_features) en caso contrario

source: An array of pairwise distances between samples, or a feature array.
es_es: Un arreglo de distancias entre pares de muestras, o un arreglo de características.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Predicted labels for each sample.
es_es: Etiquetas predichas para cada muestra.

source: str or callable, default='euclidean'
es_es: cadena o invocable, default='euclidean'

source: The metric to use when calculating distance between instances in a feature array. If metric is a string, it must be one of the options allowed by :func:`metrics.pairwise.pairwise_distances <sklearn.metrics.pairwise.pairwise_distances>`. If ``X`` is the distance array itself, use ``metric="precomputed"``.
es_es: La métrica a utilizar cuando se calcula la distancia entre instancias en un arreglo de características. Si la métrica es una cadena, debe ser una de las opciones permitidas por :func:`metrics.pairwise.pairwise_distances <sklearn.metrics.pairwise.pairwise_distances>`. Si ``X`` es el propio arreglo de distancias, utiliza ``metric="precomputed"``.

source: The size of the sample to use when computing the Silhouette Coefficient on a random subset of the data. If ``sample_size is None``, no sampling is used.
es_es: El tamaño de la muestra que se utilizará para calcular el Coeficiente de Silueta en un subconjunto aleatorio de los datos. Si ``sample_size is None``, no se utiliza el muestreo.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Determines random number generation for selecting a subset of samples. Used when ``sample_size is not None``. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para seleccionar un subconjunto de muestras. Se utiliza cuando ``sample_size is not None``. Pasa un número entero (int) para obtener resultados reproducibles en varias invocaciones a la función. Ver :term:`Glosario <random_state>`.

source: Any further parameters are passed directly to the distance function. If using a scipy.spatial.distance metric, the parameters are still metric dependent. See the scipy docs for usage examples.
es_es: Cualquier parámetro adicional se pasa directamente a la función de distancia. Si utilizas una métrica scipy.spatial.distance, los parámetros siguen siendo dependientes de la métrica. Consulta los documentos scipy para ver ejemplos de uso.

source: Returns
es_es: Devuelve

source: Mean Silhouette Coefficient for all samples.
es_es: Coeficiente de Silueta medio para todas las muestras.

source: References
es_es: Referencias

source: `Wikipedia entry on the Silhouette Coefficient <https://en.wikipedia.org/wiki/Silhouette_(clustering)>`_
es_es: `Entrada de Wikipedia en el Coeficiente de Silhouette <https://en.wikipedia.org/wiki/Silhouette_(clustering)>`_

source: Examples using ``sklearn.metrics.silhouette_score``
es_es: Ejemplos utilizando ``sklearn.metrics.silhouette_score``
