Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.random_projection.SparseRandomProjection.po
Languages: es_es

source: Reduce dimensionality through sparse random projection.
es_es: Reduce la dimensionalidad mediante la proyección aleatoria dispersa.

source: Sparse random matrix is an alternative to dense random projection matrix that guarantees similar embedding quality while being much more memory efficient and allowing faster computation of the projected data.
es_es: La matriz aleatoria dispersa es una alternativa a la matriz de proyección aleatoria densa que garantiza una calidad de inserción(embedding) similar a la vez que es mucho más eficiente en términos de memoria y permite un cálculo más rápido de los datos proyectados.

source: If we note `s = 1 / density` the components of the random matrix are drawn from:
es_es: Si observamos `s = 1 / density` los componentes de la matriz aleatoria se extraen de:

source: -sqrt(s) / sqrt(n_components) with probability 1 / 2s
es_es: -sqrt(s) / sqrt(n_components) con probabilidad 1 / 2s

source: 0 with probability 1 - 1 / s
es_es: 0 con probabilidad 1 - 1 / s

source: +sqrt(s) / sqrt(n_components) with probability 1 / 2s
es_es: +sqrt(s) / sqrt(n_components) con probabilidad 1 / 2s

source: Read more in the :ref:`User Guide <sparse_random_matrix>`.
es_es: Más información en el :ref:`Manual de usuario <sparse_random_matrix>`.

source: Parameters
es_es: Parámetros

source: int or 'auto', default='auto'
es_es: int o 'auto', default='auto'

source: Dimensionality of the target projection space.
es_es: Dimensionalidad del espacio de proyección objetivo.

source: n_components can be automatically adjusted according to the number of samples in the dataset and the bound given by the Johnson-Lindenstrauss lemma. In that case the quality of the embedding is controlled by the ``eps`` parameter.
es_es: n_components puede ajustarse automáticamente según el número de muestras del conjunto de datos y el límite dado por el lema de Johnson-Lindenstrauss. En ese caso, la calidad de la inserción se controla con el parámetro ``eps``.

source: It should be noted that Johnson-Lindenstrauss lemma can yield very conservative estimated of the required number of components as it makes no assumption on the structure of the dataset.
es_es: Hay que tener en cuenta que el lema de Johnson-Lindenstrauss puede producir una estimación muy conservadora del número de componentes necesarios, ya que no hace ninguna suposición sobre la estructura del conjunto de datos.

source: float or 'auto', default='auto'
es_es: float o 'auto', default='auto'

source: Ratio in the range (0, 1] of non-zero component in the random projection matrix.
es_es: Razón en el rango (0, 1] del componente distinto de cero en la matriz de proyección aleatoria.

source: If density = 'auto', the value is set to the minimum density as recommended by Ping Li et al.: 1 / sqrt(n_features).
es_es: Si density = 'auto', el valor se establece en la densidad mínima recomendada por Ping Li et al: 1 / sqrt(n_features).

source: Use density = 1 / 3.0 if you want to reproduce the results from Achlioptas, 2001.
es_es: Utiliza density = 1 / 3,0 si deseas reproducir los resultados de Achlioptas, 2001.

source: Parameter to control the quality of the embedding according to the Johnson-Lindenstrauss lemma when n_components is set to 'auto'. This value should be strictly positive.
es_es: Parámetro para controlar la calidad de la inserción según el lema de Johnson-Lindenstrauss cuando n_components se establece en 'auto'. Este valor debe ser estrictamente positivo.

source: Smaller values lead to better embedding and higher number of dimensions (n_components) in the target projection space.
es_es: Los valores más pequeños conducen a una mejor inserción y a un mayor número de dimensiones (n_components) en el espacio de proyección objetivo.

source: If True, ensure that the output of the random projection is a dense numpy array even if the input and random projection matrix are both sparse. In practice, if the number of components is small the number of zero components in the projected data will be very small and it will be more CPU and memory efficient to use a dense representation.
es_es: Si es True, asegura que la salida de la proyección aleatoria es un arreglo numpy denso incluso si la matriz de entrada y la de proyección aleatoria son ambas dispersas. En la práctica, si el número de componentes es pequeño, el número de componentes cero en los datos proyectados será muy pequeño y será más eficiente para la CPU y la memoria utilizar una representación densa.

source: If False, the projected data uses a sparse representation if the input is sparse.
es_es: Si es False, los datos proyectados utilizan una representación dispersa si la entrada es dispersa.

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, default=None

source: Controls the pseudo random number generator used to generate the projection matrix at fit time. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Controla el generador de números pseudoaleatorios utilizado para generar la matriz de proyección en el momento del ajuste. Pase un int para una salida reproducible a través de múltiples llamadas a la función. Véase :term:`Glosario <random_state>`.

source: Attributes
es_es: Atributos

source: Concrete number of components computed when n_components="auto".
es_es: Número concreto de componentes calculado cuando n_components="auto".

source: sparse matrix of shape (n_components, n_features)
es_es: sparse matrix de forma (n_components, n_features)

source: Random matrix used for the projection. Sparse matrix will be of CSR format.
es_es: Matriz aleatoria utilizada para la proyección. La matriz dispersa tendrá el formato CSR.

source: float in range 0.0 - 1.0
es_es: float en el rango 0.0 - 1.0

source: Concrete density computed from when density = "auto".
es_es: Densidad concreta calculada cuando density = "auto".

source: References
es_es: Referencias

source: Ping Li, T. Hastie and K. W. Church, 2006, "Very Sparse Random Projections". https://web.stanford.edu/~hastie/Papers/Ping/KDD06_rp.pdf
es_es: Ping Li, T. Hastie y K. W. Church, 2006, "Very Sparse Random Projections". https://web.stanford.edu/~hastie/Papers/Ping/KDD06_rp.pdf

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Generate a sparse random projection matrix.
es_es: Genera una matriz de proyección aleatoria dispersa.

source: Fit to data, then transform it.
es_es: Ajusta los datos y luego los transforma.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Project the data by using matrix product with the random matrix
es_es: Proyecta los datos mediante el producto de matrices con la matriz aleatoria

source: {ndarray, sparse matrix} of shape (n_samples, n_features)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_features)

source: Training set: only the shape is used to find optimal random matrix dimensions based on the theory referenced in the afore mentioned papers.
es_es: Conjunto de entrenamiento: sólo se utiliza shape para encontrar las dimensiones óptimas de la matriz aleatoria basándose en la teoría referida en los artículos mencionados anteriormente.

source: Ignored
es_es: Ignorado

source: Returns
es_es: Devuelve

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: array ndarray de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: The input data to project into a smaller dimensional space.
es_es: Los datos de entrada para proyectar en un espacio de menor dimensión.

source: {ndarray, sparse matrix} of shape (n_samples, n_components)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_components)

source: Projected array.
es_es: Arreglo proyectado.

source: Examples using ``sklearn.random_projection.SparseRandomProjection``
es_es: Ejemplos utilizando ``sklearn.random_projection.SparseRandomProjection``
