Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.GradientBoostingClassifier.po
Languages: es_es

source: The decision function of the input samples, which corresponds to the raw values predicted from the trees of the ensemble . The order of the classes corresponds to that in the attribute :term:`classes_`. Regression and binary classification produce an array of shape (n_samples,).
es_es: La función de decisión de las meustras de entrada, que corresponde a los valores en bruto predichos desde los árboles del ensemble. El ordén de las clases corresponde a aquel en el atributo :term:`classes_`. La regresión y la clasificación binaria producen un arreglo de forma (n_samples,).

source: The higher, the more important the feature. The importance of a feature is computed as the (normalized) total reduction of the criterion brought by that feature. It is also known as the Gini importance.
es_es: Cuanto más alto, más importante sera la característica. La importancia de una característica se calcula como la reducción total (normalizada) del criterio traído por esa función. También se le conoce como la importancia de Gini.

source: Warning: impurity-based feature importances can be misleading for high cardinality features (many unique values). See :func:`sklearn.inspection.permutation_importance` as an alternative.
es_es: Advertencia: las importancias de característica basadas en la impureza pueden ser engañosas para las características de alta cardinalidad (muchos valores únicos). Vea :func:`sklearn.inspection.permutation_importance` como una alternativa.

source: The values of this array sum to 1, unless all trees are single node trees consisting of only the root node, in which case it will be an array of zeros.
es_es: Los valores de este arreglo suman a 1, a menos que todos los árboles sean árboles de nodos individuales consistiendo de solo el nodo raíz, en cuyo caso sera un arreglo de ceros.

source: array-like of shape (n_samples,)
es_es: tipo arreglo de forma (n_samples,)

source: Target values (strings or integers in classification, real numbers in regression) For classification, labels must correspond to classes.
es_es: Valores objetivo (cadenas o enteros en clasificación, números reales en la regresión) Para la clasificación, las etiquetas deben corresponder a las clases.

source: array-like of shape (n_samples,), default=None
es_es: arreglo tipo de forma (n_samples,), default=None

source: Sample weights. If None, then samples are equally weighted. Splits that would create child nodes with net zero or negative weight are ignored while searching for a split in each node. In the case of classification, splits are also ignored if they would result in any single class carrying a negative weight in either child node.
es_es: Ponderados de muestra. Si es None, entonces las muestras están ponderadas de la misma manera. Divisiones que crearían nodos hijos con ponderado neto cero o negativo son ignoradas al buscar una división en cada nodo. En el caso de la clasificación, las divisiones también se ignoran si resultarían en cualquier clase individual llevando un ponderado negativo en cualquiera de los nodos hijos.

source: The monitor is called after each iteration with the current iteration, a reference to the estimator and the local variables of ``_fit_stages`` as keyword arguments ``callable(i, self, locals())``. If the callable returns ``True`` the fitting procedure is stopped. The monitor can be used for various things such as computing held-out estimates, early stopping, model introspect, and snapshoting.
es_es: El monitor es llamado después de cada iteración con la iteración actual, una referencia al estimador y a las variables locales de ``_fit_stages`` como argumentos de palabra clave ``callable(i, self, locals())``. Si el invocable devuelve ``True`` el procedimiento de ajuste se detiene. El monitor puede ser utilizado para varias cosas como calcular estimados apartados, parada anticipada, introspección del modelo, y snapshoting.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The predicted values.
es_es: Los valores previstos.

source: ndarray of shape (n_samples, n_classes)
es_es: ndarray de forma (n_samples, n_classes)

source: The class log-probabilities of the input samples. The order of the classes corresponds to that in the attribute :term:`classes_`.
es_es: Las log-probabilidades de clase de las muestras de entrada. El orden de las clases corresponde a aquel en el atributo :term:`classes_`.

source: Raises
es_es: Errores posibles

source: If the ``loss`` does not support probabilities.
es_es: Si el ``loss`` no soporta probabilidades.

source: The class probabilities of the input samples. The order of the classes corresponds to that in the attribute :term:`classes_`.
es_es: Las probabilidades de clase de las muestras de entrada. El orden de las clases corresponde a aquel en el atributo :term:`classes_`.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En clasificación multietiqueta, esta la precisión del subconjunto, una métrica exigente ya que requieres que cada conjunto de etiquetas sea predicho correctamente para cada muestra.

source: array-like of shape (n_samples, n_features)
es_es: tipo arreglo de forma (n_samples, n_features)

source: Test samples.
es_es: Muestras de prueba.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas verdaderas para X`.

source: Sample weights.
es_es: Ponderados de muestras.

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con relación a `y`.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: This method allows monitoring (i.e. determine error on testing set) after each stage.
es_es: Este método permite el monitoreo (es decir, determinar el error en el conjunto de pruebas) después de cada etapa.

source: generator of ndarray of shape (n_samples, k)
es_es: generador de ndarray de forma (n_samples, k)

source: The decision function of the input samples, which corresponds to the raw values predicted from the trees of the ensemble . The classes corresponds to that in the attribute :term:`classes_`. Regression and binary classification are special cases with ``k == 1``, otherwise ``k==n_classes``.
es_es: La función de decisión de las meustras de entrada, que corresponde a los valores en bruto predichos de los árboles del ensemble. Las clases corresponden a aquellas en el atributo :term:`classes_`. La regresión y la clasificación binaria son casos especiales con ``k == 1``, de lo contrario ``k==n_classes``.

source: generator of ndarray of shape (n_samples,)
es_es: generador de ndarray de forma (n_samples,)

source: The predicted value of the input samples.
es_es: El valor predicho de las muestras de entrada.

source: Examples using ``sklearn.ensemble.GradientBoostingClassifier``
es_es: Ejemplos usando ``sklearn.ensemble.GradientBoostingClassifier``
