Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.HalvingRandomSearchCV.po
Languages: es_es

source: Randomized search on hyper parameters.
es_es: Búsqueda aleatoria de hiperparámetros.

source: The search strategy starts evaluating all the candidates with a small amount of resources and iteratively selects the best candidates, using more and more resources.
es_es: La estrategia de búsqueda comienza a evaluar todos los candidatos con una pequeña cantidad de recursos y selecciona iterativamente los mejores candidatos, utilizando cada vez más recursos.

source: The candidates are sampled at random from the parameter space and the number of sampled candidates is determined by ``n_candidates``.
es_es: Los candidatos se muestrean de forma aleatoria del espacio de parámetros y el número de candidatos muestreados se determina por ``n_candidates``.

source: Read more in the :ref:`User guide<successive_halving_user_guide>`.
es_es: Lee más en el :ref:`Manual del usuario <successive_halving_user_guide>`.

source: This estimator is still **experimental** for now: the predictions and the API might change without any deprecation cycle. To use it, you need to explicitly import ``enable_halving_search_cv``::
es_es: Este estimador es todavía **experimental** por ahora: las predicciones y la API podrían cambiar sin ningún ciclo de obsolescencia. Para utilizarlo, es necesario importar explícitamente ``enable_halving_search_cv``::

source: Parameters
es_es: Parámetros

source: This is assumed to implement the scikit-learn estimator interface. Either estimator needs to provide a ``score`` function, or ``scoring`` must be passed.
es_es: Se supone que implementa la interfaz del estimador de scikit-learn. O bien el estimador necesita proporcionar una función ``score``, o se debe pasar ``scoring``.

source: Dictionary with parameters names (string) as keys and distributions or lists of parameters to try. Distributions must provide a ``rvs`` method for sampling (such as those from scipy.stats.distributions). If a list is given, it is sampled uniformly.
es_es: Diccionario con nombres de parámetros (cadenas) como claves y distribuciones o listas de parámetros a probar. Las distribuciones deben proporcionar un método ``rvs`` para el muestreo (como los de scipy.stats.distributions). Si se da una lista, se muestrea uniformemente.

source: The number of candidate parameters to sample, at the first iteration. Using 'exhaust' will sample enough candidates so that the last iteration uses as many resources as possible, based on `min_resources`, `max_resources` and `factor`. In this case, `min_resources` cannot be 'exhaust'.
es_es: El número de parámetros candidatos a muestrear, en la primera iteración. Si se utiliza 'exhaust' se muestrearán suficientes candidatos para que la última iteración utilice tantos recursos como sea posible, basándose en `min_resources`, `max_resources` y `factor`. En este caso, `min_resources` no puede ser 'exhaust'.

source: int or float, default=3
es_es: int o float, default=3

source: The 'halving' parameter, which determines the proportion of candidates that are selected for each subsequent iteration. For example, ``factor=3`` means that only one third of the candidates are selected.
es_es: El parámetro 'halving', que determina la proporción de candidatos que se seleccionan en cada iteración posterior. Por ejemplo, ``factor=3`` significa que sólo se selecciona un tercio de los candidatos.

source: **resource** : ``'n_samples'`` or str, default='n_samples'
es_es: **resource** : ``'n_samples'`` o str, default='n_samples'

source: 'n_samples' or str, default='n_samples'
es_es: 'n_samples' o str, default='n_samples'

source: Defines the resource that increases with each iteration. By default, the resource is the number of samples. It can also be set to any parameter of the base estimator that accepts positive integer values, e.g. 'n_iterations' or 'n_estimators' for a gradient boosting estimator. In this case ``max_resources`` cannot be 'auto' and must be set explicitly.
es_es: Define el recurso que aumenta con cada iteración. Por defecto, el recurso es el número de muestras. También puede establecerse en cualquier parámetro del estimador base que acepte valores enteros positivos, por ejemplo, 'n_iterations' o 'n_estimators' para un estimador de potenciación de gradiente. En este caso, ``max_resources`` no puede ser 'auto' y debe establecerse explícitamente.

source: The maximum number of resources that any candidate is allowed to use for a given iteration. By default, this is set ``n_samples`` when ``resource='n_samples'`` (default), else an error is raised.
es_es: El número máximo de recursos que se permite utilizar a cualquier candidato para una iteración determinada. Por defecto, se establece en ``n_samples`` cuando ``resource='n_samples'`` (por defecto), de lo contrario se produce un error.

source: {'exhaust', 'smallest'} or int, default='smallest'
es_es: {'exhaust', 'smallest'} o int, default='smallest'

source: The minimum amount of resource that any candidate is allowed to use for a given iteration. Equivalently, this defines the amount of resources `r0` that are allocated for each candidate at the first iteration.
es_es: La cantidad mínima de recursos que cualquier candidato puede utilizar en una iteración determinada. Equivalentemente, define la cantidad de recursos `r0` que se asigna a cada candidato en la primera iteración.

source: 'smallest' is a heuristic that sets `r0` to a small value:
es_es: 'smallest' es una heurística que establece `r0` en un valor pequeño:

source: ``n_splits * 2`` when ``resource='n_samples'`` for a regression
es_es: ``n_splits * 2`` cuando ``resource='n_samples'`` para una regresión

source: problem
es_es: problema

source: ``n_classes * n_splits * 2`` when ``resource='n_samples'`` for a
es_es: ``n_classes * n_splits * 2`` cuando ``resource='n_samples'`` para un

source: classification problem
es_es: problema de clasificación

source: ``1`` when ``resource != 'n_samples'``
es_es: ``1`` cuando ``resource != 'n_samples'``

source: 'exhaust' will set `r0` such that the **last** iteration uses as much resources as possible. Namely, the last iteration will use the highest value smaller than ``max_resources`` that is a multiple of both ``min_resources`` and ``factor``. In general, using 'exhaust' leads to a more accurate estimator, but is slightly more time consuming. 'exhaust' isn't available when `n_candidates='exhaust'`.
es_es: 'exhaust' establecerá "r0" de forma que la **última** iteración utilice tantos recursos como sea posible. Es decir, la última iteración utilizará el mayor valor menor que ``max_resources`` que sea múltiplo de ``min_resources`` y ``factor``. En general, el uso de 'exhaust' conduce a un estimador más preciso, pero consumpero es ligeramente más lento. El uso de 'exhaust' no está disponible cuando `n_candidates='exhaust'`.

source: Note that the amount of resources used at each iteration is always a multiple of ``min_resources``.
es_es: Ten en cuenta que la cantidad de recursos utilizados en cada iteración es siempre un múltiplo de ``min_resources``.

source: This is only relevant in cases where there isn't enough resources to reduce the remaining candidates to at most `factor` after the last iteration. If ``True``, then the search process will 'replay' the first iteration for as long as needed until the number of candidates is small enough. This is ``False`` by default, which means that the last iteration may evaluate more than ``factor`` candidates. See :ref:`aggressive_elimination` for more details.
es_es: Esto sólo es relevante en los casos en los que no hay suficientes recursos para reducir los candidatos restantes a un máximo de `factor` después de la última iteración. Si es ``True``, el proceso de búsqueda 'repetirá' la primera iteración durante el tiempo necesario hasta que el número de candidatos sea lo suficientemente pequeño. Por defecto es ``False``, lo que significa que la última iteración puede evaluar más candidatos que ``factor``. Consulta :ref:`aggressive_elimination` para más detalles.

source: int, cross-validation generator or an iterable, default=5
es_es: int, generador de validación cruzada o un iterable, default=5

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de división de la validación cruzada. Las posibles entradas para cv son:

source: integer, to specify the number of folds in a `(Stratified)KFold`,
es_es: entero, para especificar el número de pliegues en un `(Stratified)KFold`,

source: :term:`CV splitter`,
es_es: :term:`separador de CV`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce divisiones (train, test) como arreglos de índices.

source: For integer/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas enteras/None, si el estimador es un clasificador e ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta el :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: Due to implementation details, the folds produced by `cv` must be the same across multiple calls to `cv.split()`. For built-in `scikit-learn` iterators, this can be achieved by deactivating shuffling (`shuffle=False`), or by setting the `cv`'s `random_state` parameter to an integer.
es_es: Debido a los detalles de implementación, los pliegues producidos por `cv` deben ser los mismos a través de múltiples invocaciones a `cv.split()`. Para los iteradores incorporados de `scikit-learn`, esto se puede lograr desactivando el mezclado (`shuffle=False`), o estableciendo el parámetro `random_state` de `cv` en un número entero.

source: string, callable, or None, default=None
es_es: string, invocable, o None, default=None

source: A single string (see :ref:`scoring_parameter`) or a callable (see :ref:`scoring`) to evaluate the predictions on the test set. If None, the estimator's score method is used.
es_es: Una sola cadena (ver :ref:`scoring_parameter`) o un invocable "callable" (ver :ref:`scoring`) para evaluar las predicciones en el conjunto de pruebas. Si es None, se utiliza el método score del estimador.

source: If True, refit an estimator using the best found parameters on the whole dataset.
es_es: Si es True, reajusta un estimador utilizando los mejores parámetros encontrados en todo el conjunto de datos.

source: The refitted estimator is made available at the ``best_estimator_`` attribute and permits using ``predict`` directly on this ``HalvingRandomSearchCV`` instance.
es_es: El estimador reajustado está disponible en el atributo ``best_estimator_`` y permite utilizar ``predict`` directamente en esta instancia ``HalvingRandomSearchCV``.

source: 'raise' or numeric
es_es: 'raise' o numeric

source: Value to assign to the score if an error occurs in estimator fitting. If set to 'raise', the error is raised. If a numeric value is given, FitFailedWarning is raised. This parameter does not affect the refit step, which will always raise the error. Default is ``np.nan``
es_es: Valor para asignar a la puntuación (score) si se produce un error en el ajuste del estimador. Si se establece en 'raise', se genera un error. Si se da un valor numérico, se genera FitFailedWarning. Este parámetro no afecta al paso de reajuste, que siempre generará el error. Por defecto es ``np.nan``

source: If ``False``, the ``cv_results_`` attribute will not include training scores. Computing training scores is used to get insights on how different parameter settings impact the overfitting/underfitting trade-off. However computing the scores on the training set can be computationally expensive and is not strictly required to select the parameters that yield the best generalization performance.
es_es: Si es ``False``, el atributo ``cv_results_`` no incluirá las puntuaciones de entrenamiento. El cálculo de las puntuaciones de entrenamiento se utiliza para obtener información sobre el impacto de los diferentes ajustes de los parámetros en el equilibrio entre sobreajuste/subajuste. Sin embargo, calcular las puntuaciones en el conjunto de entrenamiento puede ser costoso computacionalmente y no es estrictamente necesario para seleccionar los parámetros que producen el mejor rendimiento de generalización.

source: int, RandomState instance or None, default=None
es_es: int, RandomState instance o None, default=None

source: Pseudo random number generator state used for subsampling the dataset when `resources != 'n_samples'`. Also used for random uniform sampling from lists of possible values instead of scipy.stats distributions. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Estado del generador de números pseudoaleatorios utilizado para el submuestreo del conjunto de datos cuando `resources != 'n_samples'`. También se utiliza para el muestreo uniforme aleatorio de las listas de valores posibles en lugar de las distribuciones de scipy.stats. Pasa un número entero (int) para una salida reproducible a través de múltiples invocaiones a la función. Ver :term:`Glosario <random_state>`.

source: int or None, default=None
es_es: int o None, default=None

source: Number of jobs to run in parallel. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa utilizar todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: Controls the verbosity: the higher, the more messages.
es_es: Controla la verbosidad: cuanto más alta, más mensajes.

source: Attributes
es_es: Atributos

source: list of int
es_es: list de int

source: The amount of resources used at each iteration.
es_es: La cantidad de recursos utilizados en cada iteración.

source: The number of candidate parameters that were evaluated at each iteration.
es_es: El número de parámetros candidatos que se evaluaron en cada iteración.

source: The number of candidate parameters that are left after the last iteration. It corresponds to `ceil(n_candidates[-1] / factor)`
es_es: El número de parámetros candidatos que quedan después de la última iteración. Corresponde a `ceil(n_candidates[-1] / factor)`

source: The maximum number of resources that any candidate is allowed to use for a given iteration. Note that since the number of resources used at each iteration must be a multiple of ``min_resources_``, the actual number of resources used at the last iteration may be smaller than ``max_resources_``.
es_es: El número máximo de recursos que cualquier candidato puede utilizar en una iteración determinada. Ten en cuenta que, dado que el número de recursos utilizados en cada iteración debe ser un múltiplo de ``min_resources_``, el número real de recursos utilizados en la última iteración puede ser menor que ``max_resources_``.

source: The amount of resources that are allocated for each candidate at the first iteration.
es_es: La cantidad de recursos que se asignan a cada candidato en la primera iteración.

source: The actual number of iterations that were run. This is equal to ``n_required_iterations_`` if ``aggressive_elimination`` is ``True``. Else, this is equal to ``min(n_possible_iterations_, n_required_iterations_)``.
es_es: El número real de iteraciones que se ejecutaron. Es igual a ``n_required_iterations_`` si ``aggressive_elimination`` es ``True``. De lo contrario, es igual a ``min(n_possible_iterations_, n_required_iterations_)``.

source: The number of iterations that are possible starting with ``min_resources_`` resources and without exceeding ``max_resources_``.
es_es: El número de iteraciones que son posibles comenzando con los recursos ``min_resources_`` y sin superar los recursos ``max_resources_``.

source: The number of iterations that are required to end up with less than ``factor`` candidates at the last iteration, starting with ``min_resources_`` resources. This will be smaller than ``n_possible_iterations_`` when there isn't enough resources.
es_es: El número de iteraciones que se requieren para terminar con menos de ``factor`` candidatos en la última iteración, comenzando con ``min_resources_`` recursos. Será menor que ``n_possible_iterations_`` cuando no haya suficientes recursos.

source: dict of numpy (masked) ndarrays
es_es: dict de numpy (masked) ndarrays

source: A dict with keys as column headers and values as columns, that can be imported into a pandas ``DataFrame``. It contains many informations for analysing the results of a search. Please refer to the :ref:`User guide<successive_halving_cv_results>` for details.
es_es: Un diccionario (dict) con claves como cabeceras de columna y valores como columnas, que puede ser importado en un ``DataFrame`` de pandas. Contiene mucha información para analizar los resultados de una búsqueda. Por favor, consulta el :ref:`Manual de Usuario<successive_halving_cv_results>` para más detalles.

source: estimator or dict
es_es: estimator o dict

source: Estimator that was chosen by the search, i.e. estimator which gave highest score (or smallest loss if specified) on the left out data. Not available if ``refit=False``.
es_es: Estimador que fue elegido por la búsqueda, es decir, el estimador que dio la puntuación más alta (o la pérdida más pequeña si se especifica) en los datos omitidos. No está disponible si ``refit = False``'.

source: Mean cross-validated score of the best_estimator.
es_es: Puntuación media de la validación cruzada del mejor estimador (best_estimator).

source: Parameter setting that gave the best results on the hold out data.
es_es: Configuración del parámetro que dio los mejores resultados en los datos retenidos.

source: The index (of the ``cv_results_`` arrays) which corresponds to the best candidate parameter setting.
es_es: El índice (de los arreglos ``cv_results_``) que corresponde a la mejor configuración del parámetro candidato.

source: The dict at ``search.cv_results_['params'][search.best_index_]`` gives the parameter setting for the best model, that gives the highest mean score (``search.best_score_``).
es_es: El diccionario (dict) en ``search.cv_results_['params'][search.best_index_]`` da la configuración de parámetros para el mejor modelo, que da la puntuación media más alta (``search.best_score_``).

source: function or a dict
es_es: function o un dict

source: Scorer function used on the held out data to choose the best parameters for the model.
es_es: Función de puntuación utilizada en los datos retenidos para elegir los mejores parámetros para el modelo.

source: The number of cross-validation splits (folds/iterations).
es_es: El número de divisiones de la validación cruzada (pliegues/iteraciones).

source: Seconds used for refitting the best model on the whole dataset.
es_es: Segundos utilizados para reajustar el mejor modelo en todo el conjunto de datos.

source: This is present only if ``refit`` is not False.
es_es: Esto está presente sólo si ``refit`` no es False.

source: Search over a grid of parameters using successive halving.
es_es: Búsqueda sobre una cuadrícula de parámetros utilizando una división sucesiva a la mitad.

source: Notes
es_es: Notas

source: The parameters selected are those that maximize the score of the held-out data, according to the scoring parameter.
es_es: Los parámetros seleccionados son los que maximizan la puntuación de los datos retenidos, según el parámetro de puntuación.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Call decision_function on the estimator with the best found parameters.
es_es: Invoca a decision_function en el estimador con los mejores parámetros encontrados.

source: Run fit with all sets of parameters.
es_es: Ejecuta el ajuste con todos los conjuntos de parámetros.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Call inverse_transform on the estimator with the best found params.
es_es: Invoca a inverse_transform en el estimador con los mejores parámetros encontrados.

source: Call predict on the estimator with the best found parameters.
es_es: Invoca a predict en el estimador con los mejores parámetros encontrados.

source: Call predict_log_proba on the estimator with the best found parameters.
es_es: Invoca a predict_log_proba en el estimador con los mejores parámetros encontrados.

source: Call predict_proba on the estimator with the best found parameters.
es_es: Invoca a predict_proba en el estimador con los mejores parámetros encontrados.

source: Returns the score on the given data, if the estimator has been refit.
es_es: Devuelve la puntuación en los datos dados, si el estimador ha sido reajustado.

source: Call score_samples on the estimator with the best found parameters.
es_es: Invoca a score_samples en el estimador con los mejores parámetros encontrados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Call transform on the estimator with the best found parameters.
es_es: Invoca a transform en el estimador con los mejores parámetros encontrados.

source: Only available if ``refit=True`` and the underlying estimator supports ``decision_function``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente admite ``decision_function``.

source: Must fulfill the input assumptions of the underlying estimator.
es_es: Debe cumplir los supuestos de entrada del estimador subyacente.

source: array-like, shape (n_samples, n_features)
es_es: array-like, forma (n_samples, n_features)

source: Training vector, where n_samples is the number of samples and n_features is the number of features.
es_es: Vector de entrenamiento, donde `n_samples` es el número de muestras y `n_features` es el número de características.

source: array-like, shape (n_samples,) or (n_samples, n_output), optional
es_es: array-like, forma (n_samples,) o (n_samples, n_output), opcional

source: Target relative to X for classification or regression; None for unsupervised learning.
es_es: Objetivo relativo a X para la clasificación o la regresión; None para el aprendizaje no supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`~sklearn.model_selection.GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia "Group" de :term:`cv` (por ejemplo, :class:`~sklearn.model_selection.GroupKFold`).

source: Parameters passed to the ``fit`` method of the estimator
es_es: Parámetros pasados al método ``fit`` del estimador

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Returns
es_es: Devuelve

source: Parameter names mapped to their values.
es_es: Nombres de los parámetros mapeados a sus valores.
