Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.decomposition.non_negative_factorization.po
Languages: es_es

source: Compute Non-negative Matrix Factorization (NMF).
es_es: Calcula la Matriz de Factorización no-negativa (NMF).

source: Find two non-negative matrices (W, H) whose product approximates the non- negative matrix X. This factorization can be used for example for dimensionality reduction, source separation or topic extraction.
es_es: Encuentra dos matrices no negativas (W, H) cuyo producto se aproxima a la matriz no negativa X. Esta factorización se puede utilizar, por ejemplo, para la reducción de la dimensionalidad, la separación de fuentes o la extracción de temas.

source: The objective function is:
es_es: La función objetivo es:

source: Where:
es_es: Donde:

source: :math:`||A||_{Fro}^2 = \sum_{i,j} A_{ij}^2` (Frobenius norm)
es_es: :math:`|A||_{Fro}^2 = \su_{i,j} A_{ij}^2` (Norma de Frobenius)

source: :math:`||vec(A)||_1 = \sum_{i,j} abs(A_{ij})` (Elementwise L1 norm)
es_es: :math:`||vec(A)||_1 = \sum_{i,j} abs(A_{ij})` (Norma Elemental L1)

source: For multiplicative-update ('mu') solver, the Frobenius norm :math:`(0.5 * ||X - WH||_{Fro}^2)` can be changed into another beta-divergence loss, by changing the beta_loss parameter.
es_es: Para el solucionador de actualización multiplicativa ('mu'), la norma de Frobenius :math:`(0.5 * ||X - WH||_{Fro}^2)` puede cambiarse por otra función de pérdida de beta-divergencia, cambiando el parámetro beta_loss.

source: The objective function is minimized with an alternating minimization of W and H. If H is given and update_H=False, it solves for W only.
es_es: La función objetivo se minimiza con una minimización alternativa de W y H. Si se da H y update_H=False, se resuelve sólo para W.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Constant matrix.
es_es: Matriz constante.

source: array-like of shape (n_samples, n_components), default=None
es_es: array-like de forma (n_samples, n_components), default=None

source: If init='custom', it is used as initial guess for the solution.
es_es: Si init='custom', se utiliza como conjetura inicial para la solución.

source: array-like of shape (n_components, n_features), default=None
es_es: array-like de forma (n_components, n_features), default=None

source: If init='custom', it is used as initial guess for the solution. If update_H=False, it is used as a constant, to solve for W only.
es_es: Si init='custom', se utiliza como conjetura inicial para la solución. Si update_H=False, se utiliza como una constante, para resolver sólo W.

source: Number of components, if n_components is not set all features are kept.
es_es: Número de componentes, si n_components no se establece se mantienen todas las características.

source: Method used to initialize the procedure.
es_es: Método utilizado para inicializar el procedimiento.

source: Valid options:
es_es: Opciones válidas:

source: None: 'nndsvd' if n_components < n_features, otherwise 'random'.
es_es: None: 'nndsvd' si n_components < n_features, en caso contrario 'random'.

source: 'random': non-negative random matrices, scaled with:
es_es: 'random': matrices aleatorias no negativas, escaladas con:

source: 'nndsvd': Nonnegative Double Singular Value Decomposition (NNDSVD)
es_es: 'nndsvd': Descomposición del valor singular doble no negativo (Nonnegative Double Singular Value Decomposition NNDSVD)

source: initialization (better for sparseness)
es_es: inicialización (mejor para la dispersión)

source: 'nndsvda': NNDSVD with zeros filled with the average of X
es_es: 'nndsvda': NNDSVD con ceros rellenados con el promedio de X

source: (better when sparsity is not desired)
es_es: (mejor cuando no se desea la dispersión)

source: 'nndsvdar': NNDSVD with zeros filled with small random values
es_es: 'nndsvdar': NNDSVD con ceros rellenados de pequeños valores aleatorios

source: (generally faster, less accurate alternative to NNDSVDa for when sparsity is not desired)
es_es: (alternativa generalmente más rápida y menos precisa a la NNDSVDa para cuando no se desea la dispersión)

source: 'custom': use custom matrices W and H if `update_H=True`. If `update_H=False`, then only custom matrix H is used.
es_es: 'custom': utilizar las matrices personalizadas W y H si `update_H=True`. Si `update_H=False`, entonces sólo se utiliza la matriz personalizada H.

source: The default value of `init` changed from 'random' to None in 0.23.
es_es: El valor por defecto de `init` cambió de 'random' a None en 0.23.

source: Set to True, both W and H will be estimated from initial guesses. Set to False, only W will be estimated.
es_es: Si se establece en True, tanto W como H se estimarán a partir de las conjeturas iniciales. Si se establece en False, sólo se estimará W.

source: Numerical solver to use:
es_es: Solucionador numérico a utilizar:

source: 'cd' is a Coordinate Descent solver that uses Fast Hierarchical
es_es: 'cd' es un solucionador de Descenso de Coordenadas que utiliza la Jerarquía Rápida

source: Alternating Least Squares (Fast HALS).
es_es: Mínimos cuadrados alternativos (HALS rápido).

source: 'mu' is a Multiplicative Update solver.
es_es: 'mu' es un solucionador de Actualización Multiplicativa.

source: Coordinate Descent solver.
es_es: Solucionador de Descenso de Coordenadas.

source: Multiplicative Update solver.
es_es: Solucionador de Actualización Multiplicativa.

source: float or {'frobenius', 'kullback-leibler', 'itakura-saito'}, default='frobenius'
es_es: float o {'frobenius', 'kullback-leibler', 'itakura-saito'}, default='frobenius'

source: Beta divergence to be minimized, measuring the distance between X and the dot product WH. Note that values different from 'frobenius' (or 2) and 'kullback-leibler' (or 1) lead to significantly slower fits. Note that for beta_loss <= 0 (or 'itakura-saito'), the input matrix X cannot contain zeros. Used only in 'mu' solver.
es_es: Se minimiza la Divergencia Beta, midiendo la distancia entre X y el producto punto WH. Ten en cuenta que los valores diferentes de 'frobenius' (o 2) y 'kullback-leibler' (o 1) conducen ajustes significativamente más lentos. Ten en cuenta que para beta_loss <= 0 (o 'itakura-saito'), la matriz de entrada X no puede contener ceros. Sólo se utiliza en el solucionador 'mu'.

source: Tolerance of the stopping condition.
es_es: Tolerancia de la condición de parada.

source: Maximum number of iterations before timing out.
es_es: Número máximo de iteraciones antes de que se agote el tiempo.

source: Constant that multiplies the regularization terms.
es_es: Constante que multiplica los términos de regularización.

source: The regularization mixing parameter, with 0 <= l1_ratio <= 1. For l1_ratio = 0 the penalty is an elementwise L2 penalty (aka Frobenius Norm). For l1_ratio = 1 it is an elementwise L1 penalty. For 0 < l1_ratio < 1, the penalty is a combination of L1 and L2.
es_es: El parámetro de mezcla de regularización, con 0 <= l1_ratio <= 1. Para l1_ratio = 0 la penalización es una penalización L2 por elementos (también conocida como Norma de Frobenius). Para l1_ratio = 1 es una penalización L1 por elementos. Para 0 < l1_ratio < 1, la penalización es una combinación de L1 y L2.

source: Select whether the regularization affects the components (H), the transformation (W), both or none of them.
es_es: Selecciona si la regularización afecta a los componentes (H), a la transformación (W), a ambos o a ninguno de ellos.

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, default=None

source: Used for NMF initialisation (when ``init`` == 'nndsvdar' or 'random'), and in Coordinate Descent. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Se utiliza para la inicialización del NMF (cuando ``init`` == 'nndsvdar' o 'random'), y en el Descenso de Coordenadas. Pasa un entero(int) para obtener resultados reproducibles a través de múltiples llamadas a la función. Véase :term:`Glosario <random_state>`.

source: The verbosity level.
es_es: El nivel de verbosidad.

source: If true, randomize the order of coordinates in the CD solver.
es_es: Si es verdadero (True), aleatoriza el orden de las coordenadas en el solucionador de CD.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples, n_components)
es_es: ndarray de forma (n_samples, n_components)

source: Solution to the non-negative least squares problem.
es_es: Solución al problema de mínimos cuadrados no negativos.

source: ndarray of shape (n_components, n_features)
es_es: ndarray de forma (n_components, n_features)

source: Actual number of iterations.
es_es: Número real de iteraciones.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos
