Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.top_k_accuracy_score.po
Languages: es_es

source: Top-k Accuracy classification score.
es_es: Puntuación de clasificación de Precisión Top-k.

source: This metric computes the number of times where the correct label is among the top `k` labels predicted (ranked by predicted scores). Note that the multilabel case isn't covered here.
es_es: Esta métrica calcula el número de veces en que la etiqueta correcta se encuentra entre las `k` mejores etiquetas predichas (clasificadas por las puntuaciones predichas). Ten en cuenta que el caso de multietiquetas no está cubierto aquí.

source: Read more in the :ref:`User Guide <top_k_accuracy_score>`
es_es: Lee más en el :ref:`Manual de usuario <top_k_accuracy_score>`

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: True labels.
es_es: Etiquetas verdaderas.

source: array-like of shape (n_samples,) or (n_samples, n_classes)
es_es: array-like de forma (n_samples,) o (n_samples, n_classes)

source: Target scores. These can be either probability estimates or non-thresholded decision values (as returned by :term:`decision_function` on some classifiers). The binary case expects scores with shape (n_samples,) while the multiclass case expects scores with shape (n_samples, n_classes). In the nulticlass case, the order of the class scores must correspond to the order of ``labels``, if provided, or else to the numerical or lexicographical order of the labels in ``y_true``.
es_es: Puntuaciones objetivo. Pueden ser estimaciones de probabilidad o valores de decisión sin umbral (como los devueltos por :term:`decision_function` en algunos clasificadores). El caso binario espera puntuaciones con forma (n_samples,) mientras que el caso multiclase espera puntuaciones con forma (n_samples, n_classes). En el caso multiclase, el orden de las puntuaciones de las clases debe corresponder al orden de ``labels``, si se proporciona, o bien al orden numérico o lexicográfico de las etiquetas en ``y_true``.

source: Number of most likely outcomes considered to find the correct label.
es_es: Número de resultados más probables considerados para encontrar la etiqueta correcta.

source: If `True`, return the fraction of correctly classified samples. Otherwise, return the number of correctly classified samples.
es_es: Si es `True`, devuelve la fracción de muestras clasificadas correctamente. En caso contrario, devuelve el número de muestras clasificadas correctamente.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights. If `None`, all samples are given the same weight.
es_es: Ponderaciones de las muestras. Si es `None`, todas las muestras tienen la misma ponderación.

source: array-like of shape (n_classes,), default=None
es_es: array-like de forma (n_classes,), default=None

source: Multiclass only. List of labels that index the classes in ``y_score``. If ``None``, the numerical or lexicographical order of the labels in ``y_true`` is used.
es_es: Sólo multiclase. Lista de etiquetas que indexan las clases en ``y_score``. Si es ``None``, se utiliza el orden numérico o lexicográfico de las etiquetas en ``y_true``.

source: Returns
es_es: Devuelve

source: The top-k accuracy score. The best performance is 1 with `normalize == True` and the number of samples with `normalize == False`.
es_es: La puntuación de precisión top-k. El mejor rendimiento es 1 con `normalize == True` y el número de muestras con `normalize == False`.

source: Notes
es_es: Notas

source: In cases where two or more labels are assigned equal predicted scores, the labels with the highest indices will be chosen first. This might impact the result if the correct label falls after the threshold because of that.
es_es: En los casos en los que se asignan dos o más etiquetas con puntuaciones de predicción iguales, se elegirán primero las etiquetas con los índices más altos. Esto podría afectar el resultado si la etiqueta correcta cae después del umbral debido a eso.

source: Examples
es_es: Ejemplos
