Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.estimator_checks.parametrize_with_checks.po
Languages: es_es

source: Pytest specific decorator for parametrizing estimator checks.
es_es: Decorador específico de pytest para parametrizar las comprobaciones del estimador.

source: The `id` of each check is set to be a pprint version of the estimator and the name of the check with its keyword arguments. This allows to use `pytest -k` to specify which tests to run::
es_es: El `id` de cada comprobación se establece para que sea una versión de pprint del estimador y el nombre de la comprobación con sus argumentos de palabra clave. Esto permite usar `pytest -k` para especificar qué pruebas ejecutar::

source: Parameters
es_es: Parámetros

source: list of estimators instances
es_es: lista de instancias de estimadores

source: Estimators to generated checks for.
es_es: Estimadores para generar comprobaciones.

source: Passing a class was deprecated in version 0.23, and support for classes was removed in 0.24. Pass an instance instead.
es_es: Pasar una clase quedó obsoleta en la versión 0.23, y el soporte para clases fue eliminado en 0.24.

source: Returns
es_es: Devuelve

source: **decorator** : `pytest.mark.parametrize`
es_es: **decorador** : `pytest.mark.parametrize`

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.utils.estimator_checks.parametrize_with_checks``
es_es: Ejemplos que usan ``sklearn.utils.estimator_checks.parametrize_with_checks``
