Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.StackingClassifier.po
Languages: es_es

source: Stack of estimators with a final classifier.
es_es: Pila de estimadores con un clasificador final.

source: Stacked generalization consists in stacking the output of individual estimator and use a classifier to compute the final prediction. Stacking allows to use the strength of each individual estimator by using their output as input of a final estimator.
es_es: La generalización apilada consiste en apilar la salida del estimador individual y utilizar un clasificador para calcular la predicción final. El apilamiento permite el uso de la fuerza de cada estimador individual, usando su salida como entrada de un estimador final.

source: Note that `estimators_` are fitted on the full `X` while `final_estimator_` is trained using cross-validated predictions of the base estimators using `cross_val_predict`.
es_es: Tenga en cuenta que `estimators_` son encajados en el `X` completo mientras que `final_estimator_` es entrenado utilizando predicciones validadas en cruz de los estimadores base utilizando `cross_val_predict`.

source: Read more in the :ref:`User Guide <stacking>`.
es_es: Más información en el :ref:`Manual de usuario <stacking>`.

source: Parameters
es_es: Parámetros

source: list of (str, estimator)
es_es: lista de (str, estimator)

source: Base estimators which will be stacked together. Each element of the list is defined as a tuple of string (i.e. name) and an estimator instance. An estimator can be set to 'drop' using `set_params`.
es_es: Estimadores base que serán apilados juntos. Cada elemento de la lista es definido como una tupla de cadena (es decir, nombre) y una instancia de estimador. Un estimador puede ser establecido como 'drop' utilizando `set_params`.

source: estimator, default=None
es_es: estimador, default=None

source: A classifier which will be used to combine the base estimators. The default classifier is a :class:`~sklearn.linear_model.LogisticRegression`.
es_es: Un clasificador que sera utilizado para combinar los estimadores base. El clasificador predeterminado es un :class:`~sklearn.linear_model.LogisticRegression`.

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy used in `cross_val_predict` to train `final_estimator`. Possible inputs for cv are:
es_es: Determina la estrategia de división de validación cruzada utilizada en `cross_val_predict` para entrenar el `final_estimator`. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para usar la validación cruzada de 5 partes por defecto,

source: integer, to specify the number of folds in a (Stratified) KFold,
es_es: un entero, para especificar el número de plegados en un KFold (estratificado)

source: An object to be used as a cross-validation generator,
es_es: Un objeto a ser usado como generador de validación cruzada,

source: An iterable yielding train, test splits.
es_es: Un iterable dando divisiones de entrenamiento o prueba.

source: For integer/None inputs, if the estimator is a classifier and y is either binary or multiclass, :class:`~sklearn.model_selection.StratifiedKFold` is used. In all other cases, :class:`~sklearn.model_selection.KFold` is used.
es_es: Para entradas de enteros/None, si el estimador es un clasificador e y es binario o multiclase, :class:`~sklearn.model_selection.StratifiedKFold` es utilizado. En todos los demás casos, :class:`~sklearn.model_selection.KFold` es utilizado.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulte :ref:`Guía de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: A larger number of split will provide no benefits if the number of training samples is large enough. Indeed, the training time will increase. ``cv`` is not used for model evaluation but for prediction.
es_es: Un número grande de divisiones no proporcionara beneficios si el número de muestras de entrenamiento es lo suficientemente grande. De hecho, el tiempo de entrenamiento aumentará. ``cv`` no es utilizado para la evaluación del modelo sino para la predicción.

source: Methods called for each base estimator. It can be:
es_es: Métodos llamados para cada estimador base. Puede ser:

source: if 'auto', it will try to invoke, for each estimator, `'predict_proba'`, `'decision_function'` or `'predict'` in that order.
es_es: si 'auto', intentara invocar, para cada estimador, `'predict_proba'`, `'decision_function'` o `'predict'` en ese orden.

source: otherwise, one of `'predict_proba'`, `'decision_function'` or `'predict'`. If the method is not implemented by the estimator, it will raise an error.
es_es: de otra manera, uno de `'predict_proba'`, `'decision_function'` o `'predict'`. Si el método no es implementado por el estimador, emitirá un error.

source: The number of jobs to run in parallel all `estimators` `fit`. `None` means 1 unless in a `joblib.parallel_backend` context. -1 means using all processors. See Glossary for more details.
es_es: El número de trabajos a ejecutar en paralelo para todos los `estimators` `fit`. `None` significa 1 excepto en un contexto de `joblib.parallel_backend`. -1 significa usar todos los procesadores. Vea el Glosario para más detalles.

source: When False, only the predictions of estimators will be used as training data for `final_estimator`. When True, the `final_estimator` is trained on the predictions as well as the original training data.
es_es: Cuando es False, solo las predicciones de los estimadores serán utilizadas como datos de entrenamiento para `final_estimator`. Cuando es True, el `final_estimator` es entrenado tanto en las predicciones como los datos de entrenamiento originales.

source: Verbosity level.
es_es: Nivel de verbosidad.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Class labels.
es_es: Etiquetas de clase.

source: list of estimators
es_es: lista de estimadores

source: The elements of the estimators parameter, having been fitted on the training data. If an estimator has been set to `'drop'`, it will not appear in `estimators_`.
es_es: Los elementos del parámetro de los estimadores, tras haber sido encajados en los datos de entrenamiento. Si un estimador ha sido establecido a `'drop'`, no aparecerá en `estimators_`.

source: Attribute to access any fitted sub-estimators by name.
es_es: Atributo para acceder a cualquier subestimador ajustado por su nombre.

source: The classifier which predicts given the output of `estimators_`.
es_es: El clasificador que predice dado la salida de `estimators_`.

source: list of str
es_es: lista de str

source: The method used by each base estimator.
es_es: El método utilizado por cada estimador base.

source: Notes
es_es: Notas

source: When `predict_proba` is used by each estimator (i.e. most of the time for `stack_method='auto'` or specifically for `stack_method='predict_proba'`), The first column predicted by each estimator will be dropped in the case of a binary classification problem. Indeed, both feature will be perfectly collinear.
es_es: Cuando `predict_proba` es utilizado por cada estimador (es decir, la mayor parte del tiempo para `stack_method='auto'` o específicamente para `stack_method='predict_proba'`). La primera columna predecida por cada estimador será eliminada en el caso de un problema de clasificación binaria. De hecho, ambas características serán perfectamente colineales.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Predict decision function for samples in X using `final_estimator_.decision_function`.
es_es: Predice la función de decisión para muestras en X utilizando `final_estimator_.decision_function`.

source: Fit the estimators.
es_es: Ajusta los estimadores.

source: Fit to data, then transform it.
es_es: Lo ajusta a los datos, y después lo transforma.

source: Get the parameters of an estimator from the ensemble.
es_es: Obtiene los parámetros de un estimador del ensemble.

source: Predict target for X.
es_es: Predice el objetivo para X.

source: Predict class probabilities for X using `final_estimator_.predict_proba`.
es_es: Predice las probabilidades de clase para X utilizando `final_estimator_.predict_proba`.

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos y etiquetas de prueba dados.

source: Set the parameters of an estimator from the ensemble.
es_es: Establece los parámetros de un estimador del conjunto.

source: Return class labels or probabilities for X for each estimator.
es_es: Devuelve las etiquetas o probabilidades de clase para X para cada estimador.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Training vectors, where n_samples is the number of samples and n_features is the number of features.
es_es: Vectores de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: Returns
es_es: Salida

source: ndarray of shape (n_samples,), (n_samples, n_classes), or (n_samples, n_classes * (n_classes-1) / 2)
es_es: ndarray de forma (n_samples,), (n_samples, n_classes), o (n_samples, n_classes * (n_classes-1) / 2)

source: The decision function computed the final estimator.
es_es: La función de decisión calculada por el estimador final.

source: Training vectors, where `n_samples` is the number of samples and `n_features` is the number of features.
es_es: Vectores de entrenamiento, donde `n_samples` es el número de muestras y `n_features` es el número de características.

source: array-like of shape (n_samples,)
es_es: tipo arreglo de forma (n_samples,)

source: Target values.
es_es: Valores objetivo.

source: array-like of shape (n_samples,), default=None
es_es: arreglo tipo de forma (n_samples,), default=None

source: Sample weights. If None, then samples are equally weighted. Note that this is supported only if all underlying estimators support sample weights.
es_es: Ponderaciones de muestra. Si es None, entonces las muestras están igualmente ponderadas. Ten en cuenta que esto sólo es soportado si todos los estimadores subyacentes soportan ponderaciones de muestra.

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: array-like of shape (n_samples, n_features)
es_es: tipo arreglo de forma (n_samples, n_features)

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: tipo arreglo de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (Ninguno para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: ndarray arreglo de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: Returns the parameters given in the constructor as well as the estimators contained within the `estimators` parameter.
es_es: Devuelve los parámetros dados en el constructor así como los estimadores contenidos en el parámetro `estimators`.

source: Setting it to True gets the various estimators and the parameters of the estimators as well.
es_es: Establecerlo a True también obtiene los diversos estimadores y parámetros de los estimadores.

source: Number of features seen during :term:`fit`.
es_es: Número de características vistas durante el :term:`fit`.

source: dict of str -> obj
es_es: dict de str -> obj

source: Parameters to the `predict` called by the `final_estimator`. Note that this may be used to return uncertainties from some estimators with `return_std` or `return_cov`. Be aware that it will only accounts for uncertainty in the final estimator.
es_es: Parámetros al `predict` llamado por el `final_estimator`. Note que esto podría ser utilizado para devolver incertidumbres de algunos estimadores con `return_std` o `return_cov`. Tenga en cuenta que solo tendrá en cuenta la incertidumbre para el estimador final.

source: ndarray of shape (n_samples,) or (n_samples, n_output)
es_es: ndarray de forma (n_samples,) o (n_samples, n_output)

source: Predicted targets.
es_es: Objetivos predecidos.

source: ndarray of shape (n_samples, n_classes) or list of ndarray of shape (n_output,)
es_es: ndarray de forma (n_samples, n_classes) o lista de ndarray de forma (n_output,)

source: The class probabilities of the input samples.
es_es: Las probabilidades de clase de las muestras de entrada.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En clasificación multietiqueta, esta la precisión del subconjunto, una métrica exigente ya que requieres que cada conjunto de etiquetas sea predicho correctamente para cada muestra.

source: Test samples.
es_es: Muestras de prueba.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas verdaderas para `X`.

source: Sample weights.
es_es: Ponderados de muestras.

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con relación a `y`.

source: Valid parameter keys can be listed with `get_params()`. Note that you can directly set the parameters of the estimators contained in `estimators`.
es_es: Las claves de parámetro válidas pueden ser listadas con `get_params()`. Ten en cuenta que puedes establecer directamente los parámetros de los estimadores contenidos en `estimators`.

source: keyword arguments
es_es: argumentos de palabras clave

source: Specific parameters using e.g. `set_params(parameter_name=new_value)`. In addition, to setting the parameters of the estimator, the individual estimator of the estimators can also be set, or can be removed by setting them to 'drop'.
es_es: Parámetros específicos usando por ejemplo `set_params(parameter_name=new_value)`. Además, para establecer los parámetros del estimador, el estimador individual de los estimadores también se puede establecer, o se puede eliminar estableciendolos en "drop".

source: ndarray of shape (n_samples, n_estimators) or (n_samples, n_classes * n_estimators)
es_es: ndarray de forma (n_samples, n_estimators), o (n_samples, n_classes * n_estimators)

source: Prediction outputs for each estimator.
es_es: Salidas de predicción para cada estimador.

source: Examples using ``sklearn.ensemble.StackingClassifier``
es_es: Ejemplos usando ``sklearn.ensemble.StackingClassifier``

source: :ref:`sphx_glr_auto_examples_release_highlights_plot_release_highlights_0_22_0.py`
es_es: :ref:`sphx_glr_auto_examples_release_highlights_plot_release_highlights_0_24_0.py`
