Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.pairwise.manhattan_distances.po
Languages: es_es

source: Compute the L1 distances between the vectors in X and Y.
es_es: Calcula las distancias L1 entre los vectores en X y Y.

source: With sum_over_features equal to False it returns the componentwise distances.
es_es: Con sum_over_features igual a False, devuelve las distancias por componentes.

source: Read more in the :ref:`User Guide <metrics>`.
es_es: Leer más en el :ref:`Manual de Usuario <metrics>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples_X, n_features)
es_es: array-like de forma (n_samples_X, n_features)

source: array-like of shape (n_samples_Y, n_features), default=None
es_es: array-like de forma (n_samples_Y, n_features), default=None

source: If True the function returns the pairwise distance matrix else it returns the componentwise L1 pairwise-distances. Not supported for sparse matrix inputs.
es_es: Si es True, la función devuelve la matriz de distancias por pares, si no, devuelve las distancias por pares L1 por componentes. No es soportado para las entradas de matrices dispersas.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples_X * n_samples_Y, n_features) or (n_samples_X, n_samples_Y)
es_es: ndarray de forma (n_samples_X * n_samples_Y, n_features) o (n_samples_X, n_samples_Y)

source: If sum_over_features is False shape is (n_samples_X * n_samples_Y, n_features) and D contains the componentwise L1 pairwise-distances (ie. absolute difference), else shape is (n_samples_X, n_samples_Y) and D contains the pairwise L1 distances.
es_es: Si sum_over_features es False, la forma es (n_samples_X * n_samples_Y, n_features) y D contiene las distancias por pares L1 por componentes (es decir, la diferencia absoluta), si no la forma es (n_samples_X, n_samples_Y) y D contiene las distancias L1 por pares.

source: Notes
es_es: Notas

source: When X and/or Y are CSR sparse matrices and they are not already in canonical format, this function modifies them in-place to make them canonical.
es_es: Cuando X y/o Y son matrices dispersas CSR y no están ya en formato canónico, esta función las modifica en el lugar (in-place) para hacerlas canónicas.

source: Examples
es_es: Ejemplos
