Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.OneHotEncoder.po
Languages: es_es

source: Encode categorical features as a one-hot numeric array.
es_es: Codifica las características categóricas como un arreglo numérico one-hot.

source: The input to this transformer should be an array-like of integers or strings, denoting the values taken on by categorical (discrete) features. The features are encoded using a one-hot (aka 'one-of-K' or 'dummy') encoding scheme. This creates a binary column for each category and returns a sparse matrix or dense array (depending on the ``sparse`` parameter)
es_es: La entrada de este transformador debe ser un array-like de enteros o cadenas, que denote los valores que toman las características categóricas (discretas). Las características se codifican utilizando un esquema de codificación one-hot (también conocido como 'one-of-K' o 'dummy'). Esto crea una columna binaria para cada categoría y devuelve una matriz dispersa o un arreglo denso (dependiendo del parámetro ``sparse``)

source: By default, the encoder derives the categories based on the unique values in each feature. Alternatively, you can also specify the `categories` manually.
es_es: Por defecto, el codificador deriva las categorías basándose en los valores únicos de cada característica. Alternativamente, también puedes especificar las `categories` manualmente.

source: This encoding is needed for feeding categorical data to many scikit-learn estimators, notably linear models and SVMs with the standard kernels.
es_es: Esta codificación es necesaria para alimentar los datos categóricos a muchos estimadores de scikit-learn, especialmente los modelos lineales y las SVM con los núcleos estándar.

source: Note: a one-hot encoding of y labels should use a LabelBinarizer instead.
es_es: Nota: una codificación one-hot de las etiquetas y debe utilizar un LabelBinarizer en su lugar.

source: Read more in the :ref:`User Guide <preprocessing_categorical_features>`.
es_es: Lee más en el :ref:`Manual de usuario <preprocessing_categorical_features>`.

source: Parameters
es_es: Parámetros

source: 'auto' or a list of array-like, default='auto'
es_es: 'auto' o una list de array-like, default='auto'

source: Categories (unique values) per feature:
es_es: Categorías (valores únicos) por característica:

source: 'auto' : Determine categories automatically from the training data.
es_es: 'auto' : Determina las categorías automáticamente a partir de los datos de entrenamiento.

source: list : ``categories[i]`` holds the categories expected in the ith column. The passed categories should not mix strings and numeric values within a single feature, and should be sorted in case of numeric values.
es_es: lista (list): ``categories[i]`` contiene las categorías esperadas en la i-ésima columna. Las categorías pasadas no deben mezclar cadenas y valores numéricos dentro de una misma característica, y deben ordenarse en caso de valores numéricos.

source: The used categories can be found in the ``categories_`` attribute.
es_es: Las categorías utilizadas se encuentran en el atributo ``categories_``.

source: {'first', 'if_binary'} or a array-like of shape (n_features,), default=None
es_es: {'first', 'if_binary'} o un array-like de forma (n_features,), default=None

source: Specifies a methodology to use to drop one of the categories per feature. This is useful in situations where perfectly collinear features cause problems, such as when feeding the resulting data into a neural network or an unregularized regression.
es_es: Especifica una metodología a utilizar para eliminar una de las categorías por característica. Esto es útil en situaciones en las que las características perfectamente colineales causan problemas, como cuando se introducen los datos resultantes en una red neuronal o en una regresión no regularizada.

source: However, dropping one category breaks the symmetry of the original representation and can therefore induce a bias in downstream models, for instance for penalized linear classification or regression models.
es_es: Sin embargo, la eliminación de una categoría rompe la simetría de la representación original y, por tanto, puede inducir un sesgo en los modelos posteriores, por ejemplo, en los modelos de clasificación o regresión lineal penalizados.

source: None : retain all features (the default).
es_es: None: conserva todas las características (por defecto).

source: 'first' : drop the first category in each feature. If only one category is present, the feature will be dropped entirely.
es_es: 'first' : elimina la primera categoría en cada característica. Si solo hay una categoría presente, la característica se eliminará por completo.

source: 'if_binary' : drop the first category in each feature with two categories. Features with 1 or more than 2 categories are left intact.
es_es: 'if_binary' : elimina la primera categoría en cada característica con dos categorías. Las características con 1 o más de 2 categorías se dejan intactas.

source: array : ``drop[i]`` is the category in feature ``X[:, i]`` that should be dropped.
es_es: array : ``drop[i]`` es la categoría en la característica ``X[:, i]`` que debe ser descartada.

source: Added option 'if_binary'.
es_es: Opción añadida 'if_binary'.

source: Will return sparse matrix if set True else will return an array.
es_es: Devolverá una matriz dispersa si se establece como True, de lo contrario devolverá un arreglo.

source: number type, default=float
es_es: tipo numérico, default=float

source: Desired dtype of output.
es_es: Tipo de salida (dtype) deseado.

source: Whether to raise an error or ignore if an unknown categorical feature is present during transform (default is to raise). When this parameter is set to 'ignore' and an unknown category is encountered during transform, the resulting one-hot encoded columns for this feature will be all zeros. In the inverse transform, an unknown category will be denoted as None.
es_es: Si se produce un error o se ignora si una característica categórica desconocida está presente durante la transformación (por defecto, se produce). Cuando este parámetro se establece en 'ignore' y se encuentra una categoría desconocida durante la transformación, las columnas codificadas one-hot resultantes para esta característica serán todas ceros. En la transformación inversa, una categoría desconocida se denotará como None.

source: Attributes
es_es: Atributos

source: The categories of each feature determined during fitting (in order of the features in X and corresponding with the output of ``transform``). This includes the category specified in ``drop`` (if any).
es_es: Las categorías de cada característica determinadas durante el ajuste (en orden de las características en X y correspondientes con la salida de ``transform``). Esto incluye la categoría especificada en ``drop`` (si la hay).

source: array of shape (n_features,)
es_es: array de forma (n_features,)

source: ``drop_idx_[i]`` is the index in ``categories_[i]`` of the category to be dropped for each feature.
es_es: ``drop_idx_[i]`` es el índice en ``categories_[i]`` de la categoría que se va a eliminar para cada característica.

source: ``drop_idx_[i] = None`` if no category is to be dropped from the feature with index ``i``, e.g. when `drop='if_binary'` and the feature isn't binary.
es_es: ``drop_idx_[i] = None`` si no hay que eliminar ninguna categoría de la característica con el índice ``i``, por ejemplo, cuando `drop='if_binary'` y la característica no es binaria.

source: ``drop_idx_ = None`` if all the transformed features will be retained.
es_es: ``drop_idx_ = None`` si se conservan todas las características transformadas.

source: Added the possibility to contain `None` values.
es_es: Se ha añadido la posibilidad de contener valores `None`.

source: Performs an ordinal (integer) encoding of the categorical features.
es_es: Realiza una codificación ordinal (entera) de las características categóricas.

source: Performs a one-hot encoding of dictionary items (also handles string-valued features).
es_es: Realiza una codificación one-hot de los elementos del diccionario (también maneja características con valores de cadena).

source: Performs an approximate one-hot encoding of dictionary items or strings.
es_es: Realiza una codificación one-hot aproximada de los elementos del diccionario o de las cadenas.

source: Binarizes labels in a one-vs-all fashion.
es_es: Binariza las etiquetas de una forma uno contra todos (one-vs-all).

source: Transforms between iterable of iterables and a multilabel format, e.g. a (samples x classes) binary matrix indicating the presence of a class label.
es_es: Transforma entre un iterable de iterables y un formato multietiqueta, por ejemplo, una matriz binaria (muestras x clases) que indica la presencia de una etiqueta de clase.

source: Examples
es_es: Ejemplos

source: Given a dataset with two features, we let the encoder find the unique values per feature and transform the data to a binary one-hot encoding.
es_es: Dado un conjunto de datos con dos características, dejamos que el codificador encuentre los valores únicos por característica y transforme los datos en una codificación binaria one-hot.

source: One can discard categories not seen during `fit`:
es_es: Se pueden descartar las categorías no vistas durante `fit`:

source: One can always drop the first column for each feature:
es_es: Siempre se puede eliminar la primera columna para cada característica:

source: Or drop a column for feature only having 2 categories:
es_es: O bien, eliminar una columna para la característica que sólo tiene 2 categorías:

source: Methods
es_es: Métodos

source: Fit OneHotEncoder to X.
es_es: Ajusta OneHotEncoder a X.

source: Fit OneHotEncoder to X, then transform X.
es_es: Ajusta OneHotEncoder a X, luego transforma X.

source: Return feature names for output features.
es_es: Devuelve los nombres de las características para las características de salida.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Convert the data back to the original representation.
es_es: Convierte los datos a la representación original.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Transform X using one-hot encoding.
es_es: Transformar X utilizando la codificación one-hot.

source: array-like, shape [n_samples, n_features]
es_es: array-like, forma [n_samples, n_features]

source: The data to determine the categories of each feature.
es_es: Los datos para determinar las categorías de cada característica.

source: Ignored. This parameter exists only for compatibility with :class:`~sklearn.pipeline.Pipeline`.
es_es: Ignorado. Este parámetro sólo existe por compatibilidad con :class:`~sklearn.pipeline.Pipeline`.

source: Returns
es_es: Devuelve

source: Equivalent to fit(X).transform(X) but more convenient.
es_es: Equivalente a fit(X).transform(X) pero más conveniente.

source: The data to encode.
es_es: Los datos a codificar.

source: sparse matrix if sparse=True else a 2-d array
es_es: sparse matrix si sparse=True de lo contrario un 2-d array

source: Transformed input.
es_es: Entrada transformada.

source: list of str of shape (n_features,)
es_es: list de str de forma (n_features,)

source: String names for input features if available. By default, "x0", "x1", ... "xn_features" is used.
es_es: Nombres de cadenas para las características de entrada, si están disponibles. Por defecto, se utiliza "x0", "x1", ... "xn_features".

source: ndarray of shape (n_output_features,)
es_es: ndarray de forma (n_output_features,)

source: Array of feature names.
es_es: Arreglo de nombres de características.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros mapeados a sus valores.

source: In case unknown categories are encountered (all zeros in the one-hot encoding), ``None`` is used to represent this category.
es_es: En caso de que se encuentren categorías desconocidas (todos los ceros en la codificación one-hot), se utiliza ``None`` para representar esta categoría.

source: array-like or sparse matrix, shape [n_samples, n_encoded_features]
es_es: array-like o matriz dispersa, forma [n_samples, n_encoded_features]

source: The transformed data.
es_es: Los datos transformados.

source: Inverse transformed array.
es_es: Arreglo transformado inverso.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: Examples using ``sklearn.preprocessing.OneHotEncoder``
es_es: Ejemplos utilizando ``sklearn.preprocessing.OneHotEncoder``
