Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.resample.po
Languages: es_es

source: Resample arrays or sparse matrices in a consistent way.
es_es: Remuestrea arreglos o matrices dispersas de forma coherente.

source: The default strategy implements one step of the bootstrapping procedure.
es_es: La estrategia predeterminada implementa un paso del procedimiento de bootstrapping.

source: Parameters
es_es: Parámetros

source: sequence of array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: sequence of array-like de forma (n_samples,) o (n_samples, n_outputs)

source: Indexable data-structures can be arrays, lists, dataframes or scipy sparse matrices with consistent first dimension.
es_es: Las estructuras de datos indexables pueden ser arreglos, listas, dataframes o matrices dispersas scipy con una primera dimensión consistente.

source: Implements resampling with replacement. If False, this will implement (sliced) random permutations.
es_es: Implementa remuestreo con reemplazo. Si es False, implementará permutaciones aleatorias (divididas).

source: Number of samples to generate. If left to None this is automatically set to the first dimension of the arrays. If replace is False it should not be larger than the length of arrays.
es_es: Número de muestras a generar. Si se deja en None se establece automáticamente a la primera dimensión de los arreglos. Si se sustituye por False no debe ser mayor que la longitud de los arreglos.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Determines random number generation for shuffling the data. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para revolver los datos. Pasa un número entero (int) para obtener resultados reproducibles a través de múltiples invocaciones a la función. Consulta el :term:`Glosario <random_state>`.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: If not None, data is split in a stratified fashion, using this as the class labels.
es_es: Si no es None, los datos se dividen de forma estratificada, utilizando esto como las etiquetas de clase.

source: Returns
es_es: Devuelve

source: Sequence of resampled copies of the collections. The original arrays are not impacted.
es_es: Secuencia de copias remuestreadas de las colecciones. Los arreglos originales no se ven afectados.

source: Examples
es_es: Ejemplos

source: It is possible to mix sparse and dense arrays in the same run::
es_es: Es posible mezclar arreglos dispersos y densos en la misma ejecución::

source: Example using stratification::
es_es: Ejemplo de uso de la estratificación::
