Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.decomposition.PCA.po
Languages: es_es

source: Principal component analysis (PCA).
es_es: Análisis de componentes principales (Principal component analysis, PCA).

source: Linear dimensionality reduction using Singular Value Decomposition of the data to project it to a lower dimensional space. The input data is centered but not scaled for each feature before applying the SVD.
es_es: Reducción lineal de la dimensionalidad mediante la Descomposición del Valor Singular de los datos para proyectarlos a un espacio de menor dimensión. Los datos de entrada se centran pero no se escalan para cada característica antes de aplicar la SVD.

source: It uses the LAPACK implementation of the full SVD or a randomized truncated SVD by the method of Halko et al. 2009, depending on the shape of the input data and the number of components to extract.
es_es: Utiliza la implementación LAPACK de la SVD completa o una SVD truncada aleatorizada por el método de Halko et al. 2009, dependiendo de la forma de los datos de entrada y del número de componentes a extraer.

source: It can also use the scipy.sparse.linalg ARPACK implementation of the truncated SVD.
es_es: También puede utilizar la implementación scipy.sparse.linalg ARPACK de la SVD truncada.

source: Notice that this class does not support sparse input. See :class:`TruncatedSVD` for an alternative with sparse data.
es_es: Ten en cuenta que esta clase no admite datos dispersos de entrada. Véase :class:`TruncatedSVD` para una alternativa con datos dispersos.

source: Read more in the :ref:`User Guide <PCA>`.
es_es: Más información en el :ref:`Manual de usuario <PCA>`.

source: Parameters
es_es: Parámetros

source: int, float or 'mle', default=None
es_es: int, float o 'mle', default=None

source: Number of components to keep. if n_components is not set all components are kept::
es_es: Número de componentes a conservar. Si n_componentes no se establece, se conservan todos los componentes::

source: If ``n_components == 'mle'`` and ``svd_solver == 'full'``, Minka's MLE is used to guess the dimension. Use of ``n_components == 'mle'`` will interpret ``svd_solver == 'auto'`` as ``svd_solver == 'full'``.
es_es: Si ``n_components == 'mle'`` y ``svd_solver == 'full'``, se utiliza la MLE de Minka para suponer la dimensión. El uso de ``n_components == 'mle'`` interpretará ``svd_solver == 'auto'`` como ``svd_solver == 'full'``.

source: If ``0 < n_components < 1`` and ``svd_solver == 'full'``, select the number of components such that the amount of variance that needs to be explained is greater than the percentage specified by n_components.
es_es: Si ``0 < n_components < 1`` y ``svd_solver == 'full'``, selecciona el número de componentes tal que la cantidad de varianza que debe explicarse sea mayor que el porcentaje especificado por n_components.

source: If ``svd_solver == 'arpack'``, the number of components must be strictly less than the minimum of n_features and n_samples.
es_es: Si ``svd_solver == 'arpack'``, el número de componentes debe ser estrictamente menor que el mínimo de n_features y n_samples.

source: Hence, the None case results in::
es_es: Por lo tanto, el caso Ninguno(None) resulta en::

source: If False, data passed to fit are overwritten and running fit(X).transform(X) will not yield the expected results, use fit_transform(X) instead.
es_es: Si es False, los datos pasados para el ajuste se sobrescriben y la ejecución de fit(X).transform(X) no producirá los resultados esperados, utiliza fit_transform(X) en su lugar.

source: When True (False by default) the `components_` vectors are multiplied by the square root of n_samples and then divided by the singular values to ensure uncorrelated outputs with unit component-wise variances.
es_es: Cuando es True (False por defecto) los vectores `components_` se multiplican por la raíz cuadrada de n_samples y luego se dividen por los valores singulares para asegurar salidas no correlacionadas con varianzas unitarias de los componentes.

source: Whitening will remove some information from the transformed signal (the relative variance scales of the components) but can sometime improve the predictive accuracy of the downstream estimators by making their data respect some hard-wired assumptions.
es_es: El whitening eliminará parte de la información de la señal transformada (las escalas de varianza relativas de los componentes), pero a veces puede mejorar la precisión predictiva de los estimadores posteriores al hacer que los datos respeten algunos supuestos fijos.

source: If auto :
es_es: Si es auto :

source: The solver is selected by a default policy based on `X.shape` and `n_components`: if the input data is larger than 500x500 and the number of components to extract is lower than 80% of the smallest dimension of the data, then the more efficient 'randomized' method is enabled. Otherwise the exact full SVD is computed and optionally truncated afterwards.
es_es: El solucionador es seleccionado mediante una política por defecto basada en `X.shape` y `n_components`: si los datos de entrada son mayores de 500x500 y el número de componentes a extraer es inferior al 80% de la dimensión más pequeña de los datos, entonces se habilita el método 'randomized' más eficiente. En caso contrario, se calcula la SVD completa exacta y, opcionalmente, se trunca después.

source: If full :
es_es: Si es full :

source: run exact full SVD calling the standard LAPACK solver via `scipy.linalg.svd` and select the components by postprocessing
es_es: ejecuta la SVD completa exacta llamando al solucionador estándar LAPACK a través de `scipy.linalg.svd` y selecciona los componentes mediante postprocesamiento

source: If arpack :
es_es: Si es arpack :

source: run SVD truncated to n_components calling ARPACK solver via `scipy.sparse.linalg.svds`. It requires strictly 0 < n_components < min(X.shape)
es_es: ejecuta la SVD truncada a n_components llamando al solucionador ARPACK mediante `scipy.sparse.linalg.svds`. Requiere estrictamente 0 < n_components < min(X.shape)

source: If randomized :
es_es: Si es randomized :

source: run randomized SVD by the method of Halko et al.
es_es: ejecuta la SVD aleatorizada por el método de Halko et al.

source: Tolerance for singular values computed by svd_solver == 'arpack'. Must be of range [0.0, infinity).
es_es: Tolerancia para los valores singulares calculados por svd_solver == 'arpack'. Debe estar en el rango [0.0, infinito).

source: int or 'auto', default='auto'
es_es: int o 'auto', default='auto'

source: Number of iterations for the power method computed by svd_solver == 'randomized'. Must be of range [0, infinity).
es_es: Número de iteraciones para el método de potencia calculado por svd_solver == 'randomized'. Debe estar en el rango [0, infinito).

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, default=None

source: Used when the 'arpack' or 'randomized' solvers are used. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Se emplea cuando se utilizan los solucionadores 'arpack' o 'randomized'. Pasa un entero(int) para obtener resultados reproducibles a través de múltiples llamadas a la función. Véase :term:`Glosario <random_state>`.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_components, n_features)
es_es: ndarray de forma (n_components, n_features)

source: Principal axes in feature space, representing the directions of maximum variance in the data. The components are sorted by ``explained_variance_``.
es_es: Ejes principales en el espacio de características, que representan las direcciones de máxima varianza en los datos. Los componentes se ordenan por ``explained_variance_``.

source: ndarray of shape (n_components,)
es_es: ndarray de forma (n_components,)

source: The amount of variance explained by each of the selected components.
es_es: La cantidad de varianza explicada por cada uno de los componentes seleccionados.

source: Equal to n_components largest eigenvalues of the covariance matrix of X.
es_es: Igual a n_components autovalores más grandes de la matriz de covarianza de X.

source: Percentage of variance explained by each of the selected components.
es_es: Porcentaje de la varianza explicada por cada uno de los componentes seleccionados.

source: If ``n_components`` is not set then all components are stored and the sum of the ratios is equal to 1.0.
es_es: Si no se establece ``n_components``, se almacenan todos los componentes y la suma de las razones es igual a 1,0.

source: The singular values corresponding to each of the selected components. The singular values are equal to the 2-norms of the ``n_components`` variables in the lower-dimensional space.
es_es: Los valores singulares correspondientes a cada uno de los componentes seleccionados. Los valores singulares son iguales a las 2-normas de las variables ``n_componentes`` en el espacio de dimensión inferior.

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features,)

source: Per-feature empirical mean, estimated from the training set.
es_es: Media empírica por característica, estimada a partir del conjunto de entrenamiento.

source: Equal to `X.mean(axis=0)`.
es_es: Igual a `X.mean(axis=0)`.

source: The estimated number of components. When n_components is set to 'mle' or a number between 0 and 1 (with svd_solver == 'full') this number is estimated from input data. Otherwise it equals the parameter n_components, or the lesser value of n_features and n_samples if n_components is None.
es_es: El número estimado de componentes. Cuando n_components se establece como 'mle' o un número entre 0 y 1 (con svd_solver == 'full') este número se estima a partir de los datos de entrada. De lo contrario, es igual al parámetro n_components, o el valor menor de n_features y n_samples si n_components es None.

source: Number of features in the training data.
es_es: Número de características en los datos de entrenamiento.

source: Number of samples in the training data.
es_es: Número de muestras en los datos de entrenamiento.

source: The estimated noise covariance following the Probabilistic PCA model from Tipping and Bishop 1999. See "Pattern Recognition and Machine Learning" by C. Bishop, 12.2.1 p. 574 or http://www.miketipping.com/papers/met-mppca.pdf. It is required to compute the estimated data covariance and score samples.
es_es: La covarianza del ruido estimada según el modelo de PCA probabilístico de Tipping y Bishop 1999. Vea "Pattern Recognition and Machine Learning" de C. Bishop, 12.2.1 p. 574 o http://www.miketipping.com/papers/met-mppca.pdf. Es necesario para calcular la covarianza estimada de los datos y las puntuaciones muestrales.

source: Equal to the average of (min(n_features, n_samples) - n_components) smallest eigenvalues of the covariance matrix of X.
es_es: Igual al promedio de (min(n_features, n_samples) - n_components) autovalores más pequeños de la matriz de covarianza de X.

source: Kernel Principal Component Analysis.
es_es: Análisis de componentes principales basado en Kernel.

source: Sparse Principal Component Analysis.
es_es: Análisis de Componentes Principales Disperso.

source: Dimensionality reduction using truncated SVD.
es_es: Reducción de la dimensionalidad usando la SVD truncada.

source: Incremental Principal Component Analysis.
es_es: Análisis de Componentes Principales Incremental.

source: References
es_es: Referencias

source: For n_components == 'mle', this class uses the method of *Minka, T. P. "Automatic choice of dimensionality for PCA". In NIPS, pp. 598-604*
es_es: Para n_components == 'mle', esta clase utiliza el método de *Minka, T. P. "Automatic choice of dimensionality for PCA". En NIPS, pp. 598-604*

source: Implements the probabilistic PCA model from: Tipping, M. E., and Bishop, C. M. (1999). "Probabilistic principal component analysis". Journal of the Royal Statistical Society: Series B (Statistical Methodology), 61(3), 611-622. via the score and score_samples methods. See http://www.miketipping.com/papers/met-mppca.pdf
es_es: Implementa el modelo probabilístico PCA de: Tipping, M. E., y Bishop, C. M. (1999). "Probabilistic principal component analysis". Journal of the Royal Statistical Society: Series B (Statistical Methodology), 61(3), 611-622. a través de los métodos score y score_samples. Véase http://www.miketipping.com/papers/met-mppca.pdf

source: For svd_solver == 'arpack', refer to `scipy.sparse.linalg.svds`.
es_es: Para svd_solver == 'arpack', consulta `scipy.sparse.linalg.svds`.

source: For svd_solver == 'randomized', see: *Halko, N., Martinsson, P. G., and Tropp, J. A. (2011). "Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions". SIAM review, 53(2), 217-288.* and also *Martinsson, P. G., Rokhlin, V., and Tygert, M. (2011). "A randomized algorithm for the decomposition of matrices". Applied and Computational Harmonic Analysis, 30(1), 47-68.*
es_es: Para svd_solver == 'randomized', ver: *Halko, N., Martinsson, P. G., y Tropp, J. A. (2011). "Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions". SIAM review, 53(2), 217-288.* y también *Martinsson, P. G., Rokhlin, V., y Tygert, M. (2011). "A randomized algorithm for the decomposition of matrices". Applied and Computational Harmonic Analysis, 30(1), 47-68.*

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the model with X.
es_es: Ajusta el modelo con X.

source: Fit the model with X and apply the dimensionality reduction on X.
es_es: Ajusta el modelo con X y aplica la reducción de la dimensionalidad en X.

source: Compute data covariance with the generative model.
es_es: Calcula la covarianza de los datos con el modelo generativo.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Compute data precision matrix with the generative model.
es_es: Calcula la matriz de precisión de los datos con el modelo generativo.

source: Transform data back to its original space.
es_es: Transforma los datos de nuevo a su espacio original.

source: Return the average log-likelihood of all samples.
es_es: Devuelve el promedio de la log-verosimilitud de todas las muestras.

source: Return the log-likelihood of each sample.
es_es: Devuelve la log-verosimilitud de cada muestra.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Apply dimensionality reduction to X.
es_es: Aplica la reducción de la dimensionalidad a X.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Training data, where n_samples is the number of samples and n_features is the number of features.
es_es: Datos de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: Returns
es_es: Devuelve

source: Returns the instance itself.
es_es: Devuelve la propia instancia.

source: ndarray of shape (n_samples, n_components)
es_es: ndarray de forma (n_samples, n_components)

source: Transformed values.
es_es: Valores transformados.

source: Notes
es_es: Notas

source: This method returns a Fortran-ordered array. To convert it to a C-ordered array, use 'np.ascontiguousarray'.
es_es: Este método devuelve un arreglo ordenado en Fortran. Para convertirlo en un arreglo ordenado en C, utiliza 'np.ascontiguousarray'.

source: ``cov = components_.T * S**2 * components_ + sigma2 * eye(n_features)`` where S**2 contains the explained variances, and sigma2 contains the noise variances.
es_es: ``cov = components_.T * S**2 * components_ + sigma2 * eye(n_features)`` donde S**2 contiene las varianzas explicadas, y sigma2 contiene las varianzas del ruido.

source: array, shape=(n_features, n_features)
es_es: array, forma=(n_features, n_features)

source: Estimated covariance of data.
es_es: Covarianza estimada de los datos.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros asignados a sus valores.

source: Equals the inverse of the covariance but computed with the matrix inversion lemma for efficiency.
es_es: Es igual a la inversa de la covarianza, pero calculada con el lema de inversión de matrices por eficiencia.

source: Estimated precision of data.
es_es: Precisión estimada de los datos.

source: In other words, return an input X_original whose transform would be X.
es_es: En otras palabras, devuelve una entrada X_original cuya transformación sería X.

source: array-like, shape (n_samples, n_components)
es_es: array-like, forma (n_samples, n_components)

source: New data, where n_samples is the number of samples and n_components is the number of components.
es_es: Nuevos datos, donde n_samples es el número de muestras y n_components es el número de componentes.

source: X_original array-like, shape (n_samples, n_features)
es_es: X_original array-like, forma (n_samples, n_features)

source: If whitening is enabled, inverse_transform will compute the exact inverse operation, which includes reversing whitening.
es_es: Si whitening está activado, inverse_transform calculará la operación inversa exacta, que incluye la inversión del whitening.

source: See. "Pattern Recognition and Machine Learning" by C. Bishop, 12.2.1 p. 574 or http://www.miketipping.com/papers/met-mppca.pdf
es_es: Ver "Pattern Recognition and Machine Learning" por C. Bishop, 12.2.1 p. 574 or http://www.miketiping.com/papers/met-mppca.pdf

source: The data.
es_es: Los datos.

source: Average log-likelihood of the samples under the current model.
es_es: Promedio de la log-verosimilitud de las muestras según el modelo actual.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: Log-likelihood of each sample under the current model.
es_es: Log-verosimilitud de cada muestra según el modelo actual.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: X is projected on the first principal components previously extracted from a training set.
es_es: X se proyecta sobre los primeros componentes principales extraídos previamente de un conjunto de entrenamiento.

source: array-like, shape (n_samples, n_features)
es_es: array-like, forma (n_samples, n_features)

source: New data, where n_samples is the number of samples and n_features is the number of features.
es_es: Nuevos datos, donde n_samples es el número de muestras y n_features es el número de características.

source: Examples using ``sklearn.decomposition.PCA``
es_es: Ejemplos usando ``sklearn.decomposition.PCA``
