Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.check_cv.po
Languages: es_es

source: Input checker utility for building a cross-validator
es_es: Utilidad de comprobación de entrada para construir un validador cruzado

source: Parameters
es_es: Parámetros

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are: - None, to use the default 5-fold cross validation, - integer, to specify the number of folds. - :term:`CV splitter`, - An iterable yielding (train, test) splits as arrays of indices.
es_es: Determina la estrategia de división de la validación cruzada. Las entradas posibles para cv son: - None, para utilizar la validación cruzada de 5-pliegues por defecto, - entero(int), para especificar el número de pliegues. - :term:`CV splitter`, - Un iterable que produce divisiones (train, test) como arreglos de índices.

source: For integer/None inputs, if classifier is True and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas enteras/None, si classifier es True y ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta el :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv`` se ha cambiado de 3 a 5 pliegues.

source: The target variable for supervised learning problems.
es_es: La variable objetivo para los problemas de aprendizaje supervisado.

source: Whether the task is a classification task, in which case stratified KFold will be used.
es_es: Si la tarea es de clasificación, en cuyo caso se utilizará KFold estratificado.

source: Returns
es_es: Devuelve

source: a cross-validator instance.
es_es: una instancia cross-validator.

source: The return value is a cross-validator which generates the train/test splits via the ``split`` method.
es_es: El valor devuelto es un validador cruzado que genera las divisiones de entrenamiento/prueba a través del método ``split``.
