Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.fetch_lfw_pairs.po
Languages: es_es

source: Load the Labeled Faces in the Wild (LFW) pairs dataset (classification).
es_es: Cargar el conjunto de datos de pares Labeled Faces in the Wild (LFW) (clasificación).

source: Download it if necessary.
es_es: Descargar si es necesario.

source: Classes
es_es: Clases

source: Samples total
es_es: Total de muestras

source: Dimensionality
es_es: Dimensionalidad

source: Features
es_es: Característica

source: real, between 0 and 255
es_es: real, entre 0 y 255

source: In the official `README.txt`_ this task is described as the "Restricted" task. As I am not sure as to implement the "Unrestricted" variant correctly, I left it as unsupported for now.
es_es: En el archivo oficial `README.txt`_ esta tarea se describe como tarea "restringida". Como no estoy seguro de implementar correctamente la variante "Unrestricted", la he dejado como no soportada por ahora.

source: The original images are 250 x 250 pixels, but the default slice and resize arguments reduce them to 62 x 47.
es_es: Las imágenes originales son de 250 x 250 píxeles, pero los argumentos de corte y redimensionamiento por defecto las reducen a 62 x 47.

source: Read more in the :ref:`User Guide <labeled_faces_in_the_wild_dataset>`.
es_es: Lee más en el :ref:`Manual de usuario <labeled_faces_in_the_wild_dataset>`.

source: Parameters
es_es: Parámetros

source: Select the dataset to load: 'train' for the development training set, 'test' for the development test set, and '10_folds' for the official evaluation set that is meant to be used with a 10-folds cross validation.
es_es: Seleccione el conjunto de datos a cargar: 'train' para el conjunto de entrenamiento de desarrollo, 'test' para el conjunto de prueba de desarrollo, y '10_folds' para el conjunto de evaluación oficial que está destinado a ser utilizado con una validación cruzada de 10 veces.

source: Specify another download and cache folder for the datasets. By default all scikit-learn data is stored in '~/scikit_learn_data' subfolders.
es_es: Especifique otra carpeta de descarga y caché para los conjuntos de datos. Por defecto todos los datos de scikit-learn se almacenan en las subcarpetas '~/scikit_learn_data'.

source: Download and use the funneled variant of the dataset.
es_es: Descargue y utilice la variante con embudo del conjunto de datos.

source: Ratio used to resize the each face picture.
es_es: Relación utilizada para redimensionar la imagen de cada cara.

source: Keep the 3 RGB channels instead of averaging them to a single gray level channel. If color is True the shape of the data has one more dimension than the shape with color = False.
es_es: Mantener los 3 canales RGB en lugar de promediarlos en un solo canal de nivel de gris. Si color es True la forma de los datos tiene una dimensión más que la forma con color = False.

source: tuple of slice, default=(slice(70, 195), slice(78, 172))
es_es: tupla de corte, por defecto=(corte(70, 195), corte(78, 172))

source: Provide a custom 2D slice (height, width) to extract the 'interesting' part of the jpeg files and avoid use statistical correlation from the background
es_es: Proporciona un corte 2D personalizado (altura, anchura) para extraer la parte "interesante" de los archivos jpeg y evitar el uso de la correlación estadística del fondo

source: If False, raise a IOError if the data is not locally available instead of trying to download the data from the source site.
es_es: Si es False, lanza un IOError si los datos no están disponibles localmente en lugar de intentar descargar los datos del sitio de origen.

source: Returns
es_es: Salida

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo diccionario, con los siguientes atributos.

source: data : ndarray of shape (2200, 5828). Shape depends on ``subset``.
es_es: data : ndarray con forma (2200, 5828). La forma depende de ``subset``.

source: ndarray of shape (2200, 5828). Shape depends on
es_es: ndarray de forma (2200, 5828). La forma depende de

source: Each row corresponds to 2 ravel'd face images of original size 62 x 47 pixels. Changing the ``slice_``, ``resize`` or ``subset`` parameters will change the shape of the output.
es_es: Cada fila corresponde a 2 imágenes faciales de tamaño original 62 x 47 píxeles. Si se cambian los parámetros ``slice_``, ``resize`` o ``subset`` se cambiará la forma de la salida.

source: pairs : ndarray of shape (2200, 2, 62, 47). Shape depends on ``subset``
es_es: pairs : ndarray de forma (2200, 2, 62, 47). La forma depende de ``subset``

source: ndarray of shape (2200, 2, 62, 47). Shape depends on
es_es: ndarray de forma (2200, 2, 62, 47). La forma depende de

source: Each row has 2 face images corresponding to same or different person from the dataset containing 5749 people. Changing the ``slice_``, ``resize`` or ``subset`` parameters will change the shape of the output.
es_es: Cada fila tiene 2 imágenes de caras que corresponden a la misma o diferente persona del conjunto de datos que contiene 5749 personas. Si se cambian los parámetros ``slice_``, ``resize`` o ``subset`` se cambiará la forma de la salida.

source: target : numpy array of shape (2200,). Shape depends on ``subset``.
es_es: target : matriz numpy de shape (2200,). La forma depende de ``subset``.

source: numpy array of shape (2200,). Shape depends on
es_es: arreglo numpy de forma (2200,). La forma depende de

source: Labels associated to each pair of images. The two label values being different persons or the same person.
es_es: Etiquetas asociadas a cada par de imágenes. Los dos valores de las etiquetas son personas diferentes o la misma persona.

source: string
es_es: cadena

source: Description of the Labeled Faces in the Wild (LFW) dataset.
es_es: Descripción del conjunto de datos Labeled Faces in the Wild (LFW).
