Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.manifold.TSNE.po
Languages: es_es

source: t-distributed Stochastic Neighbor Embedding.
es_es: Embedding Estocástico de Vecinos distribuido en t (t-EEV, o t-SNE en inglés).

source: t-SNE [1] is a tool to visualize high-dimensional data. It converts similarities between data points to joint probabilities and tries to minimize the Kullback-Leibler divergence between the joint probabilities of the low-dimensional embedding and the high-dimensional data. t-SNE has a cost function that is not convex, i.e. with different initializations we can get different results.
es_es: t-SNE [1] es una herramienta para visualizar datos de alta dimensión. Convierte similitudes entre los puntos de datos a probabilidades conjuntas e intenta minimizar la divergencia Kullback-Leibler entre las probabilidades conjuntas del embedding de bajas dimensiones y los datos de alta dimensión. t-SNE tiene una función de coste que no es convexa, es decir, con diferentes inicializaciones podemos obtener diferentes resultados.

source: It is highly recommended to use another dimensionality reduction method (e.g. PCA for dense data or TruncatedSVD for sparse data) to reduce the number of dimensions to a reasonable amount (e.g. 50) if the number of features is very high. This will suppress some noise and speed up the computation of pairwise distances between samples. For more tips see Laurens van der Maaten's FAQ [2].
es_es: Es altamente recomendable utilizar otro método de reducción de dimensiones (p. ej. PCA para datos densos o TruncatedSVD para datos dispersos) para reducir el número de dimensiones a una cantidad razonable (p. ej. 50) si el número de características es muy alto. Esto eliminará algo de ruido y acelerará el cálculo de distancias pares entre muestras. Para obtener más consejos consulte el FAQ de Laurens van der Maaten [2].

source: Read more in the :ref:`User Guide <t_sne>`.
es_es: Más información en el :ref:`Manual de usuario <t_sne>`.

source: Parameters
es_es: Parámetros

source: int, default=2
es_es: entero, default=2

source: Dimension of the embedded space.
es_es: Dimensión del espacio incrustado.

source: float, default=30.0
es_es: flotante, default=30.0

source: The perplexity is related to the number of nearest neighbors that is used in other manifold learning algorithms. Larger datasets usually require a larger perplexity. Consider selecting a value between 5 and 50. Different values can result in significantly different results.
es_es: La perplejidad está relacionada con el número de vecinos más cercanos que se utiliza en otros algoritmos de aprendizaje múltiples. Los conjuntos de datos más grandes generalmente requieren una perplejidad mayor. Considere seleccionar un valor entre 5 y 50. Los valores diferentes pueden dar resultados significativamente diferentes.

source: float, default=12.0
es_es: flotante, default=12.0

source: Controls how tight natural clusters in the original space are in the embedded space and how much space will be between them. For larger values, the space between natural clusters will be larger in the embedded space. Again, the choice of this parameter is not very critical. If the cost function increases during initial optimization, the early exaggeration factor or the learning rate might be too high.
es_es: Controla que tan estrechos son los conglomerados naturales del espacio original en el espacio incrustado y cuánto espacio habrá entre ellos. Para valores más grandes, el espacio entre los conglomerados naturales será mayor en el espacio incrustado. De nuevo, la elección de este parámetro no es muy crítica. Si la función de coste aumenta durante la optimización inicial, el factor de exageración temprana o la tasa de aprendizaje podrían ser demasiado altos.

source: float, default=200.0
es_es: flotante, default=200.0

source: The learning rate for t-SNE is usually in the range [10.0, 1000.0]. If the learning rate is too high, the data may look like a 'ball' with any point approximately equidistant from its nearest neighbours. If the learning rate is too low, most points may look compressed in a dense cloud with few outliers. If the cost function gets stuck in a bad local minimum increasing the learning rate may help.
es_es: La tasa de aprendizaje para t-SNE suele estar en el rango [10.0, 1000.0]. Si la tasa de aprendizaje es demasiado alta, los datos pueden parecer un 'balón' con cualquier punto aproximadamente equidistante de sus vecinos más cercanos. Si la tasa de aprendizaje es demasiado baja, la mayoría de los puntos pueden parecer comprimidos en una nube densa, con pocos atípicos. Si la función de costo se atasca en un mal mínimo local aumentar la tasa de aprendizaje puede ayudar.

source: int, default=1000
es_es: entero, default=1000

source: Maximum number of iterations for the optimization. Should be at least 250.
es_es: Número máximo de iteraciones para la optimización. Debe ser al menos 250.

source: int, default=300
es_es: entero, default=300

source: Maximum number of iterations without progress before we abort the optimization, used after 250 initial iterations with early exaggeration. Note that progress is only checked every 50 iterations so this value is rounded to the next multiple of 50.
es_es: Número máximo de iteraciones sin progreso antes de abortar la optimización, usada después de 250 iteraciones iniciales con exageración temprana. Tenga en cuenta que el progreso sólo se comprueba cada 50 iteraciones, así que este valor se redondea al siguiente múltiplo de 50.

source: parameter *n_iter_without_progress* to control stopping criteria.
es_es: parámetro *n_iter_without_progress* para controlar los criterios de parada.

source: float, default=1e-7
es_es: flotante, default=1e-7

source: If the gradient norm is below this threshold, the optimization will be stopped.
es_es: Si la norma de gradiente está por debajo de este umbral, la optimización se detendrá.

source: str or callable, default='euclidean'
es_es: cadena o invocable, default='euclidean'

source: The metric to use when calculating distance between instances in a feature array. If metric is a string, it must be one of the options allowed by scipy.spatial.distance.pdist for its metric parameter, or a metric listed in pairwise.PAIRWISE_DISTANCE_FUNCTIONS. If metric is "precomputed", X is assumed to be a distance matrix. Alternatively, if metric is a callable function, it is called on each pair of instances (rows) and the resulting value recorded. The callable should take two arrays from X as input and return a value indicating the distance between them. The default is "euclidean" which is interpreted as squared euclidean distance.
es_es: La métrica a utilizar cuando se calcula la distancia entre instancias en un arreglo de características. Si la métrica es una cadena de caracteres, debe ser una de las opciones permitidas por scipy.spatial.distance.pdist para su parámetro de métrica, o una métrica listada en pairwise.PAIRWISE_DISTANCE_FUNCTIONS. Si metric es "precomputed", se asume que X es una matriz de distancia. Alternativamente, si la métrica es una función invocable, se llama a cada par de instancias (filas) y se registra el valor resultante. El invocable debe tomar dos arreglos de X como entrada y devolver un valor que indique la distancia entre ellos. El valor por defecto es "euclidean", que es interpretado como la distancia euclidiana cuadrática.

source: {'random', 'pca'} or ndarray of shape (n_samples, n_components), default='random'
es_es: {'random', 'pca'} o ndarray de la forma (n_samples, n_components), default='random'

source: Initialization of embedding. Possible options are 'random', 'pca', and a numpy array of shape (n_samples, n_components). PCA initialization cannot be used with precomputed distances and is usually more globally stable than random initialization.
es_es: Inicialización de la incrustación. Las opciones posibles son 'random', 'pca' y un arreglo numpy de forma (n_samples, n_components). La inicialización PCA no se puede utilizar con distancias precalculadas y es generalmente más estable globalmente que la inicialización aleatoria.

source: int, default=0
es_es: entero, default=0

source: Verbosity level.
es_es: Nivel de verbosidad.

source: int, RandomState instance or None, default=None
es_es: entero, instancia RandomState o None, default=None

source: Determines the random number generator. Pass an int for reproducible results across multiple function calls. Note that different initializations might result in different local minima of the cost function. See :term: `Glossary <random_state>`.
es_es: Determina el generador de números aleatorios. Pase un int para resultados reproducibles a través de múltiples llamadas de funciones. Tenga en cuenta que diferentes inicializaciones pueden resultar en diferentes mínimos locales de la función de costo. Vea :term: `Glosario <random_state>`.

source: By default the gradient calculation algorithm uses Barnes-Hut approximation running in O(NlogN) time. method='exact' will run on the slower, but exact, algorithm in O(N^2) time. The exact algorithm should be used when nearest-neighbor errors need to be better than 3%. However, the exact method cannot scale to millions of examples.
es_es: Por defecto, el algoritmo de cálculo de gradiente usa la aproximación de Barnes-Hut ejecutándose en el tiempo O(NlogN). method='exact' se ejecutará en el algoritmo más lento, pero exacto en el tiempo O(N^2). El algoritmo exacto debe utilizarse cuando los errores cercanos al vecino necesitan ser mejores que el 3%. Sin embargo, el método exacto no puede escalar a millones de ejemplos.

source: Approximate optimization *method* via the Barnes-Hut.
es_es: *Método* de optimización de aproximados a través del Barnes-Hut.

source: float, default=0.5
es_es: flotante, default=0.5

source: Only used if method='barnes_hut' This is the trade-off between speed and accuracy for Barnes-Hut T-SNE. 'angle' is the angular size (referred to as theta in [3]) of a distant node as measured from a point. If this size is below 'angle' then it is used as a summary node of all points contained within it. This method is not very sensitive to changes in this parameter in the range of 0.2 - 0.8. Angle less than 0.2 has quickly increasing computation time and angle greater 0.8 has quickly increasing error.
es_es: Sólo se utiliza si method='barnes_hut' Este es el intercambio entre velocidad y precisión para Barnes-Hut T-SNE. 'angle' es el tamaño angular (denominado theta en [3]) de un nodo distante medido desde un punto. Si este tamaño está por debajo de 'angle', entonces se utiliza como un nodo resumen de todos los puntos contenidos en él. Este método no es muy sensible a los cambios en este parámetro en el rango de 0. - 0.8. Ángulos inferiores a 0.2 aumentan rápidamente el tiempo de cálculo y ángulos mayores a 0.8 aumentan rápidamente el error.

source: int, default=None
es_es: entero, default=None

source: The number of parallel jobs to run for neighbors search. This parameter has no impact when ``metric="precomputed"`` or (``metric="euclidean"`` and ``method="exact"``). ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos que se ejecutan en paralelo para la busqueda de vecinos. Este parámetro no tiene impacto cuando ``metric="precomputed"`` o (``metric="euclidean"`` y method="exact"``). ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: True or 'legacy', default='legacy'
es_es: True o 'legacy', default='legacy'

source: Whether TSNE should square the distance values. ``'legacy'`` means that distance values are squared only when ``metric="euclidean"``. ``True`` means that distance values are squared for all metrics.
es_es: Si TSNE debe calcular los cuadrados para los valores de distancia. ``'legacy'`` significa que los valores de distancia son cuadrados sólo cuando ``metric="euclidean"``. ``True`` significa que los valores de distancia son cuadrados para todas las métricas.

source: Added to provide backward compatibility during deprecation of legacy squaring behavior.
es_es: Añadido para proporcionar compatibilidad hacia atrás durante la obsolescencia del comportamiento de cuadrados de legado.

source: Legacy squaring behavior was deprecated in 0.24. The ``'legacy'`` value will be removed in 1.1 (renaming of 0.26), at which point the default value will change to ``True``.
es_es: El comportamiento de cuadrado de legado fue obsoleto en 0.24. El valor ``'legacy'`` se eliminará en 1.1. (renombrado en 0.26), por lo que el valor por defecto cambiará a ``True``.

source: Attributes
es_es: Atributos

source: array-like of shape (n_samples, n_components)
es_es: tipo arreglo de forma (n_samples, n_components)

source: Stores the embedding vectors.
es_es: Almacena los vectores de embedding.

source: float
es_es: flotante

source: Kullback-Leibler divergence after optimization.
es_es: Divergencia Kullback-Leibler después de la optimización.

source: int
es_es: entero

source: Number of iterations run.
es_es: Número de iteraciones realizadas.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit X into an embedded space.
es_es: Ajusta X en un espacio incrustado.

source: Fit X into an embedded space and return that transformed output.
es_es: Ajusta a X dentro de un espacio incrustado y devuelve esa salida transformada.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: ndarray of shape (n_samples, n_features) or (n_samples, n_samples)
es_es: ndarray de forma (n_samples, n_features) o (n_samples, n_samples)

source: If the metric is 'precomputed' X must be a square distance matrix. Otherwise it contains a sample per row. If the method is 'exact', X may be a sparse matrix of type 'csr', 'csc' or 'coo'. If the method is 'barnes_hut' and the metric is 'precomputed', X may be a precomputed sparse graph.
es_es: Si la metrica es 'precomputed' X debe ser una matriz de distancia cuadrática. De lo contrario contiene una muestra por fila. Si el método es 'exact', X podría ser una matriz dispersa de tipo 'csr', 'csc' o 'coo'. Si el método es 'barnes_hut' y la métrica es 'precomputed', X podría ser un gráfico disperso precalculado.

source: Ignored
es_es: Ignorado

source: Returns
es_es: Salida

source: ndarray of shape (n_samples, n_components)
es_es: ndarray de forma (n_samples, n_components)

source: Embedding of the training data in low-dimensional space.
es_es: Incrustación de los datos de entrenamiento en un espacio de baja dimensión.

source: bool, default=True
es_es: booleano, default=True

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los sub objetos contenidos que son estimadores.

source: dict
es_es: diccionario

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: Examples using ``sklearn.manifold.TSNE``
es_es: Ejemplos usando ``sklearn.manifold.TSNE``
