Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.murmurhash3_32.po
Languages: es_es

source: Compute the 32bit murmurhash3 of key at seed.
es_es: Calcula el murmurhash3 de 32 bits de la clave en la semilla.

source: The underlying implementation is MurmurHash3_x86_32 generating low latency 32bits hash suitable for implementing lookup tables, Bloom filters, count min sketch or feature hashing.
es_es: La implementación subyacente es MurmurHash3_x86_32 que genera un hash de 32bits de baja latencia adecuado para implementar tablas de búsqueda, filtros Bloom, count min sketch o feature hashing.

source: Parameters
es_es: Parámetros

source: np.int32, bytes, unicode or ndarray of dtype=np.int32
es_es: np.int32, bytes, unicode o ndarray de dtype=np.int32

source: The physical object to hash.
es_es: El objeto físico a hashear.

source: Integer seed for the hashing algorithm.
es_es: Semilla entera para el algoritmo hashing.

source: True: the results is casted to an unsigned int
es_es: True: el resultado se convierte en un número entero (int) sin signo

source: from 0 to 2 ** 32 - 1
es_es: de 0 a 2 ** 32 - 1

source: False: the results is casted to a signed int
es_es: Falso: el resultado se convierte en un número entero (int) con signo

source: from -(2 ** 31) to 2 ** 31 - 1
es_es: de -(2 ** 31) a 2 ** 31 - 1
