Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.linear_model.LogisticRegressionCV.po
Languages: es_es

source: array-like of shape (n_samples, n_classes)
es_es: array-like de forma (n_samples, n_classes)

source: Returns the log-probability of the sample for each class in the model, where classes are ordered as they are in ``self.classes_``.
es_es: Devuelve la probabilidad logarítmica de la muestra para cada clase en el modelo, donde las clases se ordenan como están en ``self.classes_``.

source: For a multi_class problem, if multi_class is set to be "multinomial" the softmax function is used to find the predicted probability of each class. Else use a one-vs-rest approach, i.e calculate the probability of each class assuming it to be positive using the logistic function. and normalize these values across all the classes.
es_es: Para un problema multi_class, si multi_class está establecido como "multinomial" se utiliza la función softmax para encontrar la probabilidad predicha de cada clase. De lo contrario, se utiliza un enfoque de uno contra el resto, es decir, se calcula la probabilidad de cada clase asumiendo que es positiva utilizando la función logística y se normalizan estos valores en todas las clases.

source: Returns the probability of the sample for each class in the model, where classes are ordered as they are in ``self.classes_``.
es_es: Devuelve la probabilidad de la muestra para cada clase en el modelo, donde las clases se ordenan como están en ``self.classes_``.

source: Test samples.
es_es: Muestras de prueba.

source: True labels for X.
es_es: Etiquetas verdaderas para X.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de muestras.

source: Score of self.predict(X) wrt. y.
es_es: Puntuación de self.predict(X) con respecto a y.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: Converts the ``coef_`` member to a scipy.sparse matrix, which for L1-regularized models can be much more memory- and storage-efficient than the usual numpy.ndarray representation.
es_es: Convierte el miembro ``coef_`` en una matriz scipy.sparse, que para los modelos L1-regularizados puede ser mucho más eficiente en cuanto a memoria y almacenamiento que la representación numpy.ndarray habitual.

source: The ``intercept_`` member is not converted.
es_es: El miembro ``intercept_`` no se convierte.

source: Notes
es_es: Notas

source: For non-sparse models, i.e. when there are not many zeros in ``coef_``, this may actually *increase* memory usage, so use this method with care. A rule of thumb is that the number of zero elements, which can be computed with ``(coef_ == 0).sum()``, must be more than 50% for this to provide significant benefits.
es_es: Para los modelos no dispersos, es decir, cuando no hay muchos ceros en ``coef_``, esto puede en realidad *aumentar* el uso de la memoria, así que utiliza este método con cuidado. Una regla general es que el número de elementos cero, que puede ser calculado con ``(coef_ == 0).sum()``, debe ser más del 50% para que esto proporcione beneficios significativos.

source: After calling this method, further fitting with the partial_fit method (if any) will not work until you call densify.
es_es: Después de llamar a este método, el ajuste posterior con el método partial_fit (si lo hay) no funcionará hasta que llames a densify.
