Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.svm.NuSVR.po
Languages: es_es

source: Nu Support Vector Regression.
es_es: Regresión de Vector de Soporte Nu.

source: Similar to NuSVC, for regression, uses a parameter nu to control the number of support vectors. However, unlike NuSVC, where nu replaces C, here nu replaces the parameter epsilon of epsilon-SVR.
es_es: Similar a NuSVC, para regresión, utiliza un parámetro nu para controlar el número de vectores de soporte. Sin embargo, a diferencia de NuSVC, donde nu sustituye C, aquí nu reemplaza el parámetro epsilon de epsilon-SVR.

source: The implementation is based on libsvm.
es_es: La implementación se basa en libsvm.

source: Read more in the :ref:`User Guide <svm_regression>`.
es_es: Lee más en el :ref:`Manual de usuario <svm_regression>`.

source: Parameters
es_es: Parámetros

source: float, default=0.5
es_es: flotante, default=0.5

source: An upper bound on the fraction of training errors and a lower bound of the fraction of support vectors. Should be in the interval (0, 1]. By default 0.5 will be taken.
es_es: Límite superior en la fracción de errores de entrenamiento y un límite inferior de la fracción de vectores de soporte. Debe estar en el intervalo (0, 1]. Por defecto se tomará 0.5.

source: float, default=1.0
es_es: flotante, default=1.0

source: Penalty parameter C of the error term.
es_es: Parámetro de penalización C del término de error.

source: Specifies the kernel type to be used in the algorithm. It must be one of 'linear', 'poly', 'rbf', 'sigmoid', 'precomputed' or a callable. If none is given, 'rbf' will be used. If a callable is given it is used to precompute the kernel matrix.
es_es: Especifica el tipo de núcleo a ser usado en el algoritmo. Debe ser uno de 'linear', 'poly', 'rby', 'sigmoid', 'precomputed' o un invocable. Si no se da ninguna, se utilizará 'rbf'. Si un invocable es dado se utilizara para precalcular la matriz del núcleo.

source: int, default=3
es_es: entero, default=3

source: Degree of the polynomial kernel function ('poly'). Ignored by all other kernels.
es_es: Grado de la función de núcleo polinómico ('poly'). Ignorado por todos los otros núcleos.

source: {'scale', 'auto'} or float, default='scale'
es_es: {'scale', 'auto'} o flotanto, default='scale'

source: Kernel coefficient for 'rbf', 'poly' and 'sigmoid'.
es_es: Coeficiente de núcleo para 'rbf', 'poly' y 'sigmoid'.

source: if ``gamma='scale'`` (default) is passed then it uses 1 / (n_features * X.var()) as value of gamma,
es_es: si se pasa ``gamma='scale'`` (valor predeterminado), entonces se usa 1 / (n_features * X.var()) como valor de gamma,

source: if 'auto', uses 1 / n_features.
es_es: si 'auto', utiliza 1 / n_features.

source: The default value of ``gamma`` changed from 'auto' to 'scale'.
es_es: El valor por defecto de ``gamma`` cambió de 'auto' a 'scale'.

source: float, default=0.0
es_es: flotante, default=0.0

source: Independent term in kernel function. It is only significant in 'poly' and 'sigmoid'.
es_es: Término independiente en la función del núcleo. Sólo es significativo en 'poly' y 'sigmoid'.

source: bool, default=True
es_es: booleano, default=True

source: Whether to use the shrinking heuristic. See the :ref:`User Guide <shrinking_svm>`.
es_es: Si se usa o no la heurística de reducción. Vea el :ref:`Manual de usuario <shrinking_svm>`.

source: float, default=1e-3
es_es: flotante, default=1e-3

source: Tolerance for stopping criterion.
es_es: Tolerancia para el criterio de parada.

source: float, default=200
es_es: flotante, default=200

source: Specify the size of the kernel cache (in MB).
es_es: Específica el tamaño del caché del núcleo (en MB).

source: bool, default=False
es_es: booleano, default=False

source: Enable verbose output. Note that this setting takes advantage of a per-process runtime setting in libsvm that, if enabled, may not work properly in a multithreaded context.
es_es: Activar salida detallada. Tenga en cuenta que esta configuración toma ventaja de una configuración por proceso en el tiempo de ejecución en libsvm que, si está habilitada, puede no funcionar correctamente en un contexto multihilo.

source: Hard limit on iterations within solver, or -1 for no limit.
es_es: Limite fuerte en iteraciones dentro del solucionador, o -1 para ningún límite.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Multipliers of parameter C for each class. Computed based on the ``class_weight`` parameter.
es_es: Multiplicadores del parámetro C para cada clase. Calculado basado en el parámetro ``class_weight``.

source: Weights assigned to the features (coefficients in the primal problem). This is only available in the case of a linear kernel.
es_es: Ponderados asignados a las características (coeficientes en el problema primario). Esto solo está disponible en el caso de un núcleo lineal.

source: `coef_` is readonly property derived from `dual_coef_` and `support_vectors_`.
es_es: `coef_` es propiedad de solo lectura derivada de `dual_coef_` y `support_vectors_`.

source: ndarray of shape (1, n_SV)
es_es: ndarray de forma (1, n_SV)

source: Coefficients of the support vector in the decision function.
es_es: Coeficientes de los vectores de soporte en la función de decisión.

source: int
es_es: entero

source: 0 if correctly fitted, 1 otherwise (will raise warning)
es_es: 0 si se ajusta correctamente, 1 en caso contrario (producirá una advertencia)

source: ndarray of shape (1,)
es_es: ndarray de forma (1,)

source: Constants in decision function.
es_es: Constantes en la función de decisión.

source: ndarray of shape (n_classes,), dtype=int32
es_es: ndarray de forma (n_classes,), dtype=int32

source: Number of support vectors for each class.
es_es: Número de vectores de soporte para cada clase.

source: tuple of int of shape (n_dimensions_of_X,)
es_es: tupla de int de la forma (n_dimensions_of_X,)

source: Array dimensions of training vector ``X``.
es_es: Dimensiones del arreglo del vector de entrenamiento ``X``.

source: ndarray of shape (n_SV,)
es_es: ndarray de forma (n_SV,)

source: Indices of support vectors.
es_es: Indices de vectores de apoyo.

source: ndarray of shape (n_SV, n_features)
es_es: ndarray de forma (n_SV, n_features)

source: Support vectors.
es_es: Vectores de apoyo.

source: Support Vector Machine for classification implemented with libsvm with a parameter to control the number of support vectors.
es_es: Maquína de Vector de Soporte para la clasificación implementada con libsvm con un parámetro para controlar el número de vectores de soporte.

source: Epsilon Support Vector Machine for regression implemented with libsvm.
es_es: Maquína de Vector de Soporte de Epsilon para regresión implementado con libsvm.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the SVM model according to the given training data.
es_es: Ajusta el modelo SVM de acuerdo a los datos de entrenamiento dados.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Perform regression on samples in X.
es_es: Realiza la regresión en las muestras en X.

source: Return the coefficient of determination :math:`R^2` of the prediction.
es_es: Devuelve el coeficiente de determinación :math:`R^2` de la predicción.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: {array-like, sparse matrix} of shape (n_samples, n_features) or (n_samples, n_samples)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features) o (n_samples, n_samples)

source: Training vectors, where n_samples is the number of samples and n_features is the number of features. For kernel="precomputed", the expected shape of X is (n_samples, n_samples).
es_es: Vectores de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características. Para kernel="precomputed", la forma esperada de X es (n_samples, n_samples).

source: array-like of shape (n_samples,)
es_es: arreglo tipo de forma (n_samples,)

source: Target values (class labels in classification, real numbers in regression).
es_es: Valores objetivo (etiquetas de clase en clasificación, números reales en regresión).

source: array-like of shape (n_samples,), default=None
es_es: tipo de arreglo de forma (n_samples,) default=None

source: Per-sample weights. Rescale C per sample. Higher weights force the classifier to put more emphasis on these points.
es_es: Ponderados por muestra. Reescalado de C por muestra. Los ponderados más altos obligan al clasificador a poner más énfasis en estos puntos.

source: Returns
es_es: Salida

source: Notes
es_es: Notas

source: If X and y are not C-ordered and contiguous arrays of np.float64 and X is not a scipy.sparse.csr_matrix, X and/or y may be copied.
es_es: Si X y y no son arreglos contiguos y C-ordenados de np.float64 y X no es un scipy.sparse.csr_matrix, X y/o y pueden ser copiados.

source: If X is a dense array, then the other methods will not support sparse matrices as input.
es_es: Si X es un arreglo denso, entonces los otros métodos no soportaran matrices dispersas como entrada.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los sub objetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: For an one-class model, +1 (inlier) or -1 (outlier) is returned.
es_es: Para un modelo de una clase, se devuelve +1 (valor típico) o -1 (valor atípico).

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: For kernel="precomputed", the expected shape of X is (n_samples_test, n_samples_train).
es_es: Para kernel="precomputed", la forma esperada de X es (n_samples_test, n_samples_train).

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The coefficient :math:`R^2` is defined as :math:`(1 - \frac{u}{v})`, where :math:`u` is the residual sum of squares ``((y_true - y_pred) ** 2).sum()`` and :math:`v` is the total sum of squares ``((y_true - y_true.mean()) ** 2).sum()``. The best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of `y`, disregarding the input features, would get a :math:`R^2` score of 0.0.
es_es: El coeficiente :math:`R^2` se define como :math:`(1 - \frac{u}{v})`, donde :math:`u` es la suma de cuadrados de los residuos ``((y_true - y_pred) ** 2).sum()`` y :math:`v` es la suma total de cuadrados ``((y_true - y_true.mean()) ** 2).sum()``. La mejor puntuación posible es 1.0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de `y`, sin tener en cuenta las características de entrada, obtendría una puntuación :math:`R^2` de 0.0.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples_X, n_features)

source: Test samples. For some estimators this may be a precomputed kernel matrix or a list of generic objects instead with shape ``(n_samples, n_samples_fitted)``, where ``n_samples_fitted`` is the number of samples used in the fitting for the estimator.
es_es: Muestras de prueba. Para algunos estimadores puede ser una matriz de kernel precalculada o una lista de objetos genéricos con forma ``(n_muestras, n_muestras_ajustadas)``, donde ``n_muestras_ajustadas`` es el número de muestras utilizadas en el ajuste para el estimador.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: tipo de arreglo de forma (n_samples,) o (n_samples, n_outputs)

source: True values for `X`.
es_es: Valores verdaderos para X`.

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: float
es_es: de punto flotante (float)

source: :math:`R^2` of ``self.predict(X)`` wrt. `y`.
es_es: :math:`R^2` de ``self.predict(X)`` con respecto a `y`.

source: The :math:`R^2` score used when calling ``score`` on a regressor uses ``multioutput='uniform_average'`` from version 0.23 to keep consistent with default value of :func:`~sklearn.metrics.r2_score`. This influences the ``score`` method of all the multioutput regressors (except for :class:`~sklearn.multioutput.MultiOutputRegressor`).
es_es: La puntuación :math:`R^2` utilizada al llamar a ``score`` en un regresor utiliza ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la consistencia con el valor por defecto de :func:`~sklearn.metrics.r2_score`. Esto influye en el método ``score`` de todos los regresores de salida múltiple (excepto para :class:`~sklearn.multioutput.MultiOutputRegressor`).

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia de estimador.

source: Examples using ``sklearn.svm.NuSVR``
es_es: Ejemplos usando ``sklearn.svm.NuSVR``
