Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.shuffle.po
Languages: es_es

source: Shuffle arrays or sparse matrices in a consistent way.
es_es: Revuelve arreglos o matrices dispersas de forma coherente.

source: This is a convenience alias to ``resample(*arrays, replace=False)`` to do random permutations of the collections.
es_es: Este es un alias de conveniencia para ``resample(*arrays, replace=False)`` para hacer permutaciones aleatorias de las colecciones.

source: Parameters
es_es: Parámetros

source: sequence of indexable data-structures
es_es: secuencia de estructuras de datos indexables

source: Indexable data-structures can be arrays, lists, dataframes or scipy sparse matrices with consistent first dimension.
es_es: Las estructuras de datos indexables pueden ser arreglos, listas, dataframes o matrices dispersas scipy con una primera dimensión consistente.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Determines random number generation for shuffling the data. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para revolver los datos. Pasa un número entero (int) para obtener resultados reproducibles a través de múltiples invocaciones a la función. Consulta el :term:`Glosario <random_state>`.

source: Number of samples to generate. If left to None this is automatically set to the first dimension of the arrays. It should not be larger than the length of arrays.
es_es: Número de muestras a generar. Si se deja en None se establece automáticamente a la primera dimensión de los arreglos. No debe ser mayor que la longitud de los arreglos.

source: Returns
es_es: Devuelve

source: Sequence of shuffled copies of the collections. The original arrays are not impacted.
es_es: Secuencia de copias revueltas de las colecciones. Los arreglos originales no se ven afectados.

source: Examples
es_es: Ejemplos

source: It is possible to mix sparse and dense arrays in the same run::
es_es: Es posible mezclar arreglos dispersos y densos en la misma ejecución::

source: Examples using ``sklearn.utils.shuffle``
es_es: Ejemplos utilizando ``sklearn.utils.shuffle``
