Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.normalized_mutual_info_score.po
Languages: es_es

source: Normalized Mutual Information between two clusterings.
es_es: Información Mutua Normalizada entre dos conglomerados.

source: Normalized Mutual Information (NMI) is a normalization of the Mutual Information (MI) score to scale the results between 0 (no mutual information) and 1 (perfect correlation). In this function, mutual information is normalized by some generalized mean of ``H(labels_true)`` and ``H(labels_pred))``, defined by the `average_method`.
es_es: La Información Mutua Normalizada (Normalized Mutual Information, NMI) es una normalización de la puntuación de la Información Mutua (Mutual Information, MI) para escalar los resultados entre 0 (sin información mutua) y 1 (correlación perfecta). En esta función, la información mutua se normaliza mediante una media generalizada de ``H(labels_true)`` y ``H(labels_pred))``, definida por el `average_method`.

source: This measure is not adjusted for chance. Therefore :func:`adjusted_mutual_info_score` might be preferred.
es_es: Esta medida no está ajustada para el azar. Por lo tanto, podría ser preferible :func:`adjusted_mutual_info_score` .

source: This metric is independent of the absolute values of the labels: a permutation of the class or cluster label values won't change the score value in any way.
es_es: Esta métrica es independiente de los valores absolutos de las etiquetas: una permutación de los valores de las etiquetas de la clase o del conglomerado no cambiará el valor de la puntuación de ninguna manera.

source: This metric is furthermore symmetric: switching ``label_true`` with ``label_pred`` will return the same score value. This can be useful to measure the agreement of two independent label assignments strategies on the same dataset when the real ground truth is not known.
es_es: Esta métrica es además simétrica: si se cambia ``label_true`` por ``label_pred`` devolverá el mismo valor de puntuación. Esto puede ser útil para medir la concordancia de dos estrategias independientes de asignación de etiquetas en el mismo conjunto de datos cuando no se conoce la verdad fundamental real.

source: Read more in the :ref:`User Guide <mutual_info_score>`.
es_es: Leer más en el :ref:`Manual de Usuario <mutual_info_score>`.

source: Parameters
es_es: Parámetros

source: A clustering of the data into disjoint subsets.
es_es: Un conglomerado de los datos en subconjuntos disjuntos.

source: int array-like of shape (n_samples,)
es_es: int array-like de forma (n_samples,)

source: How to compute the normalizer in the denominator. Possible options are 'min', 'geometric', 'arithmetic', and 'max'.
es_es: Cómo calcular el normalizador en el denominador. Las opciones posibles son 'min', 'geometric', 'arithmetic' y 'max'.

source: The default value of ``average_method`` changed from 'geometric' to 'arithmetic'.
es_es: El valor predeterminado de ``average_method`` cambió de 'geometric' a 'arithmetic'.

source: Returns
es_es: Devuelve

source: score between 0.0 and 1.0. 1.0 stands for perfectly complete labeling
es_es: puntuación entre 0.0 y 1.0. 1.0 significa un etiquetado perfectamente completo

source: V-Measure (NMI with arithmetic mean option).
es_es: V-Measure (NMI con opción de media aritmética).

source: Adjusted Rand Index.
es_es: Índice de Rand ajustado (adjusted Rand Index).

source: Adjusted Mutual Information (adjusted against chance).
es_es: Información Mutua Ajustada (ajustada contra el azar).

source: Examples
es_es: Ejemplos

source: Perfect labelings are both homogeneous and complete, hence have score 1.0::
es_es: Los etiquetados perfectos son homogéneos y completos, por lo que tienen una puntuación de 1.0::

source: If classes members are completely split across different clusters, the assignment is totally in-complete, hence the NMI is null::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente incompleta, por lo que el NMI es nulo::
