Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.estimator_checks.check_estimator.po
Languages: es_es

source: Check if estimator adheres to scikit-learn conventions.
es_es: Comprueba si el estimador cumple las convenciones de scikit-learn.

source: This estimator will run an extensive test-suite for input validation, shapes, etc, making sure that the estimator complies with `scikit-learn` conventions as detailed in :ref:`rolling_your_own_estimator`. Additional tests for classifiers, regressors, clustering or transformers will be run if the Estimator class inherits from the corresponding mixin from sklearn.base.
es_es: Este estimador ejecutará un extenso conjunto de pruebas para la validación de la entrada, las formas, etc, asegurándose de que el estimador cumple con las convenciones de `scikit-learn` como se detalla en :ref:`rolling_your_own_estimator`. Se ejecutarán pruebas adicionales para clasificadores, regresores, conglomerados o transformadores si la clase Estimator hereda del mixin correspondiente de sklearn.base.

source: Setting `generate_only=True` returns a generator that yields (estimator, check) tuples where the check can be called independently from each other, i.e. `check(estimator)`. This allows all checks to be run independently and report the checks that are failing.
es_es: Al establecer `generate_only=True` se obtiene un generador que produce tuplas (estimador, comprobación) en las que la comprobación puede llamarse de forma independiente, es decir, `check(estimador)`. Esto permite que todas las comprobaciones se ejecuten de forma independiente y que se informe de las comprobaciones que fallan.

source: scikit-learn provides a pytest specific decorator, :func:`~sklearn.utils.parametrize_with_checks`, making it easier to test multiple estimators.
es_es: scikit-learn proporciona un decorador específico para pytest, :func:`~sklearn.utils.parametrize_with_checks`, haciendo más fácil probar múltiples estimadores.

source: Parameters
es_es: Parámetros

source: **Estimator**
es_es: **Estimador**

source: estimator object
es_es: objeto estimador

source: Estimator instance to check.
es_es: Instancia del estimador a comprobar.

source: Passing a class was deprecated in version 0.23, and support for classes was removed in 0.24.
es_es: Pasar una clase quedó obsoleto en la versión 0.23, y el soporte para clases fue eliminado en 0.24.

source: When `False`, checks are evaluated when `check_estimator` is called. When `True`, `check_estimator` returns a generator that yields (estimator, check) tuples. The check is run by calling `check(estimator)`.
es_es: Cuando `False`, las comprobaciones son evaluadas cuando `check_estimator` es llamado. Cuando `True`, `check_estimator` devuelve un generador que yields (estimador, verificar) tuplas. El cheque se ejecuta llamando `check(estimator)`.

source: Returns
es_es: Devuelve

source: generator
es_es: generador

source: Generator that yields (estimator, check) tuples. Returned when `generate_only=True`.
es_es: Generador que produce tuplas (estimador, verificación). Se devuelve cuando `generate_only=True`.
