Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.linear_model.MultiTaskElasticNetCV.po
Languages: es_es

source: Multi-task L1/L2 ElasticNet with built-in cross-validation.
es_es: ElasticNet multitarea L1/L2 con validación cruzada incorporada.

source: See glossary entry for :term:`cross-validation estimator`.
es_es: Ver entrada de glosario para :term:`estimador de validación cruzada`.

source: The optimization objective for MultiTaskElasticNet is::
es_es: El objetivo de optimización para MultiTaskElasticNet es::

source: Where::
es_es: Donde::

source: i.e. the sum of norm of each row.
es_es: es decir, la suma de la norma de cada fila.

source: Read more in the :ref:`User Guide <multi_task_elastic_net>`.
es_es: Más información en el :ref:`Manual de usuario <multi_task_elastic_net>`.

source: Parameters
es_es: Parámetros

source: float or list of float, default=0.5
es_es: flotante o lista de flotantes, default=0.5

source: The ElasticNet mixing parameter, with 0 < l1_ratio <= 1. For l1_ratio = 1 the penalty is an L1/L2 penalty. For l1_ratio = 0 it is an L2 penalty. For ``0 < l1_ratio < 1``, the penalty is a combination of L1/L2 and L2. This parameter can be a list, in which case the different values are tested by cross-validation and the one giving the best prediction score is used. Note that a good choice of list of values for l1_ratio is often to put more values close to 1 (i.e. Lasso) and less close to 0 (i.e. Ridge), as in ``[.1, .5, .7, .9, .95, .99, 1]``
es_es: El parámetro de mezcla de ElasticNet, con 0 < l1_ratio <= 1. Para l1_ratio = 1 la penalización es una penalización L1/L2. Para l1_ratio = 0 es una penalización L2. Para ``0 < l1_ratio < 1``, la penalización es una combinación de L1/L2 y L2. Este parámetro puede ser una lista, en cuyo caso se prueban los diferentes valores por validación cruzada y se utiliza el que da la mejor puntuación de predicción. Tenga en cuenta que una buena elección de la lista de valores para l1_ratio suele ser poner más valores cerca de 1 (es decir, Lasso) y menos cerca de 0 (es decir, Ridge), como en ``[.1, .5, .7, .9, .95, .99, 1]``

source: float, default=1e-3
es_es: flotante, default=1e-3

source: Length of the path. ``eps=1e-3`` means that ``alpha_min / alpha_max = 1e-3``.
es_es: Longitud de la ruta. ``eps=1e-3`` significa que ``alpha_min / alpha_max = 1e-3``.

source: int, default=100
es_es: entero, default=100

source: Number of alphas along the regularization path.
es_es: Número de alfas a lo largo de la ruta de regularización.

source: List of alphas where to compute the models. If not provided, set automatically.
es_es: Lista de alfas donde calcular los modelos. Si es None los alfas se establecen automáticamente.

source: bool, default=True
es_es: booleano, default=True

source: Whether to calculate the intercept for this model. If set to false, no intercept will be used in calculations (i.e. data is expected to be centered).
es_es: Si se calcula el intercepto para este modelo. Si se establece como falso, no se usara ningún intercepto en los cálculos (es decir, los datos se espera que estén centrados).

source: bool, default=False
es_es: booleano, default=False

source: This parameter is ignored when ``fit_intercept`` is set to False. If True, the regressors X will be normalized before regression by subtracting the mean and dividing by the l2-norm. If you wish to standardize, please use :class:`~sklearn.preprocessing.StandardScaler` before calling ``fit`` on an estimator with ``normalize=False``.
es_es: Este parámetro es ignorado cuando ``fit_intercept`` se establece como False. Si es True, los regresores X serán normalizados antes de la regresión restando la media y dividiendo por la norma l2. Si tu deseas estandarizar, por favor utiliza :class:`~sklearn.preprocessing.StandardScaler` antes de llamar ``fit`` en un estimador con ``normalize=False``.

source: int, default=1000
es_es: entero, default=1000

source: The maximum number of iterations.
es_es: Número máximo de iteraciones.

source: float, default=1e-4
es_es: flotante, default=1e-4

source: The tolerance for the optimization: if the updates are smaller than ``tol``, the optimization code checks the dual gap for optimality and continues until it is smaller than ``tol``.
es_es: La tolerancia para la optimización: si las actualizaciones son menores que ``tol``, el código de optimización comprueba la brecha dual para la optimalidad y continúa hasta que es menor que ``tol``.

source: int, cross-validation generator or iterable, default=None
es_es: entero, generador de validación cruzada o iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de división de la validación cruzada. Las posibles entradas para cv son:

source: None, to use the default 5-fold cross-validation,
es_es: None, para usar la validación cruzada de 5 partes por defecto,

source: int, to specify the number of folds.
es_es: entero, para especificar el número de pliegues.

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce divisiones (train, test) como matrices de índices.

source: For int/None inputs, :class:`KFold` is used.
es_es: Para entradas None/de enteros se usa :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: ``cv`` es el valor por defecto si None cambió de 3 partes a 5 partes.

source: If ``True``, X will be copied; else, it may be overwritten.
es_es: Si es ``True``, X se copiará; si no, puede ser sobrescrito.

source: bool or int, default=0
es_es: booleano o entero, default=0

source: Amount of verbosity.
es_es: Cantidad de verbosidad.

source: int, default=None
es_es: entero, default=None

source: Number of CPUs to use during the cross validation. Note that this is used only if multiple values for l1_ratio are given. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de CPUs a usar durante la validación cruzada. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa utilizar todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: int, RandomState instance, default=None
es_es: entero, instancia RandomState, default=None

source: The seed of the pseudo random number generator that selects a random feature to update. Used when ``selection`` == 'random'. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: La semilla del generador de números pseudo aleatorio que selecciona una característica aleatoria a actualizar. Usada cuando ``selection`` =='random'. Pasa un entero para una salida reproducible a través de multiples llamadas de función. Ver :term:`Glosario <random_state>`.

source: If set to 'random', a random coefficient is updated every iteration rather than looping over features sequentially by default. This (setting to 'random') often leads to significantly faster convergence especially when tol is higher than 1e-4.
es_es: Si se establece a 'random', un coeficiente aleatorio es actualizado cada iteración en lugar de hacer un bucle sobre características secuencialmente por defecto. Esto (establecer a 'random') a menudo lleva a convergencia significativamente mas rápida especialmente cuando tol es mayor que 1e-4.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_tasks,)
es_es: ndarray de forma (n_tasks,)

source: Independent term in decision function.
es_es: Término independiente en la función de decisión.

source: ndarray of shape (n_tasks, n_features)
es_es: ndarray de forma (n_tasks, n_features)

source: Parameter vector (W in the cost function formula). Note that ``coef_`` stores the transpose of ``W``, ``W.T``.
es_es: El parámetro vector (W en la fórmula de la función de costo). Ten en cuenta que ``coef_`` almacena la transposición de ``W``, ``W.T``.

source: float
es_es: flotante

source: The amount of penalization chosen by cross validation.
es_es: La cantidad de penalización elegida por validación cruzada.

source: ndarray of shape (n_alphas, n_folds) or (n_l1_ratio, n_alphas, n_folds)
es_es: ndarray de forma (n_alphas, n_folds) o (n_l1_ratio, n_alphas, n_folds)

source: Mean square error for the test set on each fold, varying alpha.
es_es: Error medio cuadrático para el conjunto de prueba en cada pliegue, variando l1_ratio y alfa.

source: ndarray of shape (n_alphas,) or (n_l1_ratio, n_alphas)
es_es: ndarray de forma (n_alphas,) o (n_l1_ratio, n_alphas)

source: The grid of alphas used for fitting, for each l1_ratio.
es_es: La cuadrícula de alfas usada para ajustar, por cada l1_ratio.

source: Best l1_ratio obtained by cross-validation.
es_es: El mejor l1_ratio obtenido por validación cruzada.

source: int
es_es: entero

source: Number of iterations run by the coordinate descent solver to reach the specified tolerance for the optimal alpha.
es_es: Número de iteraciones ejecutadas por el solucionador de descenso de coordenadas para alcanzar la tolerancia especificada para el alfa óptimo.

source: The dual gap at the end of the optimization for the optimal alpha.
es_es: Los huecos duales al final de la optimización para el alfa óptimo.

source: Notes
es_es: Notas

source: The algorithm used to fit the model is coordinate descent.
es_es: El algoritmo utilizado para encajar el modelo es el descenso de coordenadas.

source: To avoid unnecessary memory duplication the X and y arguments of the fit method should be directly passed as Fortran-contiguous numpy arrays.
es_es: Para evitar la duplicación innecesaria de la memoria, los argumentos X y y del método de ajuste deben pasarse directamente como arreglos numpy de Fortran-contiguo.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit linear model with coordinate descent.
es_es: Ajustar el modelo lineal del descenso de coordenadas.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Compute elastic net path with coordinate descent.
es_es: Calcula la ruta de red elástica con el descenso de coordenadas.

source: Predict using the linear model.
es_es: Predice utilizando el modelo lineal.

source: Return the coefficient of determination :math:`R^2` of the prediction.
es_es: Devuelve el coeficiente de determinación :math:`R^2` de la predicción.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Fit is on grid of alphas and best alpha estimated by cross-validation.
es_es: El ajuste esta en la cuadrícula de alfas y el mejor alfa estimado por validación cruzada.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Training data. Pass directly as Fortran-contiguous data to avoid unnecessary memory duplication. If y is mono-output, X can be sparse.
es_es: Datos de entrenamiento. Pase directamente como datos Fortran-contiguos para evitar la duplicación innecesaria de memoria. Si y es mono-salida entonces X puede ser disperso.

source: array-like of shape (n_samples,) or (n_samples, n_targets)
es_es: array-like de forma (n_samples,) o (n_samples, n_targets)

source: Target values.
es_es: Valores objetivo.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Returns
es_es: Devuelve

source: dict
es_es: diccionario

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The elastic net optimization function varies for mono and multi-outputs.
es_es: La función de optimización de la red elástica varía para las mono y multisalidas.

source: For mono-output tasks it is::
es_es: Para las tareas mono-salida es::

source: For multi-output tasks it is::
es_es: Para tareas multi-salidas es::

source: Read more in the :ref:`User Guide <elastic_net>`.
es_es: Más información en el :ref:`Manual de usuario <elastic_net>`.

source: Training data. Pass directly as Fortran-contiguous data to avoid unnecessary memory duplication. If ``y`` is mono-output then ``X`` can be sparse.
es_es: Datos de entrenamiento. Pase directamente como datos Fortran-contiguos para evitar la duplicación innecesaria de memoria. Si ``y`` es mono-salida entonces ``X`` puede ser disperso.

source: {array-like, sparse matrix} of shape (n_samples,) or (n_samples, n_outputs)
es_es: {array-like, sparse matrix} de forma (n_samples,), o (n_samples, n_outputs)

source: float, default=0.5
es_es: flotante, default=0.5

source: Number between 0 and 1 passed to elastic net (scaling between l1 and l2 penalties). ``l1_ratio=1`` corresponds to the Lasso.
es_es: Número entre 0 y 1 pasado a la red elástica (escalado entre penalizaciones l1 y l2). ``l1_ratio=1`` corresponde al Lasso.

source: List of alphas where to compute the models. If None alphas are set automatically.
es_es: Lista de alfas donde calcular los modelos. Si es None los alfas se establecen automáticamente.

source: 'auto', bool or array-like of shape (n_features, n_features), default='auto'
es_es: 'auto', booleano o array-like de forma (n_features, n_features), default='auto'

source: Whether to use a precomputed Gram matrix to speed up calculations. If set to ``'auto'`` let us decide. The Gram matrix can also be passed as argument.
es_es: Si usar una matriz precalculada Gram para acelerar los cálculos. Si se establece como ``'auto'``, nosotros decidimos. La matriz de Gram puede también ser pasada como un argumento.

source: array-like of shape (n_features,) or (n_features, n_outputs), default=None
es_es: array-like de forma (n_features,) o (n_features, n_outputs), default=None

source: Xy = np.dot(X.T, y) that can be precomputed. It is useful only when the Gram matrix is precomputed.
es_es: Xy = np.dot(X.T, y) que puede ser precalculado. Es útil sólo cuando la matriz Gram está precalculada.

source: ndarray of shape (n_features, ), default=None
es_es: ndarray de forma (n_features, ), default=None

source: The initial values of the coefficients.
es_es: Los valores iniciales de los coeficientes.

source: bool or int, default=False
es_es: booleano o entero, default=False

source: Whether to return the number of iterations or not.
es_es: Si se devuelve o no el número de iteraciones.

source: If set to True, forces coefficients to be positive. (Only allowed when ``y.ndim == 1``).
es_es: Si se establece como True, obliga a los coeficientes a ser positivos. (Sólo se permite cuando ``y.ndim ==1``).

source: If set to False, the input validation checks are skipped (including the Gram matrix when provided). It is assumed that they are handled by the caller.
es_es: Si se establece en False, se omiten las comprobaciones de validación de la entrada (incluyendo la matriz Gram cuando se proporciona). Se asume que son manejadas por el llamador.

source: Keyword arguments passed to the coordinate descent solver.
es_es: Argumentos de palabras clave que se pasan al solucionador de descenso de coordenadas.

source: ndarray of shape (n_alphas,)
es_es: ndarray de forma (n_alphas,)

source: The alphas along the path where models are computed.
es_es: Los alfas a lo largo del camino donde se calculan los modelos.

source: ndarray of shape (n_features, n_alphas) or (n_outputs, n_features, n_alphas)
es_es: ndarray de forma (n_features, n_alphas) o (n_outputs, n_features, n_alphas)

source: Coefficients along the path.
es_es: Coeficientes a lo largo del camino.

source: The dual gaps at the end of the optimization for each alpha.
es_es: Los huecos duales al final de la optimización para cada alfa.

source: list of int
es_es: lista de enteros

source: The number of iterations taken by the coordinate descent optimizer to reach the specified tolerance for each alpha. (Is returned when ``return_n_iter`` is set to True).
es_es: El número de iteraciones tomadas por el optimizador de descenso de coordenadas para alcanzar la tolerancia especificada para cada alfa. (Es devuelto cuando ``return_n_iter`` está establecido a True).

source: For an example, see :ref:`examples/linear_model/plot_lasso_coordinate_descent_path.py <sphx_glr_auto_examples_linear_model_plot_lasso_coordinate_descent_path.py>`.
es_es: Para un ejemplo, ver :ref:`examples/linear_model/plot_lasso_coordinate_descent_path.py <sphx_glr_auto_examples_linear_model_plot_lasso_coordinate_descent_path.py>`.

source: array-like or sparse matrix, shape (n_samples, n_features)
es_es: array-like o matriz dispersa, forma (n_samples, n_features)

source: Samples.
es_es: Muestras.

source: array, shape (n_samples,)
es_es: arreglo, forma (n_samples,)

source: Returns predicted values.
es_es: Devuelve los valores previstos.

source: The coefficient :math:`R^2` is defined as :math:`(1 - \frac{u}{v})`, where :math:`u` is the residual sum of squares ``((y_true - y_pred) ** 2).sum()`` and :math:`v` is the total sum of squares ``((y_true - y_true.mean()) ** 2).sum()``. The best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of `y`, disregarding the input features, would get a :math:`R^2` score of 0.0.
es_es: El coeficiente :math:`R^2` se define como :math:`(1 - \frac{u}{v})`, donde :math:`u` es la suma residual de cuadrados ``((y_true - y_pred) ** 2).sum()`` y :math:`v` es la suma total de cuadrados ``((y_true - y_true.mean()) ** 2).sum()``. El mejor valo posible es 1.0 y puede ser negativo (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de `y`, sin tener en cuenta las características de entrada, obtendría un valor :math:`R^2` de 0,0.

source: array-like of shape (n_samples, n_features)
es_es: tipo de arreglo de forma (n_samples, n_features)

source: Test samples. For some estimators this may be a precomputed kernel matrix or a list of generic objects instead with shape ``(n_samples, n_samples_fitted)``, where ``n_samples_fitted`` is the number of samples used in the fitting for the estimator.
es_es: Muestras de prueba. Para algunos estimadores puede ser una matriz de núcleo precalculada o una lista de objetos genéricos con forma ``(n_samples, n_samples_fitted)``, donde ``n_samples_fitted`` es el número de muestras utilizadas en el ajuste para el estimador.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True values for `X`.
es_es: Valores verdaderos para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de muestra.

source: :math:`R^2` of ``self.predict(X)`` wrt. `y`.
es_es: :math:`R^2` de ``self.predict(X)`` con respecto a `y`.

source: The :math:`R^2` score used when calling ``score`` on a regressor uses ``multioutput='uniform_average'`` from version 0.23 to keep consistent with default value of :func:`~sklearn.metrics.r2_score`. This influences the ``score`` method of all the multioutput regressors (except for :class:`~sklearn.multioutput.MultiOutputRegressor`).
es_es: El valor :math:`R^2` utilizado al llamar a ``score`` en un regresor utiliza ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la coherencia con el valor por defecto de :func:`~sklearn.metrics.r2_score``. Esto influye en el método ``score`` de todos los regresores de salida múltiple (excepto para :class:`~sklearn.multioutput.MultiOutputRegressor`).

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.
