Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.neighbors.LocalOutlierFactor.po
Languages: es_es

source: Unsupervised Outlier Detection using Local Outlier Factor (LOF)
es_es: Detección no supervisada de valores atípicos mediante el factor local de valores atípicos (LOF)

source: The anomaly score of each sample is called Local Outlier Factor. It measures the local deviation of density of a given sample with respect to its neighbors. It is local in that the anomaly score depends on how isolated the object is with respect to the surrounding neighborhood. More precisely, locality is given by k-nearest neighbors, whose distance is used to estimate the local density. By comparing the local density of a sample to the local densities of its neighbors, one can identify samples that have a substantially lower density than their neighbors. These are considered outliers.
es_es: El valor de anomalía de cada muestra se denomina Factor de Anomalía Local. Mide la desviación local de la densidad de una muestra dada con respecto a sus vecinos. Es local en el sentido de que el valor de la anomalía depende de lo aislado que esté el objeto con respecto al vecindario circundante. Más concretamente, la localidad viene dada por los k vecinos más cercanos, cuya distancia se utiliza para estimar la densidad local. Comparando la densidad local de una muestra con las densidades locales de sus vecinos, se pueden identificar las muestras que tienen una densidad sustancialmente menor que sus vecinos. Éstas se consideran valores atípicos.

source: Parameters
es_es: Parámetros

source: int, default=20
es_es: entero, default=20

source: Number of neighbors to use by default for :meth:`kneighbors` queries. If n_neighbors is larger than the number of samples provided, all samples will be used.
es_es: Número de vecinos a usar por defecto para :meth:`kneighbors` consultas. Si n_neighbors es mayor que el número de muestras proporcionadas, todas las muestras serán usadas.

source: Algorithm used to compute the nearest neighbors:
es_es: Algoritmo usado para calcular los vecinos más cercanos:

source: 'ball_tree' will use :class:`BallTree`
es_es: 'ball_tree' usará :class:`BallTree`

source: 'kd_tree' will use :class:`KDTree`
es_es: 'kd_tree' usará :class:`KDTree`

source: 'brute' will use a brute-force search.
es_es: 'brute' usará una búsqueda de fuerza bruta.

source: 'auto' will attempt to decide the most appropriate algorithm based on the values passed to :meth:`fit` method.
es_es: 'auto' intentará decidir el algoritmo más apropiado basado en los valores pasados al método :meth:`fit`.

source: Note: fitting on sparse input will override the setting of this parameter, using brute force.
es_es: Nota: el ajuste en la entrada dispersa anulará el ajuste de este parámetro, utilizando la fuerza bruta.

source: int, default=30
es_es: entero, default=30

source: Leaf size passed to :class:`BallTree` or :class:`KDTree`. This can affect the speed of the construction and query, as well as the memory required to store the tree. The optimal value depends on the nature of the problem.
es_es: Tamaño de la hoja que se pasa a :class:`BallTree` o :class:`KDTree`. Esto puede afectar a la velocidad de construcción y consulta, así como a la memoria necesaria para almacenar el árbol. El valor óptimo depende de la naturaleza del problema.

source: str or callable, default='minkowski'
es_es: cadena de caracteres o invocable, default="minkowski'

source: metric used for the distance computation. Any metric from scikit-learn or scipy.spatial.distance can be used.
es_es: métrica utilizada para el cálculo a distancia. Cualquier métrica de scikit-learn o scipy.spatial.distance puede ser usada.

source: If metric is "precomputed", X is assumed to be a distance matrix and must be square. X may be a sparse matrix, in which case only "nonzero" elements may be considered neighbors.
es_es: Si la métrica es "precomputed", se supone que X es una matriz de distancia y debe ser cuadrada. X puede ser una matriz dispersa, en cuyo caso sólo los elementos "no nulos" pueden considerarse vecinos.

source: If metric is a callable function, it is called on each pair of instances (rows) and the resulting value recorded. The callable should take two arrays as input and return one value indicating the distance between them. This works for Scipy's metrics, but is less efficient than passing the metric name as a string.
es_es: Si la métrica es una función invocable, se llama a cada par de instancias (filas) y se registra el valor resultante. El invocable debe tomar dos arreglos como entrada y devolver un valor que indique la distancia entre ellos. Esto funciona para las métricas de Scipy, pero es menos eficiente que pasar el nombre de la métrica como una cadena.

source: Valid values for metric are:
es_es: Valores válidos para la métrica son:

source: from scikit-learn: ['cityblock', 'cosine', 'euclidean', 'l1', 'l2', 'manhattan']
es_es: de scikit-learn: ['cityblock', 'cosine', 'euclidean', 'l1', 'l2', 'manhattan']

source: from scipy.spatial.distance: ['braycurtis', 'canberra', 'chebyshev', 'correlation', 'dice', 'hamming', 'jaccard', 'kulsinski', 'mahalanobis', 'minkowski', 'rogerstanimoto', 'russellrao', 'seuclidean', 'sokalmichener', 'sokalsneath', 'sqeuclidean', 'yule']
es_es: de scipy.spatial.distance: ['braycurtis', 'canberra', 'chebyshev', 'correlation', 'dice', 'hamming', 'jaccard', 'kulsinski', 'mahalanobis', 'minkowski', 'rogerstanimoto', 'russellrao', 'seuclidean', 'sokalmichener', 'sokalsneath', 'sqeuclidean', 'yule']

source: See the documentation for scipy.spatial.distance for details on these metrics: https://docs.scipy.org/doc/scipy/reference/spatial.distance.html
es_es: Consulta la documentación de scipy.spatial.distance para obtener detalles sobre estas métricas: https://docs.scipy.org/doc/scipy/reference/spatial.distance.html

source: int, default=2
es_es: entero, default=2

source: Parameter for the Minkowski metric from :func:`sklearn.metrics.pairwise.pairwise_distances`. When p = 1, this is equivalent to using manhattan_distance (l1), and euclidean_distance (l2) for p = 2. For arbitrary p, minkowski_distance (l_p) is used.
es_es: Parámetro para la métrica de Minkowski de :func:`sklearn.metrics.pairwise.pairwise_distances`. Cuando p = 1, esto es equivalente a usar manhattan_distance (l1), y euclidean_distance (l2) para p = 2. Para una p arbitraria, se usa minkowski_distance (l_p).

source: dict, default=None
es_es: diccionario, default=None

source: Additional keyword arguments for the metric function.
es_es: Argumentos adicionales de palabras clave para la función métrica.

source: 'auto' or float, default='auto'
es_es: 'auto' o flotante, default='auto'

source: The amount of contamination of the data set, i.e. the proportion of outliers in the data set. When fitting this is used to define the threshold on the scores of the samples.
es_es: La cantidad de contaminación del conjunto de datos, es decir, la proporción de los atajos en el conjunto de datos. Cuando se ajusta esto se utiliza para definir el umbral en los valores de las muestras.

source: if 'auto', the threshold is determined as in the original paper,
es_es: si 'auto', el umbral se determina como en el artículo original,

source: if a float, the contamination should be in the range [0, 0.5].
es_es: si un flotante, la contaminación debería estar en el rango [0, 0.5].

source: The default value of ``contamination`` changed from 0.1 to ``'auto'``.
es_es: El valor predeterminado de ``contaminación`` cambió de 0.1 a ``'auto'``.

source: bool, default=False
es_es: booleano, default=False

source: By default, LocalOutlierFactor is only meant to be used for outlier detection (novelty=False). Set novelty to True if you want to use LocalOutlierFactor for novelty detection. In this case be aware that that you should only use predict, decision_function and score_samples on new unseen data and not on the training set.
es_es: Por defecto, LocalOutlierFactor sólo está pensado para ser utilizado para la detección atmosférica (novelty=False). Establecer novelty a True si desea utilizar LocalOutlierFactor para la detección novelty. En este caso, ten en cuenta que sólo debe usar predict, decision_function y score_samples en nuevos datos no vistos y no en el conjunto de entrenamientos.

source: int, default=None
es_es: entero, default=None

source: The number of parallel jobs to run for neighbors search. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos paralelos a ejecutar para la búsqueda de vecinos. ``None`` significa 1 a menos que en un :obj:`joblib. contexto arallel_backend`. ``-1`` significa usar todos los procesadores. Vea :term:`Glosario <n_jobs>` para más detalles.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The opposite LOF of the training samples. The higher, the more normal. Inliers tend to have a LOF score close to 1 (``negative_outlier_factor_`` close to -1), while outliers tend to have a larger LOF score.
es_es: El LOF opuesto de las muestras de entrenamiento. Cuanto más alto, más normal. Los valores típicos tienden a tener un valor de LOF cercana a 1 (``negative_outlier_factor_`` cercano a -1), mientras que los valores atípìcos tienden a tener un valor de LOF mayor.

source: The local outlier factor (LOF) of a sample captures its supposed 'degree of abnormality'. It is the average of the ratio of the local reachability density of a sample and those of its k-nearest neighbors.
es_es: El factor local de valores atìpicos (LOF) de una muestra capta su supuesto "grado de anormalidad". Es la media de la relación entre la densidad de accesibilidad local de una muestra y las de sus k vecinos más cercanos.

source: int
es_es: entero

source: The actual number of neighbors used for :meth:`kneighbors` queries.
es_es: El número real de vecinos usados para :meth:`kneighbors` consultas.

source: float
es_es: flotante

source: Offset used to obtain binary labels from the raw scores. Observations having a negative_outlier_factor smaller than `offset_` are detected as abnormal. The offset is set to -1.5 (inliers score around -1), except when a contamination parameter different than "auto" is provided. In that case, the offset is defined in such a way we obtain the expected number of outliers in training.
es_es: Desplazamiento utilizado para obtener etiquetas binarias a partir de las puntuaciones brutas. Las observaciones que tienen un factor_de_extremo_negativo menor que `offset_` se detectan como anormales. El desplazamiento se fija en -1,5 (los valores típicos se sitúan en torno a -1), excepto cuando se proporciona un parámetro de contaminación distinto de "auto". En ese caso, el desplazamiento se define de forma que se obtiene el número esperado de valores atípicos en el entrenamiento.

source: str
es_es: cadena

source: The effective metric used for the distance computation.
es_es: La métrica efectiva utilizada para el cálculo a distancia.

source: dict
es_es: diccionario

source: The effective additional keyword arguments for the metric function.
es_es: Los argumentos adicionales efectivos de la palabra clave para la función métrica.

source: It is the number of samples in the fitted data.
es_es: Es el número de muestras en los datos ajustados.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the local outlier factor detector from the training dataset.
es_es: Ajustar el detector local de valores atípicos del conjunto de datos de entrenamiento.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros de este estimador.

source: Finds the K-neighbors of a point.
es_es: Encuentra a los K-vecinos de un punto.

source: Computes the (weighted) graph of k-Neighbors for points in X
es_es: Calcula el grafo (ponderado) de k-vecinos para los puntos de X

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Shifted opposite of the Local Outlier Factor of X.
es_es: Desplazamiento opuesto al Factor Local de Desviación de X.

source: Bigger is better, i.e. large values correspond to inliers.
es_es: Más grande es mejor, es decir, los valores grandes corresponden a los valores típicos.

source: **Only available for novelty detection (when novelty is set to True).** The shift offset allows a zero threshold for being an outlier. The argument X is supposed to contain *new data*: if X contains a point from training, it considers the later in its own neighborhood. Also, the samples in X are not considered in the neighborhood of any point.
es_es: **Sólo disponible para la detección de novedades (cuando la novedad se establece en True).** El desplazamiento permite un umbral cero para ser un valor atípico. El argumento X se supone que contiene *datos nuevos*: si X contiene un punto del entrenamiento, se considera el posterior en su propia vecindad. Además, las muestras de X no se consideran en la vecindad de ningún punto.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: The query sample or samples to compute the Local Outlier Factor w.r.t. the training samples.
es_es: La muestra o muestras de consulta para calcular el factor local de valores atípicos con respecto a las muestras de entrenamiento.

source: Returns
es_es: Devuelve

source: The shifted opposite of the Local Outlier Factor of each input samples. The lower, the more abnormal. Negative scores represent outliers, positive scores represent inliers.
es_es: El opuesto desplazado del Factor de Anomalía Local de cada muestra de entrada. Cuanto más bajo, más anormal. Las puntuaciones negativas representan valores atípicos, y las positivas representan valores atípicos.

source: {array-like, sparse matrix} of shape (n_samples, n_features) or (n_samples, n_samples) if metric='precomputed'
es_es: {array-like, sparse matrix} de forma (n_samples, n_features) o (n_samples, n_samples) si metric='precomputed'

source: Training data.
es_es: Datos de entrenamiento.

source: Ignored
es_es: Ignorado

source: Not used, present for API consistency by convention.
es_es: No se utiliza, está presente para la coherencia de la API por convención.

source: The fitted local outlier factor detector.
es_es: El detector de factores atípicos locales ajustado.

source: Fits the model to the training set X and returns the labels.
es_es: Ajusta el modelo al conjunto de entrenamiento X y devuelve las etiquetas.

source: **Not available for novelty detection (when novelty is set to True).** Label is 1 for an inlier and -1 for an outlier according to the LOF score and the contamination parameter.
es_es: **No disponible para la detección de novedades (cuando la novedad se establece como True). **La etiqueta es 1 para un valor típico y -1 para un valor atípico según el valor LOF y el parámetro de contaminación.

source: array-like of shape (n_samples, n_features), default=None
es_es: array-like de forma (n_samples, n_features), default=None

source: The query sample or samples to compute the Local Outlier Factor w.r.t. to the training samples.
es_es: La muestra o muestras de consulta para calcular el factor local de valores atípicos con respecto a las muestras de entrenamiento.

source: Returns -1 for anomalies/outliers and 1 for inliers.
es_es: Devuelve -1 para las anomalías/atípicos y +1 para los típicos.

source: bool, default=True
es_es: booleano, default=True

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los sub objetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: Returns indices of and distances to the neighbors of each point.
es_es: Devuelve los índices y las distancias a los vecinos de cada punto.

source: array-like, shape (n_queries, n_features), or (n_queries, n_indexed) if metric == 'precomputed', default=None
es_es: array-like, forma (n_queries, n_features), o (n_queries, n_indexed) si metric == 'precomputed', default=None

source: The query point or points. If not provided, neighbors of each indexed point are returned. In this case, the query point is not considered its own neighbor.
es_es: El punto o puntos de la consulta. Si no se proporciona, se devuelven los vecinos de cada punto indexado. En este caso, el punto de consulta no se considera su propio vecino.

source: Number of neighbors required for each sample. The default is the value passed to the constructor.
es_es: Número de vecinos necesarios para cada muestra. El valor por defecto es el que se pasa al constructor.

source: Whether or not to return the distances.
es_es: Si se devuelven o no las distancias.

source: ndarray of shape (n_queries, n_neighbors)
es_es: ndarray de forma (n_queries, n_neighbors)

source: Array representing the lengths to points, only present if return_distance=True
es_es: Un arreglo que representa las longitudes de los puntos, sólo presente si return_distance=True

source: Indices of the nearest points in the population matrix.
es_es: Indices de los puntos más cercanos en la matriz de la población.

source: In the following example, we construct a NearestNeighbors class from an array representing our data set and ask who's the closest point to [1,1,1]
es_es: En el siguiente ejemplo, construimos una clase NearestNeighbors a partir de un arreglo que representa nuestro conjunto de datos y preguntamos cuál es el punto más cercano a [1,1,1]

source: As you can see, it returns [[0.5]], and [[2]], which means that the element is at distance 0.5 and is the third element of samples (indexes start at 0). You can also query for multiple points:
es_es: Como puedes ver, devuelve [[0.5]], y [[2]], lo que significa que el elemento está a la distancia 0.5 y es el tercer elemento de las muestras (los índices empiezan en 0). También puede consultar varios puntos:

source: array-like of shape (n_queries, n_features), or (n_queries, n_indexed) if metric == 'precomputed', default=None
es_es: array-like de forma (n_queries, n_features), o (n_queries, n_indexed) si métrica == 'precomputed', default=None

source: The query point or points. If not provided, neighbors of each indexed point are returned. In this case, the query point is not considered its own neighbor. For ``metric='precomputed'`` the shape should be (n_queries, n_indexed). Otherwise the shape should be (n_queries, n_features).
es_es: El punto o puntos de la consulta. Si no se proporciona, se devuelven los vecinos de cada punto indexado. En este caso, el punto de consulta no se considera su propio vecino. Para ``metric='precomputed'`` la forma debe ser (n_queries, n_indexed). En caso contrario, la forma debe ser (n_queries, n_features).

source: Number of neighbors for each sample. The default is the value passed to the constructor.
es_es: Número de vecinos para cada muestra. El valor por defecto es el que se pasa al constructor.

source: Type of returned matrix: 'connectivity' will return the connectivity matrix with ones and zeros, in 'distance' the edges are Euclidean distance between points.
es_es: Tipo de matriz devuelta: 'connectivity' devolverá la matriz de conectividad con unos y ceros, en 'distance' los bordes son la distancia euclidiana entre puntos.

source: sparse-matrix of shape (n_queries, n_samples_fit)
es_es: matriz dispersa de forma (n_queries, n_samples_fit)

source: `n_samples_fit` is the number of samples in the fitted data `A[i, j]` is assigned the weight of edge that connects `i` to `j`. The matrix is of CSR format.
es_es: `n_samples_fit` es el número de muestras en los datos ajustados `A[i, j]` se asigna el peso del borde que conecta `i` con `j`. La matriz tiene el formato CSR.

source: Predict the labels (1 inlier, -1 outlier) of X according to LOF.
es_es: Predice las etiquetas (1 típico, -1 atípico) de X de acuerdo al LOF.

source: **Only available for novelty detection (when novelty is set to True).** This method allows to generalize prediction to *new observations* (not in the training set).
es_es: **Sólo disponible para la detección de novedades (cuando la novedad se establece como True). ** Este método permite generalizar la predicción a *nuevas observaciones* (no en el conjunto de entrenamiento).

source: Returns -1 for anomalies/outliers and +1 for inliers.
es_es: Devuelve -1 para las anomalías/atípicos y +1 para los típicos.

source: Opposite of the Local Outlier Factor of X.
es_es: Opuesto al Factor Local de Excedencia de X.

source: It is the opposite as bigger is better, i.e. large values correspond to inliers.
es_es: Es lo contrario, ya que lo más grande es mejor, es decir, los valores grandes corresponden a los valores típicos.

source: **Only available for novelty detection (when novelty is set to True).** The argument X is supposed to contain *new data*: if X contains a point from training, it considers the later in its own neighborhood. Also, the samples in X are not considered in the neighborhood of any point. The score_samples on training data is available by considering the the ``negative_outlier_factor_`` attribute.
es_es: **Sólo disponible para la detección de novedades (cuando la novedad se establece como True). **Se supone que el argumento X contiene *datos nuevos*: si X contiene un punto de entrenamiento, se considera el posterior en su propia vecindad. Además, las muestras de X no se consideran en la vecindad de ningún punto. El valor de las muestras en los datos de entrenamiento está disponible al considerar el atributo ``negative_outlier_factor_``.

source: The opposite of the Local Outlier Factor of each input samples. The lower, the more abnormal.
es_es: Lo contrario del Factor de Anomalía Local de cada muestra de entrada. Cuanto más bajo, más anormal.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia de estimador.

source: Examples using ``sklearn.neighbors.LocalOutlierFactor``
es_es: Ejemplos usando ``sklearn.neighbors.LocalOutlierFactor``
