Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.GradientBoostingClassifier.po
Languages: es_es

source: Gradient Boosting for classification.
es_es: Potenciación de gradiente para clasificación.

source: GB builds an additive model in a forward stage-wise fashion; it allows for the optimization of arbitrary differentiable loss functions. In each stage ``n_classes_`` regression trees are fit on the negative gradient of the binomial or multinomial deviance loss function. Binary classification is a special case where only a single regression tree is induced.
es_es: La potenciación de gradiente crea un modelo aditivo de forma progresiva por etapas; permite la optimización de funciones de perdida arbitrariamente diferenciables. En cada etapa los árboles de regresión ``n_classes_`` son encajados en el gradiente negativo de la función de perdida de desviación binomial o multinomial. La clasificación binaria es un caso especial donde solo un árbol de regresión es inducido.

source: Read more in the :ref:`User Guide <gradient_boosting>`.
es_es: Más información en el :ref:`Manual de usuario <gradient_boosting>`.

source: Parameters
es_es: Parámetros

source: The loss function to be optimized. 'deviance' refers to deviance (= logistic regression) for classification with probabilistic outputs. For loss 'exponential' gradient boosting recovers the AdaBoost algorithm.
es_es: La función de pérdida a optimizar. 'deviance' se refiere a la desviación (= regresión logística) para la clasificación con resultados probabilistas. Para loss 'exponential' la potenciación de gradiente recupera el algoritmo AdaBoost.

source: Learning rate shrinks the contribution of each tree by `learning_rate`. There is a trade-off between learning_rate and n_estimators.
es_es: La tasa de aprendizaje reduce la contribución de cada árbol por `learning_rate`. Hay una compensación entre learning_rate y n_estimators.

source: The number of boosting stages to perform. Gradient boosting is fairly robust to over-fitting so a large number usually results in better performance.
es_es: La cantidad de etapas de potenciación a realizar. La potenciación de gradiente es bastante robusta al sobre-ajuste, por lo que un número grande normalmente resultará en mejor rendimiento.

source: The fraction of samples to be used for fitting the individual base learners. If smaller than 1.0 this results in Stochastic Gradient Boosting. `subsample` interacts with the parameter `n_estimators`. Choosing `subsample < 1.0` leads to a reduction of variance and an increase in bias.
es_es: La fracción de muestras a ser usadas para ajustar los aprendices base individuales. Si es menor que 1.0 esto resulta en Potenciación de Gradiente Estocástica. `subsample` interactúa con el parámetro `n_estimators`. Escoger `subsample < 1.0` lleva a una reducción de varianza y un aumento en el sesgo.

source: The function to measure the quality of a split. Supported criteria are 'friedman_mse' for the mean squared error with improvement score by Friedman, 'mse' for mean squared error, and 'mae' for the mean absolute error. The default value of 'friedman_mse' is generally the best as it can provide a better approximation in some cases.
es_es: La función para medir la calidad de una división. Los criterios soportados son 'friedman_mse' para el error cuadrático medio con puntuación de mejora por Friedman, 'mse' para error cuadrático medio, y 'mae' para el error absoluto medio. El valor por defecto de 'friedman_mse' es generalmente el mejor ya que puede proveer una mejor aproximación en algunos casos.

source: `criterion='mae'` is deprecated and will be removed in version 1.1 (renaming of 0.26). Use `criterion='friedman_mse'` or `'mse'` instead, as trees should use a least-square criterion in Gradient Boosting.
es_es: `criterion='mae'` está obsoleto y será eliminado en la versión 1.1 (renombrado de 0.26). Use `criterion='friedman_mse'` o `'mse'` en su lugar, ya que los árboles deben usar un criterio de mínimos cuadrados en la potenciación de Gradiente.

source: int or float, default=2
es_es: int o float, default=2

source: The minimum number of samples required to split an internal node:
es_es: El número mínimo de muestras requeridas para dividir un nodo interno:

source: If int, then consider `min_samples_split` as the minimum number.
es_es: Si int, entonces considera `min_samples_split` como el número mínimo.

source: If float, then `min_samples_split` is a fraction and `ceil(min_samples_split * n_samples)` are the minimum number of samples for each split.
es_es: Si float, entonces `min_samples_split` es una fracción y `ceil(min_samples_split * n_samples)` son el número mínimo de muestras para cada división.

source: Added float values for fractions.
es_es: Se añadieron valores flotantes para las fracciones.

source: int or float, default=1
es_es: int o float, default=1

source: The minimum number of samples required to be at a leaf node. A split point at any depth will only be considered if it leaves at least ``min_samples_leaf`` training samples in each of the left and right branches. This may have the effect of smoothing the model, especially in regression.
es_es: El número mínimo de muestras requeridas para estar en un nodo de hoja. Un punto dividido a cualquier profundidad sólo se considerará si deja al menos ``min_samples_leaf`` muestras de entrenamiento en cada una de las ramas izquierda y derecha. Esto puede tener el efecto de suavizar el modelo, especialmente en regresión.

source: If int, then consider `min_samples_leaf` as the minimum number.
es_es: Si int, entonces considera `min_samples_split` como el número mínimo.

source: If float, then `min_samples_leaf` is a fraction and `ceil(min_samples_leaf * n_samples)` are the minimum number of samples for each node.
es_es: Si float, entonces `min_samples_leaf` es una fracción y `ceil(min_samples_leaf * n_samples)` son el número mínimo de muestras para cada nodo.

source: The minimum weighted fraction of the sum total of weights (of all the input samples) required to be at a leaf node. Samples have equal weight when sample_weight is not provided.
es_es: La fracción mínima ponderada de la suma total de las ponderaciones (de todas las muestras de entrada) requeridas para estar en un nodo de hoja. Las muestras tienen la misma ponderación cuando no se proporciona sample_weight.

source: The maximum depth of the individual regression estimators. The maximum depth limits the number of nodes in the tree. Tune this parameter for best performance; the best value depends on the interaction of the input variables.
es_es: La profundidad máxima de los estimadores de regresión individuales. La profundidad máxima limita el número de nodos en el árbol. Ajusté este parámetro para un mejor rendimiento; el mejor valor dependerá de la interacción de las variables de entrada.

source: A node will be split if this split induces a decrease of the impurity greater than or equal to this value.
es_es: Un nodo se dividirá si esta división induce una disminución de la impureza mayor o igual a este valor.

source: The weighted impurity decrease equation is the following::
es_es: La ecuación de disminución de impureza ponderada es la siguiente::

source: where ``N`` is the total number of samples, ``N_t`` is the number of samples at the current node, ``N_t_L`` is the number of samples in the left child, and ``N_t_R`` is the number of samples in the right child.
es_es: donde ``N`` es el número total de muestras, ``N_t`` es el número de muestras en el nodo actual, ``N_t_L`` es el número de muestras en el hijo izquierdo, y ``N_t_R`` es el número de muestras en el hijo derecho.

source: ``N``, ``N_t``, ``N_t_R`` and ``N_t_L`` all refer to the weighted sum, if ``sample_weight`` is passed.
es_es: ``N``, ``N_t``, ``N_t_R`` y ``N_t_L`` se refieren a la suma ponderada, si ``sample_weight`` es pasada.

source: Threshold for early stopping in tree growth. A node will split if its impurity is above the threshold, otherwise it is a leaf.
es_es: El umbral para la parada anticipada en el crecimiento de árboles. Un nodo se dividirá si su impureza está por encima del umbral, de lo contrario será una hoja.

source: ``min_impurity_split`` has been deprecated in favor of ``min_impurity_decrease`` in 0.19. The default value of ``min_impurity_split`` has changed from 1e-7 to 0 in 0.23 and it will be removed in 1.0 (renaming of 0.25). Use ``min_impurity_decrease`` instead.
es_es: ``min_impurity_split`` ha sido obviado en favor de ``min_impurity_decrease`` en 0.19. El valor por defecto de ``min_impurity_split`` ha cambiado de 1e-7 a 0 en 0.23 y se eliminará en 1.0 (renombrado de 0.25). Use ``min_impurity_decrease`` en su lugar.

source: An estimator object that is used to compute the initial predictions. ``init`` has to provide :meth:`fit` and :meth:`predict_proba`. If 'zero', the initial raw predictions are set to zero. By default, a ``DummyEstimator`` predicting the classes priors is used.
es_es: Un objeto estimador utilizado para calcular las predicciones iniciales. ``init`` debe proporcionar :meth:`fit` y :meth:`predict_proba`. Si 'zero', las predicciones en bruto iniciales son establecidas como cero. Por defecto un ``DummyEstimator`` prediciendo los priores de clase es utilizado.

source: int, RandomState instance or None, default=None
es_es: int, RandomState instance o None, default=None

source: Controls the random seed given to each Tree estimator at each boosting iteration. In addition, it controls the random permutation of the features at each split (see Notes for more details). It also controls the random spliting of the training data to obtain a validation set if `n_iter_no_change` is not None. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Controla la semilla aleatoria dada a cada estimador de árbol en cada iteración de potenciación. Además, controla la permutación aleatoria de las características en cada división (vea las Notas para mas detalles). También controla la división aleatoria de los datos de entrenamiento para obtener un conjunto de validación si `n_iter_no_change` no es None. Pase un int para una salida reproducible a lo largo de varías llamadas de función. Vea :term:`Glossary<random_state>`.

source: {'auto', 'sqrt', 'log2'}, int or float, default=None
es_es: {'auto', 'sqrt', 'log2'}, int o float, default=None

source: The number of features to consider when looking for the best split:
es_es: El número de características a tener en cuenta cuando se busca la mejor división:

source: If int, then consider `max_features` features at each split.
es_es: Si es int, entonces considere las características `max_features` en cada división.

source: If float, then `max_features` is a fraction and `int(max_features * n_features)` features are considered at each split.
es_es: Si float, entonces `max_features` es una fracción y las características `int(max_features * n_features)` son consideradas en cada división.

source: If 'auto', then `max_features=sqrt(n_features)`.
es_es: Si 'auto', entonces `max_features=sqrt(n_features)`.

source: If 'sqrt', then `max_features=sqrt(n_features)`.
es_es: Si 'sqrt', entonces `max_features=sqrt(n_features)`.

source: If 'log2', then `max_features=log2(n_features)`.
es_es: Si 'log2', entonces `max_features=log2(n_features)`.

source: If None, then `max_features=n_features`.
es_es: Si None, entonces `max_features=n_features`.

source: Choosing `max_features < n_features` leads to a reduction of variance and an increase in bias.
es_es: Elegir `max_features < n_features` lleva a una reducción de varianza y un incremento en el sesgo.

source: Note: the search for a split does not stop until at least one valid partition of the node samples is found, even if it requires to effectively inspect more than ``max_features`` features.
es_es: Nota: la búsqueda de una división no se detiene hasta que se encuentre al menos una partición válida de las muestras de nodos, incluso si requiere inspeccionar eficazmente más de las características de ``max_features``.

source: Enable verbose output. If 1 then it prints progress and performance once in a while (the more trees the lower the frequency). If greater than 1 then it prints progress and performance for every tree.
es_es: Habilita la salida verborrea. Si 1, entonces imprime el progreso y el rendimiento de vez en cuando (mientras más sean los árboles menor será la frecuencia). Si es mayor que 1, imprimirá progreso y rendimiento para cada árbol.

source: Grow trees with ``max_leaf_nodes`` in best-first fashion. Best nodes are defined as relative reduction in impurity. If None then unlimited number of leaf nodes.
es_es: Hacer crecer árboles con ``max_leaf_nodes`` en modo best-first. Los mejores nodos se definen como una reducción relativa de la impureza. Si no hay ninguno, el número de nodos hoja es ilimitado.

source: When set to ``True``, reuse the solution of the previous call to fit and add more estimators to the ensemble, otherwise, just erase the previous solution. See :term:`the Glossary <warm_start>`.
es_es: Cuando se establece a ``True``, reutiliza la solución de la llamada anterior para ajustar y añadir más estimadores al ensemble, de lo contrario, solamente borrará la solución anterior. Vea :term:`el Glosario <warm_start>`.

source: The proportion of training data to set aside as validation set for early stopping. Must be between 0 and 1. Only used if ``n_iter_no_change`` is set to an integer.
es_es: La proporción de datos de entrenamiento a reservar como conjunto de validación para la parada anticipada. Debe ser entre 0 y 1. Solamente utilizada si ``n_iter_no_change`` está establecido como un entero.

source: ``n_iter_no_change`` is used to decide if early stopping will be used to terminate training when validation score is not improving. By default it is set to None to disable early stopping. If set to a number, it will set aside ``validation_fraction`` size of the training data as validation and terminate training when validation score is not improving in all of the previous ``n_iter_no_change`` numbers of iterations. The split is stratified.
es_es: ``n_iter_no_change`` se usa para decidir si la parada anticipada sera utilizada para terminar el entrenamiento cuando el puntaje de validación no esta mejorando. Por defecto esta establecido como None para deshabilitar la parada anticipada. Si se establece como un número, apartará un tamaño ``validation_fraction`` de los datos de entrenamiento como validación y terminara el entrenamiento cuando el puntaje de validación no este mejorando en todas los números de iteraciones ``n_iter_no_change`` previos. La división es estratificada.

source: Tolerance for the early stopping. When the loss is not improving by at least tol for ``n_iter_no_change`` iterations (if set to a number), the training stops.
es_es: Tolerancia para la parada anticipada. Cuando la pérdida no esta mejorando por al menos tol para ``n_iter_no_change`` iteraciones (si se establece en un número), el entrenamiento se detiene.

source: non-negative float, default=0.0
es_es: flotante no negativo, default=0.0

source: Complexity parameter used for Minimal Cost-Complexity Pruning. The subtree with the largest cost complexity that is smaller than ``ccp_alpha`` will be chosen. By default, no pruning is performed. See :ref:`minimal_cost_complexity_pruning` for details.
es_es: Parámetro de complejidad utilizado para la Poda de Mínima Complejidad de Costo. El subárbol con la complejidad de costo mayor que sea menor que ``ccp_alpha`` será elegido. Por defecto, no se realiza ninguna poda. Vea :ref:`minimal_cost_complexity_pruning` para más detalles.

source: Attributes
es_es: Atributos

source: The number of estimators as selected by early stopping (if ``n_iter_no_change`` is specified). Otherwise it is set to ``n_estimators``.
es_es: El número de estimadores seleccionados por la parada anticipada (si se especifica ``n_iter_no_change``). De lo contrario, se establece como ``n_estimators``.

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features,)

source: The impurity-based feature importances.
es_es: Las importancias basadas en la impureza de las características.

source: ndarray of shape (n_estimators,)
es_es: ndarray de forma (n_estimators,)

source: The improvement in loss (= deviance) on the out-of-bag samples relative to the previous iteration. ``oob_improvement_[0]`` is the improvement in loss of the first stage over the ``init`` estimator. Only available if ``subsample < 1.0``
es_es: La mejora en la pérdida (= desviación) en las muestras fuera-de-bolsa relativa a la iteración previa. ``oob_improvement_[0]```es la mejora en la pérdida de la primera etapa sobre el estimador ``init``. Sólo esta disponible si ``subsample < 1.0``

source: The i-th score ``train_score_[i]`` is the deviance (= loss) of the model at iteration ``i`` on the in-bag sample. If ``subsample == 1`` this is the deviance on the training data.
es_es: La puntuación i-ésima ``train_score_[i]`` es la desviación (= pérdida) del modelo en la iteración ``i`` de la muestra en-bolsa. Si ``subsample == 1`` esta es la desviación en los datos de entrenamiento.

source: The concrete ``LossFunction`` object.
es_es: El objeto concreto ``LossFunction``.

source: The estimator that provides the initial predictions. Set via the ``init`` argument or ``loss.init_estimator``.
es_es: El estimador que proporciona las predicciones iniciales. Establecer a través del argumento ``init`` o ``loss.init_estimator``.

source: **estimators_** : ndarray of DecisionTreeRegressor of shape (n_estimators, ``loss_.K``)
es_es: **estimadores_** : ndarray de DecisionTreeRegressor de forma (n_estimators, ``loss_.K``)

source: ndarray of DecisionTreeRegressor of shape (n_estimators,
es_es: ndarray de DecisionTreeRegressor de forma (n_estimators,

source: The collection of fitted sub-estimators. ``loss_.K`` is 1 for binary classification, otherwise n_classes.
es_es: La colección de subestimadores instalados. ``loss_.K`` es 1 para la clasificación binaria, de lo contrario n_classes.

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: The classes labels.
es_es: Las etiquetas de las clases.

source: The number of data features.
es_es: El número de características en los datos.

source: **n_classes_**
es_es: **n_clases_**

source: The number of classes.
es_es: El número de clases.

source: The inferred value of max_features.
es_es: El valor inferido de max_features.

source: Histogram-based Gradient Boosting Classification Tree.
es_es: Árbol de Clasificación de Potenciación de Gradiente basado en histograma.

source: A decision tree classifier.
es_es: Un clasificador de árbol de decisiones.

source: A meta-estimator that fits a number of decision tree classifiers on various sub-samples of the dataset and uses averaging to improve the predictive accuracy and control over-fitting.
es_es: Un meta estimador que encaja un número de clasificadores de árboles de decisión en varias submuestras del conjunto de datos y utiliza el promedio para mejorar la precisión predictiva y controlar el sobre-ajuste.

source: A meta-estimator that begins by fitting a classifier on the original dataset and then fits additional copies of the classifier on the same dataset where the weights of incorrectly classified instances are adjusted such that subsequent classifiers focus more on difficult cases.
es_es: Un meta estimador que comienza por encajar un clasificador en el conjunto de datos original y entonces encaja copias adicionales del clasificador en el mismo conjunto de datos donde los ponderados de instancias mal clasificadas son ajustadas de manera tal que los clasificadores subsecuentes se enfocan mas en casos difíciles.

source: Notes
es_es: Notas

source: The features are always randomly permuted at each split. Therefore, the best found split may vary, even with the same training data and ``max_features=n_features``, if the improvement of the criterion is identical for several splits enumerated during the search of the best split. To obtain a deterministic behaviour during fitting, ``random_state`` has to be fixed.
es_es: Las características siempre son aleatoriamente permutadas en cada división. Por lo tanto, la mejor división encontrada podría variar, inclusive con los mismos datos de entrenamiento y ``max_features=n_features``, si la mejora del criterio es idéntica para varias divisiones enumeradas durante la búsqueda de la mejor división. Para obtener un comportamiento determinístico durante el ajuste, ``random_state`` debe ser fijo.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: The following example shows how to fit a gradient boosting classifier with 100 decision stumps as weak learners.
es_es: El siguiente ejemplo muestra como ajustar un clasificador de potenciación de gradiente con 100 muñones de decisión como aprendices débiles.

source: Methods
es_es: Métodos

source: Apply trees in the ensemble to X, return leaf indices.
es_es: Aplica los árboles en el ensemble a X, devuelve los índices de las hojas.

source: Compute the decision function of ``X``.
es_es: Calcula la función de decisión de ``X``.

source: Fit the gradient boosting model.
es_es: Ajusta el modelo de potenciación de gradiente.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Predict class for X.
es_es: Predice la clase para X.

source: Predict class log-probabilities for X.
es_es: Predice las probabilidades log de clase para X.

source: Predict class probabilities for X.
es_es: Predice las probabilidades de clase para X.

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos y etiquetas de prueba dados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Compute decision function of ``X`` for each iteration.
es_es: Calcula la función de decisión de ``X`` para cada iteración.

source: Predict class at each stage for X.
es_es: Predice la clase en cada etapa para X.

source: Predict class probabilities at each stage for X.
es_es: Predice las probabilidades de clase en cada etapa para X.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: The input samples. Internally, its dtype will be converted to ``dtype=np.float32``. If a sparse matrix is provided, it will be converted to a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, su dtype se convertirá a ``dtype=np.float32``. Si se proporciona una matriz dispersa, se convertirá a una dispersa ``csr_matrix``.

source: Returns
es_es: Salida

source: array-like of shape (n_samples, n_estimators, n_classes)
es_es: array-like de forma (n_samples, n_estimators, n_classes)

source: For each datapoint x in X and for each tree in the ensemble, return the index of the leaf x ends up in each estimator. In the case of binary classification n_classes is 1.
es_es: Por cada dato x en X y por cada árbol en el ensemble, devuelve el índice de la hoja en la que termina x en cada estimador. En el caso de la clasificación binaria, n_classes es 1.

source: The input samples. Internally, it will be converted to ``dtype=np.float32`` and if a sparse matrix is provided to a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, se convertirá a ``dtype=np.float32`` y si se proporciona una matriz dispersa se convertirá a una dispersa ``csr_matrix``.

source: ndarray of shape (n_samples, n_classes) or (n_samples,)
es_es: ndarray de forma (n_samples, n_classes) o (n_samples,)
