Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.cross_decomposition.PLSCanonical.po
Languages: es_es

source: Partial Least Squares transformer and regressor.
es_es: Transformador de mínimos cuadrados parciales y regresor.

source: Read more in the :ref:`User Guide <cross_decomposition>`.
es_es: Lee más en el :ref:`Manual del usuario <descomposición_cruzada>`.

source: Parameters
es_es: Parámetros

source: Number of components to keep. Should be in `[1, min(n_samples, n_features, n_targets)]`.
es_es: Número de componentes a conservar. Debe estar en `[1, min(n_muestras, n_características, n_objetivos)]`.

source: Whether to scale `X` and `Y`.
es_es: Si se escala `X` y `Y`.

source: The algorithm used to estimate the first singular vectors of the cross-covariance matrix. 'nipals' uses the power method while 'svd' will compute the whole SVD.
es_es: El algoritmo utilizado para estimar los primeros vectores singulares de la matriz de covarianza cruzada. 'nipals' utiliza el método de la potencia mientras que 'svd' calculará el SVD completo.

source: the maximum number of iterations of the power method when `algorithm='nipals'`. Ignored otherwise.
es_es: el número máximo de iteraciones del método de la potencia cuando `algoritmo='nipals'`. Se ignora en caso contrario.

source: The tolerance used as convergence criteria in the power method: the algorithm stops whenever the squared norm of `u_i - u_{i-1}` is less than `tol`, where `u` corresponds to the left singular vector.
es_es: La tolerancia utilizada como criterio de convergencia en el método de potencia: el algoritmo se detiene siempre que la norma cuadrada de `u_i - u_{i-1}` sea menor que `tol`, donde `u` corresponde al vector singular izquierdo.

source: Whether to copy `X` and `Y` in fit before applying centering, and potentially scaling. If False, these operations will be done inplace, modifying both arrays.
es_es: Si se copian `X` y `Y` en el ajuste antes de aplicar el centrado, y potencialmente el escalado. Si es False, estas operaciones se harán en el lugar, modificando ambas matrices.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_features, n_components)
es_es: ndarray de forma (n_features, n_components)

source: The left singular vectors of the cross-covariance matrices of each iteration.
es_es: Los vectores singulares izquierdos de las matrices de covarianza cruzada de cada iteración.

source: ndarray of shape (n_targets, n_components)
es_es: ndarray de forma (n_targets, n_components)

source: The right singular vectors of the cross-covariance matrices of each iteration.
es_es: Los vectores singulares derechos de las matrices de covarianza cruzada de cada iteración.

source: The loadings of `X`.
es_es: Las cargas de `X`.

source: The loadings of `Y`.
es_es: Las cargas de `Y`.

source: ndarray of shape (n_samples, n_components)
es_es: ndarray de forma (n_samples, n_components)

source: The transformed training samples.
es_es: Las muestras de entrenamiento transformadas.

source: `x_scores_` is deprecated in 0.24 and will be removed in 1.1 (renaming of 0.26). You can just call `transform` on the training data instead.
es_es: La función `x_scores_` está obsoleta en 0.24 y se eliminará en 1.1 (cambio de nombre de 0.26). En su lugar, puede llamar a `transform` en los datos de entrenamiento.

source: The transformed training targets.
es_es: Los objetivos de entrenamiento transformados.

source: `y_scores_` is deprecated in 0.24 and will be removed in 1.1 (renaming of 0.26). You can just call `transform` on the training data instead.
es_es: La función `y_scores_` está obsoleta en la versión 0.24 y se eliminará en la 1.1 (cambio de nombre de la versión 0.26). En su lugar, puede llamar a `transformación` en los datos de entrenamiento.

source: The projection matrix used to transform `X`.
es_es: La matriz de proyección utilizada para transformar "X".

source: The projection matrix used to transform `Y`.
es_es: La matriz de proyección utilizada para transformar "Y".

source: ndarray of shape (n_features, n_targets)
es_es: ndarray de forma (n_features, n_targets)

source: The coefficients of the linear model such that `Y` is approximated as `Y = X @ coef_`.
es_es: Los coeficientes del modelo lineal tal que `Y` se aproxima como `Y = X @ coef_`.

source: list of shape (n_components,)
es_es: lista de forma (n_components,)

source: Number of iterations of the power method, for each component. Empty if `algorithm='svd'`.
es_es: Número de iteraciones del método de potencia, para cada componente. Vacío si `algoritmo='svd'`.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit model to data.
es_es: Ajustar el modelo a los datos.

source: Learn and apply the dimension reduction on the train data.
es_es: Aprender y aplicar la reducción de dimensión en los datos de entrenamiento.

source: Get parameters for this estimator.
es_es: Obtener los parámetros de este estimador.

source: Transform data back to its original space.
es_es: Transforma los datos de vuelta a su espacio original.

source: Predict targets of given samples.
es_es: Predecir los objetivos de las muestras dadas.

source: Return the coefficient of determination :math:`R^2` of the prediction.
es_es: Devuelve el coeficiente de determinación :math:`R^2` de la predicción.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Apply the dimension reduction.
es_es: Aplica la reducción de dimensión.

source: array-like of shape (n_samples, n_features)
es_es: tipo arreglo de forma (n_samples, n_features)

source: Training vectors, where `n_samples` is the number of samples and `n_features` is the number of predictors.
es_es: Vectores de entrenamiento, donde `n_muestras` es el número de muestras y `n_características` es el número de predictores.

source: array-like of shape (n_samples,) or (n_samples, n_targets)
es_es: tipo array de forma (n_samples,) o (n_samples, n_targets)

source: Target vectors, where `n_samples` is the number of samples and `n_targets` is the number of response variables.
es_es: Vectores objetivo, donde `n_samples` es el número de muestras y `n_targets` es el número de variables de respuesta.

source: Training vectors, where n_samples is the number of samples and n_features is the number of predictors.
es_es: Vectores de entrenamiento, donde n_muestras es el número de muestras y n_características es el número de predictores.

source: array-like of shape (n_samples, n_targets), default=None
es_es: tipo array de forma (n_samples, n_targets), default=None

source: Target vectors, where n_samples is the number of samples and n_targets is the number of response variables.
es_es: Vectores objetivo, donde n_muestras es el número de muestras y n_objetivos es el número de variables de respuesta.

source: Returns
es_es: Salida

source: x_scores if Y is not given, (x_scores, y_scores) otherwise.
es_es: si no se da `Y`, `(x_scores, y_scores)` en caso contrario.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: dict
es_es: diccionario

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros se asignan a sus valores.

source: array-like of shape (n_samples, n_components)
es_es: tipo arreglo de forma (n_samples, n_components)

source: New data, where `n_samples` is the number of samples and `n_components` is the number of pls components.
es_es: Nuevos datos, donde `n_samples` es el número de muestras y `n_components` es el número de componentes pls.

source: Notes
es_es: Notas

source: This transformation will only be exact if `n_components=n_features`.
es_es: Esta transformación sólo será exacta si `n_components=n_features`.

source: Samples.
es_es: Muestras.

source: Whether to copy `X` and `Y`, or perform in-place normalization.
es_es: Si se copia `X` y `Y`, o se realiza la normalización en el lugar.

source: This call requires the estimation of a matrix of shape `(n_features, n_targets)`, which may be an issue in high dimensional space.
es_es: Esta llamada requiere la estimación de una matriz de forma `(n_features, n_targets)`, lo que puede ser un problema en un espacio de alta dimensión.

source: The coefficient :math:`R^2` is defined as :math:`(1 - \frac{u}{v})`, where :math:`u` is the residual sum of squares ``((y_true - y_pred) ** 2).sum()`` and :math:`v` is the total sum of squares ``((y_true - y_true.mean()) ** 2).sum()``. The best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of `y`, disregarding the input features, would get a :math:`R^2` score of 0.0.
es_es: El coeficiente :math:`R^2` se define como :math:`(1 - \frac{u}{v})`, donde :math:`u` es la suma residual de cuadrados ``((y_true - y_pred) ** 2).sum()`` y :math:`v` es la suma total de cuadrados ``((y_true - y_true.mean()) ** 2).sum()``. La mejor puntuación posible es 1,0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de `y`, sin tener en cuenta las características de entrada, obtendría una puntuación :math:`R^2` de 0,0.

source: Test samples. For some estimators this may be a precomputed kernel matrix or a list of generic objects instead with shape ``(n_samples, n_samples_fitted)``, where ``n_samples_fitted`` is the number of samples used in the fitting for the estimator.
es_es: Muestras de prueba. Para algunos estimadores puede ser una matriz de núcleo precalculada o una lista de objetos genéricos con forma ``(n_samples, n_samples_fitted)``, donde ``n_samples_fitted`` es el número de muestras utilizadas en el ajuste para el estimador.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True values for `X`.
es_es: Valores verdaderos para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Pesos de la muestra.

source: :math:`R^2` of ``self.predict(X)`` wrt. `y`.
es_es: :math:`R^2` de ``self.predict(X)`` wrt. `y`.

source: The :math:`R^2` score used when calling ``score`` on a regressor uses ``multioutput='uniform_average'`` from version 0.23 to keep consistent with default value of :func:`~sklearn.metrics.r2_score`. This influences the ``score`` method of all the multioutput regressors (except for :class:`~sklearn.multioutput.MultiOutputRegressor`).
es_es: La puntuación :math:`R^2` utilizada al llamar a ``score`` en un regresor utiliza ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la coherencia con el valor por defecto de :func:`~sklearn.metrics.r2_score``. Esto influye en el método ``score`` de todos los regresores de salida múltiple (excepto para :class:`~sklearn.multioutput.MultiOutputRegressor`).

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: Samples to transform.
es_es: Muestras a transformar.

source: Target vectors.
es_es: Vectores destino.

source: `x_scores` if `Y` is not given, `(x_scores, y_scores)` otherwise.
es_es: Si no se indica `Y`, `(x_scores, y_scores)` en caso contrario.
