Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.parallel_backend.po
Languages: es_es

source: Change the default backend used by Parallel inside a with block.
es_es: Cambia el backend predeterminado utilizado por Parallel dentro de un bloque with.

source: If ``backend`` is a string it must match a previously registered implementation using the ``register_parallel_backend`` function.
es_es: Si ``backend`` es una cadena, debe coincidir con una implementación previamente registrada mediante la función ``register_parallel_backend``.

source: By default the following backends are available:
es_es: Por defecto están disponibles los siguientes backends:

source: 'loky': single-host, process-based parallelism (used by default),
es_es: 'loky': paralelismo basado en procesos de un solo host (utilizado por defecto),

source: 'threading': single-host, thread-based parallelism,
es_es: 'threading': paralelismo basado en hilos y en un solo host,

source: 'multiprocessing': legacy single-host, process-based parallelism.
es_es: 'multiprocessing': paralelismo heredado de un solo host y basado en procesos.

source: 'loky' is recommended to run functions that manipulate Python objects. 'threading' is a low-overhead alternative that is most efficient for functions that release the Global Interpreter Lock: e.g. I/O-bound code or CPU-bound code in a few calls to native code that explicitly releases the GIL.
es_es: 'loky' se recomienda para ejecutar funciones que manipulan objetos de Python. 'threading' es una alternativa de baja sobrecarga que es más eficiente para las funciones que liberan el Bloqueo Global del Intérprete: por ejemplo, código I/O-bound o código CPU-bound en unas pocas invocaciones al código nativo que explícitamente libera el GIL.

source: In addition, if the `dask` and `distributed` Python packages are installed, it is possible to use the 'dask' backend for better scheduling of nested parallel calls without over-subscription and potentially distribute parallel calls over a networked cluster of several hosts.
es_es: Además, si se instalan los paquetes `dask` y `distributed` de Python, es posible utilizar el backend `dask` para programar mejor las invocaciones paralelas anidadas sin sobresuscripción y distribuir potencialmente las invocaciones paralelas en un conglomerado en red de varios hosts.

source: It is also possible to use the distributed 'ray' backend for distributing the workload to a cluster of nodes. To use the 'ray' joblib backend add the following lines::
es_es: También es posible utilizar el backend distribuido 'ray' para distribuir la carga de trabajo a un conglomerado de nodos. Para utilizar el backend joblib 'ray' añade las siguientes líneas::

source: Alternatively the backend can be passed directly as an instance.
es_es: Alternativamente, el backend se puede pasar directamente como una instancia.

source: By default all available workers will be used (``n_jobs=-1``) unless the caller passes an explicit value for the ``n_jobs`` parameter.
es_es: Por defecto se utilizarán todos los trabajadores disponibles (``n_jobs=-1``) a menos que el invocador pase un valor explícito para el parámetro ``n_jobs``.

source: This is an alternative to passing a ``backend='backend_name'`` argument to the ``Parallel`` class constructor. It is particularly useful when calling into library code that uses joblib internally but does not expose the backend argument in its own API.
es_es: Esta es una alternativa a pasar un argumento ``backend='backend_name'`` al constructor de la clase ``Parallel``. Es particularmente útil cuando se llama al código de la biblioteca que utiliza joblib internamente pero no expone el argumento backend en su propia API.

source: Warning: this function is experimental and subject to change in a future version of joblib.
es_es: Advertencia: esta función es experimental y está sujeta a cambios en una versión futura de joblib.

source: Joblib also tries to limit the oversubscription by limiting the number of threads usable in some third-party library threadpools like OpenBLAS, MKL or OpenMP. The default limit in each worker is set to ``max(cpu_count() // effective_n_jobs, 1)`` but this limit can be overwritten with the ``inner_max_num_threads`` argument which will be used to set this limit in the child processes.
es_es: Joblib también intenta limitar la sobresuscripción limitando el número de hilos utilizables en algunos threadpools de bibliotecas de terceros como OpenBLAS, MKL u OpenMP. El límite predeterminado en cada trabajador se establece en ``max(cpu_count() // effective_n_jobs, 1)`` pero este límite puede sobrescribirse con el argumento ``inner_max_num_threads`` que se utilizará para establecer este límite en los procesos hijos.
