Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.adjusted_mutual_info_score.po
Languages: es_es

source: Adjusted Mutual Information between two clusterings.
es_es: Información Mutua Ajustada (AMI) entre dos agrupaciones.

source: Adjusted Mutual Information (AMI) is an adjustment of the Mutual Information (MI) score to account for chance. It accounts for the fact that the MI is generally higher for two clusterings with a larger number of clusters, regardless of whether there is actually more information shared. For two clusterings :math:`U` and :math:`V`, the AMI is given as::
es_es: La Información Mutua Ajustada (AMI en inglés) es un ajuste del puntaje de Información Mutua (MI en inglés) para dar cuenta de la casualidad. Explica el hecho de que el MI es por lo general más alto para dos agrupaciones con un número mayor de conglomerados, independientemente de sí realmente hay más información compartida. Para dos agrupaciones :math:`U` y :math:`V`, el AMI es dado como::

source: This metric is independent of the absolute values of the labels: a permutation of the class or cluster label values won't change the score value in any way.
es_es: Está métrica es independiente de los valores absolutos de las etiquetas: una permutación de la clase o de los valores de las etiquetas de conglomerado no cambiará el valor de la puntuación de ninguna manera.

source: This metric is furthermore symmetric: switching ``label_true`` with ``label_pred`` will return the same score value. This can be useful to measure the agreement of two independent label assignments strategies on the same dataset when the real ground truth is not known.
es_es: Esta métrica es además simétrica: si se cambia ``label_true`` por ``label_pred`` devolverá el mismo valor de puntuación. Esto puede ser útil para medir el acuerdo de dos estrategias independientes de asignación de etiquetas en el mismo conjunto de datos cuando se desconoce la verdad fundamental real.

source: Be mindful that this function is an order of magnitude slower than other metrics, such as the Adjusted Rand Index.
es_es: Ten en cuenta que esta función es un orden de magnitud más lenta que otras métricas, como el Índice de Rand Ajustado.

source: Read more in the :ref:`User Guide <mutual_info_score>`.
es_es: Más información en el :ref:`Manual de usuario <mutual_info_score>`.

source: Parameters
es_es: Parámetros

source: int array, shape = [n_samples]
es_es: arreglo de enteros, forma = [n_samples]

source: A clustering of the data into disjoint subsets.
es_es: Una agrupación de los datos en subconjuntos disjuntos.

source: int array-like of shape (n_samples,)
es_es: entero array-like de forma (n_samples,)

source: str, default='arithmetic'
es_es: cadena, default='arithmetic'

source: How to compute the normalizer in the denominator. Possible options are 'min', 'geometric', 'arithmetic', and 'max'.
es_es: Cómo calcular el normalizador en el denominador. Las opciones posibles son 'min', 'geometric', 'arithmetic', y 'max'.

source: The default value of ``average_method`` changed from 'max' to 'arithmetic'.
es_es: El valor predeterminado de ``average_method``cambiado de 'max' a 'arithmetic'.

source: Returns
es_es: Devuelve

source: ami: float (upperlimited by 1.0)
es_es: ami: flotante (límite superior en 1.0)

source: The AMI returns a value of 1 when the two partitions are identical (ie perfectly matched). Random partitions (independent labellings) have an expected AMI around 0 on average hence can be negative.
es_es: El AMI devuelve un valor de 1 cuando las dos particiones son idénticas (es decir, corresponden perfectamente). Las particiones aleatorias (etiquetados independientes) tienen un AMI esperado de alrededor de 0 en promedio, por lo que pueden ser negativas.

source: Adjusted Rand Index.
es_es: Indice de Rand ajustado (ARI en ingles).

source: Mutual Information (not adjusted for chance).
es_es: Información Mutua (no ajustada por casualidad).

source: References
es_es: Referencias

source: `Wikipedia entry for the Adjusted Mutual Information <https://en.wikipedia.org/wiki/Adjusted_Mutual_Information>`_
es_es: `Entrada de Wikipedia para la Información Mutua Ajustada <https://en.wikipedia.org/wiki/Adjusted_Mutual_Information>`_

source: Examples
es_es: Ejemplos

source: Perfect labelings are both homogeneous and complete, hence have score 1.0::
es_es: Los etiquetados perfectos son homogéneos y completos, por lo que tienen una puntuación de 1,0::

source: If classes members are completely split across different clusters, the assignment is totally in-complete, hence the AMI is null::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente in-completa, por tanto el AMI es nulo::
