Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.load_digits.po
Languages: es_es

source: Load and return the digits dataset (classification).
es_es: Carga y devuelve el conjunto de datos de dígitos (clasificación).

source: Each datapoint is a 8x8 image of a digit.
es_es: Cada dato es una imagen de 8x8 de un dígito.

source: Classes
es_es: Clases

source: Samples per class
es_es: Muestras por clase

source: Samples total
es_es: Total de muestras

source: Dimensionality
es_es: Dimensionalidad

source: Features
es_es: Característica

source: integers 0-16
es_es: enteros 0-16

source: Read more in the :ref:`User Guide <digits_dataset>`.
es_es: Lee más en el :ref:`Manual del usuario <digits_dataset>`.

source: Parameters
es_es: Parámetros

source: The number of classes to return. Between 0 and 10.
es_es: El número de clases a devolver. Entre 0 y 10.

source: If True, returns ``(data, target)`` instead of a Bunch object. See below for more information about the `data` and `target` object.
es_es: Si es True, devuelve ``(data, target)`` en lugar de un objeto Bunch. Ver más abajo para más información sobre el objeto `data` y `target`.

source: If True, the data is a pandas DataFrame including columns with appropriate dtypes (numeric). The target is a pandas DataFrame or Series depending on the number of target columns. If `return_X_y` is True, then (`data`, `target`) will be pandas DataFrames or Series as described below.
es_es: Si es True, los datos son un DataFrame de pandas que incluye columnas con los dtypes adecuados (numéricos). El objetivo es un DataFrame de pandas o una Serie, dependiendo del número de columnas del objetivo. Si `return_X_y` es True, entonces (`data`, `target`) serán pandas DataFrames o Series como se describe a continuación.

source: Returns
es_es: Salida

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo diccionario, con los siguientes atributos.

source: data
es_es: datos

source: {ndarray, dataframe} of shape (1797, 64)
es_es: {ndarray, dataframe} de forma (1797, 64)

source: The flattened data matrix. If `as_frame=True`, `data` will be a pandas DataFrame.
es_es: La matriz de datos aplanada. Si `as_frame=True`, `data` será un pandas DataFrame.

source: target: {ndarray, Series} of shape (1797,)
es_es: target: {ndarray, Series} de forma (1797,)

source: The classification target. If `as_frame=True`, `target` will be a pandas Series.
es_es: El objetivo de la clasificación. Si `as_frame=True`, `target` será Series de pandas.

source: The names of the dataset columns.
es_es: Los nombres de las columnas del conjunto de datos.

source: The names of target classes.
es_es: Los nombres de las clases de destino.

source: frame: DataFrame of shape (1797, 65)
es_es: frame: DataFrame de forma (1797, 65)

source: Only present when `as_frame=True`. DataFrame with `data` and `target`.
es_es: Sólo está presente cuando `as_frame=True`. DataFrame con `data` y `target`.

source: images: {ndarray} of shape (1797, 8, 8)
es_es: images: {ndarray} de forma (1797, 8, 8)

source: The raw image data.
es_es: Los datos de las imágenes en bruto.

source: The full description of the dataset.
es_es: La descripción completa del conjunto de datos.

source: tuple if
es_es: tupla si

source: This is a copy of the test set of the UCI ML hand-written digits datasets
es_es: Esta es una copia del conjunto de datos de prueba de los dígitos escritos a mano de UCI ML

source: Examples
es_es: Ejemplos

source: To load the data and visualize the images::
es_es: Para cargar los datos y visualizar las imágenes::

source: Examples using ``sklearn.datasets.load_digits``
es_es: Ejemplos con ``sklearn.datasets.load_digits``
