Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.precision_recall_fscore_support.po
Languages: es_es

source: Compute precision, recall, F-measure and support for each class.
es_es: Calcula precisión, exhaustividad, valor F y el soporte para cada clase.

source: The precision is the ratio ``tp / (tp + fp)`` where ``tp`` is the number of true positives and ``fp`` the number of false positives. The precision is intuitively the ability of the classifier not to label as positive a sample that is negative.
es_es: La precisión es la relación ``tp / (tp + fp)`` donde ``tp`` es el número de verdaderos positivos y ``fp`` el número de falsos positivos. La precisión es intuitivamente la capacidad del clasificador de no etiquetar como positiva una muestra que es negativa.

source: The recall is the ratio ``tp / (tp + fn)`` where ``tp`` is the number of true positives and ``fn`` the number of false negatives. The recall is intuitively the ability of the classifier to find all the positive samples.
es_es: La exhaustividad es la relación ``tp / (tp + fn)`` donde ``tp`` es el número de verdaderos positivos y ``fn`` el número de falsos negativos. La exhaustividad es, intuitivamente, la capacidad del clasificador para encontrar todas las muestras positivas.

source: The F-beta score can be interpreted as a weighted harmonic mean of the precision and recall, where an F-beta score reaches its best value at 1 and worst score at 0.
es_es: El valor F-beta puede interpretarse como una media ponderada armónica de la precisión y exhaustividad, donde un valor F-beta alcanza su mejor valor a 1 y la peor valor a 0.

source: The F-beta score weights recall more than precision by a factor of ``beta``. ``beta == 1.0`` means recall and precision are equally important.
es_es: El valor F-beta pondera más la exhaustividad que la precisión por un factor de ``beta``. ``beta == 1,0`` significa que la exhaustividad y la precisión tienen la misma importancia.

source: The support is the number of occurrences of each class in ``y_true``.
es_es: El soporte es el número de ocurrencias de cada clase en ``y_true``.

source: If ``pos_label is None`` and in binary classification, this function returns the average precision, recall and F-measure if ``average`` is one of ``'micro'``, ``'macro'``, ``'weighted'`` or ``'samples'``.
es_es: Si ``pos_label es None`` y en la clasificación binaria, esta función devuelve la precisión promedio, exhaustivodad y valor F si ``average`` es uno de ``'micro'``, ``'macro'``, ``'weighted'`` o ``'samples'``.

source: Read more in the :ref:`User Guide <precision_recall_f_measure_metrics>`.
es_es: Más información en el :ref:`Manual de usuario <precision_recall_f_measure_metrics>`.

source: Parameters
es_es: Parámetros

source: 1d array-like, or label indicator array / sparse matrix
es_es: Arreglo 1d o arreglo de indicadores de etiqueta / matriz dispersa

source: Ground truth (correct) target values.
es_es: Valores objetivo reales (correctos).

source: Estimated targets as returned by a classifier.
es_es: Objetivos estimados devueltos por un clasificador.

source: float, default=1.0
es_es: flotante, default=1.0

source: The strength of recall versus precision in the F-score.
es_es: La fuerza de la exhaustividad frente a la precisión en el valor F.

source: The set of labels to include when ``average != 'binary'``, and their order if ``average is None``. Labels present in the data can be excluded, for example to calculate a multiclass average ignoring a majority negative class, while labels not present in the data will result in 0 components in a macro average. For multilabel targets, labels are column indices. By default, all labels in ``y_true`` and ``y_pred`` are used in sorted order.
es_es: El conjunto de etiquetas a incluir cuando ``average != 'binary'``, y su orden si ``average es None``. Las etiquetas presentes en los datos pueden ser excluidas, por ejemplo para calcular un promedio de varias clases ignorando una clase negativa mayoritaria, mientras que las etiquetas no presentes en los datos resultarán en 0 componentes en una macro media. Para objetivos multietiqueta, las etiquetas son índices de columnas. Por defecto, todas las etiquetas en ``y_true`` y ``y_pred`` se utilizan en orden ordenado.

source: str or int, default=1
es_es: cadena de caracteres o entero, default=1

source: The class to report if ``average='binary'`` and the data is binary. If the data are multiclass or multilabel, this will be ignored; setting ``labels=[pos_label]`` and ``average != 'binary'`` will report scores for that label only.
es_es: La clase a reportar si ``average='binary'`` y los datos son binarios. Si los datos son multiclase o multietiqueta, esto será ignorado; configurando ``labels=[pos_label]`` y ``average != 'binary'`` sólo reportará valores para esa etiqueta.

source: If ``None``, the scores for each class are returned. Otherwise, this determines the type of averaging performed on the data:
es_es: Si es ``None``, los valores para cada clase son devueltos. De lo contrario, esto determina el tipo de promedio realizado en los datos:

source: Only report results for the class specified by ``pos_label``. This is applicable only if targets (``y_{true,pred}``) are binary.
es_es: Solo reporta resultados para la clase especificada por ``pos_label``. Esto es aplicable sólo si los objetivos (``y_{true,pred}``) son binarios.

source: Calculate metrics globally by counting the total true positives, false negatives and false positives.
es_es: Calcula las métricas globalmente contando los verdaderos positivos, falsos negativos y falsos positivos.

source: Calculate metrics for each label, and find their unweighted mean. This does not take label imbalance into account.
es_es: Calcula las métricas para cada etiqueta y encuentra su media no ponderada. Esto no tiene en cuenta el desequilibrio de la etiqueta.

source: Calculate metrics for each label, and find their average weighted by support (the number of true instances for each label). This alters 'macro' to account for label imbalance; it can result in an F-score that is not between precision and recall.
es_es: Calcula las métricas para cada etiqueta y encuentra su promedio ponderado por soporte (el número de instancias verdaderas para cada etiqueta). Esto altera 'macro' para explicar el desequilibrio de la etiqueta; puede dar lugar a un valor F que no esté entre la precisión y la exhaustividad.

source: Calculate metrics for each instance, and find their average (only meaningful for multilabel classification where this differs from :func:`accuracy_score`).
es_es: Calcula las métricas para cada caso, y encuentra su promedio (solo tiene sentido para la clasificación multietiqueta donde esto difiere de :func:`preciacy_score`).

source: tuple or set, for internal use
es_es: tupla o conjunto, para uso interno

source: This determines which warnings will be made in the case that this function is being used to return only one of its metrics.
es_es: Esto determina qué advertencias se harán en el caso de que esta función se utilice para devolver sólo una de sus métricas.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de muestra.

source: "warn", 0 or 1, default="warn"
es_es: "warn", 0 o 1, default="warn"

source: Sets the value to return when there is a zero division:
es_es: Establece el valor a devolver cuando hay una división cero:

source: recall: when there are no positive labels
es_es: exhaustividad: cuando no hay etiquetas positivas

source: precision: when there are no positive predictions
es_es: precisión: cuando no hay predicciones positivas

source: f-score: both
es_es: valor f: ambos

source: If set to "warn", this acts as 0, but warnings are also raised.
es_es: Si se establece en "warn", esto actúa como 0, pero también se levantan las advertencias.

source: Returns
es_es: Devuelve

source: float (if average is not None) or array of float, shape = [n_unique_labels]
es_es: flotante (si el promedio no es None) o arreglo de flotantes, forma = [n_unique_labels]

source: float (if average is not None) or array of float, , shape = [n_unique_labels]
es_es: flotante (si el promedio no es None) o arreglo de flotantes, forma = [n_unique_labels]

source: **support**
es_es: Notes

source: None (if average is not None) or array of int, shape = [n_unique_labels]
es_es: None (si el promedio no es None) o arreglo de enteros, forma = [n_unique_labels]

source: The number of occurrences of each label in ``y_true``.
es_es: El número de ocurrencias de cada etiqueta en ``y_true``.

source: Notes
es_es: Notas

source: When ``true positive + false positive == 0``, precision is undefined. When ``true positive + false negative == 0``, recall is undefined. In such cases, by default the metric will be set to 0, as will f-score, and ``UndefinedMetricWarning`` will be raised. This behavior can be modified with ``zero_division``.
es_es: Cuando ``true positive + false positive == 0``, la precisión es indefinida. Cuando ``true positive + false negative == 0``, la exhaustividad no está definida. En tales casos, por defecto la métrica se establecerá en 0, al igual que valor F, y ``UndefinedMetricWarning`` se levantará. Este comportamiento puede ser modificado con ``zero_division``.

source: References
es_es: Referencias

source: `Wikipedia entry for the Precision and recall <https://en.wikipedia.org/wiki/Precision_and_recall>`_.
es_es: `Entrada de Wikipedia para la precisión y exhaustividad <https://es.wikipedia.org/wiki/Precisión_y_exhaustividad>`_.

source: `Wikipedia entry for the F1-score <https://en.wikipedia.org/wiki/F1_score>`_.
es_es: `Entrada de Wikipedia para la valor F1 <https://en.wikipedia.org/wiki/F1_score>`_.

source: Examples
es_es: Ejemplos

source: It is possible to compute per-label precisions, recalls, F1-scores and supports instead of averaging:
es_es: Es posible calcular precisiones por etiqueta, exhaustividad, valor F1 y soportes en lugar de promedio:
