Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.make_moons.po
Languages: es_es

source: Make two interleaving half circles.
es_es: Crea dos medios círculos intercalados.

source: A simple toy dataset to visualize clustering and classification algorithms. Read more in the :ref:`User Guide <sample_generators>`.
es_es: Un conjunto de datos simple de juguetes para visualizar los algoritmos de conglomerados y clasificación. Leer más en el :ref:`Manual de Usuario <sample_generators>`.

source: Parameters
es_es: Parámetros

source: int or tuple of shape (2,), dtype=int, default=100
es_es: entero o tupla de forma (2,), dtype=int, default=100

source: If int, the total number of points generated. If two-element tuple, number of points in each of two moons.
es_es: Si es int, el número total de puntos generados. Si es una tupla de dos elementos, el número de puntos en cada una de las dos lunas.

source: Added two-element tuple.
es_es: Tupla de dos elementos añadida.

source: Whether to shuffle the samples.
es_es: Si se revuelven las muestras.

source: Standard deviation of Gaussian noise added to the data.
es_es: Desviación estándar del ruido Gaussiano añadido a los datos.

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, default=None

source: Determines random number generation for dataset shuffling and noise. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para el shuffling y el ruido del conjunto de datos. Pasa un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples, 2)
es_es: ndarray de forma (n_samples, 2)

source: The generated samples.
es_es: Las muestras generadas.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The integer labels (0 or 1) for class membership of each sample.
es_es: Las etiquetas enteras (0 o 1) para la pertenencia a la clase de cada muestra.

source: Examples using ``sklearn.datasets.make_moons``
es_es: Ejemplos usando ``sklearn.datasets.make_moons``
