Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.exceptions.DataConversionWarning.po
Languages: es_es

source: Warning used to notify implicit data conversions happening in the code.
es_es: Advertencia utilizada para notificar conversiones implícitas de datos que ocurren en el código.

source: This warning occurs when some input data needs to be converted or interpreted in a way that may not match the user's expectations.
es_es: Esta advertencia ocurre cuando algunos datos de entrada necesitan ser convertidos o interpretados de una manera que puede no coincidir con las expectativas del usuario.

source: For example, this warning may occur when the user
es_es: Por ejemplo, esta advertencia puede ocurrir cuando el usuario

source: passes an integer array to a function which expects float input and will convert the input
es_es: pasa un array entero a una función que espera entrada flotante y convertirá la entrada

source: requests a non-copying operation, but a copy is required to meet the implementation's data-type expectations;
es_es: solicita una operación sin copiar, pero una copia es necesaria para satisfacer las expectativas de tipo de datos de la implementación;

source: passes an input whose shape can be interpreted ambiguously.
es_es: pasa una entrada cuya forma puede ser interpretada con ambigüedad.

source: Moved from sklearn.utils.validation.
es_es: Se ha movido de sklearn.utils.validation.

source: Attributes
es_es: Atributos

source: Methods
es_es: Métodos

source: Exception.with_traceback(tb) -- set self.__traceback__ to tb and return self.
es_es: Exception.with_traceback(tb) -- se establece self.__traceback__ en tb y devuelve self.
