Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.permutation_test_score.po
Languages: es_es

source: Evaluate the significance of a cross-validated score with permutations
es_es: Evaluar la significación de una puntuación validada de forma cruzada con permutaciones

source: Permutes targets to generate 'randomized data' and compute the empirical p-value against the null hypothesis that features and targets are independent.
es_es: Permute los objetivos para generar "datos aleatorios" y calcule el valor p empírico frente a la hipótesis nula de que las características y los objetivos son independientes.

source: The p-value represents the fraction of randomized data sets where the estimator performed as well or better than in the original data. A small p-value suggests that there is a real dependency between features and targets which has been used by the estimator to give good predictions. A large p-value may be due to lack of real dependency between features and targets or the estimator was not able to use the dependency to give good predictions.
es_es: El valor p representa la fracción de conjuntos de datos aleatorios en los que el estimador funcionó tan bien o mejor que en los datos originales. Un valor p pequeño sugiere que hay una dependencia real entre las características y los objetivos que ha sido utilizada por el estimador para dar buenas predicciones. Un valor p elevado puede deberse a la falta de dependencia real entre las características y los objetivos o a que el estimador no fue capaz de utilizar la dependencia para hacer buenas predicciones.

source: Read more in the :ref:`User Guide <permutation_test_score>`.
es_es: Más información en el :ref:`Manual de usuario <permutation_test_score>`.

source: Parameters
es_es: Parámetros

source: estimator object implementing 'fit'
es_es: objeto estimador implementando 'fit'

source: The object to use to fit the data.
es_es: El objeto a usar para ajustar los datos.

source: array-like of shape at least 2D
es_es: tipo de arreglo de forma al menos 2D

source: The data to fit.
es_es: Los datos a ajustar.

source: array-like of shape (n_samples,) or (n_samples, n_outputs) or None
es_es: tipo arreglo de forma (n_samples,) o (n_samples, n_outputs) o None

source: The target variable to try to predict in the case of supervised learning.
es_es: La variable objetivo que se intenta predecir en el caso del aprendizaje supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Labels to constrain permutation within groups, i.e. ``y`` values are permuted among samples with the same group identifier. When not specified, ``y`` values are permuted among all samples.
es_es: Etiquetas para restringir la permutación dentro de los grupos, es decir, los valores de ``y`` se permutan entre las muestras con el mismo identificador de grupo. Si no se especifica, los valores de ``y`` se permutan entre todas las muestras.

source: When a grouped cross-validator is used, the group labels are also passed on to the ``split`` method of the cross-validator. The cross-validator uses them for grouping the samples while splitting the dataset into train/test set.
es_es: Cuando se utiliza un validador cruzado agrupado, las etiquetas de grupo también se pasan al método ``split`` del validador cruzado. El validador cruzado las utiliza para agrupar las muestras mientras separa el conjunto de datos en conjunto de entrenamiento/prueba.

source: str or callable, default=None
es_es: cadena de caracteres o invocable, default=None

source: A single str (see :ref:`scoring_parameter`) or a callable (see :ref:`scoring`) to evaluate the predictions on the test set.
es_es: Una sola cadena (véase :ref:`scoring_parameter`) o un callable (véase :ref:`scoring`) para evaluar las predicciones en el conjunto de prueba.

source: If None the estimator's score method is used.
es_es: Si es None se utiliza el método de puntuación del estimador.

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, por defecto=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de separación de la validación cruzada. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para utilizar la validación cruzada de 5 pliegues por defecto,

source: int, to specify the number of folds in a `(Stratified)KFold`,
es_es: int, para especificar el número de pliegues en un `(Stratified)KFold`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce (train, test) se separa como arreglos de índices.

source: For int/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas int/None, si el estimador es un clasificador y ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv`` si None cambió de 3-fold a 5-fold.

source: Number of times to permute ``y``.
es_es: Número de veces para permutar ``y``.

source: Number of jobs to run in parallel. Training the estimator and computing the cross-validated score are parallelized over the permutations. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. El entrenamiento del estimador y el cálculo de la puntuación de validación cruzada se ejecutan en paralelo sobre las permutaciones. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: int, RandomState instance or None, default=0
es_es: entero, instancia de RandomState o None, default=None

source: Pass an int for reproducible output for permutation of ``y`` values among samples. See :term:`Glossary <random_state>`.
es_es: Pase un int para una salida reproducible para la permutación de los valores ``y`` entre las muestras. Véase :term:`Glosario <random_state>`.

source: The verbosity level.
es_es: El nivel de verbosidad.

source: Parameters to pass to the fit method of the estimator.
es_es: Los parámetros que hay que pasar al método de ajuste del estimador.

source: Returns
es_es: Devuelve

source: float
es_es: de punto flotante (float)

source: The true score without permuting targets.
es_es: La puntuación verdadera sin permutar los objetivos.

source: array of shape (n_permutations,)
es_es: arreglo de forma (n_permutations,)

source: The scores obtained for each permutations.
es_es: Las puntuaciones obtenidas para cada permutación.

source: The p-value, which approximates the probability that the score would be obtained by chance. This is calculated as:
es_es: El valor p, que se aproxima a la probabilidad de que la puntuación se obtenga por azar. Se calcula como:

source: Where C is the number of permutations whose score >= the true score.
es_es: Donde C es el número de permutaciones cuya puntuación >= la puntuación verdadera.

source: The best possible p-value is 1/(n_permutations + 1), the worst is 1.0.
es_es: El mejor valor p posible es 1/(n_permutations + 1), el peor es 1,0.

source: Notes
es_es: Notas

source: This function implements Test 1 in:
es_es: Esta función implementa la prueba 1 en:

source: Examples using ``sklearn.model_selection.permutation_test_score``
es_es: Ejemplos usando ``sklearn.model_selection.permutation_test_score``
