Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.RepeatedStratifiedKFold.po
Languages: es_es

source: Repeated Stratified K-Fold cross validator.
es_es: Repite el validador cruzado K-Fold estratificado.

source: Repeats Stratified K-Fold n times with different randomization in each repetition.
es_es: Repite K-Fold estratificado n veces con diferente aleatoriedad en cada repetición.

source: Read more in the :ref:`User Guide <repeated_k_fold>`.
es_es: Más información en el :ref:`Manual de usuario <repeated_k_fold>`.

source: Parameters
es_es: Parámetros

source: Number of folds. Must be at least 2.
es_es: Número de pliegues. Debe ser al menos 2.

source: Number of times cross-validator needs to be repeated.
es_es: Número de veces que debe repetirse el validador cruzado.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, por defecto=None

source: Controls the generation of the random states for each repetition. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Controla la generación de los estados aleatorios para cada repetición. Pase un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Repeats K-Fold n times.
es_es: Repite el K-Fold Estratificado n veces.

source: Notes
es_es: Notas

source: Randomized CV splitters may return different results for each call of split. You can make the results identical by setting `random_state` to an integer.
es_es: Los separadores de CV aleatorios pueden devolver resultados diferentes en cada llamada a separar. Puedes hacer que los resultados sean idénticos estableciendo `random_state` a un número entero.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Returns the number of splitting iterations in the cross-validator
es_es: Devuelve el número de iteraciones divididas en el validador cruzado

source: Generates indices to split data into training and test set.
es_es: Generar índices para dividir los datos en conjunto de entrenamiento y de prueba.

source: object
es_es: objeto

source: Always ignored, exists for compatibility. ``np.zeros(n_samples)`` may be used as a placeholder.
es_es: Siempre se ignora, existe por compatibilidad. ``np.zeros(n_samples)`` puede utilizarse como marcador de posición.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Group labels for the samples used while splitting the dataset into train/test set.
es_es: Etiquetas de grupo para las muestras utilizadas al separar el conjunto de datos en conjunto de entrenamiento/prueba.

source: Returns
es_es: Devuelve

source: Returns the number of splitting iterations in the cross-validator.
es_es: Devuelve el número de iteraciones divididas en el validador cruzado.

source: array-like of shape (n_samples, n_features)
es_es: tipo de arreglo de forma (n_samples, n_features)

source: Training data, where n_samples is the number of samples and n_features is the number of features.
es_es: Datos de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: The target variable for supervised learning problems.
es_es: La variable objetivo para los problemas de aprendizaje supervisado.

source: Yields
es_es: Produce

source: The training set indices for that split.
es_es: El entrenamiento establece los índices para esa división.

source: The testing set indices for that split.
es_es: Los índices del conjunto de pruebas para esa división.

source: Examples using ``sklearn.model_selection.RepeatedStratifiedKFold``
es_es: Ejemplos usando ``sklearn.model_selection.RepeatedStratifiedKFold``
