Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.multiclass.unique_labels.po
Languages: es_es

source: Extract an ordered array of unique labels.
es_es: Extrae un arreglo ordenado de etiquetas únicas.

source: We don't allow:
es_es: No se permite:

source: mix of multilabel and multiclass (single label) targets
es_es: mezcla de objetivos multietiqueta y multiclase (etiqueta única)

source: mix of label indicator matrix and anything else, because there are no explicit labels)
es_es: mezcla de matriz indicatriz de etiquetas y cualquier otra cosa, porque no hay etiquetas explícitas)

source: mix of label indicator matrices of different sizes
es_es: mezcla de matrices indicatrices de etiquetas de diferentes tamaños

source: mix of string and integer labels
es_es: mezcla de etiquetas de cadenas y de números enteros

source: At the moment, we also don't allow "multiclass-multioutput" input type.
es_es: Por el momento, tampoco permitimos el tipo de entrada "multiclase-multisalida".

source: Parameters
es_es: Parámetros

source: Returns
es_es: Devuelve

source: ndarray of shape (n_unique_labels,)
es_es: ndarray de forma (n_unique_labels,)

source: An ordered array of unique labels.
es_es: Un arreglo ordenado de etiquetas únicas.

source: Examples
es_es: Ejemplos
