Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.GroupKFold.po
Languages: es_es

source: K-fold iterator variant with non-overlapping groups.
es_es: Variante del iterador K-fold con grupos no superpuestos.

source: The same group will not appear in two different folds (the number of distinct groups has to be at least equal to the number of folds).
es_es: El mismo grupo no aparecerá en dos pliegues(folds) diferentes (el número de grupos distintos tiene que ser al menos igual al número de pliegues).

source: The folds are approximately balanced in the sense that the number of distinct groups is approximately the same in each fold.
es_es: Los pliegues están aproximadamente equilibrados en el sentido de que el número de grupos distintos es aproximadamente el mismo en cada pliegue.

source: Read more in the :ref:`User Guide <group_k_fold>`.
es_es: Más información en el :ref:`Manual de usuario <group_k_fold>`.

source: Parameters
es_es: Parámetros

source: Number of folds. Must be at least 2.
es_es: Número de pliegues. Debe ser al menos 2.

source: ``n_splits`` default value changed from 3 to 5.
es_es: El valor predeterminado de ``n_splits`` ha cambiado de 3 a 5.

source: For splitting the data according to explicit domain-specific stratification of the dataset.
es_es: Para dividir los datos de acuerdo con la estratificación explícita de dominio específico del conjunto de datos.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Returns the number of splitting iterations in the cross-validator
es_es: Devuelve el número de iteraciones de división en el validador cruzado

source: Generate indices to split data into training and test set.
es_es: Genera índices para dividir los datos en conjunto de entrenamiento y de prueba.

source: Always ignored, exists for compatibility.
es_es: Siempre se ignora, existe por compatibilidad.

source: Returns
es_es: Devuelve

source: Returns the number of splitting iterations in the cross-validator.
es_es: Devuelve el número de iteraciones de división en el validador cruzado.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Training data, where n_samples is the number of samples and n_features is the number of features.
es_es: Datos de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,) default=None

source: The target variable for supervised learning problems.
es_es: La variable objetivo para problemas de aprendizaje supervisado.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Group labels for the samples used while splitting the dataset into train/test set.
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba.

source: Yields
es_es: Produce

source: The training set indices for that split.
es_es: Los índices del conjunto de entrenamiento para esa división.

source: The testing set indices for that split.
es_es: Los índices del conjunto de pruebas para esa división.

source: Examples using ``sklearn.model_selection.GroupKFold``
es_es: Ejemplos utilizando ``sklearn.model_selection.GroupKFold``
