Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.pairwise.euclidean_distances.po
Languages: es_es

source: Considering the rows of X (and Y=X) as vectors, compute the distance matrix between each pair of vectors.
es_es: Considerando las filas de X (y Y=X) como vectores, calcula la matriz de distancia entre cada par de vectores.

source: For efficiency reasons, the euclidean distance between a pair of row vector x and y is computed as::
es_es: Por razones de eficiencia, la distancia euclidiana entre un par de vectores fila x y y se calcula como::

source: This formulation has two advantages over other ways of computing distances. First, it is computationally efficient when dealing with sparse data. Second, if one argument varies but the other remains unchanged, then `dot(x, x)` and/or `dot(y, y)` can be pre-computed.
es_es: Esta formulación tiene dos ventajas sobre otras formas de calcular las distancias. En primer lugar, es eficiente desde el punto de vista computacional cuando se trata de datos dispersos. En segundo lugar, si uno de los argumentos varía pero el otro permanece inalterado, entonces `dot(x, x)` y/o `dot(y, y)` pueden ser precalculados.

source: However, this is not the most precise way of doing this computation, because this equation potentially suffers from "catastrophic cancellation". Also, the distance matrix returned by this function may not be exactly symmetric as required by, e.g., ``scipy.spatial.distance`` functions.
es_es: Sin embargo, esta no es la forma más precisa de hacer este cálculo, porque esta ecuación sufre potencialmente de "cancelación catastrófica". Además, la matriz de distancias devuelta por esta función puede no ser exactamente simétrica como requieren, por ejemplo, las funciones ``scipy.spatial.distance``.

source: Read more in the :ref:`User Guide <metrics>`.
es_es: Leer más en el :ref:`Manual de Usuario <metrics>`.

source: Parameters
es_es: Parámetros

source: {array-like, sparse matrix} of shape (n_samples_X, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples_X, n_features)

source: {array-like, sparse matrix} of shape (n_samples_Y, n_features), default=None
es_es: {array-like, sparse matrix} de forma (n_samples_Y, n_features), default=None

source: array-like of shape (n_samples_Y,), default=None
es_es: array-like de forma (n_samples_Y,), default=None

source: Pre-computed dot-products of vectors in Y (e.g., ``(Y**2).sum(axis=1)``) May be ignored in some cases, see the note below.
es_es: Productos-punto precalculados de vectores en Y (por ejemplo, ``(Y**2).sum(axis=1)``) Pueden ignorarse en algunos casos, ver la nota más abajo.

source: Return squared Euclidean distances.
es_es: Devuelve las distancias euclidianas al cuadrado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Pre-computed dot-products of vectors in X (e.g., ``(X**2).sum(axis=1)``) May be ignored in some cases, see the note below.
es_es: Productos-punto precalculados de vectores en X (por ejemplo, ``(X**2).sum(axis=1)``) Pueden ignorarse en algunos casos, ver la nota más abajo.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples_X, n_samples_Y)
es_es: ndarray de forma (n_samples_X, n_samples_Y)

source: Distances betweens pairs of elements of X and Y.
es_es: Distancias entre pares de elementos de X y Y.

source: Notes
es_es: Notas

source: To achieve better accuracy, `X_norm_squared` and `Y_norm_squared` may be unused if they are passed as ``float32``.
es_es: Para lograr una mayor precisión, `X_norm_squared` y `Y_norm_squared` pueden no utilizarse si se pasan como ``float32``.

source: Examples
es_es: Ejemplos
