Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.neighbors.RadiusNeighborsClassifier.po
Languages: es_es

source: Classifier implementing a vote among neighbors within a given radius
es_es: Clasificador que implementa un voto entre vecinos dentro de un radio determinado

source: Read more in the :ref:`User Guide <classification>`.
es_es: Más información en el :ref:`Manual de usuario <classification>`.

source: Parameters
es_es: Parámetros

source: float, default=1.0
es_es: flotante, default=1.0

source: Range of parameter space to use by default for :meth:`radius_neighbors` queries.
es_es: Rango del espacio de parámetros a usar por defecto para consultas :meth:`radius_neighbors`.

source: {'uniform', 'distance'} or callable, default='uniform'
es_es: {'uniform', 'distance'} o invocable, default='uniform'

source: weight function used in prediction. Possible values:
es_es: función de ponderación utilizada en la predicción. Valores posibles:

source: 'uniform' : uniform weights. All points in each neighborhood are weighted equally.
es_es: 'uniform' : ponderaciones uniformes. Todos los puntos de cada vecindad se ponderan por igual.

source: 'distance' : weight points by the inverse of their distance. in this case, closer neighbors of a query point will have a greater influence than neighbors which are further away.
es_es: 'distance' : ponderar los puntos por la inversa de su distancia. en este caso, los vecinos más cercanos de un punto de consulta tendrán una mayor influencia que los vecinos más alejados.

source: [callable] : a user-defined function which accepts an array of distances, and returns an array of the same shape containing the weights.
es_es: [callable] : una función definida por el usuario que acepta un arreglo de distancias, y devuelve un arreglo de la misma forma que contiene las ponderaciones.

source: Uniform weights are used by default.
es_es: Las ponderaciones uniformes se utilizan por defecto.

source: Algorithm used to compute the nearest neighbors:
es_es: Algoritmo usado para calcular los vecinos más cercanos:

source: 'ball_tree' will use :class:`BallTree`
es_es: 'ball_tree' usará :class:`BallTree`

source: 'kd_tree' will use :class:`KDTree`
es_es: 'kd_tree' usará :class:`KDTree`

source: 'brute' will use a brute-force search.
es_es: 'brute' usará una búsqueda de fuerza bruta.

source: 'auto' will attempt to decide the most appropriate algorithm based on the values passed to :meth:`fit` method.
es_es: 'auto' intentará decidir el algoritmo más apropiado basado en los valores pasados al método :meth:`fit`.

source: Note: fitting on sparse input will override the setting of this parameter, using brute force.
es_es: Nota: el ajuste en la entrada dispersa anulará el ajuste de este parámetro, utilizando la fuerza bruta.

source: int, default=30
es_es: entero, default=30

source: Leaf size passed to BallTree or KDTree. This can affect the speed of the construction and query, as well as the memory required to store the tree. The optimal value depends on the nature of the problem.
es_es: Tamaño de hoja pasado a BallTree o KDTree. Esto puede afectar la velocidad de la construcción y la consulta, así como la memoria necesaria para almacenar el árbol. El valor óptimo depende de la naturaleza del problema.

source: int, default=2
es_es: entero, default=2

source: Power parameter for the Minkowski metric. When p = 1, this is equivalent to using manhattan_distance (l1), and euclidean_distance (l2) for p = 2. For arbitrary p, minkowski_distance (l_p) is used.
es_es: Parámetro de potencia para la métrica de Minkowski. Cuando p = 1, esto equivale a utilizar manhattan_distance (l1), y euclidean_distance (l2) para p = 2. Para p arbitrario, se utiliza minkowski_distance (l_p).

source: str or callable, default='minkowski'
es_es: cadena de caracteres o invocable, default="minkowski'

source: the distance metric to use for the tree. The default metric is minkowski, and with p=2 is equivalent to the standard Euclidean metric. See the documentation of :class:`DistanceMetric` for a list of available metrics. If metric is "precomputed", X is assumed to be a distance matrix and must be square during fit. X may be a :term:`sparse graph`, in which case only "nonzero" elements may be considered neighbors.
es_es: la métrica de distancia a utilizar para el árbol. La métrica predeterminada es minkowski, y con p=2 es equivalente a la métrica Euclideana estándar. Ver la documentación de :class:`DistanceMetric` para una lista de métricas disponibles. Si la métrica es "precomputed", se asume que X es una matriz de distancias y debe ser cuadrada durante el ajuste. X puede ser un :term:`grafo disperso`, en cuyo caso sólo elementos "distintos de cero" pueden ser considerados vecinos.

source: label for outlier samples (samples with no neighbors in given radius).
es_es: etiqueta para muestras atípicas (muestras sin vecinos en un radio determinado).

source: manual label: str or int label (should be the same type as y) or list of manual labels if multi-output is used.
es_es: etiqueta manual: etiqueta cadena o entero (debe ser del mismo tipo que y) o lista de etiquetas manuales si se utiliza multi-salida.

source: 'most_frequent' : assign the most frequent label of y to outliers.
es_es: 'most_frequent' : asignar la etiqueta más frecuente de y a los atípicos.

source: None : when any outlier is detected, ValueError will be raised.
es_es: None: cuando se detecta algún atípico, ValueError se levantará.

source: dict, default=None
es_es: diccionario, default=None

source: Additional keyword arguments for the metric function.
es_es: Argumentos adicionales de la palabra clave para la función métrica.

source: int, default=None
es_es: entero, default=None

source: The number of parallel jobs to run for neighbors search. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos paralelos a ejecutar para la búsqueda de vecinos. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa usar todos los procesadores. Consulta :term:`Glosario <n_jobs>` para más detalles.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Class labels known to the classifier.
es_es: Etiquetas de clase conocidas por el clasificador.

source: str or callable
es_es: cadena de caracteres o invocable

source: The distance metric used. It will be same as the `metric` parameter or a synonym of it, e.g. 'euclidean' if the `metric` parameter set to 'minkowski' and `p` parameter set to 2.
es_es: La métrica de distancia utilizada. Será la misma que el parámetro `metric` o un sinónimo de la misma, por ejemplo, `euclidean` si el parámetro `metric` es `minkowski` y el parámetro `p` es 2.

source: Additional keyword arguments for the metric function. For most metrics will be same with `metric_params` parameter, but may also contain the `p` parameter value if the `effective_metric_` attribute is set to 'minkowski'.
es_es: Argumentos adicionales para la función métrica. Para la mayoría de las métricas será lo mismo que el parámetro `metric_params`, pero también puede contener el valor del parámetro `p` si el atributo `effective_metric_` se establece como `minkowski`.

source: int
es_es: entero

source: Number of samples in the fitted data.
es_es: Número de muestras en los datos ajustados.

source: int or array-like of shape (n_class,)
es_es: entero o array-like de forma (n_class,)

source: Label which is given for outlier samples (samples with no neighbors on given radius).
es_es: Etiqueta que se da para muestras atípicas (muestras sin vecinos en un radio determinado).

source: bool
es_es: booleano

source: False when `y`'s shape is (n_samples, ) or (n_samples, 1) during fit otherwise True.
es_es: False cuando la forma de `y` es (n_samples, ) o (n_samples, 1) durante el ajuste, de lo contrario True.

source: Notes
es_es: Notas

source: See :ref:`Nearest Neighbors <neighbors>` in the online documentation for a discussion of the choice of ``algorithm`` and ``leaf_size``.
es_es: Ver :ref:`Nearest Neighbors <neighbors>` en la documentación en línea para una discusión sobre la elección del ``algorithm`` y el ``leaf_size``.

source: https://en.wikipedia.org/wiki/K-nearest_neighbor_algorithm
es_es: https://https://es.wikipedia.org/wiki/K_vecinos_m%C3%A1s_pr%C3%B3ximos

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the radius neighbors classifier from the training dataset.
es_es: Ajusta el clasificador de radio de vecinos a partir del conjunto de datos de entrenamiento.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros de este estimador.

source: Predict the class labels for the provided data.
es_es: Predice las etiquetas de la clase para los datos proporcionados.

source: Return probability estimates for the test data X.
es_es: Devuelve las estimaciones de probabilidad para los datos de prueba X.

source: Finds the neighbors within a given radius of a point or points.
es_es: Encuentra a los vecinos dentro de un radio determinado de un punto o puntos.

source: Computes the (weighted) graph of Neighbors for points in X
es_es: Calcula el grafo (ponderado) de vecinos para los puntos de X

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos de prueba y las etiquetas dados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: {array-like, sparse matrix} of shape (n_samples, n_features) or (n_samples, n_samples) if metric='precomputed'
es_es: {array-like, sparse matrix} de forma (n_samples, n_features) o (n_samples, n_samples) si metric='precomputed'

source: Training data.
es_es: Datos del entrenamiento.

source: {array-like, sparse matrix} of shape (n_samples,) or (n_samples, n_outputs)
es_es: {array-like, sparse matrix} de forma (n_samples,) o (n_samples, n_outputs)

source: Target values.
es_es: Valores objetivo.

source: Returns
es_es: Devuelve

source: The fitted radius neighbors classifier.
es_es: El clasificador de vecinos de radio ajustado.

source: bool, default=True
es_es: booleano, default=True

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: array-like of shape (n_queries, n_features), or (n_queries, n_indexed) if metric == 'precomputed'
es_es: array-like de forma (n_queries, n_features), o (n_queries, n_indexed) si metric == 'precomputed'

source: Test samples.
es_es: Muestras de prueba.

source: ndarray of shape (n_queries,) or (n_queries, n_outputs)
es_es: ndarray de forma (n_queries,) o (n_queries, n_outputs)

source: Class labels for each data sample.
es_es: Etiquetas de clase para cada muestra de datos.

source: ndarray of shape (n_queries, n_classes), or a list of n_outputs
es_es: ndarray de forma (n_queries, n_classes), o una lista de n_outputs

source: of such arrays if n_outputs > 1. The class probabilities of the input samples. Classes are ordered by lexicographic order.
es_es: de dichos arreglos si n_outputs > 1. Las probabilidades de clase de las muestras de entrada. Las clases se ordenan por orden lexicográfico.

source: Return the indices and distances of each point from the dataset lying in a ball with size ``radius`` around the points of the query array. Points lying on the boundary are included in the results.
es_es: Devuelve los índices y distancias de cada punto del conjunto de datos que se encuentra en una bola con el tamaño ``radius`` alrededor de los puntos del arreglo de consultas. Los puntos en el límite están incluidos en los resultados.

source: The result points are *not* necessarily sorted by distance to their query point.
es_es: Los puntos de resultado *no* necesariamente están ordenados por distancia a su punto de consulta.

source: array-like of (n_samples, n_features), default=None
es_es: array-like de (n_samples, n_features), default=None

source: The query point or points. If not provided, neighbors of each indexed point are returned. In this case, the query point is not considered its own neighbor.
es_es: El punto o puntos de la consulta. Si no se proporciona, se devuelven los vecinos de cada punto indexado. En este caso, el punto de consulta no se considera su propio vecino.

source: float, default=None
es_es: flotante, default=None

source: Limiting distance of neighbors to return. The default is the value passed to the constructor.
es_es: Limitando la distancia de vecinos a regresar. El valor predeterminado es pasado al constructor.

source: Whether or not to return the distances.
es_es: Si se devuelven o no las distancias.

source: bool, default=False
es_es: booleano, default=False

source: If True, the distances and indices will be sorted by increasing distances before being returned. If False, the results may not be sorted. If `return_distance=False`, setting `sort_results=True` will result in an error.
es_es: Si es True, las distancias e índices serán ordenados antes de ser devueltos. Si es False, los resultados no se ordenarán. Si `return_distance=False`, al establecer `sort_results=True` se producirá un error.

source: ndarray of shape (n_samples,) of arrays
es_es: ndarray de forma (n_samples,) de arreglos

source: Array representing the distances to each point, only present if `return_distance=True`. The distance values are computed according to the ``metric`` constructor parameter.
es_es: Arreglo que representa las distancias a cada punto, sólo presente si `return_distance=True`. Los valores de la distancia se calculan según el parámetro del constructor ``metric``.

source: An array of arrays of indices of the approximate nearest points from the population matrix that lie within a ball of size ``radius`` around the query points.
es_es: Un arreglo de arreglos de los puntos más cercanos aproximados de la matriz de población que se encuentran dentro de una bola de tamaño ``radius`` alrededor de los puntos de la consulta.

source: Because the number of neighbors of each point is not necessarily equal, the results for multiple query points cannot be fit in a standard data array. For efficiency, `radius_neighbors` returns arrays of objects, where each object is a 1D array of indices or distances.
es_es: Debido a que el número de vecinos de cada punto no es necesariamente igual, los resultados para múltiples puntos de consulta no pueden encajar en un arreglo de datos estándar. Por eficiencia, `radius_neighbors` devuelve arreglos de objetos, donde cada objeto es un arreglo 1D de índices o distancias.

source: In the following example, we construct a NeighborsClassifier class from an array representing our data set and ask who's the closest point to [1, 1, 1]:
es_es: En el siguiente ejemplo, construimos una clase NeighborsClassifier a partir de un arreglo que representa nuestro conjunto de datos y preguntamos cuál es el punto más cercano a [1,1,1]:

source: The first array returned contains the distances to all points which are closer than 1.6, while the second array returned contains their indices. In general, multiple points can be queried at the same time.
es_es: El primer arreglo devuelto contiene las distancias a todos los puntos más cercanos a 1.6, mientras que el segundo arreglo devuelto contiene sus índices. En general, se pueden consultar varios puntos al mismo tiempo.

source: Neighborhoods are restricted the points at a distance lower than radius.
es_es: Las vecindades son los puntos restringidos a una distancia inferior al radio.

source: array-like of shape (n_samples, n_features), default=None
es_es: array-like de forma (n_samples, n_features), default=None

source: Radius of neighborhoods. The default is the value passed to the constructor.
es_es: Radio de vecindades. El valor predeterminado es pasado al constructor.

source: Type of returned matrix: 'connectivity' will return the connectivity matrix with ones and zeros, in 'distance' the edges are Euclidean distance between points.
es_es: Tipo de matriz devuelta: 'connectivity' devolverá la matriz de conectividad con unos y ceros, en 'distance' los bordes son la distancia euclidiana entre puntos.

source: If True, in each row of the result, the non-zero entries will be sorted by increasing distances. If False, the non-zero entries may not be sorted. Only used with mode='distance'.
es_es: Si es True, en cada fila del resultado, las entradas que no sean de cero se ordenarán aumentando las distancias. Si es False, las entradas que no sean nulas no pueden ser ordenadas. Sólo se utiliza con mode='distance'.

source: sparse-matrix of shape (n_queries, n_samples_fit)
es_es: matriz dispersa de forma (n_queries, n_samples_fit)

source: `n_samples_fit` is the number of samples in the fitted data `A[i, j]` is assigned the weight of edge that connects `i` to `j`. The matrix if of format CSR.
es_es: `n_samples_fit` es el número de muestras en los datos especificados `A[i, j]` se le asigna la ponderación de borde que conecta `i` a `j`. La matriz si de formato CSR.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En la clasificación multietiqueta, se trata de la precisión del subconjunto, que es una métrica rigurosa, ya que se requiere para cada muestra que cada conjunto de etiquetas sea predicho correctamente.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas verdaderas para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de muestra.

source: float
es_es: flotante

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con respecto a `y`.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia de estimador.
