Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils._safe_indexing.po
Languages: es_es

source: Return rows, items or columns of X using indices.
es_es: Devuelve filas, elementos o columnas de X usando índices.

source: This utility is documented, but **private**. This means that backward compatibility might be broken without any deprecation cycle.
es_es: Esta utilidad está documentada, pero **privada**. Esto significa que la compatibilidad hacia atrás podría romperse sin ningún ciclo de obsolescencia.

source: Parameters
es_es: Parámetros

source: array-like, sparse-matrix, list, pandas.DataFrame, pandas.Series
es_es: array-like, matriz dispersa, lista, pandas.DataFrame, pandas.Series

source: Data from which to sample rows, items or columns. `list` are only supported when `axis=0`.
es_es: Datos a partir de los cuales mostrar filas, elementos o columnas. `list` solo son compatibles cuando `axis=0`.

source: If `axis=0`, boolean and integer array-like, integer slice, and scalar integer are supported.
es_es: Si `axis=0`, se soportan array-like booleanos y enteros, como cortes enteros y escalares.

source: If `axis=1`:
es_es: Si `axis=1`:

source: to select a single column, `indices` can be of `int` type for all `X` types and `str` only for dataframe. The selected subset will be 1D, unless `X` is a sparse matrix in which case it will be 2D.
es_es: para seleccionar una sola columna, los `índices` pueden ser de tipo `int` para todos los tipos `X` y `str` sólo para el dataframe. El subconjunto seleccionado será 1D, a menos que `X` sea una matriz dispersa en cuyo caso será 2D.

source: to select multiples columns, `indices` can be one of the following: `list`, `array`, `slice`. The type used in these containers can be one of the following: `int`, 'bool' and `str`. However, `str` is only supported when `X` is a dataframe. The selected subset will be 2D.
es_es: para seleccionar multiples columnas, `indices` puede ser una de las siguientes: `list`, `array`, `slice`. El tipo utilizado en estos contenedores puede ser uno de los siguientes: `int`, 'bool' y `str`. Sin embargo, `str` solo es compatible cuando `X` es un dataframe. El subconjunto seleccionado será 2D.

source: The axis along which `X` will be subsampled. `axis=0` will select rows while `axis=1` will select columns.
es_es: El eje a lo largo del cual se sustituirá `X`. `axis=0` seleccionará filas mientras que `axis=1` seleccionará columnas.

source: Returns
es_es: Devuelve

source: subset
es_es: subconjunto

source: Subset of X on axis 0 or 1.
es_es: Subconjunto de X en el eje 0 o 1.

source: Notes
es_es: Notas

source: CSR, CSC, and LIL sparse matrices are supported. COO sparse matrices are not supported.
es_es: Se admiten las matrices dispersas CSR, CSC y LIL. No se admiten las matrices dispersas COO.
