Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.multiclass.OutputCodeClassifier.po
Languages: es_es

source: (Error-Correcting) Output-Code multiclass strategy
es_es: (Corrección de errores) Estrategia de código de salida (Output-Code) multiclase

source: Output-code based strategies consist in representing each class with a binary code (an array of 0s and 1s). At fitting time, one binary classifier per bit in the code book is fitted. At prediction time, the classifiers are used to project new points in the class space and the class closest to the points is chosen. The main advantage of these strategies is that the number of classifiers used can be controlled by the user, either for compressing the model (0 < code_size < 1) or for making the model more robust to errors (code_size > 1). See the documentation for more details.
es_es: Las estrategias basadas en el código de salida (Output-Code) consisten en representar cada clase con un código binario (un arreglo de 0s y 1s). En el momento del ajuste, se ajusta un clasificador binario por cada bit del libro de códigos (code book). En el momento de la predicción, los clasificadores se utilizan para proyectar nuevos puntos en el espacio de clases y se elige la clase más cercana a los puntos. La principal ventaja de estas estrategias es que el número de clasificadores utilizados puede ser controlado por el usuario, ya sea para comprimir el modelo (0 < code_size < 1) o para hacer el modelo más robusto a los errores (code_size > 1). Consulta la documentación para obtener más detalles.

source: Read more in the :ref:`User Guide <ecoc>`.
es_es: Más información en el :ref:`Manual de usuario <ecoc>`.

source: Parameters
es_es: Parámetros

source: An estimator object implementing :term:`fit` and one of :term:`decision_function` or :term:`predict_proba`.
es_es: Un objeto estimador que implementa :term:`fit` y uno de :term:`decision_function` o :term:`predict_proba`.

source: Percentage of the number of classes to be used to create the code book. A number between 0 and 1 will require fewer classifiers than one-vs-the-rest. A number greater than 1 will require more classifiers than one-vs-the-rest.
es_es: Porcentaje del número de clases que se utilizará para crear el libro de códigos. Un número entre 0 y 1 requerirá menos clasificadores que uno contra el resto (one-vs-the-rest). Un número mayor que 1 requerirá más clasificadores que uno contra el resto.

source: int, RandomState instance, default=None
es_es: entero, instancia de RandomState, default=None

source: The generator used to initialize the codebook. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: El generador utilizado para inicializar el libro de códigos (code_book). Pasa un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: The number of jobs to use for the computation: the multiclass problems are computed in parallel.
es_es: El número de trabajos a utilizar para el cómputo: los problemas multiclase se calculan en paralelo.

source: ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Consulta :term:`Glosario <n_jobs>` para más detalles.

source: Attributes
es_es: Atributos

source: **estimators_** : list of `int(n_classes * code_size)` estimators
es_es: **estimators_** : lista de `int(n_classes * code_size)` estimadores

source: list of
es_es: lista de

source: Estimators used for predictions.
es_es: Estimadores usados para predicciones.

source: numpy array of shape [n_classes]
es_es: arreglo de numpy de forma [n_classes]

source: Array containing labels.
es_es: Arreglo que contiene etiquetas.

source: numpy array of shape [n_classes, code_size]
es_es: arreglo de numpy de forma [n_classes, code_size]

source: Binary array containing the code of each class.
es_es: Arreglo binario que contiene el código de cada clase.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit underlying estimators.
es_es: Ajustar estimadores subyacentes.

source: Get parameters for this estimator.
es_es: Obtener los parámetros de este estimador.

source: Predict multi-class targets using underlying estimators.
es_es: Predecir objetivos multiclase utilizando estimadores subyacentes.

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos y etiquetas de prueba dados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: (sparse) array-like of shape (n_samples, n_features)
es_es: (sparse) array-like de forma (n_samples, n_features)

source: Data.
es_es: Datos.

source: numpy array of shape [n_samples]
es_es: arreglo de numpy de forma [n_samples]

source: Multi-class targets.
es_es: Objetivos multiclase.

source: Returns
es_es: Devuelve

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los sub objetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: Predicted multi-class targets.
es_es: Objetivos multiclase predichos.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En la clasificación multietiqueta, se trata de la precisión del subconjunto, que es una métrica rigurosa, ya que se requiere para cada muestra que cada conjunto de etiquetas sea predicho correctamente.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples_X, n_features)

source: Test samples.
es_es: Muestras de prueba.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas True para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con respecto a `y`.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia de estimador.
