Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_selection.RFECV.po
Languages: es_es

source: Feature ranking with recursive feature elimination and cross-validated selection of the best number of features.
es_es: Clasificación de características con eliminación recursiva de características y selección validada cruzada del mejor número de características.

source: See glossary entry for :term:`cross-validation estimator`.
es_es: Ver entrada de glosario para :term:`cross-validation estimator`.

source: Read more in the :ref:`User Guide <rfe>`.
es_es: Más información en el :ref:`Manual de usuario <rfe>`.

source: Parameters
es_es: Parámetros

source: **estimator** : ``Estimator`` instance
es_es: **estimator** : instancia del ``Estimator``

source: Estimator instance
es_es: Instancia del estimador

source: A supervised learning estimator with a ``fit`` method that provides information about feature importance either through a ``coef_`` attribute or through a ``feature_importances_`` attribute.
es_es: Un estimador de aprendizaje supervisado con un método de ``fit`` que proporciona información sobre la importancia de las características a través de un atributo ``coef_`` o de un atributo ``feature_importances_``.

source: int or float, default=1
es_es: entero o punto flotante, default=1

source: If greater than or equal to 1, then ``step`` corresponds to the (integer) number of features to remove at each iteration. If within (0.0, 1.0), then ``step`` corresponds to the percentage (rounded down) of features to remove at each iteration. Note that the last iteration may remove fewer than ``step`` features in order to reach ``min_features_to_select``.
es_es: Si es mayor o igual que 1, entonces ``step`` corresponde al número (entero) de características a eliminar en cada iteración. Si está dentro de (0.0, 1.0), entonces ``step`` corresponde al porcentaje (redondeado hacia abajo) de características a eliminar en cada iteración. Tener en cuenta que la última iteración puede eliminar menos características que ``step`` para llegar a ``min_features_to_select``.

source: The minimum number of features to be selected. This number of features will always be scored, even if the difference between the original feature count and ``min_features_to_select`` isn't divisible by ``step``.
es_es: El número mínimo de características a seleccionar. Este número de características siempre se puntuará, incluso si la diferencia entre el recuento original de características y ``min_features_to_select`` no es divisible por ``step``.

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de división de la validación cruzada. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross-validation,
es_es: None, para usar la validación cruzada de 5-fold por defecto,

source: integer, to specify the number of folds.
es_es: entero, para especificar el número de partes.

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce divisiones (train, test) como arreglos de índices.

source: For integer/None inputs, if ``y`` is binary or multiclass, :class:`~sklearn.model_selection.StratifiedKFold` is used. If the estimator is a classifier or if ``y`` is neither binary nor multiclass, :class:`~sklearn.model_selection.KFold` is used.
es_es: Para entradas enteras/None, si ``y`` es binario o multiclase, se utiliza :class:`~sklearn.model_selection.StratifiedKFold`. Si el estimador es un clasificador o si ``y`` no es binario ni multiclase, se utiliza :class:`~sklearn.model_selection.KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value of None changed from 3-fold to 5-fold.
es_es: ``cv`` es el valor por defecto si None cambió de 3-fold a 5-fold.

source: string, callable or None, default=None
es_es: string, callable o None, default=None

source: A string (see model evaluation documentation) or a scorer callable object / function with signature ``scorer(estimator, X, y)``.
es_es: Una cadena (véase la documentación de la evaluación del modelo) o un objeto / función callable puntuador (scorer) con la firma ``scorer(estimator, X, y)``.

source: Controls verbosity of output.
es_es: Controla la verbosidad de la salida.

source: int or None, default=None
es_es: int o None, default=None

source: Number of cores to run in parallel while fitting across folds. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de núcleos para ejecutar en paralelo mientras se ajusta a través de partes. ``None`` significa 1 al menos en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa utilizar todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: str or callable, default='auto'
es_es: str o callable, default='auto'

source: If 'auto', uses the feature importance either through a `coef_` or `feature_importances_` attributes of estimator.
es_es: Si es 'auto', utiliza la importancia de la característica a través de los atributos `coef_` o `feature_importances_` del estimador.

source: Also accepts a string that specifies an attribute name/path for extracting feature importance. For example, give `regressor_.coef_` in case of :class:`~sklearn.compose.TransformedTargetRegressor` or `named_steps.clf.feature_importances_` in case of :class:`~sklearn.pipeline.Pipeline` with its last step named `clf`.
es_es: También acepta una cadena que especifica un nombre de atributo/ruta para extraer la importancia de la característica. Por ejemplo, dar `regressor_.coef_` en el caso de :class:`~sklearn.compose.TransformedTargetRegressor` o `named_steps.clf.feature_importances_` en el caso de :class:`~sklearn.pipeline.Pipeline` con su último paso llamado `clf`.

source: If `callable`, overrides the default feature importance getter. The callable is passed with the fitted estimator and it should return importance for each feature.
es_es: Si `callable`, sobrescribe el getter de importancia de características por defecto. El callable se pasa con el estimador ajustado y debe devolver la importancia de cada característica.

source: Attributes
es_es: Atributos

source: **estimator_** : ``Estimator`` instance
es_es: **estimator_** : Instancia del ``Estimador``

source: The fitted estimator used to select features.
es_es: El estimador ajustado utilizado para seleccionar las características.

source: ndarray of shape (n_subsets_of_features,)
es_es: ndarray de forma (n_subsets_of_features)

source: The cross-validation scores such that ``grid_scores_[i]`` corresponds to the CV score of the i-th subset of features.
es_es: Las puntuaciones de validación cruzada, de modo que ``grid_scores_[i]`` corresponde a la puntuación CV del subconjunto i-ésimo de características.

source: The number of selected features with cross-validation.
es_es: El número de características seleccionadas con validación cruzada.

source: narray of shape (n_features,)
es_es: narray de forma (n_features,)

source: The feature ranking, such that `ranking_[i]` corresponds to the ranking position of the i-th feature. Selected (i.e., estimated best) features are assigned rank 1.
es_es: La clasificación de las características, de modo que `ranking_[i]` corresponde a la posición de clasificación de la i-ésima característica. A las características seleccionadas (es decir, las mejores estimadas) se les asigna el rango 1.

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features)

source: The mask of selected features.
es_es: La máscara de las características seleccionadas.

source: Recursive feature elimination.
es_es: Eliminación recursiva de características.

source: Notes
es_es: Notas

source: The size of ``grid_scores_`` is equal to ``ceil((n_features - min_features_to_select) / step) + 1``, where step is the number of features removed at each iteration.
es_es: El tamaño de ``grid_scores_`` es igual a ``ceil((n_features - min__features_to_select) / step) + 1``, donde step es el número de características eliminadas en cada iteración.

source: Allows NaN/Inf in the input if the underlying estimator does as well.
es_es: Permite NaN/Inf en la entrada si el estimador subyacente también lo hace.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: The following example shows how to retrieve the a-priori not known 5 informative features in the Friedman #1 dataset.
es_es: El siguiente ejemplo muestra cómo recuperar las 5 características informativas no conocidas a priori en el conjunto de datos Friedman #1.

source: Methods
es_es: Métodos

source: Compute the decision function of ``X``.
es_es: Calcula la función de decisión de ``X``.

source: Fit the RFE model and automatically tune the number of selected
es_es: Ajustar el modelo RFE y afinar automáticamente el número de características seleccionadas

source: Fit to data, then transform it.
es_es: Ajustar a los datos y luego transformarlos.

source: Get parameters for this estimator.
es_es: Obtener los parámetros de este estimador.

source: Get a mask, or integer index, of the features selected
es_es: Obtener una máscara, o índice entero, de las características seleccionadas

source: Reverse the transformation operation
es_es: Revertir la operación de transformación

source: Reduce X to the selected features and then predict using the
es_es: Reducir X a las características seleccionadas y luego predecir utilizando la

source: Predict class log-probabilities for X.
es_es: Predice las probabilidades de clase para X.

source: Predict class probabilities for X.
es_es: Predice las probabilidades de clase para X.

source: Reduce X to the selected features and then return the score of the
es_es: Reducir X a las características seleccionadas y luego devuelve la puntuación del

source: Set the parameters of this estimator.
es_es: Establecer los parámetros de este estimador.

source: Reduce X to the selected features.
es_es: Reduce X a las características seleccionadas.

source: {array-like or sparse matrix} of shape (n_samples, n_features)
es_es: {array-like or sparse matrix} de forma (n_samples, n_features)

source: The input samples. Internally, it will be converted to ``dtype=np.float32`` and if a sparse matrix is provided to a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, se convertirá a ``dtype=np.float32`` y si se proporciona una matriz dispersa a una ``csr_matrix`` dispersa.

source: Returns
es_es: Devuelve

source: array, shape = [n_samples, n_classes] or [n_samples]
es_es: arreglo, shape = [n_samples, n_classes] o [n_samples]

source: The decision function of the input samples. The order of the classes corresponds to that in the attribute :term:`classes_`. Regression and binary classification produce an array of shape [n_samples].
es_es: La función de decisión de las muestras de entrada. El orden de las clases corresponde al del atributo :term:`classes_`. La regresión y la clasificación binaria producen un arreglo de forma [n_samples].

source: features.
es_es: características.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Training vector, where `n_samples` is the number of samples and `n_features` is the total number of features.
es_es: Vector de entrenamiento, donde `n_samples` es el número de muestras y `n_features` es el número total de características.

source: array-like of shape (n_samples,)
es_es: tipo arreglo de forma (n_samples,)

source: Target values (integers for classification, real numbers for regression).
es_es: Valores objetivo (enteros para la clasificación, números reales para la regresión).

source: array-like of shape (n_samples,) or None, default=None
es_es: tipo arreglo de forma (n_samples,) o None, default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`~sklearn.model_selection.GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia :term:`cv` de "Group" (por ejemplo, :class:`~sklearn.model_selection.GroupKFold`).

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: array-like of shape (n_samples, n_features)
es_es: tipo de arreglo de forma (n_samples, n_features)

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: tipo arreglo de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: arreglo ndarray de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: bool, default=True
es_es: booleano, default=True

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los sub objetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros se asignan a sus valores.

source: bool, default=False
es_es: booleano, default=False

source: If True, the return value will be an array of integers, rather than a boolean mask.
es_es: Si es True, el valor de retorno será un arreglo de enteros, en lugar de una máscara booleana.

source: array
es_es: arreglo

source: An index that selects the retained features from a feature vector. If `indices` is False, this is a boolean array of shape [# input features], in which an element is True iff its corresponding feature is selected for retention. If `indices` is True, this is an integer array of shape [# output features] whose values are indices into the input feature vector.
es_es: Un índice que selecciona las características retenidas de un vector de características. Si `indices` es False, se trata de un arreglo booleano de forma [# características de entrada], en la que un elemento es True si su característica correspondiente es seleccionada para ser retenida. Si `indices` es True, se trata de un arreglo de enteros de forma [# características de salida] cuyos valores son índices en el vector de características de entrada.

source: array of shape [n_samples, n_selected_features]
es_es: arreglo de forma [n_samples, n_selected_features]

source: The input samples.
es_es: Las muestras de entrada.

source: array of shape [n_samples, n_original_features]
es_es: arreglo de forma [n_samples, n_original_features]

source: `X` with columns of zeros inserted where features would have been removed by :meth:`transform`.
es_es: X` con columnas de ceros insertadas donde las características habrían sido eliminadas por :meth:`transform`.

source: underlying estimator.
es_es: estimador subyacente.

source: array of shape [n_samples, n_features]
es_es: arreglo de forma [n_samples, n_features]

source: array of shape [n_samples]
es_es: arreglo de forma [n_samples]

source: The predicted target values.
es_es: Los valores objetivo previstos.

source: array of shape (n_samples, n_classes)
es_es: arreglo de forma (n_samples, n_classes)

source: The class log-probabilities of the input samples. The order of the classes corresponds to that in the attribute :term:`classes_`.
es_es: Las probabilidades logarítmicas de clase de las muestras de entrada. El orden de las clases corresponde al del atributo :term:`classes_`.

source: The class probabilities of the input samples. The order of the classes corresponds to that in the attribute :term:`classes_`.
es_es: Las probabilidades de clase de las muestras de entrada. El orden de las clases corresponde al del atributo :term:`classes_`.

source: The target values.
es_es: Los valores objetivo.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: The input samples with only the selected features.
es_es: Las muestras de entrada con sólo las características seleccionadas.

source: Examples using ``sklearn.feature_selection.RFECV``
es_es: Ejemplos con ``sklearn.feature_selection.RFECV``
