Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.ParameterGrid.po
Languages: es_es

source: Grid of parameters with a discrete number of values for each.
es_es: Rejilla de parámetros con un número discreto de valores para cada uno.

source: Can be used to iterate over parameter value combinations with the Python built-in function iter. The order of the generated parameter combinations is deterministic.
es_es: Se puede utilizar para iterar sobre las combinaciones de valores de los parámetros con la función incorporada de Python iter. El orden de las combinaciones de parámetros generadas es determinista.

source: Read more in the :ref:`User Guide <grid_search>`.
es_es: Más información en el :ref:`Manual de usuario <grid_search>`.

source: Parameters
es_es: Parámetros

source: dict of str to sequence, or sequence of such
es_es: dict de str a secuencia, o secuencia de tales

source: The parameter grid to explore, as a dictionary mapping estimator parameters to sequences of allowed values.
es_es: La cuadrícula de parámetros a explorar, como un diccionario que mapea los parámetros del estimador a secuencias de valores permitidos.

source: An empty dict signifies default parameters.
es_es: Un dict vacío significa parámetros por defecto.

source: A sequence of dicts signifies a sequence of grids to search, and is useful to avoid exploring parameter combinations that make no sense or have no effect. See the examples below.
es_es: Una secuencia de dicts significa una secuencia de cuadrículas para buscar, y es útil para evitar explorar combinaciones de parámetros que no tienen sentido o no tienen efecto. Ver los ejemplos siguientes.

source: Uses :class:`ParameterGrid` to perform a full parallelized parameter search.
es_es: Utiliza :class:`ParameterGrid` para realizar una búsqueda completa de parámetros en paralelo.

source: Examples
es_es: Ejemplos
