Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.fetch_openml.po
Languages: es_es

source: Fetch dataset from openml by name or dataset id.
es_es: Obtenga el conjunto de datos de openml por nombre o por el Id del conjunto de datos.

source: Datasets are uniquely identified by either an integer ID or by a combination of name and version (i.e. there might be multiple versions of the 'iris' dataset). Please give either name or data_id (not both). In case a name is given, a version can also be provided.
es_es: Los conjuntos de datos se identifican de forma exclusiva por un ID entero o por una combinación de nombre y versión (es decir, puede haber varias versiones del conjunto de datos "iris"). Indica el nombre o el identificador de datos (no ambos). Si se indica un nombre, también puede indicarse una versión.

source: Read more in the :ref:`User Guide <openml>`.
es_es: Lee más en la :ref:`Manual de usuario <openml>`.

source: The API is experimental (particularly the return value structure), and might have small backward-incompatible changes without notice or warning in future releases.
es_es: La API es experimental (en particular la estructura de valores de salida), y podría tener pequeños cambios incompatibles con versiones anteriores sin previo aviso o advertencia en futuras versiones.

source: Parameters
es_es: Parámetros

source: String identifier of the dataset. Note that OpenML can have multiple datasets with the same name.
es_es: Identificador de cadena del conjunto de datos. Ten en cuenta que OpenML puede tener varios conjuntos de datos con el mismo nombre.

source: **version**
es_es: **versión**

source: int or 'active', default='active'
es_es: int o 'active', default='active'

source: Version of the dataset. Can only be provided if also ``name`` is given. If 'active' the oldest version that's still active is used. Since there may be more than one active version of a dataset, and those versions may fundamentally be different from one another, setting an exact version is highly recommended.
es_es: Versión del conjunto de datos. Sólo puede proporcionarse si también se da ``name``. Si está "active", se utiliza la versión más antigua que aún esté activa. Dado que puede haber más de una versión activa de un conjunto de datos, y esas versiones pueden ser fundamentalmente diferentes entre sí, es muy recomendable establecer una versión exacta.

source: OpenML ID of the dataset. The most specific way of retrieving a dataset. If data_id is not given, name (and potential version) are used to obtain a dataset.
es_es: ID OpenML del conjunto de datos. Es la forma más específica de recuperar un conjunto de datos. Si no se da data_id, se utiliza el nombre (y la posible versión) para obtener un conjunto de datos.

source: Specify another download and cache folder for the data sets. By default all scikit-learn data is stored in '~/scikit_learn_data' subfolders.
es_es: Especifique otra carpeta de descarga y caché para los conjuntos de datos. Por defecto, todos los datos de scikit-learn se almacenan en las subcarpetas '~/scikit_learn_data'.

source: str, list or None, default='default-target'
es_es: str, list o None, default='default-target'

source: Specify the column name in the data to use as target. If 'default-target', the standard target column a stored on the server is used. If ``None``, all columns are returned as data and the target is ``None``. If list (of strings), all columns with these names are returned as multi-target (Note: not all scikit-learn classifiers can handle all types of multi-output combinations)
es_es: Especifica el nombre de la columna de los datos que se utilizará como objetivo. Si se indica como `default-target`, se utiliza la columna de destino estándar almacenada en el servidor. Si se establece como ``None``, se devuelven todas las columnas como datos y el objetivo es ``None``. Si es una lista (de cadenas), todas las columnas con estos nombres se devuelven como multi objetivo (Nota: no todos los clasificadores de scikit-learn pueden manejar todos los tipos de combinaciones de salida múltiple)

source: Whether to cache downloaded datasets using joblib.
es_es: Permite almacenar en caché los conjuntos de datos descargados utilizando joblib.

source: If True, returns ``(data, target)`` instead of a Bunch object. See below for more information about the `data` and `target` objects.
es_es: Si es True, devuelve ``(data, target)`` en lugar de un objeto Bunch. Ver más abajo para más información sobre los objetos `data` y `target`.

source: bool or 'auto', default='auto'
es_es: bool o 'auto', default='auto'

source: If True, the data is a pandas DataFrame including columns with appropriate dtypes (numeric, string or categorical). The target is a pandas DataFrame or Series depending on the number of target_columns. The Bunch will contain a ``frame`` attribute with the target and the data. If ``return_X_y`` is True, then ``(data, target)`` will be pandas DataFrames or Series as describe above.
es_es: Si es True, los datos son un DataFrame de pandas que incluye columnas con los dtypes apropiados (numérico, cadena o categórico). El objetivo es un DataFrame de pandas o Series dependiendo del número del target_columns. El Bunch contendrá un atributo ``frame`` con el objetivo y los datos. Si ``return_X_y`` es True, entonces ``(data, target)`` serán DataFrames o Series de pandas como se ha descrito anteriormente.

source: If as_frame is 'auto', the data and target will be converted to DataFrame or Series as if as_frame is set to True, unless the dataset is stored in sparse format.
es_es: Si as_frame es ``auto``, los datos y el objetivo se convertirán en DataFrame o Series como si as_frame fuera True, a menos que el conjunto de datos se almacene en formato disperso.

source: The default value of `as_frame` changed from `False` to `'auto'` in 0.24.
es_es: El valor por defecto de `as_frame` cambió de `False` a `'auto'` en 0.24.

source: Returns
es_es: Devuelve

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo diccionario, con los siguientes atributos.

source: data
es_es: datos

source: np.array, scipy.sparse.csr_matrix of floats, or pandas DataFrame
es_es: np.array, scipy.sparse.csr_matrix de floats, o pandas DataFrame

source: The feature matrix. Categorical features are encoded as ordinals.
es_es: La matriz de características. Las características categóricas se codifican como ordinales.

source: target
es_es: objetivo

source: np.array, pandas Series or DataFrame
es_es: np.array, Series o DataFrame de pandas

source: The regression target or classification labels, if applicable. Dtype is float if numeric, and object if categorical. If ``as_frame`` is True, ``target`` is a pandas object.
es_es: El objetivo de la regresión o las etiquetas de clasificación, si es aplicable. Dtype es float si es numérico, y objeto si es categórico. Si ``as_frame`` es True, ``target`` es un objeto pandas.

source: The full description of the dataset
es_es: La descripción completa del conjunto de datos

source: list
es_es: lista

source: The names of the dataset columns
es_es: Los nombres de las columnas del conjunto de datos

source: The names of the target columns
es_es: Los nombres de las columnas de destino

source: categories
es_es: categorías

source: dict or None
es_es: diccionario o Ninguno

source: Maps each categorical feature name to a list of values, such that the value encoded as i is ith in the list. If ``as_frame`` is True, this is None.
es_es: Asigna cada nombre de característica categórica a una lista de valores, de manera que el valor codificado como i es el ith en la lista. Si ``as_frame`` es True, es None.

source: details
es_es: detalles

source: dict
es_es: diccionario

source: More metadata from OpenML
es_es: Más metadatos de OpenML

source: Only present when `as_frame=True`. DataFrame with ``data`` and ``target``.
es_es: Sólo presente cuando `as_frame=True`. DataFrame con ``data`` and ``target``.

source: **(data, target)** : tuple if ``return_X_y`` is True
es_es: **(data, target)** : tuple if ``return_X_y`` es True

source: tuple if
es_es: tupla si

source: This interface is **experimental** and subsequent releases may change attributes without notice (although there should only be minor changes to ``data`` and ``target``).
es_es: Esta interfaz es **experimental** y las versiones posteriores pueden cambiar los atributos sin previo aviso (aunque sólo debería haber cambios menores en ``data`` y ``target``).

source: Missing values in the 'data' are represented as NaN's. Missing values in 'target' are represented as NaN's (numerical target) or None (categorical target)
es_es: Los valores perdidos en ``data`` se representan como NaN's. Los valores que faltan en ``target'' se representan como NaN's (objetivo numérico) o None (objetivo categórico)

source: Examples using ``sklearn.datasets.fetch_openml``
es_es: Ejemplos con ``sklearn.datasets.fetch_openml``
