Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.discriminant_analysis.QuadraticDiscriminantAnalysis.po
Languages: es_es

source: Quadratic Discriminant Analysis
es_es: Análisis Discriminante Cuadrático

source: A classifier with a quadratic decision boundary, generated by fitting class conditional densities to the data and using Bayes' rule.
es_es: Un clasificador con un límite de decisión cuadrático, generado ajustando las densidades condicionales de las clases a los datos y utilizando la regla de Bayes.

source: The model fits a Gaussian density to each class.
es_es: El modelo se ajusta una densidad Gaussiana a cada clase.

source: Read more in the :ref:`User Guide <lda_qda>`.
es_es: Más información en el :ref:`Manual de usuario <lda_qda>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_classes,), default=None
es_es: ndarray de forma (n_classes,), default=None

source: Class priors. By default, the class proportions are inferred from the training data.
es_es: A prioris de clase. Por defecto, las proporciones de clase se infieren a partir de los datos de entrenamiento.

source: Regularizes the per-class covariance estimates by transforming S2 as ``S2 = (1 - reg_param) * S2 + reg_param * np.eye(n_features)``, where S2 corresponds to the `scaling_` attribute of a given class.
es_es: Regulariza las estimaciones de covarianza por clase transformando S2 como ``S2 = (1 - reg_param) * S2 + reg_param * np.eye(n_features)``, donde S2 corresponde al atributo `scaling_` de una clase determinada.

source: If True, the class covariance matrices are explicitely computed and stored in the `self.covariance_` attribute.
es_es: Si es True, las matrices de covarianza de la clase se calculan explícitamente y se almacenan en el atributo `self.covariance_`.

source: Absolute threshold for a singular value to be considered significant, used to estimate the rank of `Xk` where `Xk` is the centered matrix of samples in class k. This parameter does not affect the predictions. It only controls a warning that is raised when features are considered to be colinear.
es_es: Umbral absoluto para que un valor singular se considere significativo, utilizado para estimar el rango de `Xk` donde `Xk` es la matriz centrada de muestras en la clase k. Este parámetro no afecta a las predicciones. Sólo controla una advertencia que se produce cuando las características se consideran colineales.

source: Attributes
es_es: Atributos

source: list of len n_classes of ndarray of shape (n_features, n_features)
es_es: lista de len n_classes o ndarray de forma (n_features, n_features)

source: For each class, gives the covariance matrix estimated using the samples of that class. The estimations are unbiased. Only present if `store_covariance` is True.
es_es: Para cada clase, da la matriz de covarianza estimada utilizando las muestras de esa clase. Las estimaciones son insesgadas. Sólo está presente si `store_covariance` es True.

source: array-like of shape (n_classes, n_features)
es_es: array-like de forma (n_classes, n_features)

source: Class-wise means.
es_es: Medios de la clase.

source: array-like of shape (n_classes,)
es_es: array-like de forma (n_classes,)

source: Class priors (sum to 1).
es_es: A prioris de clase (suma 1).

source: list of len n_classes of ndarray of shape (n_features, n_k)
es_es: lista de len n_classes o ndarray de forma (n_features, n_k)

source: For each class k an array of shape (n_features, n_k), where ``n_k = min(n_features, number of elements in class k)`` It is the rotation of the Gaussian distribution, i.e. its principal axis. It corresponds to `V`, the matrix of eigenvectors coming from the SVD of `Xk = U S Vt` where `Xk` is the centered matrix of samples from class k.
es_es: Para cada clase k, un arreglo de forma (n_features, n_k), donde ``n_k = min(n_features, número de elementos en la clase k)`` Es la rotación de la distribución Gaussiana, es decir, su eje principal. Corresponde a `V`, la matriz de autovectores procedente de la SVD de `Xk = U S Vt` donde `Xk` es la matriz centrada de las muestras de la clase k.

source: list of len n_classes of ndarray of shape (n_k,)
es_es: lista de len n_classes o ndarray de forma (n_k,)

source: For each class, contains the scaling of the Gaussian distributions along its principal axes, i.e. the variance in the rotated coordinate system. It corresponds to `S^2 / (n_samples - 1)`, where `S` is the diagonal matrix of singular values from the SVD of `Xk`, where `Xk` is the centered matrix of samples from class k.
es_es: Para cada clase, contiene la escala de las distribuciones Gaussianas a lo largo de sus ejes principales, es decir, la varianza en el sistema de coordenadas rotado. Corresponde a `S^2 / (n_samples - 1)`, donde `S` es la matriz diagonal de valores singulares de la SVD de `Xk`, donde `Xk` es la matriz centrada de muestras de la clase k.

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Unique class labels.
es_es: Etiquetas de clase únicas.

source: Linear Discriminant Analysis.
es_es: Análisis Discriminante Lineal.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Apply decision function to an array of samples.
es_es: Aplica la función de decisión a un arreglo de muestras.

source: Fit the model according to the given training data and parameters.
es_es: Ajusta el modelo según los datos de entrenamiento y los parámetros dados.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Perform classification on an array of test vectors X.
es_es: Realiza la clasificación en un arreglo de vectores de prueba X.

source: Return log of posterior probabilities of classification.
es_es: Devuelve el logaritmo de las probabilidades posteriores de la clasificación.

source: Return posterior probabilities of classification.
es_es: Devuelve las probabilidades posteriores de clasificación.

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos de prueba y las etiquetas dados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: The decision function is equal (up to a constant factor) to the log-posterior of the model, i.e. `log p(y = k | x)`. In a binary classification setting this instead corresponds to the difference `log p(y = 1 | x) - log p(y = 0 | x)`. See :ref:`lda_qda_math`.
es_es: La función de decisión es igual (hasta un factor constante) al log-posterior del modelo, es decir, `log p(y = k | x)`. En un entorno de clasificación binaria, esto corresponde a la diferencia `log p(y = 1 | x) - log p(y = 0 | x)`. Ver :ref:`lda_qda_math`.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Array of samples (test vectors).
es_es: Arreglo de muestras (vectores de prueba).

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples,) or (n_samples, n_classes)
es_es: ndarray de forma (n_samples,) o (n_samples, n_classes)

source: Decision function values related to each class, per sample. In the two-class case, the shape is (n_samples,), giving the log likelihood ratio of the positive class.
es_es: Valores de la función de decisión relacionados con cada clase, por muestra. En el caso de dos clases, la forma (shape) es (n_samples,), lo que da la razón de verosimilitud logarítmica de la clase positiva.

source: ``store_covariances`` has been moved to main constructor as ``store_covariance``
es_es: ``store_covariances`` se ha movido al constructor principal (main) como ``store_covariance``

source: ``tol`` has been moved to main constructor.
es_es: ``tol* se ha movido al constructor principal.

source: Training vector, where n_samples is the number of samples and n_features is the number of features.
es_es: Vector de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Target values (integers)
es_es: Valores objetivo (enteros)

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The predicted class C for each sample in X is returned.
es_es: Se devuelve la clase C predicha para cada muestra en X.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: Array of samples/test vectors.
es_es: Arreglo de vectores de muestras/prueba.

source: ndarray of shape (n_samples, n_classes)
es_es: ndarray de forma (n_samples, n_classes)

source: Posterior log-probabilities of classification per class.
es_es: Probabilidades logarítmicas posteriores de clasificación por clase.

source: Posterior probabilities of classification per class.
es_es: Probabilidades posteriores de clasificación por clase.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En la clasificación multietiqueta, se trata de la precisión del subconjunto, que es una métrica rigurosa, ya que se requiere para cada muestra que cada conjunto de etiquetas sea predicho correctamente.

source: Test samples.
es_es: Muestras de prueba.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas True para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con respecto a `y`.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.
