Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.PrecisionRecallDisplay.po
Languages: es_es

source: Precision Recall visualization.
es_es: Visualización de precisión y exhaustividad.

source: It is recommend to use :func:`~sklearn.metrics.plot_precision_recall_curve` to create a visualizer. All parameters are stored as attributes.
es_es: Se recomienda utilizar :func:`~sklearn.metrics.plot_precision_recall_curve` para crear un visualizador. Todos los parámetros se almacenan como atributos.

source: Read more in the :ref:`User Guide <visualizations>`.
es_es: Más información en el :ref:`Manual de usuario <visualizations>`.

source: Parameters
es_es: Parámetros

source: Precision values.
es_es: Valores de precisión.

source: Recall values.
es_es: Valores de exhaustividad.

source: float, default=None
es_es: flotante, default=None

source: Average precision. If None, the average precision is not shown.
es_es: Precisión promedio. Si es None, la precisión media no se muestra.

source: str, default=None
es_es: cadena de caracteres, default=None

source: Name of estimator. If None, then the estimator name is not shown.
es_es: Nombre del estimador. Si es None, entonces el nombre del estimador no se muestra.

source: str or int, default=None
es_es: cadena de caracteres o entero, default=None

source: The class considered as the positive class. If None, the class will not be shown in the legend.
es_es: La clase considerada como la clase positiva. Si es None, la clase no se mostrará en la leyenda.

source: Attributes
es_es: Atributos

source: matplotlib Artist
es_es: Artista matplotlib

source: Precision recall curve.
es_es: Curva de precisión y exhaustividad.

source: matplotlib Axes
es_es: Ejes de matplotlib

source: Axes with precision recall curve.
es_es: Ejes con curva de precisión y exhaustividad.

source: matplotlib Figure
es_es: Figura de matplotlib

source: Figure containing the curve.
es_es: Figura que contiene la curva.

source: Compute precision-recall pairs for different probability thresholds.
es_es: Calcula los pares de precisión-exhaustividad para diferentes umbrales de probabilidad.

source: Plot Precision Recall Curve for binary classifiers.
es_es: Representa la curva de precisión y exhaustividad de los clasificadores binarios.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Plot visualization.
es_es: Graficar visualización.

source: Extra keyword arguments will be passed to matplotlib's `plot`.
es_es: Los argumentos de palabras clave adicionales se pasarán al `plot` de matplotlib.

source: Matplotlib Axes, default=None
es_es: Ejes matplotlib, default = None

source: Axes object to plot on. If `None`, a new figure and axes is created.
es_es: Objeto de ejes en los que graficar. Si es `None`, se crea una nueva figura y ejes.

source: Name of precision recall curve for labeling. If `None`, use the name of the estimator.
es_es: Nombre de la curva de precisión y exhaustividad para etiquetar. Si es `None`, utiliza el nombre del estimador.

source: dict
es_es: diccionario

source: Keyword arguments to be passed to matplotlib's `plot`.
es_es: Argumentos de palabra clave que se pasarán al `plot` de matplotlib.

source: Returns
es_es: Devuelve

source: Object that stores computed values.
es_es: Objeto que almacena valores calculados.

source: Examples using ``sklearn.metrics.PrecisionRecallDisplay``
es_es: Ejemplos usando ``sklearn.metrics.PrecisionRecallDisplay``
