Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.cross_validate.po
Languages: es_es

source: Evaluate metric(s) by cross-validation and also record fit/score times.
es_es: Evalúa la(s) métrica(s) mediante validación cruzada y registra también los tiempos de ajuste/puntuación.

source: Read more in the :ref:`User Guide <multimetric_cross_validation>`.
es_es: Más información en el :ref:`Manual de usuario <multimetric_cross_validation>`.

source: Parameters
es_es: Parámetros

source: estimator object implementing 'fit'
es_es: objeto estimador implementando 'fit'

source: The object to use to fit the data.
es_es: El objeto a utilizar para ajustar los datos.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: The data to fit. Can be for example a list, or an array.
es_es: Los datos a ajustar. Puede ser, por ejemplo, una lista(list) o un arreglo(array).

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: The target variable to try to predict in the case of supervised learning.
es_es: La variable objetivo que se intenta predecir en el caso del aprendizaje supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia :term:`cv` de "Grupo(Group)" (por ejemplo, :class:`GroupKFold`).

source: str, callable, list, tuple, or dict, default=None
es_es: cadena, invocable, lista, tupla, o diccionario, default=None

source: Strategy to evaluate the performance of the cross-validated model on the test set.
es_es: Estrategia para evaluar el rendimiento del modelo con validación cruzada en el conjunto de prueba.

source: If `scoring` represents a single score, one can use:
es_es: Si `scoring` representa una única puntuación, se puede utilizar:

source: a single string (see :ref:`scoring_parameter`);
es_es: una sola cadena (véase :ref:`scoring_parameter`);

source: a callable (see :ref:`scoring`) that returns a single value.
es_es: un callable (ver :ref:`scoring`) que devuelve un único valor.

source: If `scoring` reprents multiple scores, one can use:
es_es: Si `scoring` representa múltiples puntuaciones, se puede utilizar:

source: a list or tuple of unique strings;
es_es: una lista o tupla de cadenas únicas;

source: a callable returning a dictionary where the keys are the metric names and the values are the metric scores;
es_es: una llamada que devuelve un diccionario donde las claves son los nombres de las métricas y los valores son las puntuaciones de las métricas;

source: a dictionary with metric names as keys and callables a values.
es_es: un diccionario con los nombres de las métricas como claves e invocables como valores.

source: See :ref:`multimetric_grid_search` for an example.
es_es: Véase :ref:`multimetric_grid_search` para un ejemplo.

source: int, cross-validation generator or an iterable, default=None
es_es: entero, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de separación de la validación cruzada. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para utilizar la validación cruzada de 5-pliegues por defecto,

source: int, to specify the number of folds in a `(Stratified)KFold`,
es_es: int, para especificar el número de pliegues(folds) en un `(Stratified)KFold`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce separaciones (train, test) como arreglos de índices.

source: For int/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas int/None, si el estimador es un clasificador y ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv`` si es None cambió de 3 a 5 pliegues.

source: int, default=None
es_es: entero, default=None

source: Number of jobs to run in parallel. Training the estimator and computing the score are parallelized over the cross-validation splits. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. El entrenamiento del estimador y el cálculo de la puntuación se paralelizan sobre las separaciones de validación cruzada. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Véase :term:`Glosario <n_jobs>` para más detalles.

source: int, default=0
es_es: entero, default=0

source: The verbosity level.
es_es: El nivel de verbosidad.

source: Parameters to pass to the fit method of the estimator.
es_es: Los parámetros a pasar al método fit del estimador.

source: int or str, default='2*n_jobs'
es_es: entero o cadena, default='2*n_jobs'

source: Controls the number of jobs that get dispatched during parallel execution. Reducing this number can be useful to avoid an explosion of memory consumption when more jobs get dispatched than CPUs can process. This parameter can be:
es_es: Controla el número de trabajos que se envían durante la ejecución en paralelo. Reducir este número puede ser útil para evitar una explosión de consumo de memoria cuando se envían más trabajos de los que las CPUs pueden procesar. Este parámetro puede ser:

source: None, in which case all the jobs are immediately created and spawned. Use this for lightweight and fast-running jobs, to avoid delays due to on-demand spawning of the jobs
es_es: None, en cuyo caso todos los trabajos se crean y generan inmediatamente. Utilícelo para trabajos ligeros y de ejecución rápida, para evitar retrasos debidos a la generación de trabajos bajo demanda

source: An int, giving the exact number of total jobs that are spawned
es_es: Un int, que da el número exacto de trabajos totales que se generan

source: A str, giving an expression as a function of n_jobs, as in '2*n_jobs'
es_es: Una str, que da una expresión como función de n_jobs, como en '2*n_jobs'

source: bool, default=False
es_es: booleano, default=False

source: Whether to include train scores. Computing training scores is used to get insights on how different parameter settings impact the overfitting/underfitting trade-off. However computing the scores on the training set can be computationally expensive and is not strictly required to select the parameters that yield the best generalization performance.
es_es: Si incluir o no las puntuaciones de entrenamiento. El cálculo de las puntuaciones de entrenamiento se utiliza para obtener información sobre el impacto de las diferentes configuraciones de los parámetros en el equilibrio entre sobreajuste/subajuste. Sin embargo, calcular las puntuaciones en el conjunto de entrenamiento puede ser costoso desde el punto de vista informático y no es estrictamente necesario para seleccionar los parámetros que producen el mejor rendimiento de generalización.

source: Default value was changed from ``True`` to ``False``
es_es: El valor predeterminado se ha cambiado de ``True`` a ``False``

source: Whether to return the estimators fitted on each split.
es_es: Si se devuelven los estimadores ajustados en cada división.

source: 'raise' or numeric, default=np.nan
es_es: 'raise' o numérico, default=np.nan

source: Value to assign to the score if an error occurs in estimator fitting. If set to 'raise', the error is raised. If a numeric value is given, FitFailedWarning is raised.
es_es: Valor a asignar a la puntuación si se produce un error en el ajuste del estimador. Si se establece como 'raise', el error se lanza. Si se da un valor numérico, se plantea FitFailedWarning.

source: Returns
es_es: Devuelve

source: dict of float arrays of shape (n_splits,)
es_es: dict de float, arrays de forma (n_splits,)

source: Array of scores of the estimator for each run of the cross validation.
es_es: Arreglo de puntuaciones del estimador para cada ejecución de la validación cruzada.

source: A dict of arrays containing the score/time arrays for each scorer is returned. The possible keys for this ``dict`` are:
es_es: Se devuelve un diccionario (dict) de arreglos que contiene los arreglos de puntuación/tiempo de cada puntuador. Las posibles claves de este ``dict`` son:

source: The score array for test scores on each cv split. Suffix ``_score`` in ``test_score`` changes to a specific metric like ``test_r2`` or ``test_auc`` if there are multiple scoring metrics in the scoring parameter.
es_es: El arreglo de puntuación para las puntuaciones de las pruebas en cada división del cv. El sufijo ``_score`` en ``test_score`` cambia a una métrica específica como ``test_r2`` o ``test_auc`` si hay múltiples métricas de puntuación en el parámetro scoring.

source: The score array for train scores on each cv split. Suffix ``_score`` in ``train_score`` changes to a specific metric like ``train_r2`` or ``train_auc`` if there are multiple scoring metrics in the scoring parameter. This is available only if ``return_train_score`` parameter is ``True``.
es_es: El arreglo de puntuación para las puntuaciones de entrenamiento en cada división del cv. El sufijo ``_score`` en ``train_score`` cambia a una métrica específica como ``train_r2`` o ``train_auc`` si hay múltiples métricas de puntuación en el parámetro scoring. Esto sólo está disponible si el parámetro ``return_train_score`` es ``True``.

source: The time for fitting the estimator on the train set for each cv split.
es_es: El tiempo de ajuste del estimador en el conjunto de entrenamiento para cada división del cv.

source: The time for scoring the estimator on the test set for each cv split. (Note time for scoring on the train set is not included even if ``return_train_score`` is set to ``True``
es_es: El tiempo de puntuación del estimador en el conjunto de prueba para cada división del cv. (Nota que el tiempo de puntuación en el conjunto de entrenamiento no se incluye incluso si ``return_train_score`` se establece como ``True``

source: The estimator objects for each cv split. This is available only if ``return_estimator`` parameter is set to ``True``.
es_es: Los objetos estimator(estimador) para cada división del cv. Sólo está disponible si el parámetro ``return_estimator`` se establece como ``True``.

source: Run cross-validation for single metric evaluation.
es_es: Ejecuta la validación cruzada para la evaluación de una sola métrica.

source: Get predictions from each split of cross-validation for diagnostic purposes.
es_es: Obtiene las predicciones de cada división de la validación cruzada con fines de diagnóstico.

source: Make a scorer from a performance metric or loss function.
es_es: Hacer un puntuador a partir de una métrica de rendimiento o una función de pérdida.

source: Examples
es_es: Ejemplos

source: Single metric evaluation using ``cross_validate``
es_es: Evaluación de una métrica mediante ``cross_validate``

source: Multiple metric evaluation using ``cross_validate`` (please refer the ``scoring`` parameter doc for more information)
es_es: Evaluación de múltiples métricas mediante ``cross_validate`` (para más información, consulta la documentación del parámetro ``scoring``)

source: Examples using ``sklearn.model_selection.cross_validate``
es_es: Ejemplos utilizando ``sklearn.model_selection.cross_validate``
