Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.roc_curve.po
Languages: es_es

source: Compute Receiver operating characteristic (ROC).
es_es: Calcula la Característica Operativa del Receptor (ROC).

source: Note: this implementation is restricted to the binary classification task.
es_es: Nota: esta implementación está restringida a la tarea de clasificación binaria.

source: Read more in the :ref:`User Guide <roc_metrics>`.
es_es: Lee más en el :ref:`Manual de Usuario <roc_metrics>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: True binary labels. If labels are not either {-1, 1} or {0, 1}, then pos_label should be explicitly given.
es_es: Etiquetas binarias verdaderas. Si las etiquetas no son {-1, 1} o {0, 1}, debe indicarse explícitamente pos_label.

source: Target scores, can either be probability estimates of the positive class, confidence values, or non-thresholded measure of decisions (as returned by "decision_function" on some classifiers).
es_es: Las puntuaciones objetivo, pueden ser estimaciones de probabilidad de la clase positiva, valores de confianza o medidas de decisiones sin umbral (según lo devuelto por "decision_function" en algunos clasificadores).

source: int or str, default=None
es_es: entero o cadena de caracteres, default=None

source: The label of the positive class. When ``pos_label=None``, if `y_true` is in {-1, 1} or {0, 1}, ``pos_label`` is set to 1, otherwise an error will be raised.
es_es: La etiqueta de la clase positiva. Cuando ``pos_label=None``, si `y_true` está en {-1, 1} o {0, 1}, ``pos_label`` se establece en 1, de lo contrario se producirá un error.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: Whether to drop some suboptimal thresholds which would not appear on a plotted ROC curve. This is useful in order to create lighter ROC curves.
es_es: Si se eliminan algunos umbrales subóptimos que no aparecerían en una curva ROC trazada. Esto es útil para crear curvas ROC más claras.

source: parameter *drop_intermediate*.
es_es: parámetro *drop_intermediate*.

source: Returns
es_es: Devuelve

source: ndarray of shape (>2,)
es_es: ndarray de forma (>2,)

source: Increasing false positive rates such that element i is the false positive rate of predictions with score >= `thresholds[i]`.
es_es: Incrementa las tasas de falsos positivos tal que el elemento i sea la tasa de falsos positivos de las predicciones con puntuación >= `thresholds[i]`.

source: Increasing true positive rates such that element `i` is the true positive rate of predictions with score >= `thresholds[i]`.
es_es: Incrementa las tasas de verdaderos positivos tal que el elemento `i` sea la tasa de verdaderos positivos de las predicciones con puntuación >= `thresholds[i]`.

source: ndarray of shape = (n_thresholds,)
es_es: ndarray de forma = (n_thresholds,)

source: Decreasing thresholds on the decision function used to compute fpr and tpr. `thresholds[0]` represents no instances being predicted and is arbitrarily set to `max(y_score) + 1`.
es_es: Umbrales decrecientes en la función de decisión utilizada para calcular fpr y tpr. `thresholds[0]` representa que no se predice ninguna instancia y se fija arbitrariamente en `max(y_score) + 1`.

source: Plot Receiver operating characteristic (ROC) curve.
es_es: Traza la curva Característica Operativa del Receptor (ROC).

source: ROC Curve visualization.
es_es: Visualización de Curvas ROC.

source: Compute error rates for different probability thresholds.
es_es: Calcula las tasas de error para diferentes umbrales de probabilidad.

source: Compute the area under the ROC curve.
es_es: Calcula el área bajo la curva ROC.

source: Notes
es_es: Notas

source: Since the thresholds are sorted from low to high values, they are reversed upon returning them to ensure they correspond to both ``fpr`` and ``tpr``, which are sorted in reversed order during their calculation.
es_es: Dado que los umbrales están ordenados de menor a mayor valor, se invierten al devolverlos para asegurar que corresponden tanto a ``fpr`` como a ``tpr``, que se ordenan en orden inverso durante su cálculo.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.metrics.roc_curve``
es_es: Ejemplos utilizando ``sklearn.metrics.roc_curve``
