Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.pairwise.additive_chi2_kernel.po
Languages: es_es

source: Computes the additive chi-squared kernel between observations in X and Y.
es_es: Calcula el núcleo chi-cuadrado aditivo entre las observaciones en X y Y.

source: The chi-squared kernel is computed between each pair of rows in X and Y. X and Y have to be non-negative. This kernel is most commonly applied to histograms.
es_es: El núcleo chi-cuadrado se calcula entre cada par de filas en X y Y. X y Y tienen que ser no negativos. Este núcleo se aplica más comúnmente a los histogramas.

source: The chi-squared kernel is given by::
es_es: El núcleo chi-cuadrado viene dado por::

source: It can be interpreted as a weighted difference per entry.
es_es: Puede interpretarse como una diferencia ponderada por entrada.

source: Read more in the :ref:`User Guide <chi2_kernel>`.
es_es: Leer más en el :ref:`Manual de Usuario <chi2_kernel>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples_X, n_features)
es_es: array-like de forma (n_samples_X, n_features)

source: ndarray of shape (n_samples_Y, n_features), default=None
es_es: ndarray de forma (n_samples_Y, n_features), default=None

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples_X, n_samples_Y)
es_es: ndarray de forma (n_samples_X, n_samples_Y)

source: The exponentiated version of the kernel, which is usually preferable.
es_es: La versión exponenciada del núcleo, la cual es generalmente preferible.

source: A Fourier approximation to this kernel.
es_es: Una aproximación de Fourier a este núcleo.

source: Notes
es_es: Notas

source: As the negative of a distance, this kernel is only conditionally positive definite.
es_es: Como el negativo de una distancia, este núcleo es sólo condicionalmente definido positivo.

source: References
es_es: Referencias

source: Zhang, J. and Marszalek, M. and Lazebnik, S. and Schmid, C. Local features and kernels for classification of texture and object categories: A comprehensive study International Journal of Computer Vision 2007 https://research.microsoft.com/en-us/um/people/manik/projects/trade-off/papers/ZhangIJCV06.pdf
es_es: Zhang, J. y Marszalek, M. y Lazebnik, S. y Schmid, C. Local features and kernels for classification of texture and object categories: A comprehensive study International Journal of Computer Vision 2007 https://research.microsoft.com/en-us/um/people/manik/projects/trade-off/papers/ZhangIJCV06.pdf
