Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.multiclass.type_of_target.po
Languages: es_es

source: Determine the type of data indicated by the target.
es_es: Determina el tipo de datos que indica el objetivo.

source: Note that this type is the most specific type that can be inferred. For example:
es_es: Ten en cuenta que este tipo es el tipo (type) más específico que se puede inferir. Por ejemplo:

source: ``binary`` is more specific but compatible with ``multiclass``.
es_es: ``binary`` es más específico pero compatible con ``multiclass``.

source: ``multiclass`` of integers is more specific but compatible with ``continuous``.
es_es: ``multiclass`` de enteros es más específica pero compatible con ``continuous``.

source: ``multilabel-indicator`` is more specific but compatible with ``multiclass-multioutput``.
es_es: ``multilabel-indicator`` es más específico pero compatible con ``multiclass-multioutput``.

source: Parameters
es_es: Parámetros

source: Returns
es_es: Devuelve

source: One of:
es_es: Uno de:

source: 'continuous': `y` is an array-like of floats that are not all integers, and is 1d or a column vector.
es_es: 'continuous': `y` es una array-like de números de punto flotante (float) que no son todos enteros, y es 1d o un vector columna.

source: 'continuous-multioutput': `y` is a 2d array of floats that are not all integers, and both dimensions are of size > 1.
es_es: 'continuous-multioutput': `y` es un arreglo 2d de números de punto flotante (float) que no son todos enteros y ambas dimensiones son de tamaño > 1.

source: 'binary': `y` contains <= 2 discrete values and is 1d or a column vector.
es_es: 'binary': `y` contiene <= 2 valores discretos y es 1d o un vector columna.

source: 'multiclass': `y` contains more than two discrete values, is not a sequence of sequences, and is 1d or a column vector.
es_es: 'multiclass': `y` contiene más de dos valores discretos, no es una secuencia de secuencias, y es 1d o un vector columna.

source: 'multiclass-multioutput': `y` is a 2d array that contains more than two discrete values, is not a sequence of sequences, and both dimensions are of size > 1.
es_es: 'multiclass-multioutput': `y` es un arreglo 2d que contiene más de dos valores discretos, no es una secuencia de secuencias y ambas dimensiones son de tamaño > 1.

source: 'multilabel-indicator': `y` is a label indicator matrix, an array of two dimensions with at least two columns, and at most 2 unique values.
es_es: 'multilabel-indicator': `y` es una matriz indicatriz de etiquetas, un arreglo de dos dimensiones con al menos dos columnas y a lo sumo 2 valores únicos.

source: 'unknown': `y` is array-like but none of the above, such as a 3d array, sequence of sequences, or an array of non-sequence objects.
es_es: 'unknown': `y` es un array-like pero ninguno de los anteriores, como un arreglo 3d, una secuencia de secuencias o un arreglo de objetos no secuenciales.

source: Examples
es_es: Ejemplos
