Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.StandardScaler.po
Languages: es_es

source: Standardize features by removing the mean and scaling to unit variance
es_es: Se estandarizan las características eliminando la media y escalando a la varianza unitaria

source: The standard score of a sample `x` is calculated as:
es_es: La puntuación estándar de una muestra `x` se calcula como:

source: where `u` is the mean of the training samples or zero if `with_mean=False`, and `s` is the standard deviation of the training samples or one if `with_std=False`.
es_es: donde `u` es la media de las muestras de entrenamiento o cero si `with_mean=False`, y `s` es la desviación estándar de las muestras de entrenamiento o uno si `with_std=False`.

source: Centering and scaling happen independently on each feature by computing the relevant statistics on the samples in the training set. Mean and standard deviation are then stored to be used on later data using :meth:`transform`.
es_es: El centrado y el escalado se realizan de forma independiente en cada característica, calculando los estadísticos pertinentes en las muestras del conjunto de entrenamiento. La media y la desviación estándar se almacenan para ser utilizadas en datos posteriores utilizando :meth:`transform`.

source: Standardization of a dataset is a common requirement for many machine learning estimators: they might behave badly if the individual features do not more or less look like standard normally distributed data (e.g. Gaussian with 0 mean and unit variance).
es_es: La Estandarización de un conjunto de datos es un requisito común para muchos estimadores de aprendizaje automático: podrían comportarse mal si las características individuales no se parecen más o menos a los datos distribuidos normalmente estándar (por ejemplo, gaussianos con media 0 y varianza unitaria).

source: For instance many elements used in the objective function of a learning algorithm (such as the RBF kernel of Support Vector Machines or the L1 and L2 regularizers of linear models) assume that all features are centered around 0 and have variance in the same order. If a feature has a variance that is orders of magnitude larger that others, it might dominate the objective function and make the estimator unable to learn from other features correctly as expected.
es_es: Por ejemplo, muchos elementos utilizados en la función objetivo de un algoritmo de aprendizaje (como el núcleo RBF de Máquinas de Vectores de Soporte o los regularizadores L1 y L2 de modelos lineales) asumen que todas las características están centradas en torno a cero y tienen varianza del mismo orden. Si una característica tiene varianza de un orden de magnitud mayor que otras, podría dominar la función objetivo y hacer que el estimador no pueda aprender de otras características correctamente como se espera.

source: This scaler can also be applied to sparse CSR or CSC matrices by passing `with_mean=False` to avoid breaking the sparsity structure of the data.
es_es: Este escalador también puede aplicarse a matrices CSR o CSC dispersas pasando `with_mean=False` para evitar romper la estructura de dispersión de los datos.

source: Read more in the :ref:`User Guide <preprocessing_scaler>`.
es_es: Más información en el :ref:`Manual de usuario <preprocessing_scaler>`.

source: Parameters
es_es: Parámetros

source: If False, try to avoid a copy and do inplace scaling instead. This is not guaranteed to always work inplace; e.g. if the data is not a NumPy array or scipy.sparse CSR matrix, a copy may still be returned.
es_es: Si es False, intente evitar una copia y, en su lugar, realice un escalado in situ. No se garantiza que esto funcione siempre en el lugar; por ejemplo, si los datos no son una matriz NumPy o una matriz CSR scipy.sparse, es posible que se devuelva una copia.

source: If True, center the data before scaling. This does not work (and will raise an exception) when attempted on sparse matrices, because centering them entails building a dense matrix which in common use cases is likely to be too large to fit in memory.
es_es: Si es True, centra los datos antes de escalarlos. Esto no funciona (y lanzará una excepción) cuando se intenta con matrices dispersas, porque centrarlas implica construir una matriz densa que, en casos de uso común, es probable que sea demasiado grande para caber en la memoria.

source: If True, scale the data to unit variance (or equivalently, unit standard deviation).
es_es: Si es True, escala los datos a la varianza unitaria (o, de manera equivalente, a la desviación estándar unitaria).

source: Attributes
es_es: Atributos

source: ndarray of shape (n_features,) or None
es_es: ndarray de forma (n_features,) o None

source: Per feature relative scaling of the data to achieve zero mean and unit variance. Generally this is calculated using `np.sqrt(var_)`. If a variance is zero, we can't achieve unit variance, and the data is left as-is, giving a scaling factor of 1. `scale_` is equal to `None` when `with_std=False`.
es_es: Por característica de escala relativa de los datos para lograr una media cero y una varianza unitaria. Generalmente esto se calcula usando `np.sqrt(var_)`. Si una varianza es cero, no podemos lograr una varianza unitaria, y los datos se dejan como están, dando un factor de escala de 1. `scale_` es igual a `None` cuando `with_std=False`.

source: The mean value for each feature in the training set. Equal to ``None`` when ``with_mean=False``.
es_es: El valor medio de cada característica en el conjunto de entrenamiento. Es igual a ``None`` cuando ``with_mean=False``.

source: The variance for each feature in the training set. Used to compute `scale_`. Equal to ``None`` when ``with_std=False``.
es_es: La varianza de cada característica en el conjunto de entrenamiento. Se utiliza para calcular `scale_`. Igual a ``None`` cuando ``with_std=False``.

source: int or ndarray of shape (n_features,)
es_es: int o ndarray de forma (n_features,)

source: The number of samples processed by the estimator for each feature. If there are no missing samples, the ``n_samples_seen`` will be an integer, otherwise it will be an array of dtype int. If `sample_weights` are used it will be a float (if no missing data) or an array of dtype float that sums the weights seen so far. Will be reset on new calls to fit, but increments across ``partial_fit`` calls.
es_es: El número de muestras procesadas por el estimador para cada característica. Si no hay muestras faltantes, el ``n_samples_seen`` será un entero, de lo contrario será un arreglo de tipo int. Si se utiliza ``sample_weights`` será un float (si no hay datos faltantes) o un arreglo de tipo float que sume las ponderaciones vistas hasta el momento. Se restablecerá en las nuevas llamadas a fit, pero se incrementa a través de las llamadas a ``partial_fit``.

source: Equivalent function without the estimator API.
es_es: Función equivalente sin la API estimator.

source: Further removes the linear correlation across features with 'whiten=True'.
es_es: Elimina además la correlación lineal entre características con 'whiten=True'.

source: Notes
es_es: Notas

source: NaNs are treated as missing values: disregarded in fit, and maintained in transform.
es_es: Los NaN se tratan como valores faltantes: no se tienen en cuenta en el ajuste y se mantienen en la transformación.

source: We use a biased estimator for the standard deviation, equivalent to `numpy.std(x, ddof=0)`. Note that the choice of `ddof` is unlikely to affect model performance.
es_es: Utilizamos un estimador sesgado para la desviación estándar, equivalente a `numpy.std(x, ddof=0)`. Ten en cuenta que la elección de `ddof` es poco probable que afecte al rendimiento del modelo.

source: For a comparison of the different scalers, transformers, and normalizers, see :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.
es_es: Para una comparación de los diferentes escaladores, transformadores y normalizadores, véase :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Compute the mean and std to be used for later scaling.
es_es: Calcula la media y la desviación estándar (std) que se utilizarán para el escalado posterior.

source: Fit to data, then transform it.
es_es: Ajusta los datos y luego los transforma.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Scale back the data to the original representation
es_es: Escala los datos a la representación original

source: Online computation of mean and std on X for later scaling.
es_es: Cálcula en línea la media y la std en X para su posterior escalamiento.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Perform standardization by centering and scaling
es_es: Realiza la estandarización mediante el centrado y el escalado

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: The data used to compute the mean and standard deviation used for later scaling along the features axis.
es_es: Los datos utilizados para calcular la media y la desviación estándar utilizadas para el posterior escalamiento a lo largo del eje de las características.

source: Ignored.
es_es: Ignorado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Individual weights for each sample.
es_es: Ponderaciones individuales para cada muestra.

source: parameter *sample_weight* support to StandardScaler.
es_es: el parámetro *sample_weight* tiene soporte para StandardScaler.

source: Returns
es_es: Devuelve

source: Fitted scaler.
es_es: Escalador ajustado.

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: arreglo ndarray de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The data used to scale along the features axis.
es_es: Los datos utilizados para escalar a lo largo del eje de las características.

source: Copy the input X or not.
es_es: Copia la entrada X o no.

source: {ndarray, sparse matrix} of shape (n_samples, n_features)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_features)

source: All of X is processed as a single batch. This is intended for cases when :meth:`fit` is not feasible due to very large number of `n_samples` or because X is read from a continuous stream.
es_es: Todo X se procesa como un único lote. Esto está pensado para casos en los que :meth:`fit` no es factible debido a un número muy grande de `n_samples` o porque X se lee de un flujo continuo.

source: The algorithm for incremental mean and std is given in Equation 1.5a,b in Chan, Tony F., Gene H. Golub, and Randall J. LeVeque. "Algorithms for computing the sample variance: Analysis and recommendations." The American Statistician 37.3 (1983): 242-247:
es_es: El algoritmo para la media y la std incrementales se da en la ecuación 1.5a,b en Chan, Tony F., Gene H. Golub, y Randall J. LeVeque. "Algorithms for computing the sample variance: Analysis and recommendations." The American Statistician 37.3 (1983): 242-247:

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: {array-like, sparse matrix of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Examples using ``sklearn.preprocessing.StandardScaler``
es_es: Ejemplos utilizando ``sklearn.preprocessing.StandardScaler``
