Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.robust_scale.po
Languages: es_es

source: Standardize a dataset along any axis
es_es: Estandariza un conjunto de datos a lo largo de cualquier eje

source: Center to the median and component wise scale according to the interquartile range.
es_es: Centra a la mediana y escala por componentes según el rango intercuartílico.

source: Read more in the :ref:`User Guide <preprocessing_scaler>`.
es_es: Más información en el :ref:`Manual de usuario <preprocessing_scaler>`.

source: Parameters
es_es: Parámetros

source: {array-like, sparse matrix} of shape (n_sample, n_features)
es_es: {array-like, sparse matrix} de forma (n_sample, n_features)

source: The data to center and scale.
es_es: Los datos para centrar y escalar.

source: axis used to compute the medians and IQR along. If 0, independently scale each feature, otherwise (if 1) scale each sample.
es_es: eje utilizado para calcular las medianas y el IQR (rango intercuartílico). Si es 0, escala independientemente cada característica, de lo contrario (si es 1) escala cada muestra.

source: If True, center the data before scaling.
es_es: Si es True, centra los datos antes del escalamiento.

source: If True, scale the data to unit variance (or equivalently, unit standard deviation).
es_es: Si es True, escala los datos a la varianza unitaria (o, de manera equivalente, a la desviación estándar unitaria).

source: default=(25.0, 75.0), == (1st quantile, 3rd quantile), == IQR Quantile range used to calculate ``scale_``.
es_es: default=(25.0, 75.0), == (1st quantile, 3rd quantile), == IQR Rango de cuantiles utilizado para calcular ``scale_``.

source: set to False to perform inplace row normalization and avoid a copy (if the input is already a numpy array or a scipy.sparse CSR matrix and if axis is 1).
es_es: establécelo en False para realizar la normalización de filas en el lugar y evitar una copia (si la entrada ya es un arreglo numpy o una matriz scipy.sparse CSR y si el eje es 1).

source: If True, scale data so that normally distributed features have a variance of 1. In general, if the difference between the x-values of ``q_max`` and ``q_min`` for a standard normal distribution is greater than 1, the dataset will be scaled down. If less than 1, the dataset will be scaled up.
es_es: Si es True, escala los datos para que las características distribuidas normalmente tengan una varianza de 1. En general, si la diferencia entre los valores x de ``q_max`` y ``q_min`` para una distribución normal estándar es mayor que 1, el conjunto de datos será escalado hacia abajo. Si es menor que 1, el conjunto de datos se escalará hacia arriba.

source: Returns
es_es: Devuelve

source: {ndarray, sparse matrix} of shape (n_samples, n_features)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_features)

source: The transformed data.
es_es: Los datos transformados.

source: Performs centering and scaling using the Transformer API (e.g. as part of a preprocessing :class:`~sklearn.pipeline.Pipeline`).
es_es: Realiza el centrado y el escalamiento utilizando la API Transformer (por ejemplo, como parte de un preprocesamiento :class:`~sklearn.pipeline.Pipeline`).

source: Notes
es_es: Notas

source: This implementation will refuse to center scipy.sparse matrices since it would make them non-sparse and would potentially crash the program with memory exhaustion problems.
es_es: Esta implementación se negará a centrar las matrices scipy.sparse, ya que las convertiría en no dispersas y potencialmente bloquearía el programa con problemas de agotamiento de memoria.

source: Instead the caller is expected to either set explicitly `with_centering=False` (in that case, only variance scaling will be performed on the features of the CSR matrix) or to call `X.toarray()` if he/she expects the materialized dense array to fit in memory.
es_es: En su lugar, se espera que el invocador(caller) establezca explícitamente `with_centering=False` (en ese caso, sólo se realizará el escalamiento de la varianza en las características de la matriz CSR) o llamar a `X.toarray()` si espera que el arreglo denso materializado quepa en la memoria.

source: To avoid memory copy the caller should pass a CSR matrix.
es_es: Para evitar la copia de memoria el invocador debe pasar una matriz CSR.

source: For a comparison of the different scalers, transformers, and normalizers, see :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.
es_es: Para una comparación de los diferentes escaladores, transformadores y normalizadores, consulta :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.

source: Risk of data leak
es_es: Riesgo de fuga de datos

source: Do not use :func:`~sklearn.preprocessing.robust_scale` unless you know what you are doing. A common mistake is to apply it to the entire data *before* splitting into training and test sets. This will bias the model evaluation because information would have leaked from the test set to the training set. In general, we recommend using :class:`~sklearn.preprocessing.RobustScaler` within a :ref:`Pipeline <pipeline>` in order to prevent most risks of data leaking: `pipe = make_pipeline(RobustScaler(), LogisticRegression())`.
es_es: No utilices :func:`~sklearn.preprocessing.robust_scale` a menos que sepas lo que estás haciendo. Un error común es aplicarlo a todos los datos *antes* de dividirlos en conjuntos de entrenamiento y prueba. Esto sesgará la evaluación del modelo porque la información se habrá filtrado del conjunto de prueba al conjunto de entrenamiento. En general, recomendamos utilizar :class:`~sklearn.preprocessing.RobustScaler` dentro de un :ref:`Pipeline <pipeline>` para evitar la mayoría de los riesgos de fuga de datos: `pipe = make_pipeline(RobustScaler(), LogisticRegression())`.
