Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.tree.ExtraTreeRegressor.po
Languages: es_es

source: An extremely randomized tree regressor.
es_es: Un árbol regresor extremadamente aleatorio.

source: Extra-trees differ from classic decision trees in the way they are built. When looking for the best split to separate the samples of a node into two groups, random splits are drawn for each of the `max_features` randomly selected features and the best split among those is chosen. When `max_features` is set 1, this amounts to building a totally random decision tree.
es_es: Los extra-árboles difieren de los árboles de decisión clásicos en la forma en que se construyen. Cuando se busca la mejor división para separar las muestras de un nodo en dos grupos, se dibujan divisiones aleatorias para cada una de las características seleccionadas al azar `max_features` y se elige la mejor división entre ellas. Cuando `max_features` se fija en 1, esto equivale a construir un árbol de decisión totalmente aleatorio.

source: Warning: Extra-trees should only be used within ensemble methods.
es_es: Advertencia: Los extra-árboles sólo deben utilizarse dentro de los métodos de conjunto.

source: Read more in the :ref:`User Guide <tree>`.
es_es: Lee más en el :ref:`Manual de usuario <tree>`.

source: Parameters
es_es: Parámetros

source: The function to measure the quality of a split. Supported criteria are "mse" for the mean squared error, which is equal to variance reduction as feature selection criterion and "mae" for the mean absolute error.
es_es: La función para medir la calidad de una separación. Los criterios soportados son "mse" para el error cuadrático medio, que es igual a la reducción de la varianza como criterio de selección de características y "mae" para el error absoluto medio.

source: Mean Absolute Error (MAE) criterion.
es_es: Criterio de Error Absoluto Medio (EAM, MAE en inglés).

source: Poisson deviance criterion.
es_es: Criterio de desviación de Poisson.

source: The strategy used to choose the split at each node. Supported strategies are "best" to choose the best split and "random" to choose the best random split.
es_es: La estrategia utilizada para elegir la separación en cada nodo. Las estrategias soportadas son "best" para elegir la mejor separación y "random" para elegir la mejor separación aleatoria.

source: The maximum depth of the tree. If None, then nodes are expanded until all leaves are pure or until all leaves contain less than min_samples_split samples.
es_es: La profundidad máxima del árbol. Si es None, los nodos se expanden hasta que todas las hojas sean puras o hasta que todas las hojas contengan menos muestras que min_samples_split.

source: int or float, default=2
es_es: int o float, default=2

source: The minimum number of samples required to split an internal node:
es_es: El número mínimo de muestras necesario para separar un nodo interno:

source: If int, then consider `min_samples_split` as the minimum number.
es_es: Si es int, entonces considere `min_samples_split` como el número mínimo.

source: If float, then `min_samples_split` is a fraction and `ceil(min_samples_split * n_samples)` are the minimum number of samples for each split.
es_es: Si es de punto flotante (float), `min_samples_split` es una fracción y `ceil(min_samples_split * n_samples)` es el número mínimo de muestras para cada separación.

source: Added float values for fractions.
es_es: Se han añadido valores flotantes para las fracciones.

source: int or float, default=1
es_es: int o float, default=1

source: The minimum number of samples required to be at a leaf node. A split point at any depth will only be considered if it leaves at least ``min_samples_leaf`` training samples in each of the left and right branches. This may have the effect of smoothing the model, especially in regression.
es_es: El número mínimo de muestras requerido para estar en un nodo hoja. Un punto de separación en cualquier profundidad sólo se considerará si deja al menos ``min_samples_leaf`` muestras de entrenamiento en cada una de las ramas izquierda y derecha. Esto puede tener el efecto de suavizar el modelo, especialmente en la regresión.

source: If int, then consider `min_samples_leaf` as the minimum number.
es_es: Si es entero, entonces considera `min_samples_split` como el número mínimo.

source: If float, then `min_samples_leaf` is a fraction and `ceil(min_samples_leaf * n_samples)` are the minimum number of samples for each node.
es_es: Si es de punto flotante (float), entonces `min_samples_leaf` es una fracción y `ceil(min_samples_leaf * n_samples)` son el número mínimo de muestras para cada nodo.

source: The minimum weighted fraction of the sum total of weights (of all the input samples) required to be at a leaf node. Samples have equal weight when sample_weight is not provided.
es_es: La fracción ponderada mínima de la suma total de pesos (de todas las muestras de entrada) requerida para estar en un nodo hoja. Las muestras tienen el mismo peso cuando no se proporciona sample_weight.

source: int, float, {"auto", "sqrt", "log2"} or None, default="auto"
es_es: int, float, {"auto", "sqrt", "log2"} o None, default="auto"

source: The number of features to consider when looking for the best split:
es_es: El número de características a considerar cuando se busca la mejor separación:

source: If int, then consider `max_features` features at each split.
es_es: Si es int, entonces se consideran las características `max_features` en cada separación.

source: If float, then `max_features` is a fraction and `int(max_features * n_features)` features are considered at each split.
es_es: Si es de punto flotante (float), entonces `max_features` es una fracción y las características `int(max_features * n_features)` se consideran en cada separación.

source: If "auto", then `max_features=n_features`.
es_es: Si "auto", entonces `max_features=n_features`.

source: If "sqrt", then `max_features=sqrt(n_features)`.
es_es: Si "sqrt", entonces `max_features=sqrt(n_features)`.

source: If "log2", then `max_features=log2(n_features)`.
es_es: Si "log2", entonces `max_features=log2(n_features)`.

source: If None, then `max_features=n_features`.
es_es: Si None, entonces `max_features=n_features`.

source: Note: the search for a split does not stop until at least one valid partition of the node samples is found, even if it requires to effectively inspect more than ``max_features`` features.
es_es: Nota: la búsqueda de una división no se detiene hasta que se encuentra al menos una partición válida de las muestras del nodo, incluso si requiere inspeccionar efectivamente más características que ``max_features``.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Used to pick randomly the `max_features` used at each split. See :term:`Glossary <random_state>` for details.
es_es: Se utiliza para elegir aleatoriamente el `max_features` utilizado en cada separación. Ver :term:`Glosario<random_state>` para más detalles.

source: A node will be split if this split induces a decrease of the impurity greater than or equal to this value.
es_es: Un nodo se separará si esta separación induce una disminución de la impureza mayor o igual a este valor.

source: The weighted impurity decrease equation is the following::
es_es: La ecuación de disminución de impurezas ponderada es la siguiente::

source: where ``N`` is the total number of samples, ``N_t`` is the number of samples at the current node, ``N_t_L`` is the number of samples in the left child, and ``N_t_R`` is the number of samples in the right child.
es_es: donde ``N`` es el número total de muestras, ``N_t`` es el número de muestras en el nodo actual, ``N_t_L`` es el número de muestras en el hijo izquierdo, y ``N_t_R`` es el número de muestras en el hijo derecho.

source: ``N``, ``N_t``, ``N_t_R`` and ``N_t_L`` all refer to the weighted sum, if ``sample_weight`` is passed.
es_es: ``N``, ``N_t``, ``N_t_R`` y ``N_t_L`` se refieren a la suma ponderada, si se pasa ``sample_weight``.

source: Threshold for early stopping in tree growth. A node will split if its impurity is above the threshold, otherwise it is a leaf.
es_es: Umbral para la parada anticipada en el crecimiento del árbol. Un nodo se separará si su impureza está por encima del umbral, de lo contrario será una hoja.

source: ``min_impurity_split`` has been deprecated in favor of ``min_impurity_decrease`` in 0.19. The default value of ``min_impurity_split`` has changed from 1e-7 to 0 in 0.23 and it will be removed in 1.0 (renaming of 0.25). Use ``min_impurity_decrease`` instead.
es_es: El valor de ``min_impurity_split`` ha quedado obsoleto en favor de ``min_impurity_decrease`` en 0.19. El valor predeterminado de ``min_impurity_split`` ha cambiado de 1e-7 a 0 en 0.23 y se eliminará en 1.0 (cambio de nombre de 0.25). Utilice ``min_impurity_decrease`` en su lugar.

source: Grow a tree with ``max_leaf_nodes`` in best-first fashion. Best nodes are defined as relative reduction in impurity. If None then unlimited number of leaf nodes.
es_es: Crece un árbol con ``max_leaf_nodes`` en modo best-first. Los mejores nodos se definen como una reducción relativa de la impureza. Si no hay ninguno, el número de nodos de la hoja es ilimitado.

source: non-negative float, default=0.0
es_es: flotante no negativo, default=0.0

source: Complexity parameter used for Minimal Cost-Complexity Pruning. The subtree with the largest cost complexity that is smaller than ``ccp_alpha`` will be chosen. By default, no pruning is performed. See :ref:`minimal_cost_complexity_pruning` for details.
es_es: Parámetro de complejidad utilizado para la poda de complejidad de coste mínimo. Se elegirá el subárbol con la mayor complejidad de costes que sea menor que ``ccp_alpha``. Por defecto, no se realiza ninguna poda. Ver :ref:`minimal_cost_complexity_pruning` para más detalles.

source: Attributes
es_es: Atributos

source: The inferred value of max_features.
es_es: El valor inferido de max_features.

source: The number of features when ``fit`` is performed.
es_es: El número de características cuando ``fit`` es realizado.

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features,)

source: Return the feature importances.
es_es: Devuelve la importancia de las características.

source: The number of outputs when ``fit`` is performed.
es_es: El número de salidas cuando se realiza ``fit``.

source: Tree instance
es_es: Instancia del árbol

source: The underlying Tree object. Please refer to ``help(sklearn.tree._tree.Tree)`` for attributes of Tree object and :ref:`sphx_glr_auto_examples_tree_plot_unveil_tree_structure.py` for basic usage of these attributes.
es_es: El objeto Tree subyacente. Por favor, consulte ``help(sklearn.tree._tree.Tree)`` para los atributos del objeto Tree y :ref:`sphx_glr_auto_examples_tree_plot_unveil_tree_structure.py` para el uso básico de estos atributos.

source: An extremely randomized tree classifier.
es_es: Un clasificador de árboles extremadamente aleatorio.

source: An extra-trees classifier.
es_es: Un clasificador extra-árbol.

source: An extra-trees regressor.
es_es: Un regresor extra-árbol.

source: Notes
es_es: Notas

source: The default values for the parameters controlling the size of the trees (e.g. ``max_depth``, ``min_samples_leaf``, etc.) lead to fully grown and unpruned trees which can potentially be very large on some data sets. To reduce memory consumption, the complexity and size of the trees should be controlled by setting those parameter values.
es_es: Los valores predeterminados de los parámetros que controlan el tamaño de los árboles (por ejemplo, ``max_depth``, ``min_samples_leaf``, etc.) conducen a árboles completamente crecidos y no podados que pueden ser potencialmente muy grandes en algunos conjuntos de datos. Para reducir el consumo de memoria, la complejidad y el tamaño de los árboles deben controlarse estableciendo los valores de estos parámetros.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Return the index of the leaf that each sample is predicted as.
es_es: Devuelve el índice de la hoja como la que se predice cada muestra.

source: Compute the pruning path during Minimal Cost-Complexity Pruning.
es_es: Calcule la ruta de poda durante la poda de coste-complejidad mínima.

source: Return the decision path in the tree.
es_es: Devuelve la ruta de decisión en el árbol.

source: Build a decision tree regressor from the training set (X, y).
es_es: Construir un árbol de decisión regresor a partir del conjunto de entrenamiento (X, y).

source: Return the depth of the decision tree.
es_es: Devuelve la profundidad del árbol de decisión.

source: Return the number of leaves of the decision tree.
es_es: Devuelve el número de hojas del árbol de decisión.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Predict class or regression value for X.
es_es: Predice la clase o regresión para X.

source: Return the coefficient of determination :math:`R^2` of the prediction.
es_es: Devuelve el coeficiente de determinación :math:`R^2` de la predicción.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: The input samples. Internally, it will be converted to ``dtype=np.float32`` and if a sparse matrix is provided to a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, se convertirá a ``dtype=np.float32`` y si se proporciona una matriz dispersa a una ``csr_matrix`` dispersa.

source: Allow to bypass several input checking. Don't use this parameter unless you know what you do.
es_es: Permite eludir varias comprobaciones de entrada. No uses este parámetro a menos que sepas lo que haces.

source: Returns
es_es: Devuelve

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: For each datapoint x in X, return the index of the leaf x ends up in. Leaves are numbered within ``[0; self.tree_.node_count)``, possibly with gaps in the numbering.
es_es: Para cada punto de datos x en X, devuelve el índice de la hoja en la que termina x. Las hojas se numeran dentro de ``[0; self.tree_.node_count)``, posiblemente con huecos en la numeración.

source: See :ref:`minimal_cost_complexity_pruning` for details on the pruning process.
es_es: Ver :ref:`minimal_cost_complexity_pruning` for details on the pruning process.

source: The training input samples. Internally, it will be converted to ``dtype=np.float32`` and if a sparse matrix is provided to a sparse ``csc_matrix``.
es_es: Las muestras de entrada de entrenamiento. Internamente, se convertirá a ``dtype=np.float32`` y si se proporciona una matriz dispersa a una ``csc_matrix`` dispersa.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: tipo de arreglo de forma (n_samples,) o (n_samples, n_outputs)

source: The target values (class labels) as integers or strings.
es_es: Los valores objetivo (etiquetas de clase) como enteros o cadenas.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,) default=None

source: Sample weights. If None, then samples are equally weighted. Splits that would create child nodes with net zero or negative weight are ignored while searching for a split in each node. Splits are also ignored if they would result in any single class carrying a negative weight in either child node.
es_es: Pesos de las muestras. Si es None, las muestras se ponderan por igual. Las separaciones que crearían nodos hijos con peso neto cero o negativo se ignoran al buscar una separación en cada nodo. Las separaciones también se ignoran si dan lugar a que una sola clase tenga un peso negativo en cualquiera de los nodos hijos.

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo diccionario, con los siguientes atributos.

source: Effective alphas of subtree during pruning.
es_es: Alfas efectivas del subárbol durante la poda.

source: impurities
es_es: impurezas

source: Sum of the impurities of the subtree leaves for the corresponding alpha value in ``ccp_alphas``.
es_es: Suma de las impurezas de las hojas del subárbol para el valor alfa correspondiente en ``ccp_alphas``.

source: sparse matrix of shape (n_samples, n_nodes)
es_es: matriz dispersa de forma (n_samples, n_nodes)

source: Return a node indicator CSR matrix where non zero elements indicates that the samples goes through the nodes.
es_es: Devuelve una matriz CSR indicadora de nodos donde los elementos no nulos indican que las muestras pasan por los nodos.

source: The importance of a feature is computed as the (normalized) total reduction of the criterion brought by that feature. It is also known as the Gini importance.
es_es: La importancia de una característica se calcula como la reducción total (normalizada) del criterio aportado por esa característica. También se conoce como la importancia de Gini.

source: Warning: impurity-based feature importances can be misleading for high cardinality features (many unique values). See :func:`sklearn.inspection.permutation_importance` as an alternative.
es_es: Advertencia: las importancias de las características basadas en la impureza pueden ser engañosas para las características de alta cardinalidad (muchos valores únicos). Ver :func:`sklearn.inspection.permutation_importance` como alternativa.

source: Normalized total reduction of criteria by feature (Gini importance).
es_es: Reducción total normalizada de los criterios por característica (importancia de Gini).

source: The target values (real numbers). Use ``dtype=np.float64`` and ``order='C'`` for maximum efficiency.
es_es: Los valores objetivo (números reales). Utilice ``dtype=np.float64`` y ``order='C'`` para obtener la máxima eficiencia.

source: Sample weights. If None, then samples are equally weighted. Splits that would create child nodes with net zero or negative weight are ignored while searching for a split in each node.
es_es: Pesos de las muestras. Si es Ninguno, las muestras se ponderan por igual. Las separaciones que crearían nodos hijos con peso neto cero o negativo se ignoran al buscar una separación en cada nodo.

source: deprecated, default="deprecated"
es_es: obsoleto, default="deprecated"

source: This parameter is deprecated and has no effect. It will be removed in 1.1 (renaming of 0.26).
es_es: Este parámetro está obsoleto y no tiene ningún efecto. Se eliminará en la versión 1.1 (cambio de nombre de la versión 0.26).

source: Fitted estimator.
es_es: Estimador ajustado.

source: The depth of a tree is the maximum distance between the root and any leaf.
es_es: La profundidad de un árbol es la distancia máxima entre la raíz y cualquier hoja.

source: The maximum depth of the tree.
es_es: La profundidad máxima del árbol.

source: Number of leaves.
es_es: Número de hojas.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: For a classification model, the predicted class for each sample in X is returned. For a regression model, the predicted value based on X is returned.
es_es: Para un modelo de clasificación, se devuelve la clase predicha para cada muestra en X. Para un modelo de regresión, se devuelve el valor predicho basado en X.

source: The predicted classes, or the predict values.
es_es: Las clases predichas, o los valores predichos.

source: The coefficient :math:`R^2` is defined as :math:`(1 - \frac{u}{v})`, where :math:`u` is the residual sum of squares ``((y_true - y_pred) ** 2).sum()`` and :math:`v` is the total sum of squares ``((y_true - y_true.mean()) ** 2).sum()``. The best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of `y`, disregarding the input features, would get a :math:`R^2` score of 0.0.
es_es: El coeficiente :math:`R^2` se define como :math:`(1 - \frac{u}{v})`, donde :math:`u` es la suma residual de cuadrados ``((y_true - y_pred) ** 2).sum()`` y :math:`v` es la suma total de cuadrados ``((y_true - y_true.mean()) ** 2).sum()``. La mejor puntuación posible es 1,0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de `y`, sin tener en cuenta las características de entrada, obtendría una puntuación :math:`R^2` de 0,0.

source: array-like of shape (n_samples, n_features)
es_es: tipo de arreglo de forma (n_samples, n_features)

source: Test samples. For some estimators this may be a precomputed kernel matrix or a list of generic objects instead with shape ``(n_samples, n_samples_fitted)``, where ``n_samples_fitted`` is the number of samples used in the fitting for the estimator.
es_es: Muestras de prueba. Para algunos estimadores esto puede ser una matriz de núcleo precalculada o una lista de objetos genéricos con forma ``(n_samples, n_samples_fitted)``, donde ``n_samples_fitted`` es el número de muestras utilizadas en el ajuste para el estimador.

source: True values for `X`.
es_es: Valores verdaderos para X`.

source: Sample weights.
es_es: Ponderaciones de muestras.

source: The :math:`R^2` score used when calling ``score`` on a regressor uses ``multioutput='uniform_average'`` from version 0.23 to keep consistent with default value of :func:`~sklearn.metrics.r2_score`. This influences the ``score`` method of all the multioutput regressors (except for :class:`~sklearn.multioutput.MultiOutputRegressor`).
es_es: La puntuación :math:`R^2` utilizada al llamar a ``score`` en un regresor utiliza ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la coherencia con el valor predeterminado de :func:`~sklearn.metrics.r2_score``. Esto influye en el método ``score`` de todos los regresores de salida múltiple (excepto para :class:`~sklearn.multioutput.MultiOutputRegressor`).

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.
