Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.rand_score.po
Languages: es_es

source: Rand index.
es_es: Índice de Rand.

source: The Rand Index computes a similarity measure between two clusterings by considering all pairs of samples and counting pairs that are assigned in the same or different clusters in the predicted and true clusterings.
es_es: El Índice de Rand calcula una medida de similitud entre dos agrupaciones considerando todos los pares de muestras y los pares de conteo que se asignan en los mismos o diferentes conglomerados o grupos en las agrupaciones predichas y verdaderas.

source: The raw RI score is:
es_es: La puntuación en bruto de RI es:

source: RI = (number of agreeing pairs) / (number of pairs)
es_es: RI = (número de pares coincidentes) / (número de pares)

source: Read more in the :ref:`User Guide <rand_score>`.
es_es: Más información en el :ref:`Manual de usuario <rand_score>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,), dtype=integral
es_es: array-like de forma (n_samples,), dtype=integral

source: Ground truth class labels to be used as a reference.
es_es: Etiquetas de clase de verdad fundamental que se utilizarán como referencia.

source: Cluster labels to evaluate.
es_es: Etiquetas de conglomerados para evaluar.

source: Returns
es_es: Devuelve

source: Similarity score between 0.0 and 1.0, inclusive, 1.0 stands for perfect match.
es_es: Puntuación de similitud entre 0.0 y 1.0, inclusive, 1.0 significa correspondencia perfecta.

source: Adjusted Rand Score
es_es: Puntuación de Rand ajustada

source: Adjusted Mutual Information
es_es: Información Mutua Ajustada

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Perfectly matching labelings have a score of 1 even
es_es: Los etiquetados que coinciden perfectamente tienen una puntuación de 1 incluso

source: Labelings that assign all classes members to the same clusters are complete but may not always be pure, hence penalized:
es_es: Las etiquetas que asignan a todos los miembros de las clases a los mismos grupos o conglomerados están completas, pero pueden no ser siempre puros, están penalizadas:
