Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.IsolationForest.po
Languages: es_es

source: Isolation Forest Algorithm.
es_es: Algoritmo de Bosque de Aislamiento.

source: Return the anomaly score of each sample using the IsolationForest algorithm
es_es: Devuelve la puntuación de anomalía de cada muestra utilizando el algoritmo IsolationForest

source: The IsolationForest 'isolates' observations by randomly selecting a feature and then randomly selecting a split value between the maximum and minimum values of the selected feature.
es_es: El IsolationForest "aísla" las observaciones seleccionando aleatoriamente una característica y luego seleccionando aleatoriamente un valor de división entre los valores máximos y mínimos de la característica seleccionada.

source: Since recursive partitioning can be represented by a tree structure, the number of splittings required to isolate a sample is equivalent to the path length from the root node to the terminating node.
es_es: Dado que la partición recursiva puede representarse mediante una estructura de árbol, el número de divisiones necesarias para aislar una muestra es equivalente a la longitud de la trayectoria desde el nodo raíz hasta el nodo final.

source: This path length, averaged over a forest of such random trees, is a measure of normality and our decision function.
es_es: Esta longitud de la trayectoria, promediada sobre un bosque de tales árboles aleatorios, es una medida de normalidad y nuestra función de decisión.

source: Random partitioning produces noticeably shorter paths for anomalies. Hence, when a forest of random trees collectively produce shorter path lengths for particular samples, they are highly likely to be anomalies.
es_es: La partición aleatoria produce trayectorias notablemente más cortas para las anomalías. Por lo tanto, cuando un bosque de árboles aleatorios produce colectivamente longitudes de trayectorias más cortas para muestras particulares, es muy probable que se trate de anomalías.

source: Read more in the :ref:`User Guide <isolation_forest>`.
es_es: Leer más en el :ref:`Manual de Usuario <isolation_forest>`.

source: Parameters
es_es: Parámetros

source: The number of base estimators in the ensemble.
es_es: El número de estimadores base en el ensemble.

source: "auto", int or float, default="auto"
es_es: "auto", int o float, default="auto"

source: The number of samples to draw from X to train each base estimator.
es_es: El número de muestras a extraer de X para entrenar cada estimador base.

source: If int, then draw `max_samples` samples.
es_es: Si es int, entonces extrae `max_samples` muestras.

source: If float, then draw `max_samples * X.shape[0]` samples.
es_es: Si es float, entonces extrae `max_samples * X.shape[0]` muestras.

source: If "auto", then `max_samples=min(256, n_samples)`.
es_es: Si es "auto", entonces `max_samples=min(256, n_samples)`.

source: If max_samples is larger than the number of samples provided, all samples will be used for all trees (no sampling).
es_es: Si max_samples es mayor que el número de muestras proporcionado, se utilizarán todas las muestras para todos los árboles (sin muestreo).

source: 'auto' or float, default='auto'
es_es: 'auto' o float, default='auto'

source: The amount of contamination of the data set, i.e. the proportion of outliers in the data set. Used when fitting to define the threshold on the scores of the samples.
es_es: La cantidad de contaminación del conjunto de datos, es decir, la proporción de valores atípicos en el conjunto de datos. Se utiliza al ajustar para definir el umbral en las puntuaciones de las muestras.

source: If 'auto', the threshold is determined as in the original paper.
es_es: Si es "auto", el umbral se determina como en el documento original.

source: If float, the contamination should be in the range [0, 0.5].
es_es: Si es float, la contaminación debe estar en el rango [0, 0.5].

source: The default value of ``contamination`` changed from 0.1 to ``'auto'``.
es_es: El valor predeterminado de ``contamination`` cambió de 0.1 a ``'auto'``.

source: int or float, default=1.0
es_es: int o float, default=1.0

source: The number of features to draw from X to train each base estimator.
es_es: El número de características a extraer de X para entrenar cada estimador base.

source: If int, then draw `max_features` features.
es_es: Si es int, entonces extrae `max_features` características.

source: If float, then draw `max_features * X.shape[1]` features.
es_es: Si es float, entonces extrae `max_features * X.shape[1]` características.

source: If True, individual trees are fit on random subsets of the training data sampled with replacement. If False, sampling without replacement is performed.
es_es: Si es True, los árboles individuales se ajustan a subconjuntos aleatorios de los datos de entrenamiento muestreados con reemplazo. Si es False, se realiza un muestreo sin reemplazo.

source: The number of jobs to run in parallel for both :meth:`fit` and :meth:`predict`. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos que se ejecutan en paralelo para :meth:`fit` y :meth:`predict`. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Controls the pseudo-randomness of the selection of the feature and split values for each branching step and each tree in the forest.
es_es: Controla la pseudo-aleatoriedad de la selección de los valores de las características y de división para cada paso de ramificación y cada árbol del bosque.

source: Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Pasa un número entero para que los resultados sean reproducibles a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Controls the verbosity of the tree building process.
es_es: Controla la verbosidad del proceso de construcción del árbol.

source: When set to ``True``, reuse the solution of the previous call to fit and add more estimators to the ensemble, otherwise, just fit a whole new forest. See :term:`the Glossary <warm_start>`.
es_es: Cuando se establece como ``True``, reutiliza la solución de la llamada previa para ajustar y añadir más estimadores al ensemble, de lo contrario, sólo se ajusta un bosque nuevo. Ver :term:`el Glosario <warm_start>`.

source: Attributes
es_es: Atributos

source: ExtraTreeRegressor instance
es_es: instancia ExtraTreeRegressor

source: The child estimator template used to create the collection of fitted sub-estimators.
es_es: La plantilla del estimador hijo utilizada para crear la colección de subestimadores ajustados.

source: list of ExtraTreeRegressor instances
es_es: list de instancias ExtraTreeRegressor

source: The collection of fitted sub-estimators.
es_es: La colección de subestimadores ajustados.

source: list of ndarray
es_es: list de ndarray

source: The subset of drawn features for each base estimator.
es_es: El subconjunto de características extraídas para cada estimador base.

source: The subset of drawn samples for each base estimator.
es_es: El subconjunto de muestras extraídas para cada estimador base.

source: The actual number of samples.
es_es: El número real de muestras.

source: Offset used to define the decision function from the raw scores. We have the relation: ``decision_function = score_samples - offset_``. ``offset_`` is defined as follows. When the contamination parameter is set to "auto", the offset is equal to -0.5 as the scores of inliers are close to 0 and the scores of outliers are close to -1. When a contamination parameter different than "auto" is provided, the offset is defined in such a way we obtain the expected number of outliers (samples with decision function < 0) in training.
es_es: Desplazamiento utilizado para definir la función de decisión a partir de las puntuaciones brutas. Tenemos la relación: ``decision_function = score_samples - offset_``. ``offset_`` se define de la siguiente manera. Cuando el parámetro de contaminación se establece en "auto", el desplazamiento es igual a -0.5 ya que las puntuaciones de los valores típicos son cercanas a 0 y las puntuaciones de los valores atípicos son cercanas a -1. Cuando se proporciona un parámetro de contaminación diferente a "auto", el desplazamiento se define de tal manera que obtenemos el número esperado de valores atípicos (muestras con función de decisión < 0) en el entrenamiento.

source: The number of features when ``fit`` is performed.
es_es: El número de características cuando se realiza el ``fit``.

source: An object for detecting outliers in a Gaussian distributed dataset.
es_es: Un objeto para detectar valores atípicos en un conjunto de datos con distribución Gaussiana.

source: Unsupervised Outlier Detection. Estimate the support of a high-dimensional distribution. The implementation is based on libsvm.
es_es: Detección No Supervisada de Valores Atípicos. Estima el soporte de una distribución de alta dimensión. La implementación se basa en libsvm.

source: Unsupervised Outlier Detection using Local Outlier Factor (LOF).
es_es: Detección No Supervisada de Valores Atípicos mediante el Factor Local de Valores Atípicos (Local Outlier Factor, LOF).

source: Notes
es_es: Notas

source: The implementation is based on an ensemble of ExtraTreeRegressor. The maximum depth of each tree is set to ``ceil(log_2(n))`` where :math:`n` is the number of samples used to build the tree (see (Liu et al., 2008) for more details).
es_es: La implementación se basa en un ensemble de ExtraTreeRegressor. La profundidad máxima de cada árbol se establece en ``ceil(log_2(n))`` donde :math:`n` es el número de muestras utilizadas para construir el árbol (ver (Liu et al., 2008) para más detalles).

source: References
es_es: Referencias

source: Liu, Fei Tony, Ting, Kai Ming and Zhou, Zhi-Hua. "Isolation forest." Data Mining, 2008. ICDM'08. Eighth IEEE International Conference on.
es_es: Liu, Fei Tony, Ting, Kai Ming y Zhou, Zhi-Hua. "Isolation forest." Data Mining, 2008. ICDM'08. Eighth IEEE International Conference on.

source: Liu, Fei Tony, Ting, Kai Ming and Zhou, Zhi-Hua. "Isolation-based anomaly detection." ACM Transactions on Knowledge Discovery from Data (TKDD) 6.1 (2012): 3.
es_es: Liu, Fei Tony, Ting, Kai Ming y Zhou, Zhi-Hua. "Isolation-based anomaly detection." ACM Transactions on Knowledge Discovery from Data (TKDD) 6.1 (2012): 3.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Average anomaly score of X of the base classifiers.
es_es: Puntuación de anomalía media de X de los clasificadores base.

source: Fit estimator.
es_es: Estimador del ajuste.

source: Perform fit on X and returns labels for X.
es_es: Realiza el ajuste en X y devuelve las etiquetas para X.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Predict if a particular sample is an outlier or not.
es_es: Predice si una muestra en particular es un valor atípico o no.

source: Opposite of the anomaly score defined in the original paper.
es_es: Lo contrario de la puntuación de anomalía definida en el documento original.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: The anomaly score of an input sample is computed as the mean anomaly score of the trees in the forest.
es_es: La puntuación de anomalía de una muestra de entrada se calcula como la puntuación de anomalía media de los árboles del bosque.

source: The measure of normality of an observation given a tree is the depth of the leaf containing this observation, which is equivalent to the number of splittings required to isolate this point. In case of several observations n_left in the leaf, the average path length of a n_left samples isolation tree is added.
es_es: La medida de normalidad de una observación dado un árbol es la profundidad de la hoja que contiene esta observación, que equivale al número de divisiones necesarias para aislar este punto. En caso de que haya varias observaciones n_left en la hoja, se añade la longitud media de la trayectoria de un árbol de aislamiento de muestras n_left.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: The input samples. Internally, it will be converted to ``dtype=np.float32`` and if a sparse matrix is provided to a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, se convertirá a ``dtype=np.float32`` y si se proporciona una matriz dispersa, a una ``csr_matrix`` dispersa.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The anomaly score of the input samples. The lower, the more abnormal. Negative scores represent outliers, positive scores represent inliers.
es_es: La puntuación de anomalía de las muestras de entrada. Cuanto más baja, más anormal. Las puntuaciones negativas representan valores atípicos, y las positivas, valores típicos.

source: Returns a dynamically generated list of indices identifying the samples used for fitting each member of the ensemble, i.e., the in-bag samples.
es_es: Devuelve una lista generada dinámicamente de índices que identifican las muestras utilizadas para el ajuste de cada miembro del ensemble, es decir, las muestras in-bag.

source: Note: the list is re-created at each call to the property in order to reduce the object memory footprint by not storing the sampling data. Thus fetching the property may be slower than expected.
es_es: Nota: la lista se vuelve a crear en cada llamada a la propiedad para reducir la huella de memoria del objeto al no almacenar los datos de muestreo. Por lo tanto, la obtención de la propiedad puede ser más lenta de lo esperado.

source: The input samples. Use ``dtype=np.float32`` for maximum efficiency. Sparse matrices are also supported, use sparse ``csc_matrix`` for maximum efficiency.
es_es: Las muestras de entrada. Utiliza ``dtype=np.float32`` para obtener la máxima eficiencia. También se admiten matrices dispersas, utiliza ``csc_matrix`` dispersa para obtener la máxima eficiencia.

source: Ignored
es_es: Ignorado

source: Not used, present for API consistency by convention.
es_es: No utilizado, está presente para la coherencia de la API por convención.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights. If None, then samples are equally weighted.
es_es: Ponderaciones de las muestras. Si es None, las muestras se ponderan por igual.

source: Fitted estimator.
es_es: Estimador ajustado.

source: Returns -1 for outliers and 1 for inliers.
es_es: Devuelve -1 para los valores atípicos y 1 para los valores típicos.

source: {array-like, sparse matrix, dataframe} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix, dataframe} de forma (n_samples, n_features)

source: 1 for inliers, -1 for outliers.
es_es: 1 para los valores típicos, -1 para los valores atípicos.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: For each observation, tells whether or not (+1 or -1) it should be considered as an inlier according to the fitted model.
es_es: Para cada observación, indica si debe considerarse o no (+1 o -1) como un valor típico según el modelo ajustado.

source: The input samples.
es_es: Las muestras de entrada.

source: The anomaly score of the input samples. The lower, the more abnormal.
es_es: La puntuación de anomalía de las muestras de entrada. Cuanto más baja, más anormal.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: Examples using ``sklearn.ensemble.IsolationForest``
es_es: Ejemplos utilizando ``sklearn.ensemble.IsolationForest``
