Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.add_dummy_feature.po
Languages: es_es

source: Augment dataset with an additional dummy feature.
es_es: Aumenta el conjunto de datos con una característica ficticia adicional.

source: This is useful for fitting an intercept term with implementations which cannot otherwise fit it directly.
es_es: Esto es útil para ajustar un término de intercepto con implementaciones que de otro modo no pueden ajustarlo directamente.

source: Parameters
es_es: Parámetros

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Data.
es_es: Datos.

source: Value to use for the dummy feature.
es_es: Valor a utilizar para la característica ficticia.

source: Returns
es_es: Devuelve

source: {ndarray, sparse matrix} of shape (n_samples, n_features + 1)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_features + 1)

source: Same data with dummy feature added as first column.
es_es: Los mismos datos con la característica ficticia añadida como primera columna.

source: Examples
es_es: Ejemplos
