Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.fetch_20newsgroups_vectorized.po
Languages: es_es

source: Load and vectorize the 20 newsgroups dataset (classification).
es_es: Cargar y vectorizar el conjunto de datos de 20 grupos de noticias (clasificación).

source: Download it if necessary.
es_es: Descargar si es necesario.

source: This is a convenience function; the transformation is done using the default settings for :class:`~sklearn.feature_extraction.text.CountVectorizer`. For more advanced usage (stopword filtering, n-gram extraction, etc.), combine fetch_20newsgroups with a custom :class:`~sklearn.feature_extraction.text.CountVectorizer`, :class:`~sklearn.feature_extraction.text.HashingVectorizer`, :class:`~sklearn.feature_extraction.text.TfidfTransformer` or :class:`~sklearn.feature_extraction.text.TfidfVectorizer`.
es_es: Esta es una función de conveniencia; la transformación se realiza utilizando la configuración por defecto de :class:`~sklearn.feature_extraction.text.CountVectorizer`. Para un uso más avanzado (filtrado de palabras de parada, extracción de n-gramas, etc.), combina fetch_20newsgroups con un :class:`~sklearn.feature_extraction.text.CountVectorizer` personalizado, :class:`~sklearn.feature_extraction.text.HashingVectorizer`, :class:`~sklearn.feature_extraction.text.TfidfTransformer` o :class:`~sklearn.feature_extraction.text.TfidfVectorizer`.

source: The resulting counts are normalized using :func:`sklearn.preprocessing.normalize` unless normalize is set to False.
es_es: Los recuentos resultantes se normalizan utilizando :func:`sklearn.preprocessing.normalize` a menos que normalize se establezca en False.

source: Classes
es_es: Clases

source: Samples total
es_es: Total de muestras

source: Dimensionality
es_es: Dimensionalidad

source: Features
es_es: Característica

source: Read more in the :ref:`User Guide <20newsgroups_dataset>`.
es_es: Lee más en la :ref:`Manual de usuario <20newsgroups_dataset>`.

source: Parameters
es_es: Parámetros

source: **subset**
es_es: **subconjunto**

source: Select the dataset to load: 'train' for the training set, 'test' for the test set, 'all' for both, with shuffled ordering.
es_es: Seleccione el conjunto de datos a cargar: 'train' para el conjunto de entrenamiento, 'test' para el conjunto de prueba, 'all' para ambos, con ordenación aleatoria.

source: May contain any subset of ('headers', 'footers', 'quotes'). Each of these are kinds of text that will be detected and removed from the newsgroup posts, preventing classifiers from overfitting on metadata.
es_es: Puede contener cualquier subconjunto de ('headers', 'footers', 'quotes'). Cada uno de ellos es un tipo de texto que será detectado y eliminado de los mensajes de los grupos de noticias, evitando que los clasificadores se ajusten en exceso a los metadatos.

source: 'headers' removes newsgroup headers, 'footers' removes blocks at the ends of posts that look like signatures, and 'quotes' removes lines that appear to be quoting another post.
es_es: Los "headers" eliminan los encabezados de los grupos de noticias, los "footers" eliminan los bloques al final de los mensajes que parecen firmas, y las "quotes" eliminan las líneas que parecen citar otro mensaje.

source: Specify an download and cache folder for the datasets. If None, all scikit-learn data is stored in '~/scikit_learn_data' subfolders.
es_es: Especifique una carpeta de descarga y de caché para los conjuntos de datos. Si es None, todos los datos de scikit-learn se almacenan en las subcarpetas '~/scikit_learn_data'.

source: If False, raise an IOError if the data is not locally available instead of trying to download the data from the source site.
es_es: Si es False, lanza un IOError si los datos no están disponibles localmente en lugar de intentar descargar los datos desde el sitio de origen.

source: If True, returns ``(data.data, data.target)`` instead of a Bunch object.
es_es: Si es True, devuelve ``(data.data, data.target)`` en lugar de un objeto Bunch.

source: If True, normalizes each document's feature vector to unit norm using :func:`sklearn.preprocessing.normalize`.
es_es: Si es True, normaliza el vector de características de cada documento a la norma unitaria usando :func:`sklearn.preprocessing.normalize`.

source: If True, the data is a pandas DataFrame including columns with appropriate dtypes (numeric, string, or categorical). The target is a pandas DataFrame or Series depending on the number of `target_columns`.
es_es: Si es True, los datos son un DataFrame de pandas que incluye columnas con los dtypes apropiados (numérico, cadena o categórico). El objetivo es un DataFrame de pandas o una Serie dependiendo del número de `target_columns`.

source: Returns
es_es: Salida

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo diccionario, con los siguientes atributos.

source: data: {sparse matrix, dataframe} of shape (n_samples, n_features)
es_es: datos: {sparse matrix, dataframe} de forma (n_samples, n_features)

source: The input data matrix. If ``as_frame`` is `True`, ``data`` is a pandas DataFrame with sparse columns.
es_es: La matriz de datos de entrada. Si ``as_frame`` es `True`, ``data`` es un DataFrame de pandas con columnas dispersas.

source: target: {ndarray, series} of shape (n_samples,)
es_es: target: {ndarray, series} de forma (n_samples,)

source: The target labels. If ``as_frame`` is `True`, ``target`` is a pandas Series.
es_es: Las etiquetas del objetivo. Si ``as_frame`` es ``True``, ``target`` son Series de pandas.

source: target_names: list of shape (n_classes,)
es_es: target_names: lista de shape (n_clases,)

source: The names of target classes.
es_es: Los nombres de las clases objetivo.

source: The full description of the dataset.
es_es: La descripción completa del conjunto de datos.

source: frame: dataframe of shape (n_samples, n_features + 1)
es_es: frame: dataframe de forma (n_samples, n_features + 1)

source: Only present when `as_frame=True`. Pandas DataFrame with ``data`` and ``target``.
es_es: Sólo está presente cuando `as_frame=True`. Pandas DataFrame con ``data`` y ``target``.

source: **(data, target)** : tuple if ``return_X_y`` is True
es_es: **(data, target)** : tupla si ``return_X_y`` es True

source: tuple if
es_es: tupla si

source: `data` and `target` would be of the format defined in the `Bunch` description above.
es_es: `datos` y `objetivo` tendrían el formato definido en la descripción del `Bunch` anterior.

source: Examples using ``sklearn.datasets.fetch_20newsgroups_vectorized``
es_es: Ejemplos con ``sklearn.datasets.fetch_20newsgroups_vectorized``
