Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.r2_score.po
Languages: es_es

source: R^2 (coefficient of determination) regression score function.
es_es: Función de puntuación de regresión R^2 (coeficiente de determinación).

source: Best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of y, disregarding the input features, would get a R^2 score of 0.0.
es_es: La mejor puntuación posible es 1.0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de y, sin tener en cuenta las características de entrada, obtendría una puntuación R^2 de 0.0.

source: Read more in the :ref:`User Guide <r2_score>`.
es_es: Lee más en el :ref:`Manual de Usuario` <r2_score>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: Ground truth (correct) target values.
es_es: Valores objetivo (correctos) de verdad fundamental.

source: Estimated target values.
es_es: Valores objetivo estimados.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: {'raw_values', 'uniform_average', 'variance_weighted'}, array-like of shape (n_outputs,) or None, default='uniform_average'
es_es: {'raw_values', 'uniform_average', 'variance_weighted'}, array-like de forma (n_outputs,) o None, default='uniform_average'

source: Defines aggregating of multiple output scores. Array-like value defines weights used to average scores. Default is "uniform_average".
es_es: Define la agregación de múltiples puntuaciones de salida. El valor de array-like define los pesos utilizados para promediar las puntuaciones. Por defecto es "uniform_average".

source: Returns a full set of scores in case of multioutput input.
es_es: Devuelve un conjunto completo de puntuaciones en el caso de la entrada de salida múltiple.

source: Scores of all outputs are averaged with uniform weight.
es_es: Las puntuaciones de todas las salidas se promedian con una ponderación uniforme.

source: Scores of all outputs are averaged, weighted by the variances of each individual output.
es_es: Las puntuaciones de todas las salidas se promedian, ponderadas por las varianzas de cada salida individual.

source: Default value of multioutput is 'uniform_average'.
es_es: El valor predeterminado de multioutput es 'uniform_average'.

source: Returns
es_es: Devuelve

source: float or ndarray of floats
es_es: float o ndarray of floats

source: The R^2 score or ndarray of scores if 'multioutput' is 'raw_values'.
es_es: La puntuación R^2 o el ndarray de las puntuaciones si 'multioutput' es 'raw_values'.

source: Notes
es_es: Notas

source: This is not a symmetric function.
es_es: Esta no es una función simétrica.

source: Unlike most other scores, R^2 score may be negative (it need not actually be the square of a quantity R).
es_es: A diferencia de la mayoría de las otras puntuaciones, la puntuación R ^ 2 puede ser negativa (no es necesario que sea el cuadrado de una cantidad R).

source: This metric is not well-defined for single samples and will return a NaN value if n_samples is less than two.
es_es: Esta métrica no está bien definida para muestras individuales y devolverá un valor NaN si n_sampless es menor que dos.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.metrics.r2_score``
es_es: Ejemplos utilizando ``sklearn.metrics.r2_score``
