Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.class_weight.compute_sample_weight.po
Languages: es_es

source: Estimate sample weights by class for unbalanced datasets.
es_es: Estima los pesos muestrales por clase para conjuntos de datos no balanceados.

source: Parameters
es_es: Parámetros

source: dict, list of dicts, "balanced", or None
es_es: dict, lista o dicts, "balanced", o None

source: Weights associated with classes in the form ``{class_label: weight}``. If not given, all classes are supposed to have weight one. For multi-output problems, a list of dicts can be provided in the same order as the columns of y.
es_es: Ponderaciones asociadas a las clases de la forma ``{class_label: weight}``. Si no se da, se supone que todas las clases tienen una ponderación de uno. Para los problemas de salida múltiple, se puede proporcionar una lista de diccionarios en el mismo orden que las columnas de y.

source: Note that for multioutput (including multilabel) weights should be defined for each class of every column in its own dict. For example, for four-class multilabel classification weights should be [{0: 1, 1: 1}, {0: 1, 1: 5}, {0: 1, 1: 1}, {0: 1, 1: 1}] instead of [{1:1}, {2:5}, {3:1}, {4:1}].
es_es: Ten en cuenta que para multisalida (incluyendo multietiqueta) las ponderaciones deben ser definidas para cada clase de cada columna en su propio diccionario. Por ejemplo, para la clasificación múltiple de cuatro clases debe ser [{0: 1, 1: 1}, {0: 1, 1: 5}, {0: 1, 1: 1}, {0: 1, 1: 1}] en lugar de [{1:1}, {2:5}, {3:1}, {4:1}].

source: The "balanced" mode uses the values of y to automatically adjust weights inversely proportional to class frequencies in the input data: ``n_samples / (n_classes * np.bincount(y))``.
es_es: El modo "balanced" utiliza los valores de y para ajustar automáticamente las ponderaciones inversamente proporcionales a las frecuencias de clase en los datos de entrada como ``n_samples / (n_classes * np.bincount(y))``.

source: For multi-output, the weights of each column of y will be multiplied.
es_es: Para la salida múltiple, las ponderaciones de cada columna de y se multiplicarán.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: tipo de arreglo de forma (n_samples,) o (n_samples, n_outputs)

source: Array of original class labels per sample.
es_es: Arreglo de etiquetas de clase originales por muestra.

source: array-like of shape (n_subsample,), default=None
es_es: tipo de arreglo de forma (n_subsample,) default=None

source: Array of indices to be used in a subsample. Can be of length less than n_samples in the case of a subsample, or equal to n_samples in the case of a bootstrap subsample with repeated indices. If None, the sample weight will be calculated over the full sample. Only "balanced" is supported for class_weight if this is provided.
es_es: Arreglo de índices que se utilizarán en una submuestra. Puede tener una longitud inferior a n_samples en el caso de una submuestra, o ser igual a n_samples en el caso de una submuestra bootstrap con índices repetidos. Si es Ninguno, el peso de la muestra se calculará sobre la muestra completa. Sólo se admite "equilibrado" para class_weight si se proporciona.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: Array with sample weights as applied to the original y.
es_es: Arreglo con los pesos de la muestra aplicados a la y original.
