Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.cross_val_predict.po
Languages: es_es

source: Generate cross-validated estimates for each input data point
es_es: Genera estimaciones de validación cruzada para cada punto de datos de entrada

source: The data is split according to the cv parameter. Each sample belongs to exactly one test set, and its prediction is computed with an estimator fitted on the corresponding training set.
es_es: Los datos se dividen según el parámetro cv. Cada muestra pertenece exactamente a un conjunto de pruebas, y su predicción se calcula con un estimador ajustado al conjunto de entrenamiento correspondiente.

source: Passing these predictions into an evaluation metric may not be a valid way to measure generalization performance. Results can differ from :func:`cross_validate` and :func:`cross_val_score` unless all tests sets have equal size and the metric decomposes over samples.
es_es: Pasar estas predicciones a una métrica de evaluación puede no ser una forma válida de medir el rendimiento de la generalización. Los resultados pueden diferir de :func:`cross_validate` y :func:`cross_val_score` a menos que todos los conjuntos de pruebas tengan el mismo tamaño y la métrica se descomponga sobre las muestras.

source: Read more in the :ref:`User Guide <cross_validation>`.
es_es: Más información en el :ref:`Manual de usuario <cross_validation>`.

source: Parameters
es_es: Parámetros

source: estimator object implementing 'fit' and 'predict'
es_es: objeto estimator que implementa 'fit' y 'predict'

source: The object to use to fit the data.
es_es: El objeto a utilizar para ajustar los datos.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: The data to fit. Can be, for example a list, or an array at least 2d.
es_es: Los datos a ajustar. Puede ser, por ejemplo una lista(list), o un arreglo(array) al menos 2d.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: The target variable to try to predict in the case of supervised learning.
es_es: La variable objetivo que se intenta predecir en el caso del aprendizaje supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,) default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia de :term:`cv` "Group" (por ejemplo, :class:`GroupKFold`).

source: int, cross-validation generator or an iterable, default=None
es_es: entero, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de división de la validación cruzada. Las posibles entradas para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para utilizar la validación cruzada de 5-pliegues por defecto,

source: int, to specify the number of folds in a `(Stratified)KFold`,
es_es: int, para especificar el número de pliegues en un `(Stratified)KFold`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce divisiones (train, test) como arreglos de índices.

source: For int/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas int/None, si el estimador es un clasificador y ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta el :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv`` si None cambió de 3-pliegues a 5-pliegues.

source: Number of jobs to run in parallel. Training the estimator and predicting are parallelized over the cross-validation splits. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. El entrenamiento del estimador y la predicción se paralelizan sobre las divisiones de validación cruzada. ``None`` significa 1 a menos que en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: The verbosity level.
es_es: El nivel de verbosidad.

source: dict, defualt=None
es_es: dict, default=None

source: Parameters to pass to the fit method of the estimator.
es_es: Parámetros para pasar al método fit del estimador.

source: int or str, default='2*n_jobs'
es_es: int o str, default='2*n_jobs'

source: Controls the number of jobs that get dispatched during parallel execution. Reducing this number can be useful to avoid an explosion of memory consumption when more jobs get dispatched than CPUs can process. This parameter can be:
es_es: Controla el número de trabajos que se envían durante la ejecución en paralelo. Reducir este número puede ser útil para evitar una explosión de consumo de memoria cuando se envían más trabajos de los que las CPUs pueden procesar. Este parámetro puede ser:

source: None, in which case all the jobs are immediately created and spawned. Use this for lightweight and fast-running jobs, to avoid delays due to on-demand spawning of the jobs
es_es: None, en cuyo caso todos los trabajos se crean y generan inmediatamente. Utilícelo para trabajos ligeros y de ejecución rápida, para evitar retrasos debidos a la generación de trabajos bajo demanda

source: An int, giving the exact number of total jobs that are spawned
es_es: Un int(entero), que da el número exacto de trabajos totales que se generan

source: A str, giving an expression as a function of n_jobs, as in '2*n_jobs'
es_es: Una str(cadena), que da una expresión como función de n_jobs, como en '2*n_jobs'

source: The method to be invoked by `estimator`.
es_es: El método a ser invocado por `estimator`.

source: Returns
es_es: Devuelve

source: This is the result of calling `method`. Shape:
es_es: Este es el resultado de llamar a `method`. Forma(shape):

source: When `method` is 'predict' and in special case where `method` is 'decision_function' and the target is binary: (n_samples,)
es_es: Cuando `method` es 'predict' y en el caso especial cuando `method` es 'decision_function' y el objetivo es binario: (n_samples,)

source: When `method` is one of {'predict_proba', 'predict_log_proba', 'decision_function'} (unless special case above): (n_samples, n_classes)
es_es: Cuando `method` es uno de {'predict_proba', 'predict_log_proba', 'decision_function'} (a menos que se trate de un caso especial): (n_samples, n_classes)

source: If `estimator` is :term:`multioutput`, an extra dimension 'n_outputs' is added to the end of each shape above.
es_es: Si `estimator` es :term:`multioutput`, se añade una dimensión extra 'n_outputs' al final de cada forma(shape) anterior.

source: Calculate score for each CV split.
es_es: Calcula la puntuación de cada división del CV.

source: Calculate one or more scores and timings for each CV split.
es_es: Calcula una o más puntuaciones y tiempos para cada división de CV.

source: Notes
es_es: Notas

source: In the case that one or more classes are absent in a training portion, a default score needs to be assigned to all instances for that class if ``method`` produces columns per class, as in {'decision_function', 'predict_proba', 'predict_log_proba'}. For ``predict_proba`` this value is 0. In order to ensure finite output, we approximate negative infinity by the minimum finite float value for the dtype in other cases.
es_es: En el caso de que una o más clases estén ausentes en una porción de entrenamiento, es necesario asignar una puntuación predeterminada a todas las instancias para esa clase si ``method`` produce columnas por clase, como en {'decision_function', 'predict_proba', 'predict_log_proba'}. Para ``predict_proba`` este valor es 0. Para asegurar una salida finita, aproximamos el infinito negativo por el mínimo valor de punto flotante finito para el dtype en otros casos.

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.model_selection.cross_val_predict``
es_es: Ejemplos utilizando ``sklearn.model_selection.cross_val_predict``
