Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.RandomizedSearchCV.po
Languages: es_es

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Returns
es_es: Devuelve

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros se asignan a sus valores.

source: Only available if the underlying estimator implements ``inverse_transform`` and ``refit=True``.
es_es: Sólo está disponible si el estimador subyacente implementa ``inverse_transform`` y ``refit=True``.

source: Only available if ``refit=True`` and the underlying estimator supports ``predict``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente soporta ``predict``.

source: Only available if ``refit=True`` and the underlying estimator supports ``predict_log_proba``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente soporta ``predict_log_proba``.

source: Only available if ``refit=True`` and the underlying estimator supports ``predict_proba``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente soporta ``predict_proba``.

source: This uses the score defined by ``scoring`` where provided, and the ``best_estimator_.score`` method otherwise.
es_es: Se utiliza la puntuación definida por ``scoring`` cuando se proporciona, y el método ``best_estimator_.score`` en caso contrario.

source: Input data, where n_samples is the number of samples and n_features is the number of features.
es_es: Datos de entrada, donde n_samples es el número de muestras y n_features es el número de características.

source: Only available if ``refit=True`` and the underlying estimator supports ``score_samples``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente soporta ``score_samples``.

source: Data to predict on. Must fulfill input requirements of the underlying estimator.
es_es: Datos para predecir. Deben cumplir los requisitos de entrada del estimador subyacente.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como con objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: Only available if the underlying estimator supports ``transform`` and ``refit=True``.
es_es: Sólo está disponible si el estimador subyacente soporta ``transform`` y ``refit=True``.

source: Examples using ``sklearn.model_selection.RandomizedSearchCV``
es_es: Ejemplos usando ``sklearn.model_selection.RandomizedSearchCV``
