Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.pairwise.cosine_similarity.po
Languages: es_es

source: Compute cosine similarity between samples in X and Y.
es_es: Calcula la similitud coseno entre las muestras en X y Y.

source: Cosine similarity, or the cosine kernel, computes similarity as the normalized dot product of X and Y:
es_es: La similitud coseno, o el kernel del coseno, calcula la similitud como el producto punto normalizado de X y Y:

source: On L2-normalized data, this function is equivalent to linear_kernel.
es_es: En datos normalizados en L2, esta función es equivalente a linear_kernel.

source: Read more in the :ref:`User Guide <cosine_similarity>`.
es_es: Leer más en el :ref:`Manual de Usuario <cosine_similarity>`.

source: Parameters
es_es: Parámetros

source: {ndarray, sparse matrix} of shape (n_samples_X, n_features)
es_es: {ndarray, sparse matrix} de forma (n_samples_X, n_features)

source: Input data.
es_es: Datos de entrada.

source: {ndarray, sparse matrix} of shape (n_samples_Y, n_features), default=None
es_es: {ndarray, sparse matrix} de forma (n_samples_Y, n_features), default=None

source: Input data. If ``None``, the output will be the pairwise similarities between all samples in ``X``.
es_es: Datos de entrada. Si es ``None``, la salida será las similitudes por pares entre todas las muestras en ``X``.

source: Whether to return dense output even when the input is sparse. If ``False``, the output is sparse if both input arrays are sparse.
es_es: Si se devuelve una salida densa incluso cuando la entrada es dispersa. Si es ``False``, la salida es dispersa si ambos arreglos de entrada son dispersos.

source: parameter ``dense_output`` for dense output.
es_es: parámetro ``dense_output`` para salida densa.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples_X, n_samples_Y)
es_es: ndarray de forma (n_samples_X, n_samples_Y)
