Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.mean_poisson_deviance.po
Languages: es_es

source: Mean Poisson deviance regression loss.
es_es: Pérdida de regresión Desviación media de Poisson (mean Poisson deviance regression loss).

source: Read more in the :ref:`User Guide <mean_tweedie_deviance>`.
es_es: Leer más en el :ref:`Manual de Usuario <mean_tweedie_deviance>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Ground truth (correct) target values. Requires y_true >= 0.
es_es: Valores objetivo reales (correctos). Requiere y_true >= 0.

source: Estimated target values. Requires y_pred > 0.
es_es: Valores objetivo estimados. Requiere y_pred > 0.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de muestras.

source: Returns
es_es: Devuelve

source: A non-negative floating point value (the best value is 0.0).
es_es: Un valor de punto flotante no negativo (el mejor valor es 0.0).

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.metrics.mean_poisson_deviance``
es_es: Ejemplos utilizando ``sklearn.metrics.mean_poisson_deviance``
