Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.zero_one_loss.po
Languages: es_es

source: Zero-one classification loss.
es_es: Pérdida de clasificación cero-uno.

source: If normalize is ``True``, return the fraction of misclassifications (float), else it returns the number of misclassifications (int). The best performance is 0.
es_es: Si normalize es ``True``, devuelve la fracción de clasificaciones incorrectas (float), sino devuelve el número de clasificaciones incorrectas (int). El mejor rendimiento es 0.

source: Read more in the :ref:`User Guide <zero_one_loss>`.
es_es: Lee más en el :ref:`Manual de Usuario <zero_one_loss>`.

source: Parameters
es_es: Parámetros

source: 1d array-like, or label indicator array / sparse matrix
es_es: 1d array-like, o arreglo indicador de etiqueta / matriz dispersa

source: Ground truth (correct) labels.
es_es: Etiquetas de verdad fundamental (correctas).

source: Predicted labels, as returned by a classifier.
es_es: Etiquetas predichas, devueltas por un clasificador.

source: If ``False``, return the number of misclassifications. Otherwise, return the fraction of misclassifications.
es_es: Si es ``False``, devuelve el número de clasificaciones incorrectas. De lo contrario, devuelve la fracción de clasificaciones incorrectas.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: Returns
es_es: Devuelve

source: float or int,
es_es: float o int,

source: If ``normalize == True``, return the fraction of misclassifications (float), else it returns the number of misclassifications (int).
es_es: Si ``normalize == True``, devuelve la fracción de clasificaciones incorrectas (float), de lo contrario devuelve el número de clasificaciones incorrectas (int).

source: Notes
es_es: Notas

source: In multilabel classification, the zero_one_loss function corresponds to the subset zero-one loss: for each sample, the entire set of labels must be correctly predicted, otherwise the loss for that sample is equal to one.
es_es: En la clasificación multietiqueta, la función zero_one_loss corresponde al subconjunto pérdida de cero a uno: para cada muestra, todo el conjunto de etiquetas debe predecirse correctamente, de lo contrario la pérdida para esa muestra es igual a uno.

source: Examples
es_es: Ejemplos

source: In the multilabel case with binary label indicators:
es_es: En el caso multietiqueta con indicadores de etiqueta binaria:
