Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.cluster.Birch.po
Languages: es_es

source: Implements the Birch clustering algorithm.
es_es: Implementa el algoritmo de conglomerado Birch.

source: It is a memory-efficient, online-learning algorithm provided as an alternative to :class:`MiniBatchKMeans`. It constructs a tree data structure with the cluster centroids being read off the leaf. These can be either the final cluster centroids or can be provided as input to another clustering algorithm such as :class:`AgglomerativeClustering`.
es_es: Se trata de un algoritmo de aprendizaje en línea, eficiente en cuanto a memoria, que se ofrece como alternativa a :class:`MiniBatchKMeans`. Construye una estructura de datos en forma de árbol en la que los centroides de los conglomerados son leídos de la hoja (leaf). Estos pueden ser los centroides de los conglomerados finales o pueden ser proporcionados como entrada a otro algoritmo de conglomerado como :class:`AgglomerativeClustering`.

source: Read more in the :ref:`User Guide <birch>`.
es_es: Más información en el :ref:`Manual de usuario <birch>`.

source: Parameters
es_es: Parámetros

source: The radius of the subcluster obtained by merging a new sample and the closest subcluster should be lesser than the threshold. Otherwise a new subcluster is started. Setting this value to be very low promotes splitting and vice-versa.
es_es: El radio del subgrupo obtenido al fusionar una nueva muestra y el subgrupo más cercano debe ser menor que el threshold. En caso contrario, se crea un nuevo subcluster. Si este valor se establece como muy bajo, se promueve la división (splitting) y viceversa.

source: Maximum number of CF subclusters in each node. If a new samples enters such that the number of subclusters exceed the branching_factor then that node is split into two nodes with the subclusters redistributed in each. The parent subcluster of that node is removed and two new subclusters are added as parents of the 2 split nodes.
es_es: Número máximo de subconglomerados (subclusters) de CF en cada nodo. Si entra una nueva muestra tal que el número de subconglomerados excede el branching_factor entonces ese nodo se divide en dos nodos con los subconglomerados redistribuidos en cada uno. El subconglomerado padre de ese nodo se elimina y se añaden dos nuevos subconglomerados como padres de los 2 nodos divididos.

source: Number of clusters after the final clustering step, which treats the subclusters from the leaves as new samples.
es_es: Número de conglomerados después del paso final de la conglomeración, que trata los subconglomerados de las hojas (leaves) como nuevas muestras.

source: `None` : the final clustering step is not performed and the subclusters are returned as they are.
es_es: `None` : el paso final de la conglomeración no se realiza y los subconglomerados son retornados en su estado actual.

source: :mod:`sklearn.cluster` Estimator : If a model is provided, the model is fit treating the subclusters as new samples and the initial data is mapped to the label of the closest subcluster.
es_es: :mod:`sklearn.cluster` Estimador : Si se proporciona un modelo, éste se ajusta tratando los subclomerados como nuevas muestras y los datos iniciales se asignan a la etiqueta del subclomerado más cercano.

source: `int` : the model fit is :class:`AgglomerativeClustering` with `n_clusters` set to be equal to the int.
es_es: `int` : el ajuste del modelo es :class:`AgglomerativeClustering` con `n_clusters` configurado para ser igual al int.

source: Whether or not to compute labels for each fit.
es_es: Si se deben calcular o no las etiquetas para cada ajuste.

source: Whether or not to make a copy of the given data. If set to False, the initial data will be overwritten.
es_es: Si se hace o no una copia de los datos dados. Si se establece en False, se sobrescribirán los datos iniciales.

source: Attributes
es_es: Atributos

source: Root of the CFTree.
es_es: Raíz (root) del CFTree.

source: Start pointer to all the leaves.
es_es: Puntero de inicio de todas las hojas (leaves).

source: Centroids of all subclusters read directly from the leaves.
es_es: Los centroides de todos los subconglomerados que se leen directamente de las hojas.

source: Labels assigned to the centroids of the subclusters after they are clustered globally.
es_es: Etiquetas asignadas a los centroides de los subconglomerados después de ser conglomerados (clustered) globalmente.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: Array of labels assigned to the input data. if partial_fit is used instead of fit, they are assigned to the last batch of data.
es_es: Arreglo de etiquetas asignadas a los datos de entrada. Si se utiliza partial_fit en lugar de fit, las etiquetas se asignan al último lote de datos.

source: Alternative implementation that does incremental updates of the centers' positions using mini-batches.
es_es: Implementación alternativa que realiza actualizaciones incrementales de las posiciones de los centros utilizando minilotes.

source: Notes
es_es: Notas

source: The tree data structure consists of nodes with each node consisting of a number of subclusters. The maximum number of subclusters in a node is determined by the branching factor. Each subcluster maintains a linear sum, squared sum and the number of samples in that subcluster. In addition, each subcluster can also have a node as its child, if the subcluster is not a member of a leaf node.
es_es: La estructura de datos en forma de árbol se compone de nodos y cada uno de ellos consta de un número de subconglomerados (subclusters). El número máximo de subconglomerados en un nodo viene determinado por el factor de ramificación (branching factor). Cada subconglomerado mantiene una suma lineal, una suma cuadrada y el número de muestras en ese subconglomerado. Además, cada subconglomerado puede tener un nodo como hijo, si el subconglomerado no es miembro de un nodo hoja.

source: For a new point entering the root, it is merged with the subcluster closest to it and the linear sum, squared sum and the number of samples of that subcluster are updated. This is done recursively till the properties of the leaf node are updated.
es_es: Para que un nuevo punto entre en la raíz, se debe fusionar con el subconglomerado más cercano a él y se actualizan la suma lineal, la suma cuadrada y el número de muestras de ese subconglomerado. Esto se hace recursivamente hasta que se actualizan las propiedades del nodo hoja.

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Build a CF Tree for the input data.
es_es: Construye un árbol de CF para los datos de entrada.

source: Perform clustering on `X` and returns cluster labels.
es_es: Realiza el conglomerado en `X` y devuelve las etiquetas de los conglomerados.

source: Fit to data, then transform it.
es_es: Se ajustan los datos y luego se transforman.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Online learning.
es_es: Aprendizaje en línea.

source: Predict data using the ``centroids_`` of subclusters.
es_es: Predecir los datos utilizando los ``centroids_`` de los subconglomerados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Transform X into subcluster centroids dimension.
es_es: Transforma X en la dimensión de los centroides de los subconglomerados.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Input data.
es_es: Datos de entrada.

source: Not used, present here for API consistency by convention.
es_es: No se utiliza, se presenta aquí para la coherencia de la API por convención.

source: Returns
es_es: Salida

source: Fitted estimator.
es_es: Estimador ajustado.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Not used, present for API consistency by convention.
es_es: No se utiliza, está presente para la coherencia de la API por convención.

source: ndarray of shape (n_samples,), dtype=np.int64
es_es: ndarray de forma (n_samples,), dtype=np.int64

source: Cluster labels.
es_es: Etiquetas de conglomerado.

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (Target values). Se usa None para las transformaciones no supervisadas.

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: ndarray array de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros asignados a sus valores.

source: Online learning. Prevents rebuilding of CFTree from scratch.
es_es: Aprendizaje en línea. Evita que se reconstruya el CFTree desde cero.

source: {array-like, sparse matrix} of shape (n_samples, n_features), default=None
es_es: {array-like, sparse matrix} de forma (n_samples, n_features), default=None

source: Input data. If X is not provided, only the global clustering step is done.
es_es: Datos de entrada. Si no se proporciona X, sólo se realiza el paso de conglomerado global.

source: Avoid computation of the row norms of X.
es_es: Evita el cálculo de las normas de fila (row norms) de X.

source: ndarray of shape(n_samples,)
es_es: ndarray de forma(n_samples,)

source: Labelled data.
es_es: Datos etiquetados.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: Each dimension represents the distance from the sample point to each cluster centroid.
es_es: Cada dimensión representa la distancia del punto de la muestra a cada centroide del conglomerado.

source: {array-like, sparse matrix} of shape (n_samples, n_clusters)
es_es: {array-like, sparse matrix} de forma (n_samples, n_clusters)

source: Transformed data.
es_es: Datos transformados.
