Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.v_measure_score.po
Languages: es_es

source: V-measure cluster labeling given a ground truth.
es_es: Etiquetado de conglomerados con medida V dada una verdad fundamental.

source: This score is identical to :func:`normalized_mutual_info_score` with the ``'arithmetic'`` option for averaging.
es_es: Esta puntuación es idéntica a la de :func:`normalized_mutual_info_score` con la opción ``'arithmetic'`` para promediar.

source: The V-measure is the harmonic mean between homogeneity and completeness::
es_es: La medida V es la media armónica entre la homogeneidad y la completitud::

source: This metric is independent of the absolute values of the labels: a permutation of the class or cluster label values won't change the score value in any way.
es_es: Está métrica es independiente de los valores absolutos de las etiquetas: una permutación de la clase o de los valores de las etiquetas de la clase o del conglomerado no cambiará de ninguna manera el valor de la puntuación.

source: This metric is furthermore symmetric: switching ``label_true`` with ``label_pred`` will return the same score value. This can be useful to measure the agreement of two independent label assignments strategies on the same dataset when the real ground truth is not known.
es_es: Esta métrica es además simétrica: si se cambia ``label_true`` por ``label_pred`` devolverá el mismo valor de puntuación. Esto puede ser útil para medir el acuerdo de dos estrategias independientes de asignación de etiquetas en el mismo conjunto de datos cuando se desconoce la verdad fundamental real.

source: Read more in the :ref:`User Guide <homogeneity_completeness>`.
es_es: Lee más en el :ref:`Manual de usuario <homogeneity_completeness>`.

source: Parameters
es_es: Parámetros

source: int array, shape = [n_samples]
es_es: arreglo de int, forma = [n_samples]

source: ground truth class labels to be used as a reference
es_es: etiquetas de clase de verdad fundamental que se utilizarán como referencia

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: cluster labels to evaluate
es_es: etiquetas de conglomerados para evaluar

source: Ratio of weight attributed to ``homogeneity`` vs ``completeness``. If ``beta`` is greater than 1, ``completeness`` is weighted more strongly in the calculation. If ``beta`` is less than 1, ``homogeneity`` is weighted more strongly.
es_es: Razón de la ponderación atribuida a ``homogeneity`` vs ``completeness``. Si ``beta`` es mayor que 1, ``completeness`` tiene más ponderación en el cálculo. Si ``beta`` es menor que 1, ``homogeneity`` tiene más ponderación.

source: Returns
es_es: Devuelve

source: score between 0.0 and 1.0. 1.0 stands for perfectly complete labeling
es_es: puntuación entre 0.0 y 1.0. significa etiquetado perfectamente completo

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Perfect labelings are both homogeneous and complete, hence have score 1.0::
es_es: Los etiquetados perfectos son homogéneos y completos, por lo que tienen una puntuación de 1,0::

source: Labelings that assign all classes members to the same clusters are complete be not homogeneous, hence penalized::
es_es: Los etiquetados que asignan todos los miembros de las clases a los mismos conglomerados son completos no homogéneos, por lo que se penalizan::

source: Labelings that have pure clusters with members coming from the same classes are homogeneous but un-necessary splits harms completeness and thus penalize V-measure as well::
es_es: Los etiquetados que tienen conglomerados puros con miembros procedentes de las mismas clases son homogéneos, pero las divisiones innecesarias perjudican la exhaustividad y, por tanto, penalizan también la medida V::

source: If classes members are completely split across different clusters, the assignment is totally incomplete, hence the V-Measure is null::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente incompleta, por tanto la Medida V es nula::

source: Clusters that include samples from totally different classes totally destroy the homogeneity of the labeling, hence::
es_es: Los conglomerados o agrupaciones que incluyen muestras de clases totalmente diferentes destruyen totalmente la homogeneidad del etiquetado, por tanto::

source: Examples using ``sklearn.metrics.v_measure_score``
es_es: Ejemplos utilizando ``sklearn.metrics.v_measure_score``
