Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.linear_model.LogisticRegressionCV.po
Languages: es_es

source: Logistic Regression CV (aka logit, MaxEnt) classifier.
es_es: Clasificador de Regresión Logística CV (también conocido como logit, MaxEnt).

source: See glossary entry for :term:`cross-validation estimator`.
es_es: Ver entrada del glosario para :term:`estimador de validación cruzada`.

source: This class implements logistic regression using liblinear, newton-cg, sag of lbfgs optimizer. The newton-cg, sag and lbfgs solvers support only L2 regularization with primal formulation. The liblinear solver supports both L1 and L2 regularization, with a dual formulation only for the L2 penalty. Elastic-Net penalty is only supported by the saga solver.
es_es: Esta clase implementa la regresión logística utilizando el optimizador liblinear, newton-cg, sag o lbfgs. Los solucionadores newton-cg, sag y lbfgs sólo soportan la regularización L2 con formulación primal. El solucionador liblinear soporta tanto la regularización L1 como la L2, con una formulación dual sólo para la penalización L2. La penalización Elastic-Net sólo es compatible con el solucionador saga.

source: For the grid of `Cs` values and `l1_ratios` values, the best hyperparameter is selected by the cross-validator :class:`~sklearn.model_selection.StratifiedKFold`, but it can be changed using the :term:`cv` parameter. The 'newton-cg', 'sag', 'saga' and 'lbfgs' solvers can warm-start the coefficients (see :term:`Glossary<warm_start>`).
es_es: Para la cuadrícula de valores `Cs` y `l1_ratios`, el mejor hiperparámetro es seleccionado por el validador cruzado :class:`~sklearn.model_selection.StratifiedKFold`, pero puede ser cambiado usando el parámetro :term:`cv`. Los solucionadores 'newton-cg', 'sag', 'saga' y 'lbfgs' pueden arrancar en caliente (warm-start) los coeficientes (ver :term:`Glosario <warm_start>`).

source: Read more in the :ref:`User Guide <logistic_regression>`.
es_es: Leer más en el :ref:`Manual de Usuario <logistic_regression>`.

source: Parameters
es_es: Parámetros

source: int or list of floats, default=10
es_es: int o lista de flotantes, default=10

source: Each of the values in Cs describes the inverse of regularization strength. If Cs is as an int, then a grid of Cs values are chosen in a logarithmic scale between 1e-4 and 1e4. Like in support vector machines, smaller values specify stronger regularization.
es_es: Cada uno de los valores en Cs describe el inverso de la fuerza de regularización. Si Cs es como un int, entonces se elige una cuadrícula de valores Cs en una escala logarítmica entre 1e-4 y 1e4. Como en las máquinas de vectores de soporte, los valores más pequeños especifican una regularización más fuerte.

source: Specifies if a constant (a.k.a. bias or intercept) should be added to the decision function.
es_es: Especifica si una constante (también conocida como sesgo o intercepto) se debe añadir a la función de decisión.

source: int or cross-validation generator, default=None
es_es: int o generador de validación cruzada, default=None

source: The default cross-validation generator used is Stratified K-Folds. If an integer is provided, then it is the number of folds used. See the module :mod:`sklearn.model_selection` module for the list of possible cross-validation objects.
es_es: El generador de validación cruzada utilizado por defecto es Stratified K-Folds. Si se proporciona un número entero, entonces es el número de partes (folds) utilizadas. Ver el módulo :mod:`sklearn.model_selection` para la lista de posibles objetos de validación cruzada.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv``, si es None, cambió de 3 partes a 5 partes.

source: Dual or primal formulation. Dual formulation is only implemented for l2 penalty with liblinear solver. Prefer dual=False when n_samples > n_features.
es_es: Formulación dual o primal. La formulación dual sólo se implementa para la penalización l2 con el solucionador liblinear. Preferir dual=False cuando n_samples > n_features.

source: Used to specify the norm used in the penalization. The 'newton-cg', 'sag' and 'lbfgs' solvers support only l2 penalties. 'elasticnet' is only supported by the 'saga' solver.
es_es: Utilizado para especificar la norma usada en la penalización. Los solucionadores 'newton-cg', 'sag' y 'lbfgs' sólo soportan penalizaciones l2. 'elasticnet' sólo es soportado por el solucionador 'saga'.

source: str or callable, default=None
es_es: cadena de caracteres o invocable, default=None

source: A string (see model evaluation documentation) or a scorer callable object / function with signature ``scorer(estimator, X, y)``. For a list of scoring functions that can be used, look at :mod:`sklearn.metrics`. The default scoring option used is 'accuracy'.
es_es: Una cadena (ver la documentación sobre la evaluación del modelo) o un objeto / función de puntuación invocable con la firma ``scorer(estimator, X, y)``. Para obtener una lista de funciones de puntuación que pueden ser usadas, consulta :mod:`sklearn.metrics`. La opción de puntuación utilizada por defecto es 'accuracy'.

source: Algorithm to use in the optimization problem.
es_es: Algoritmo a utilizar en el problema de optimización.

source: For small datasets, 'liblinear' is a good choice, whereas 'sag' and 'saga' are faster for large ones.
es_es: Para conjuntos de datos pequeños, 'liblinear' es una buena elección, mientras que 'sag' y 'saga' son más rápidos para los grandes.

source: For multiclass problems, only 'newton-cg', 'sag', 'saga' and 'lbfgs' handle multinomial loss; 'liblinear' is limited to one-versus-rest schemes.
es_es: Para los problemas multiclase, sólo 'newton-cg', 'sag', 'saga' y 'lbfgs' manejan la pérdida multinomial; 'liblinear' se limita a los esquemas de uno contra el resto.

source: 'newton-cg', 'lbfgs' and 'sag' only handle L2 penalty, whereas 'liblinear' and 'saga' handle L1 penalty.
es_es: 'newton-cg', 'lbfgs' y 'sag' sólo manejan la penalización L2, mientras que 'liblinear' y 'saga' manejan la penalización L1.

source: 'liblinear' might be slower in LogisticRegressionCV because it does not handle warm-starting.
es_es: 'liblinear' podría ser más lento en LogisticRegressionCV porque no maneja el arranque en caliente (warm-starting).

source: Note that 'sag' and 'saga' fast convergence is only guaranteed on features with approximately the same scale. You can preprocess the data with a scaler from sklearn.preprocessing.
es_es: Ten en cuenta que la convergencia rápida de 'sag' y 'saga' sólo está garantizada en características con aproximadamente la misma escala. Puedes preprocesar los datos con un escalador de sklearn.preprocessing.

source: Stochastic Average Gradient descent solver.
es_es: Solucionador de descenso de Gradiente Medio Estocástico (Stochastic Average Gradient descent solver).

source: SAGA solver.
es_es: Solucionador SAGA.

source: Tolerance for stopping criteria.
es_es: Tolerancia para el criterio de parada.

source: Maximum number of iterations of the optimization algorithm.
es_es: Número máximo de iteraciones del algoritmo de optimización.

source: dict or 'balanced', default=None
es_es: diccionario o 'balanced', default=None

source: Weights associated with classes in the form ``{class_label: weight}``. If not given, all classes are supposed to have weight one.
es_es: Ponderaciones asociadas a las clases de la forma ``{class_label: weight}``. Si no se da, se supone que todas las clases tienen ponderación uno.

source: The "balanced" mode uses the values of y to automatically adjust weights inversely proportional to class frequencies in the input data as ``n_samples / (n_classes * np.bincount(y))``.
es_es: El modo "balanced" utiliza los valores de y para ajustar automáticamente las ponderaciones de forma inversamente proporcional a las frecuencias de las clases en los datos de entrada como ``n_samples / (n_classes * np.bincount(y))``.

source: Note that these weights will be multiplied with sample_weight (passed through the fit method) if sample_weight is specified.
es_es: Ten en cuenta que estas ponderaciones se multiplicarán por sample_weight (pasado por el método de ajuste) si se especifica sample_weight.

source: Number of CPU cores used during the cross-validation loop. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de núcleos de CPU utilizados durante el bucle de validación cruzada. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa usar todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: For the 'liblinear', 'sag' and 'lbfgs' solvers set verbose to any positive number for verbosity.
es_es: Para los solucionadores 'liblinear', 'sag' y 'lbfgs' establece verbose a cualquier número positivo para la verbosidad.

source: If set to True, the scores are averaged across all folds, and the coefs and the C that corresponds to the best score is taken, and a final refit is done using these parameters. Otherwise the coefs, intercepts and C that correspond to the best scores across folds are averaged.
es_es: Si se establece en True, las puntuaciones se promedian entre todas las partes, y se toman los coefs y la C correspondientes a la mejor puntuación, y se hace un reajuste final utilizando estos parámetros. En caso contrario, se promedian los coefs, interceptos y C correspondientes a las mejores puntuaciones en todas las partes.

source: Useful only when the solver 'liblinear' is used and self.fit_intercept is set to True. In this case, x becomes [x, self.intercept_scaling], i.e. a "synthetic" feature with constant value equal to intercept_scaling is appended to the instance vector. The intercept becomes ``intercept_scaling * synthetic_feature_weight``.
es_es: Útil sólo cuando se usa el solucionador 'liblinear' y self.fit_intercept se establece en True. En este caso, x se convierte en [x, self.intercept_scaling], es decir, una característica "sintética" con valor constante igual a intercept_scaling se añade al vector de la instancia. El intercepto se convierte en ``intercept_scaling * synthetic_feature_weight``.

source: Note! the synthetic feature weight is subject to l1/l2 regularization as all other features. To lessen the effect of regularization on synthetic feature weight (and therefore on the intercept) intercept_scaling has to be increased.
es_es: Nota: la ponderación de la característica sintética está sujeta a la regularización l1/l2 como todas las demás características. Para disminuir el efecto de la regularización en la ponderación de la característica sintética (y por lo tanto en el intercepto) el intercept_scaling tiene que aumentarse.

source: If the option chosen is 'ovr', then a binary problem is fit for each label. For 'multinomial' the loss minimised is the multinomial loss fit across the entire probability distribution, *even when the data is binary*. 'multinomial' is unavailable when solver='liblinear'. 'auto' selects 'ovr' if the data is binary, or if solver='liblinear', and otherwise selects 'multinomial'.
es_es: Si la opción elegida es 'ovr', entonces se ajusta un problema binario para cada etiqueta. Para 'multinomial' la pérdida minimizada es la pérdida multinomial ajustada a través de toda la distribución de probabilidad, *incluso cuando los datos son binarios*. 'multinomial' no está disponible cuando solver='liblinear'. auto' selecciona 'ovr' si los datos son binarios, o si solver='liblinear', y en caso contrario selecciona 'multinomial'.

source: Stochastic Average Gradient descent solver for 'multinomial' case.
es_es: Solucionador de descenso de Gradiente Medio Estocástico para el caso 'multinomial'.

source: Default changed from 'ovr' to 'auto' in 0.22.
es_es: Por defecto cambió de 'ovr' a 'auto' en 0.22.

source: int, RandomState instance, default=None
es_es: entero, instancia de RandomState, default=None

source: Used when `solver='sag'`, 'saga' or 'liblinear' to shuffle the data. Note that this only applies to the solver and not the cross-validation generator. See :term:`Glossary <random_state>` for details.
es_es: Utilizado cuando `solver='sag'`, 'saga' o 'liblinear' para revolver los datos. Ten en cuenta que esto sólo se aplica al solucionador y no al generador de validación cruzada. Ver :term:`Glosario <random_state>` para obtener detalles.

source: list of float, default=None
es_es: lista de flotantes, default=None

source: The list of Elastic-Net mixing parameter, with ``0 <= l1_ratio <= 1``. Only used if ``penalty='elasticnet'``. A value of 0 is equivalent to using ``penalty='l2'``, while 1 is equivalent to using ``penalty='l1'``. For ``0 < l1_ratio <1``, the penalty is a combination of L1 and L2.
es_es: La lista del parámetro de mezcla de Elastic-Net, con ``0 < l1_ratio <= 1``. Sólo se utiliza si ``penalty='elasticnet'``. Un valor de 0 es equivalente a utilizar ``penalty='l2'``, mientras que 1 es equivalente a utilizar ``penalty='l1'``. Para ``0 < l1_ratio < 1``, la penalización es una combinación de L1 y L2.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_classes, )
es_es: ndarray de forma (n_classes, )

source: A list of class labels known to the classifier.
es_es: Una lista de etiquetas de clase conocidas por el clasificador.

source: ndarray of shape (1, n_features) or (n_classes, n_features)
es_es: ndarray de forma (1, n_features) o (n_classes, n_features)

source: Coefficient of the features in the decision function.
es_es: Coeficiente de las características en la función de decisión.

source: `coef_` is of shape (1, n_features) when the given problem is binary.
es_es: `coef_` es de forma (1, n_features) cuando el problema dado es binario.

source: ndarray of shape (1,) or (n_classes,)
es_es: ndarray de forma (1,) o (n_classes,)

source: Intercept (a.k.a. bias) added to the decision function.
es_es: Intercepto (también conocido como sesgo) añadido a la función de decisión.

source: If `fit_intercept` is set to False, the intercept is set to zero. `intercept_` is of shape(1,) when the problem is binary.
es_es: Si `fit_intercept` se establece en False, el intercepto se establece en cero. `intercept_` es de forma (1,) cuando el problema es binario.

source: ndarray of shape (n_cs)
es_es: ndarray de forma (n_cs)

source: Array of C i.e. inverse of regularization parameter values used for cross-validation.
es_es: Arreglo de C, es decir, la inversa de los valores de los parámetros de regularización utilizados para la validación cruzada.

source: ndarray of shape (n_l1_ratios)
es_es: ndarray de forma (n_l1_ratios)

source: Array of l1_ratios used for cross-validation. If no l1_ratio is used (i.e. penalty is not 'elasticnet'), this is set to ``[None]``
es_es: Arreglo de l1_ratios utilizados para la validación cruzada. Si no se utiliza l1_ratio (es decir, la penalización no es 'elasticnet'), se establece como ``[None]``

source: ndarray of shape (n_folds, n_cs, n_features) or (n_folds, n_cs, n_features + 1)
es_es: ndarray de forma (n_folds, n_cs, n_features) o (n_folds, n_cs, n_features + 1)

source: dict with classes as the keys, and the path of coefficients obtained during cross-validating across each fold and then across each Cs after doing an OvR for the corresponding class as values. If the 'multi_class' option is set to 'multinomial', then the coefs_paths are the coefficients corresponding to each class. Each dict value has shape ``(n_folds, n_cs, n_features)`` or ``(n_folds, n_cs, n_features + 1)`` depending on whether the intercept is fit or not. If ``penalty='elasticnet'``, the shape is ``(n_folds, n_cs, n_l1_ratios_, n_features)`` or ``(n_folds, n_cs, n_l1_ratios_, n_features + 1)``.
es_es: Diccionario con las clases como claves, y la ruta de los coeficientes obtenidos durante la validación cruzada a través de cada parte (fold) y luego a través de cada Cs después de hacer un OvR para la clase correspondiente como valores. Si la opción 'multi_class' se establece como 'multinomial', entonces los coefs_paths son los coeficientes correspondientes a cada clase. Cada valor del diccionario tiene forma ``(n_folds, n_cs, n_features)`` o ``(n_folds, n_cs, n_features + 1)`` dependiendo de si el intercepto se ajusta o no. Si ``penalty='elasticnet'``, la forma es ``(n_folds, n_cs, n_l1_ratios_, n_features)`` o ``(n_folds, n_cs, n_l1_ratios_, n_features + 1)``.

source: dict with classes as the keys, and the values as the grid of scores obtained during cross-validating each fold, after doing an OvR for the corresponding class. If the 'multi_class' option given is 'multinomial' then the same scores are repeated across all classes, since this is the multinomial class. Each dict value has shape ``(n_folds, n_cs`` or ``(n_folds, n_cs, n_l1_ratios)`` if ``penalty='elasticnet'``.
es_es: Diccionario con las clases como claves, y los valores como la cuadrícula de puntuaciones obtenidas durante la validación cruzada de cada parte (fold), después de hacer un OvR para la clase correspondiente. Si la opción 'multi_class' dada es 'multinomial' entonces las mismas puntuaciones se repiten en todas las clases, ya que se trata de la clase multinomial. Cada valor del diccionario tiene forma ``(n_folds, n_cs`` o ``(n_folds, n_cs, n_l1_ratios)`` si ``penalty='elasticnet'``.

source: ndarray of shape (n_classes,) or (n_classes - 1,)
es_es: ndarray de forma (n_classes,) o (n_classes - 1,)

source: Array of C that maps to the best scores across every class. If refit is set to False, then for each class, the best C is the average of the C's that correspond to the best scores for each fold. `C_` is of shape(n_classes,) when the problem is binary.
es_es: Arreglo de C que se mapea a las mejores puntuaciones de cada clase. Si refit se establece en False, entonces para cada clase, la mejor C es la media de las C que corresponden a las mejores puntuaciones para cada parte. `C_` es de forma (n_classes,) cuando el problema es binario.

source: Array of l1_ratio that maps to the best scores across every class. If refit is set to False, then for each class, the best l1_ratio is the average of the l1_ratio's that correspond to the best scores for each fold. `l1_ratio_` is of shape(n_classes,) when the problem is binary.
es_es: Arreglo de l1_ratio que se mapea a las mejores puntuaciones de cada clase. Si refit se establece en False, entonces para cada clase, el mejor l1_ratio es el promedio de los l1_ratio que corresponden a las mejores puntuaciones para cada parte. `l1_ratio_` es de forma (n_classes,) cuando el problema es binario.

source: ndarray of shape (n_classes, n_folds, n_cs) or (1, n_folds, n_cs)
es_es: ndarray de forma (n_classes, n_folds, n_cs) o (1, n_folds, n_cs)

source: Actual number of iterations for all classes, folds and Cs. In the binary or multinomial cases, the first dimension is equal to 1. If ``penalty='elasticnet'``, the shape is ``(n_classes, n_folds, n_cs, n_l1_ratios)`` or ``(1, n_folds, n_cs, n_l1_ratios)``.
es_es: Número real de iteraciones para todas las clases, partes y Cs. En los casos binarios o multinomiales, la primera dimensión es igual a 1. Si ``penalty='elasticnet'``, la forma es ``(n_classes, n_folds, n_cs, n_l1_ratios)`` o ``(1, n_folds, n_cs, n_l1_ratios)``.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Predict confidence scores for samples.
es_es: Predice las puntuaciones de confianza de las muestras.

source: Convert coefficient matrix to dense array format.
es_es: Convierte la matriz de coeficientes en formato de arreglo denso.

source: Fit the model according to the given training data.
es_es: Ajusta el modelo según los datos de entrenamiento dados.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Predict class labels for samples in X.
es_es: Predice las etiquetas de clase para las muestras en X.

source: Predict logarithm of probability estimates.
es_es: Predice el logaritmo de las estimaciones de probabilidad.

source: Probability estimates.
es_es: Estimaciones de probabilidad.

source: Returns the score using the `scoring` option on the given test data and labels.
es_es: Devuelve la puntuación utilizando la opción `scoring` en los datos de la prueba y las etiquetas dadas.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Convert coefficient matrix to sparse format.
es_es: Convierte la matriz de coeficientes en formato disperso.

source: The confidence score for a sample is proportional to the signed distance of that sample to the hyperplane.
es_es: La puntuación de confianza de una muestra es proporcional a la distancia con signo de esa muestra al hiperplano.

source: array-like or sparse matrix, shape (n_samples, n_features)
es_es: array-like o matriz dispersa, forma (n_samples, n_features)

source: Samples.
es_es: Muestras.

source: Returns
es_es: Devuelve

source: Confidence scores per (sample, class) combination. In the binary case, confidence score for self.classes_[1] where >0 means this class would be predicted.
es_es: Puntuaciones de confianza por combinación (sample, class). En el caso binario, la puntuación de confianza para self.classes_[1] donde >0 significa que esta clase sería predicha.

source: Converts the ``coef_`` member (back) to a numpy.ndarray. This is the default format of ``coef_`` and is required for fitting, so calling this method is only required on models that have previously been sparsified; otherwise, it is a no-op.
es_es: Convierte el miembro ``coef_`` (de vuelta) en un numpy.ndarray. Este es el formato predeterminado de ``coef_`` y se requiere para el ajuste, por lo que llamar a este método sólo es necesario en los modelos que han sido previamente dispersados (sparsified); de lo contrario, es un no-op.

source: Fitted estimator.
es_es: Estimador ajustado.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Training vector, where n_samples is the number of samples and n_features is the number of features.
es_es: Vector de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Target vector relative to X.
es_es: Vector objetivo relativo a X.

source: array-like of shape (n_samples,) default=None
es_es: array-like de forma (n_samples,) default=None

source: Array of weights that are assigned to individual samples. If not provided, then each sample is given unit weight.
es_es: Arreglo de ponderaciones que se asignan a las muestras individuales. Si no se proporciona, entonces cada muestra recibe una ponderación unitaria.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: array, shape [n_samples]
es_es: array, forma [n_samples]

source: Predicted class label per sample.
es_es: Etiqueta de clase predicha por muestra.

source: The returned estimates for all classes are ordered by the label of classes.
es_es: Las estimaciones devueltas para todas las clases están ordenadas por la etiqueta de las clases.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Vector to be scored, where `n_samples` is the number of samples and `n_features` is the number of features.
es_es: Vector a ser puntuado, donde `n_samples` es el número de muestras y `n_features` es el número de características.
