Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.train_test_split.po
Languages: es_es

source: Split arrays or matrices into random train and test subsets
es_es: Separar arreglos o matrices en subconjuntos aleatorios de entrenamiento y prueba

source: Quick utility that wraps input validation and ``next(ShuffleSplit().split(X, y))`` and application to input data into a single call for splitting (and optionally subsampling) data in a oneliner.
es_es: Utilidad rápida que envuelve la validación de la entrada y ``next(ShuffleSplit().split(X, y))`` y la aplicación a los datos de entrada en una sola llamada para separar (y opcionalmente submuestrear) los datos en una línea.

source: Read more in the :ref:`User Guide <cross_validation>`.
es_es: Más información en el :ref:`Manual de usuario <cross_validation>`.

source: Parameters
es_es: Parámetros

source: sequence of indexables with same length / shape[0]
es_es: secuencia de indexables con la misma longitud / forma[0]

source: Allowed inputs are lists, numpy arrays, scipy-sparse matrices or pandas dataframes.
es_es: Las entradas permitidas son listas, arreglos numpy, matrices scipy-sparse o dataframes pandas.

source: float or int, default=None
es_es: float o int, default=None

source: If float, should be between 0.0 and 1.0 and represent the proportion of the dataset to include in the test split. If int, represents the absolute number of test samples. If None, the value is set to the complement of the train size. If ``train_size`` is also None, it will be set to 0.25.
es_es: Si es de punto flotante (float), debe estar entre 0,0 y 1,0 y representa la proporción del conjunto de datos que se incluirá en la división de la prueba. Si es int, representa el número absoluto de muestras de prueba. Si es None, el valor se establece como el complemento del tamaño del tren. Si ``train_size`` también es None, se establecerá en 0,25.

source: If float, should be between 0.0 and 1.0 and represent the proportion of the dataset to include in the train split. If int, represents the absolute number of train samples. If None, the value is automatically set to the complement of the test size.
es_es: Si es de punto flotante (float), debe estar entre 0,0 y 1,0 y representa la proporción del conjunto de datos que se va a incluir en la división del tren. Si es int, representa el número absoluto de muestras de entrenamiento. Si es None, el valor se establece automáticamente en el complemento del tamaño de la prueba.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Controls the shuffling applied to the data before applying the split. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Controla el barajado aplicado a los datos antes de aplicar la división. Pase un int para una salida reproducible a través de múltiples llamadas a la función. Véase :term:`Glosario <random_state>`.

source: bool, default=True
es_es: booleano, default=True

source: Whether or not to shuffle the data before splitting. If shuffle=False then stratify must be None.
es_es: Si se barajan o no los datos antes de la división. Si shuffle=False entonces stratify debe ser None.

source: If not None, data is split in a stratified fashion, using this as the class labels. Read more in the :ref:`User Guide <stratification>`.
es_es: Si no es None, los datos se separan de forma estratificada, utilizando esto como las etiquetas de clase. Leer más en la :ref:`Guía del usuario <stratification>`.

source: Returns
es_es: Devuelve

source: list, length=2 * len(arrays)
es_es: lista, longitud=2 * len(arrays)

source: List containing train-test split of inputs.
es_es: Lista que contiene la división de las entradas entre el entrenamiento y la prueba.

source: If the input is sparse, the output will be a ``scipy.sparse.csr_matrix``. Else, output type is the same as the input type.
es_es: Si la entrada es dispersa, la salida será una matriz ``scipy.sparse.csr_matrix``. Si no, el tipo de salida es el mismo que el de entrada.

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.model_selection.train_test_split``
es_es: Ejemplos con ``sklearn.model_selection.train_test_split``
