Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.gaussian_process.kernels.Hyperparameter.po
Languages: es_es

source: A kernel hyperparameter's specification in form of a namedtuple.
es_es: La especificación de un hiperparámetro del núcleo en forma de una tupla con nombre.

source: Attributes
es_es: Atributos

source: The name of the hyperparameter. Note that a kernel using a hyperparameter with name "x" must have the attributes self.x and self.x_bounds
es_es: El nombre del hiperparámetro. Tenga en cuenta que un núcleo que utiliza un hiperparámetro con nombre "x" debe tener los atributos self.x y self.x_bounds

source: The type of the hyperparameter. Currently, only "numeric" hyperparameters are supported.
es_es: El tipo de hiperparámetro. Actualmente, sólo se admiten hiperparámetros "numeric".

source: The lower and upper bound on the parameter. If n_elements>1, a pair of 1d array with n_elements each may be given alternatively. If the string "fixed" is passed as bounds, the hyperparameter's value cannot be changed.
es_es: El límite inferior y superior del parámetro. Si n_elements>1, se puede dar alternativamente un par de arreglos 1d con n_elements cada una. Si se pasa la cadena "fixed" como límite, el valor del hiperparámetro no puede cambiarse.

source: The number of elements of the hyperparameter value. Defaults to 1, which corresponds to a scalar hyperparameter. n_elements > 1 corresponds to a hyperparameter which is vector-valued, such as, e.g., anisotropic length-scales.
es_es: El número de elementos del valor del hiperparámetro. El valor predeterminado es 1, que corresponde a un hiperparámetro escalar. n_elements > 1 corresponde a un hiperparámetro de valor vectorial, como, por ejemplo, las escalas de longitud anisotrópicas.

source: Whether the value of this hyperparameter is fixed, i.e., cannot be changed during hyperparameter tuning. If None is passed, the "fixed" is derived based on the given bounds.
es_es: Si el valor de este hiperparámetro es fijo, es decir, no puede cambiarse durante el ajuste del hiperparámetro. Si se pasa None, el "fixed " se deriva en base a los límites dados.

source: Examples
es_es: Ejemplos

source: We can access each hyperparameter:
es_es: Podemos acceder a cada parámetro:

source: Methods
es_es: Métodos

source: Return number of occurrences of value.
es_es: Devuelve el número de apariciones del valor.

source: Return first index of value.
es_es: Devuelve el primer índice del valor.

source: Call self as a function.
es_es: Llamar a sí mismo como una función.

source: Alias for field number 2
es_es: Alias para el campo número 2

source: Alias for field number 4
es_es: Alias para el campo número 4

source: Raises ValueError if the value is not present.
es_es: Genera un ValueError si el valor no está presente.

source: Alias for field number 3
es_es: Alias para el campo número 3

source: Alias for field number 0
es_es: Alias para el campo número 0

source: Alias for field number 1
es_es: Alias para el campo número 1

source: Examples using ``sklearn.gaussian_process.kernels.Hyperparameter``
es_es: Ejemplos usando ``sklearn.gaussian_process.kernels.Hyperparameter``
