Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.load_files.po
Languages: es_es

source: Load text files with categories as subfolder names.
es_es: Carga archivos de texto con categorías como nombres de subcarpetas.

source: Individual samples are assumed to be files stored a two levels folder structure such as the following:
es_es: Se asume que las muestras individuales son archivos almacenados en una estructura de carpetas de dos niveles como la siguiente:

source: container_folder/
es_es: carpeta_contenedora/

source: category_1_folder/
es_es: carpeta_categoría_1/

source: file_1.txt file_2.txt ... file_42.txt
es_es: archivo_1.txt archivo_2.txt ... archivo_42.txt

source: category_2_folder/
es_es: carpeta_categoría_2/

source: file_43.txt file_44.txt ...
es_es: archivo_43.txt archivo_44.txt ...

source: The folder names are used as supervised signal label names. The individual file names are not important.
es_es: Los nombres de las carpetas se utilizan como nombres de etiquetas de señales supervisadas. Los nombres de los archivos individuales no son importantes.

source: This function does not try to extract features into a numpy array or scipy sparse matrix. In addition, if load_content is false it does not try to load the files in memory.
es_es: Esta función no intenta extraer características en un arreglo numpy o en una matriz dispersa scipy. Además, si load_content es falso no intenta cargar los archivos en memoria.

source: To use text files in a scikit-learn classification or clustering algorithm, you will need to use the :mod`~sklearn.feature_extraction.text` module to build a feature extraction transformer that suits your problem.
es_es: Para utilizar archivos de texto en un algoritmo de clasificación o conglomerado de scikit-learn, tendrás que utilizar el módulo :mod`~sklearn.feature_extraction.text` para construir un transformador de extracción de características que se adapte a tu problema.

source: If you set load_content=True, you should also specify the encoding of the text using the 'encoding' parameter. For many modern text files, 'utf-8' will be the correct encoding. If you leave encoding equal to None, then the content will be made of bytes instead of Unicode, and you will not be able to use most functions in :mod:`~sklearn.feature_extraction.text`.
es_es: Si estableces load_content=True, también debes especificar la codificación del texto utilizando el parámetro 'encoding'. Para muchos archivos de texto modernos, 'utf-8' será la codificación correcta. Si dejas la codificación igual a None, entonces el contenido estará hecho de bytes en lugar de Unicode, y no podrás utilizar la mayoría de las funciones de :mod:`~sklearn.feature_extraction.text`.

source: Similar feature extractors should be built for other kind of unstructured data input such as images, audio, video, ...
es_es: Deberían construirse extractores de características similares para otro tipo de entrada de datos no estructurados, como imágenes, audio, vídeo, ...

source: Read more in the :ref:`User Guide <datasets>`.
es_es: Leer más en el :ref:`Manual de Usuario <datasets>`.

source: Parameters
es_es: Parámetros

source: str or unicode
es_es: str o unicode

source: Path to the main folder holding one subfolder per category
es_es: Ruta de acceso a la carpeta principal que contiene una subcarpeta por categoría

source: str or unicode, default=None
es_es: str o unicode, default=None

source: A paragraph describing the characteristic of the dataset: its source, reference, etc.
es_es: Un párrafo que describe las características del conjunto de datos: su fuente, referencia, etc.

source: list of str, default=None
es_es: lista de cadenas, default=None

source: If None (default), load all the categories. If not None, list of category names to load (other categories ignored).
es_es: Si es None (predeterminado), carga todas las categorías. Si no es None, lista de nombres de categorías a cargar (otras categorías ignoradas).

source: Whether to load or not the content of the different files. If true a 'data' attribute containing the text information is present in the data structure returned. If not, a filenames attribute gives the path to the files.
es_es: Si se carga o no el contenido de los diferentes archivos. Si es verdadero, un atributo 'data' que contiene la información de texto está presente en la estructura de datos devuelta. Si no, un atributo filenames da la ruta a los archivos.

source: Whether or not to shuffle the data: might be important for models that make the assumption that the samples are independent and identically distributed (i.i.d.), such as stochastic gradient descent.
es_es: Si se revuelven o no los datos: puede ser importante para los modelos que suponen que las muestras son independientes e idénticamente distribuidas (i.i.d.), como el descenso de gradiente estocástico.

source: If None, do not try to decode the content of the files (e.g. for images or other non-text content). If not None, encoding to use to decode text files to Unicode if load_content is True.
es_es: Si es None, no intenta decodificar el contenido de los archivos (por ejemplo, para imágenes u otro contenido no textual). Si no es None, codificación a utilizar para decodificar los archivos de texto a Unicode si load_content es True.

source: Instruction on what to do if a byte sequence is given to analyze that contains characters not of the given `encoding`. Passed as keyword argument 'errors' to bytes.decode.
es_es: Instrucción sobre qué hacer si se da una secuencia de bytes para analizar que contiene caracteres que no son del `encoding` dado. Se pasa como argumento de palabra clave `errors` a bytes.decode.

source: int, RandomState instance or None, default=0
es_es: int, instancia de RandomState o None, default=0

source: Determines random number generation for dataset shuffling. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para revolver el conjunto de datos. Pasa un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: Dictionary-like object, with the following attributes.
es_es: Objeto dictionary-like, con los siguientes atributos.

source: list of str
es_es: list de str

source: Only present when `load_content=True`. The raw text data to learn.
es_es: Sólo está presente cuando `load_content=True`. Los datos de texto en bruto para aprender.

source: target
es_es: objetivo

source: The target labels (integer index).
es_es: Las etiquetas objetivo (índice entero).

source: The names of target classes.
es_es: Los nombres de las clases objetivo.

source: The full description of the dataset.
es_es: La descripción completa del conjunto de datos.

source: The filenames holding the dataset.
es_es: Los nombres de archivo que contienen el conjunto de datos.
