Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.neighbors.NeighborhoodComponentsAnalysis.po
Languages: es_es

source: Neighborhood Components Analysis
es_es: Análisis de componentes de vecindad

source: Neighborhood Component Analysis (NCA) is a machine learning algorithm for metric learning. It learns a linear transformation in a supervised fashion to improve the classification accuracy of a stochastic nearest neighbors rule in the transformed space.
es_es: El análisis de Componentes de Vecindario (Neighborhood Component Analysis, NCA) es un algoritmo de aprendizaje automático para el aprendizaje métrico. Aprende una transformación lineal de forma supervisada para mejorar la precisión de la clasificación de una regla estocástica de vecinos más cercanos en el espacio transformado.

source: Read more in the :ref:`User Guide <nca>`.
es_es: Más información en el :ref:`Manual de usuario <nca>`.

source: Parameters
es_es: Parámetros

source: int, default=None
es_es: entero, default=None

source: Preferred dimensionality of the projected space. If None it will be set to ``n_features``.
es_es: Dimensionalidad preferida del espacio proyectado. Si es None se establecerá en ``n_features``.

source: {'auto', 'pca', 'lda', 'identity', 'random'} or ndarray of shape (n_features_a, n_features_b), default='auto'
es_es: {'auto', 'pca', 'lda', 'identity', 'random'} o ndarray de la forma (n_features_a, n_features_b), default='auto'

source: Initialization of the linear transformation. Possible options are 'auto', 'pca', 'lda', 'identity', 'random', and a numpy array of shape (n_features_a, n_features_b).
es_es: Inicialización de la transformación lineal. Las opciones posibles son 'auto', 'pca', 'lda', 'identity', 'random' y una matriz numérica de forma (n_features_a, n_features_b).

source: Depending on ``n_components``, the most reasonable initialization will be chosen. If ``n_components <= n_classes`` we use 'lda', as it uses labels information. If not, but ``n_components < min(n_features, n_samples)``, we use 'pca', as it projects data in meaningful directions (those of higher variance). Otherwise, we just use 'identity'.
es_es: Dependiendo de ``n_components``, la inicialización más razonable será elegida. Si ``n_components <= n_classes`` usamos 'lda', ya que usa información de etiquetas. Si no, pero ``n_components < min(n_features, n_samples)``, usamos 'pca', ya que proyecta datos en direcciones significativas (aquellas de mayor varianza). De lo contrario, sólo utilizaremos la "identity".

source: ``n_components`` principal components of the inputs passed to :meth:`fit` will be used to initialize the transformation. (See :class:`~sklearn.decomposition.PCA`)
es_es: Los componentes principales ``n_components`` de las entradas pasadas a :meth:`fit` serán usados para inicializar la transformación. (Ver :class:`~sklearn.decomposition.PCA`)

source: ``min(n_components, n_classes)`` most discriminative components of the inputs passed to :meth:`fit` will be used to initialize the transformation. (If ``n_components > n_classes``, the rest of the components will be zero.) (See :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`)
es_es: ``min(n_components, n_classes)`` los componentes más discriminativos de las entradas pasadas a :meth:`fit` serán usados para inicializar la transformación. (Si ``n_components > n_classes``, el resto de los componentes serán cero.) (Ver :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`)

source: If ``n_components`` is strictly smaller than the dimensionality of the inputs passed to :meth:`fit`, the identity matrix will be truncated to the first ``n_components`` rows.
es_es: Si ``n_components`` es estrictamente menor que la dimensionalidad de las entradas pasadas a :meth:`fit`, la matriz de identidad será truncada a las primeras filas ``n_components``.

source: The initial transformation will be a random array of shape `(n_components, n_features)`. Each value is sampled from the standard normal distribution.
es_es: La transformación inicial será un arreglo aleatorio de forma `(n_components, n_features)`. Cada valor es muestreado de la distribución normal estándar.

source: numpy array
es_es: arreglo numpy

source: n_features_b must match the dimensionality of the inputs passed to :meth:`fit` and n_features_a must be less than or equal to that. If ``n_components`` is not None, n_features_a must match it.
es_es: n_features_b debe coincidir con la dimensionalidad de las entradas pasadas a :meth:`fit` y n_features_a debe ser menor o igual a eso. Si ``n_components`` no es None, n_features_a debe coincidirlo.

source: bool, default=False
es_es: booleano, default=False

source: If True and :meth:`fit` has been called before, the solution of the previous call to :meth:`fit` is used as the initial linear transformation (``n_components`` and ``init`` will be ignored).
es_es: Si es True y :meth:`fit` ha sido llamado antes, la solución de la llamada anterior a :meth:`fit` se utiliza como la transformación lineal inicial (``n_components`` e ``init`` serán ignorados).

source: int, default=50
es_es: entero, default=50

source: Maximum number of iterations in the optimization.
es_es: Número máximo de iteraciones en la optimización.

source: float, default=1e-5
es_es: flotante, default=1e-5

source: Convergence tolerance for the optimization.
es_es: Tolerancia de conversión para la optimización.

source: callable, default=None
es_es: invocable, default=None

source: If not None, this function is called after every iteration of the optimizer, taking as arguments the current solution (flattened transformation matrix) and the number of iterations. This might be useful in case one wants to examine or store the transformation found after each iteration.
es_es: Si no es None, esta función es llamada después de cada iteración del optimizador, tomando como argumentos la solución actual (matriz de transformación aplanada) y el número de iteraciones. Esto puede ser útil en caso de que uno quiera examinar o almacenar la transformación encontrada después de cada iteración.

source: int, default=0
es_es: entero, default=0

source: If 0, no progress messages will be printed. If 1, progress messages will be printed to stdout. If > 1, progress messages will be printed and the ``disp`` parameter of :func:`scipy.optimize.minimize` will be set to ``verbose - 2``.
es_es: Si es 0, no se imprimirán mensajes de progreso. Si es 1, los mensajes de progreso se imprimirán en stdout. Si > 1, los mensajes de progreso se imprimirán y el parámetro ``disp`` de :func:`scipy.optimize.minimize` se establecerá en ``verbose - 2``.

source: int or numpy.RandomState, default=None
es_es: entero o numpy.Randomstate, default=None

source: A pseudo random number generator object or a seed for it if int. If ``init='random'``, ``random_state`` is used to initialize the random transformation. If ``init='pca'``, ``random_state`` is passed as an argument to PCA when initializing the transformation. Pass an int for reproducible results across multiple function calls. See :term: `Glossary <random_state>`.
es_es: Un objeto generador de números pseudoaleatorios o una semilla para él si es int. Si ``init='random'``, ``random_state`` se utiliza para inicializar la transformación aleatoria. Si ``init='pca'``, ``random_state`` se pasa como argumento a PCA cuando se inicializa la transformación. Pasa un entero para obtener resultados reproducibles a través de múltiples llamadas a la función. Ver :término: `Glosario <random_state>`.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_components, n_features)
es_es: ndarray de forma (n_components, n_features)

source: The linear transformation learned during fitting.
es_es: La transformación lineal aprendida durante el ajuste.

source: int
es_es: entero

source: Counts the number of iterations performed by the optimizer.
es_es: Cuenta el número de iteraciones realizadas por el optimizador.

source: Pseudo random number generator object used during initialization.
es_es: Objeto generador de números pseudoaleatorio utilizado durante la inicialización.

source: References
es_es: Referencias

source: Wikipedia entry on Neighborhood Components Analysis https://en.wikipedia.org/wiki/Neighbourhood_components_analysis
es_es: Entrada de Wikipedia sobre el Análisis de Componentes de Vecindario https://en.wikipedia.org/wiki/Neighbourhood_components_analysis

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the model according to the given training data.
es_es: Ajusta el modelo de acuerdo a los datos de entrenamiento dados.

source: Fit to data, then transform it.
es_es: Se ajustan los datos y luego se transforman.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros de este estimador.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Applies the learned transformation to the given data.
es_es: Se aplica la transformación aprendida a los datos dados.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples_X, n_features)

source: The training samples.
es_es: Las muestras de entrenamiento.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: The corresponding training labels.
es_es: Las etiquetas de entrenamiento correspondientes.

source: Returns
es_es: Devuelve

source: object
es_es: objeto

source: returns a trained NeighborhoodComponentsAnalysis model.
es_es: devuelve un modelo de NeighborhoodComponentsAnalysis entrenado.

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` y `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: dict
es_es: diccionario

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: ndarray arreglo de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: bool, default=True
es_es: booleano, default=True

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto con estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia de estimador.

source: Data samples.
es_es: Muestras de datos.

source: X_embedded: ndarray of shape (n_samples, n_components)
es_es: X_embedded: ndarray de la forma (n_samples, n_components)

source: The data samples transformed.
es_es: Las muestras de datos transformadas.

source: Raises
es_es: Plantea

source: If :meth:`fit` has not been called before.
es_es: Si :meth:`fit` no ha sido llamado antes.

source: Examples using ``sklearn.neighbors.NeighborhoodComponentsAnalysis``
es_es: Ejemplos con ``sklearn.neighbors.NeighborhoodComponentsAnalysis``
