Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.calibration.calibration_curve.po
Languages: es_es

source: Compute true and predicted probabilities for a calibration curve.
es_es: Calcula las probabilidades verdaderas y predichas para una curva de calibración.

source: The method assumes the inputs come from a binary classifier, and discretize the [0, 1] interval into bins.
es_es: El método asume que las entradas vienen de un clasificador binario, y discretizar el intervalo [0, 1] en intervalos (bins).

source: Calibration curves may also be referred to as reliability diagrams.
es_es: Las curvas de calibración también pueden denominarse diagramas de fiabilidad.

source: Read more in the :ref:`User Guide <calibration>`.
es_es: Lee más en el :ref:`Manual de usuario <calibration>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: True targets.
es_es: Objetivos verdaderos.

source: Probabilities of the positive class.
es_es: Probabilidades de la clase positiva.

source: Whether y_prob needs to be normalized into the [0, 1] interval, i.e. is not a proper probability. If True, the smallest value in y_prob is linearly mapped onto 0 and the largest one onto 1.
es_es: Si y_prob necesita ser normalizado en el intervalo [0, 1], es decir, no es una probabilidad adecuada. Si es True, el valor más pequeño de y_prob se mapea linealmente a 0 y el más grande a 1.

source: Number of bins to discretize the [0, 1] interval. A bigger number requires more data. Bins with no samples (i.e. without corresponding values in `y_prob`) will not be returned, thus the returned arrays may have less than `n_bins` values.
es_es: Número de intervalos (bins) para discretizar el intervalo [0, 1]. Un número mayor requiere más datos. Los intervalos sin muestras (es decir, sin valores correspondientes en `y_prob`) no se devolverán, por lo que los arreglos devueltos pueden tener menos valores que `n_bins`.

source: Strategy used to define the widths of the bins.
es_es: Estrategia utilizada para definir la amplitud de los intervalos (bins).

source: uniform
es_es: uniforme

source: The bins have identical widths.
es_es: Los intervalos (bin) tienen una amplitud idéntica.

source: quantile
es_es: cuantil

source: The bins have the same number of samples and depend on `y_prob`.
es_es: Los intervalos (bins) tienen el mismo número de muestras y dependen de `y_prob`.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_bins,) or smaller
es_es: ndarray de forma (n_bins,) o smaller

source: The proportion of samples whose class is the positive class, in each bin (fraction of positives).
es_es: La proporción de muestras cuya clase es la clase positiva, en cada intervalo (fracción de positivos).

source: The mean predicted probability in each bin.
es_es: La probabilidad media predicha en cada intervalo.

source: References
es_es: Referencias

source: Alexandru Niculescu-Mizil and Rich Caruana (2005) Predicting Good Probabilities With Supervised Learning, in Proceedings of the 22nd International Conference on Machine Learning (ICML). See section 4 (Qualitative Analysis of Predictions).
es_es: Alexandru Niculescu-Mizil and Rich Caruana (2005) Predicting Good Probabilities With Supervised Learning, in Proceedings of the 22nd International Conference on Machine Learning (ICML). Ver sección 4 (Qualitative Analysis of Predictions).

source: Examples
es_es: Ejemplos
