Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.make_scorer.po
Languages: es_es

source: Make a scorer from a performance metric or loss function.
es_es: Hace un puntuador (scorer) a partir de una métrica de rendimiento o una función de pérdida.

source: This factory function wraps scoring functions for use in :class:`~sklearn.model_selection.GridSearchCV` and :func:`~sklearn.model_selection.cross_val_score`. It takes a score function, such as :func:`~sklearn.metrics.accuracy_score`, :func:`~sklearn.metrics.mean_squared_error`, :func:`~sklearn.metrics.adjusted_rand_index` or :func:`~sklearn.metrics.average_precision` and returns a callable that scores an estimator's output. The signature of the call is `(estimator, X, y)` where `estimator` is the model to be evaluated, `X` is the data and `y` is the ground truth labeling (or `None` in the case of unsupervised models).
es_es: Esta función de fábrica envuelve (wraps) funciones de puntuación para su uso en :class:`~sklearn.model_selection.GridSearchCV` y :func:`~sklearn.model_selection.cross_val_score`. Toma una función de puntuación, como :func:`~sklearn.metrics.accuracy_score`, :func:`~sklearn.metrics.mean_squared_error`, :func:`~sklearn.metrics.adjusted_rand_index` o :func:`~sklearn.metrics.average_precision` y devuelve un invocable (callable) que puntúa la salida de un estimador. La firma de la llamada es `(estimator, X, y)` donde `estimator` es el modelo a evaluar, `X` son los datos y `y` es el etiquetado real (o `None` en el caso de modelos no supervisados).

source: Read more in the :ref:`User Guide <scoring>`.
es_es: Leer más en el :ref:`Manual de Usuario <scoring>`.

source: Parameters
es_es: Parámetros

source: Score function (or loss function) with signature ``score_func(y, y_pred, **kwargs)``.
es_es: Función de puntuación (o función de pérdida) con la firma ``score_func(y, y_pred, **kwargs)``.

source: Whether score_func is a score function (default), meaning high is good, or a loss function, meaning low is good. In the latter case, the scorer object will sign-flip the outcome of the score_func.
es_es: Si score_func es una función de puntuación (por defecto), lo que significa que alto es bueno, o una función de pérdida, lo que significa que bajo es bueno. En este último caso, el objeto puntuador invertirá el signo del resultado de score_func.

source: Whether score_func requires predict_proba to get probability estimates out of a classifier.
es_es: Si score_func requiere predict_proba para obtener estimaciones de probabilidad de un clasificador.

source: If True, for binary `y_true`, the score function is supposed to accept a 1D `y_pred` (i.e., probability of the positive class, shape `(n_samples,)`).
es_es: Si es True, para el binario `y_true`, se supone que la función de puntuación acepta un `y_pred` 1D (es decir, la probabilidad de la clase positiva, forma `(n_samples,)`).

source: Whether score_func takes a continuous decision certainty. This only works for binary classification using estimators that have either a decision_function or predict_proba method.
es_es: Si score_func toma una certeza de decisión continua. Esto sólo funciona para la clasificación binaria utilizando estimadores que tienen un método decision_function o predict_proba.

source: If True, for binary `y_true`, the score function is supposed to accept a 1D `y_pred` (i.e., probability of the positive class or the decision function, shape `(n_samples,)`).
es_es: Si es True, para el binario `y_true`, se supone que la función de puntuación acepta un `y_pred` 1D (es decir, la probabilidad de la clase positiva o la función de decisión, forma `(n_samples,)`).

source: For example ``average_precision`` or the area under the roc curve can not be computed using discrete predictions alone.
es_es: Por ejemplo, ``average_precision`` o el área bajo la curva roc no pueden calcularse sólo con predicciones discretas.

source: additional arguments
es_es: argumentos adicionales

source: Additional parameters to be passed to score_func.
es_es: Parámetros adicionales que se pasan a score_func.

source: Returns
es_es: Devuelve

source: Callable object that returns a scalar score; greater is better.
es_es: Objeto invocable que devuelve una puntuación escalar; cuanto mayor sea, mejor.

source: Notes
es_es: Notas

source: If `needs_proba=False` and `needs_threshold=False`, the score function is supposed to accept the output of :term:`predict`. If `needs_proba=True`, the score function is supposed to accept the output of :term:`predict_proba` (For binary `y_true`, the score function is supposed to accept probability of the positive class). If `needs_threshold=True`, the score function is supposed to accept the output of :term:`decision_function`.
es_es: Si `needs_proba=False` y `needs_threshold=False`, se supone que la función de puntuación acepta la salida de :term:`predict`. Si `needs_proba=True`, se supone que la función de puntuación acepta la salida de :term:`predict_proba` (Para el binario `y_true`, la función de puntuación se supone que acepta la probabilidad de la clase positiva). Si `needs_threshold=True`, se supone que la función de puntuación acepta la salida de :term:`decision_function`.

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.metrics.make_scorer``
es_es: Ejemplos utilizando ``sklearn.metrics.make_scorer``
