Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.homogeneity_completeness_v_measure.po
Languages: es_es

source: Compute the homogeneity and completeness and V-Measure scores at once.
es_es: Calcula a la vez la homogeneidad, la completitud y la puntuación V-Measure.

source: Those metrics are based on normalized conditional entropy measures of the clustering labeling to evaluate given the knowledge of a Ground Truth class labels of the same samples.
es_es: Estas métricas se basan en medidas de entropía condicional normalizada del etiquetado de análisis de conglomerados a evaluar dado el conocimiento de las etiquetas de clase de Verdad Fundamental de las mismas muestras.

source: A clustering result satisfies homogeneity if all of its clusters contain only data points which are members of a single class.
es_es: Un resultado de análisis de conglomerados satisface la homogeneidad si todos sus conglomerados contienen sólo puntos de datos que son miembros de una sola clase.

source: A clustering result satisfies completeness if all the data points that are members of a given class are elements of the same cluster.
es_es: Un resultado de análisis de conglomerados satisface la completitud si todos los puntos de datos que son miembros de una clase dada son elementos del mismo conglomerado.

source: Both scores have positive values between 0.0 and 1.0, larger values being desirable.
es_es: Ambos puntajes tienen valores positivos entre 0.0 y 1.0, valores más grandes siendo deseables.

source: Those 3 metrics are independent of the absolute values of the labels: a permutation of the class or cluster label values won't change the score values in any way.
es_es: Estás 3 métricas son independientes de los valores absolutos de las etiquetas: una permutación de la clase o de los valores de las etiquetas de conglomerado no cambiará el valor de la puntuación de ninguna manera.

source: V-Measure is furthermore symmetric: swapping ``labels_true`` and ``label_pred`` will give the same score. This does not hold for homogeneity and completeness. V-Measure is identical to :func:`normalized_mutual_info_score` with the arithmetic averaging method.
es_es: Además, el V-Measure es simétrico: cambiar ``labels_true`` y ``label_pred`` dará la misma puntuación. Esto no se mantiene para la homogeneidad y la completitud. V-Measure es idéntico a :func:`normalized_mutual_info_score` con el método de promediado aritmético.

source: Read more in the :ref:`User Guide <homogeneity_completeness>`.
es_es: Más información en el :ref:`Manual de usuario <homogeneity_completeness>`.

source: Parameters
es_es: Parámetros

source: int array, shape = [n_samples]
es_es: arreglo de enteros, forma = [n_samples]

source: ground truth class labels to be used as a reference
es_es: las etiquetas clase de verdad fundamental a ser usadas como referencia

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: cluster labels to evaluate
es_es: etiquetas de clúster a evaluar

source: float, default=1.0
es_es: flotante, default=1.0

source: Ratio of weight attributed to ``homogeneity`` vs ``completeness``. If ``beta`` is greater than 1, ``completeness`` is weighted more strongly in the calculation. If ``beta`` is less than 1, ``homogeneity`` is weighted more strongly.
es_es: Razón de ponderado atribuida a ``homogeneity`` vs ``completeness``. Sí ``beta`` es mayor que 1, ``completeness`` es ponderado más fuertemente en el cálculo. Sí ``beta`` es menor que 1, ``homogeneity`` es ponderado con más fuerza.

source: Returns
es_es: Salida

source: float
es_es: flotante

source: score between 0.0 and 1.0. 1.0 stands for perfectly homogeneous labeling
es_es: puntaje entre 0.0 y 1.0. 1.0 significa etiquetado perfectamente homogeneo

source: score between 0.0 and 1.0. 1.0 stands for perfectly complete labeling
es_es: puntaje entre 0.0 y 1.0. 1.0 significa etiquetado completamente perfecto

source: harmonic mean of the first two
es_es: media armónica de los dos primeros
