Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.adjusted_rand_score.po
Languages: es_es

source: Rand index adjusted for chance.
es_es: Índice de rand ajustado para el azar.

source: The Rand Index computes a similarity measure between two clusterings by considering all pairs of samples and counting pairs that are assigned in the same or different clusters in the predicted and true clusterings.
es_es: El Índice de Rand calcula una medida de similitud entre dos agrupaciones considerando todos los pares de muestras y los pares de conteo que se asignan en los mismos o diferentes conglomerados en las agrupaciones predecidas y verdaderas.

source: The raw RI score is then "adjusted for chance" into the ARI score using the following scheme::
es_es: La puntuación bruta de RI se "ajusta por casualidad" en la puntuación ARI utilizando el siguiente esquema::

source: The adjusted Rand index is thus ensured to have a value close to 0.0 for random labeling independently of the number of clusters and samples and exactly 1.0 when the clusterings are identical (up to a permutation).
es_es: Por lo tanto, el índice de Rand ajustado está asegurado de tener un valor cercano a 0.0. para etiquetado aleatorio independiente del número de conglomerados y muestras y exactamente 1.0 cuando las agrupaciones son idénticas (hasta una permutación).

source: ARI is a symmetric measure::
es_es: ARI es una medida simétrica::

source: Read more in the :ref:`User Guide <adjusted_rand_score>`.
es_es: Más información en el :ref:`Manual de usuario <adjusted_rand_score>`.

source: Parameters
es_es: Parámetros

source: int array, shape = [n_samples]
es_es: arreglo de enteros, forma = [n_samples]

source: Ground truth class labels to be used as a reference
es_es: Las etiquetas cLase de verdad fundamental a ser usadas como referencia

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: Cluster labels to evaluate
es_es: Etiquetas de clúster a evaluar

source: Returns
es_es: Salida

source: float
es_es: flotante

source: Similarity score between -1.0 and 1.0. Random labelings have an ARI close to 0.0. 1.0 stands for perfect match.
es_es: Puntuación de similaridad entre -1.0 y 1.0. Las etiquetas aleatorias tienen un ARI cercano a 0.0. 1.0 es una coincidencia perfecta.

source: Adjusted Mutual Information.
es_es: Información Mutua Ajustada (AMI en inglés).

source: References
es_es: Referencias

source: Examples
es_es: Ejemplos

source: Perfectly matching labelings have a score of 1 even
es_es: Las etiquetas que coinciden perfectamente tienen una puntuación de 1 par

source: Labelings that assign all classes members to the same clusters are complete but may not always be pure, hence penalized::
es_es: Las etiquetas que asignan a todos los miembros de las clases a los mismos conglomerados son completos, pero pueden no ser siempre puros, por lo que están penalizados::

source: ARI is symmetric, so labelings that have pure clusters with members coming from the same classes but unnecessary splits are penalized::
es_es: ARI es simétrico, por lo que las etiquetas que tienen conglomerados puros con miembros viniendo de las mismas clases pero con divisiones innecesarias son penalizadas::

source: If classes members are completely split across different clusters, the assignment is totally incomplete, hence the ARI is very low::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente incompleta, por lo que el ARI es muy bajo::

source: Examples using ``sklearn.metrics.adjusted_rand_score``
es_es: Ejemplos usando ``sklearn.metrics.adjusted_rand_score``
