Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.random_projection.johnson_lindenstrauss_min_dim.po
Languages: es_es

source: Find a 'safe' number of components to randomly project to.
es_es: Encuentra un número 'seguro' de componentes para proyectar aleatoriamente.

source: The distortion introduced by a random projection `p` only changes the distance between two points by a factor (1 +- eps) in an euclidean space with good probability. The projection `p` is an eps-embedding as defined by:
es_es: La distorsión introducida por una proyección aleatoria `p` sólo cambia la distancia entre dos puntos por un factor (1 +- eps) en un espacio euclidiano con buena probabilidad. La proyección `p` es una inserción(embedding) eps definida por:

source: Where u and v are any rows taken from a dataset of shape (n_samples, n_features), eps is in ]0, 1[ and p is a projection by a random Gaussian N(0, 1) matrix of shape (n_components, n_features) (or a sparse Achlioptas matrix).
es_es: Donde u y v son cualquier fila tomada de un conjunto de datos de forma (n_samples, n_features), eps está en [0, 1] y p es una proyección por una matriz gaussiana aleatoria N(0, 1) de forma (n_components, n_features) (o una matriz de Achlioptas dispersa).

source: The minimum number of components to guarantee the eps-embedding is given by:
es_es: El número mínimo de componentes para garantizar la inserción eps viene dado por:

source: Note that the number of dimensions is independent of the original number of features but instead depends on the size of the dataset: the larger the dataset, the higher is the minimal dimensionality of an eps-embedding.
es_es: Ten en cuenta que el número de dimensiones es independiente del número original de características, pero en cambio depende del tamaño del conjunto de datos: cuanto más grande es el conjunto de datos, mayor es la dimensionalidad mínima de una inserción eps.

source: Read more in the :ref:`User Guide <johnson_lindenstrauss>`.
es_es: Más información en el :ref:`Manual de usuario <johnson_lindenstrauss>`.

source: Parameters
es_es: Parámetros

source: int or array-like of int
es_es: int o array-like de int

source: Number of samples that should be a integer greater than 0. If an array is given, it will compute a safe number of components array-wise.
es_es: Número de muestras que debe ser un entero mayor que 0. Si se da un arreglo, calculará un número seguro de componentes en forma de arreglo.

source: float or ndarray of shape (n_components,), dtype=float, default=0.1
es_es: float o ndarray de forma (n_components,), dtype=float, default=0.1

source: Maximum distortion rate in the range (0,1 ) as defined by the Johnson-Lindenstrauss lemma. If an array is given, it will compute a safe number of components array-wise.
es_es: Tasa de distorsión máxima en el rango (0,1 ) definida por el lema de Johnson-Lindenstrauss. Si se da un arreglo, calculará un número seguro de componentes en forma de arreglo.

source: Returns
es_es: Devuelve

source: int or ndarray of int
es_es: int o ndarray de int

source: The minimal number of components to guarantee with good probability an eps-embedding with n_samples.
es_es: El número mínimo de componentes para garantizar con buena probabilidad una inserción eps con n_samples.

source: References
es_es: Referencias

source: Sanjoy Dasgupta and Anupam Gupta, 1999, "An elementary proof of the Johnson-Lindenstrauss Lemma." http://citeseer.ist.psu.edu/viewdoc/summary?doi=10.1.1.45.3654
es_es: Sanjoy Dasgupta y Anupam Gupta, 1999, "An elementary proof of the Johnson-Lindenstrauss Lemma." http://citeseer.ist.psu.edu/viewdoc/summary?doi=10.1.1.45.3654

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.random_projection.johnson_lindenstrauss_min_dim``
es_es: Ejemplos utilizando ``sklearn.random_projection.johnson_lindenstrauss_min_dim``
