Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.make_sparse_coded_signal.po
Languages: es_es

source: Generate a signal as a sparse combination of dictionary elements.
es_es: Genera una señal como una combinación dispersa de elementos del diccionario.

source: Returns a matrix Y = DX, such as D is (n_features, n_components), X is (n_components, n_samples) and each column of X has exactly n_nonzero_coefs non-zero elements.
es_es: Devuelve una matriz Y = DX, tal que D es (n_features, n_components), X es (n_components, n_samples) y cada columna de X tiene exactamente n_nonzero_coefs elementos distintos de cero.

source: Read more in the :ref:`User Guide <sample_generators>`.
es_es: Leer más en el :ref:`Manual de Usuario <sample_generators>`.

source: Parameters
es_es: Parámetros

source: Number of samples to generate
es_es: Número de muestras a generar

source: Number of components in the dictionary
es_es: Número de componentes en el diccionario

source: Number of features of the dataset to generate
es_es: Número de características del conjunto de datos a generar

source: Number of active (non-zero) coefficients in each sample
es_es: Número de coeficientes activos (distintos de cero) en cada muestra

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Determines random number generation for dataset creation. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para la creación de conjuntos de datos. Pasa un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_features, n_samples)
es_es: ndarray de forma (n_features, n_samples)

source: The encoded signal (Y).
es_es: La señal codificada (Y).

source: ndarray of shape (n_features, n_components)
es_es: ndarray de forma (n_features, n_components)

source: The dictionary with normalized components (D).
es_es: El diccionario con componentes normalizados (D).

source: ndarray of shape (n_components, n_samples)
es_es: ndarray de forma (n_components, n_samples)

source: The sparse code such that each column of this matrix has exactly n_nonzero_coefs non-zero items (X).
es_es: El código disperso tal que cada columna de esta matriz tiene exactamente n_nonzero_coefs elementos distintos de cero (X).
