Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.class_weight.compute_class_weight.po
Languages: es_es

source: Estimate class weights for unbalanced datasets.
es_es: Estimar los pesos de las clases para conjuntos de datos no equilibrados.

source: Parameters
es_es: Parámetros

source: dict, 'balanced' or None
es_es: dict, 'balanced' o None

source: If 'balanced', class weights will be given by ``n_samples / (n_classes * np.bincount(y))``. If a dictionary is given, keys are classes and values are corresponding class weights. If None is given, the class weights will be uniform.
es_es: Si está equilibrado, los pesos de las clases vendrán dados por ``n_samples / (n_clases * np.bincount(y))``. Si se da un diccionario, las claves son las clases y los valores son los pesos de las clases correspondientes. Si se da None, los pesos de las clases serán uniformes.

source: Array of the classes occurring in the data, as given by ``np.unique(y_org)`` with ``y_org`` the original class labels.
es_es: Arreglo de las clases que aparecen en los datos, según ``np.unique(y_org)`` con ``y_org`` las etiquetas de clase originales.

source: array-like of shape (n_samples,)
es_es: tipo de arreglo de forma (n_samples,)

source: Array of original class labels per sample.
es_es: Arreglo de etiquetas de clase originales por muestra.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Array with class_weight_vect[i] the weight for i-th class.
es_es: Arreglo con class_weight_vect[i] el peso para la i-ésima clase.

source: References
es_es: Referencias

source: The "balanced" heuristic is inspired by Logistic Regression in Rare Events Data, King, Zen, 2001.
es_es: La heurística "equilibrada" está inspirada en la Regresión Logística en Datos de Eventos Inusuales, King, Zen, 2001.
