Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.make_friedman1.po
Languages: es_es

source: Generate the "Friedman #1" regression problem.
es_es: Genera el problema de regresión "Friedman #1".

source: This dataset is described in Friedman [1] and Breiman [2].
es_es: Este conjunto de datos se describe en Friedman [1] y Breiman [2].

source: Inputs `X` are independent features uniformly distributed on the interval [0, 1]. The output `y` is created according to the formula::
es_es: Las entradas `X` son características independientes distribuidas uniformemente en el intervalo [0, 1]. La salida `y` se crea según la fórmula::

source: Out of the `n_features` features, only 5 are actually used to compute `y`. The remaining features are independent of `y`.
es_es: De las características `n_features`, sólo 5 se utilizan realmente para calcular `y`. El resto de características son independientes de "y".

source: The number of features has to be >= 5.
es_es: El número de características tiene que ser >= 5.

source: Read more in the :ref:`User Guide <sample_generators>`.
es_es: Leer más en el :ref:`Manual de Usuario <sample_generators>`.

source: Parameters
es_es: Parámetros

source: The number of samples.
es_es: El número de muestras.

source: The number of features. Should be at least 5.
es_es: El número de características. Debe ser al menos 5.

source: The standard deviation of the gaussian noise applied to the output.
es_es: La desviación estándar del ruido gaussiano aplicado a la salida.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Determines random number generation for dataset noise. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para el ruido del conjunto de datos. Pasa un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples, n_features)
es_es: ndarray de forma (n_samples, n_features)

source: The input samples.
es_es: Las muestras de entrada.

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The output values.
es_es: Los valores de salida.

source: References
es_es: Referencias

source: J. Friedman, "Multivariate adaptive regression splines", The Annals of Statistics 19 (1), pages 1-67, 1991.
es_es: J. Friedman, "Multivariate adaptive regression splines", The Annals of Statistics 19 (1), páginas 1-67, 1991.

source: L. Breiman, "Bagging predictors", Machine Learning 24, pages 123-140, 1996.
es_es: L. Breiman, "Bagging predictors", Machine Learning 24, páginas 123-140, 1996.
