Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.explained_variance_score.po
Languages: es_es

source: Explained variance regression score function.
es_es: Función de puntaje de regresión de varianza explicada.

source: Best possible score is 1.0, lower values are worse.
es_es: La mejor puntuación posible es 1.0, los valores más bajos son peores.

source: Read more in the :ref:`User Guide <explained_variance_score>`.
es_es: Más información en el :ref:`Manual de usuario <explained_variance_score>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: arreglo tipo de forma (n_samples,) o (n_samples, n_outputs)

source: Ground truth (correct) target values.
es_es: Valores objetivo reales (correctos).

source: Estimated target values.
es_es: Valores objetivo estimados.

source: array-like of shape (n_samples,), default=None
es_es: arreglo tipo de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderados de muestra.

source: {'raw_values', 'uniform_average', 'variance_weighted'} or array-like of shape (n_outputs,), default='uniform_average'
es_es: {'raw_values', 'uniform_average', 'variance_weighted'} o arreglo tipo de forma (n_outputs,), default='uniform_average'

source: Defines aggregating of multiple output scores. Array-like value defines weights used to average scores.
es_es: Define la agregación de múltiples puntajes de salida. El valor del arreglo tipo define los ponderados usados para promediar puntajes.

source: Returns a full set of scores in case of multioutput input.
es_es: Devuelve un conjunto completo de puntajes en el caso de la entrada multisalida.

source: Scores of all outputs are averaged with uniform weight.
es_es: Puntajes de todas las salidas promediadas con ponderado uniforme.

source: Scores of all outputs are averaged, weighted by the variances of each individual output.
es_es: Las puntuaciones de todas las salidas son promediadas, ponderadas por las varianzas de cada salida individual.

source: Returns
es_es: Salida

source: float or ndarray of floats
es_es: flotante o ndarray de flotantes

source: The explained variance or ndarray if 'multioutput' is 'raw_values'.
es_es: La varianza explicada o ndarray si 'multioutput' es 'raw_values'.

source: Notes
es_es: Notas

source: This is not a symmetric function.
es_es: Esta no es una función simétrica.

source: Examples
es_es: Ejemplos
