Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.VotingClassifier.po
Languages: es_es

source: Soft Voting/Majority Rule classifier for unfitted estimators.
es_es: Clasificador de voto suave/regla de la mayoría para estimadores no ajustados.

source: Read more in the :ref:`User Guide <voting_classifier>`.
es_es: Más información en el :ref:`Manual de usuario <voting_classifier>`.

source: Parameters
es_es: Parámetros

source: list of (str, estimator) tuples
es_es: lista de tuplas (str, estimator)

source: Invoking the ``fit`` method on the ``VotingClassifier`` will fit clones of those original estimators that will be stored in the class attribute ``self.estimators_``. An estimator can be set to ``'drop'`` using ``set_params``.
es_es: Al invocar el método ``fit`` en el ``VotingClassifier`` se ajustarán clones de esos estimadores originales que se almacenarán en el atributo de la clase ``self.estimators_``. Un estimador puede establecerse en ``'drop'`` utilizando ``set_params``.

source: ``'drop'`` is accepted. Using None was deprecated in 0.22 and support was removed in 0.24.
es_es: ``'drop'`` es aceptado. El uso de None quedó obsoleto en la versión 0.22 y se eliminó el soporte en la 0.24.

source: If 'hard', uses predicted class labels for majority rule voting. Else if 'soft', predicts the class label based on the argmax of the sums of the predicted probabilities, which is recommended for an ensemble of well-calibrated classifiers.
es_es: Si es 'hard', utiliza las etiquetas de clase predichas para la votación por regla de la mayoría. Si es 'soft', predice la etiqueta de clase basándose en el argmax de las sumas de las probabilidades predichas, lo que se recomienda para un conjunto (ensemble) de clasificadores bien calibrados.

source: array-like of shape (n_classifiers,), default=None
es_es: array-like de forma (n_classifiers,), default=None

source: Sequence of weights (`float` or `int`) to weight the occurrences of predicted class labels (`hard` voting) or class probabilities before averaging (`soft` voting). Uses uniform weights if `None`.
es_es: Secuencia de ponderaciones (`float` o `int`) para ponderar las ocurrencias de las etiquetas de clase predichas (votación `hard`) o las probabilidades de clase antes de promediar (votación `soft`). Utiliza ponderaciones uniformes si es `None`.

source: The number of jobs to run in parallel for ``fit``. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos a ejecutar en paralelo para ``fit``. ``None`` significa 1 a menos que sea en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa usar todos los procesadores. Véase :term:`Glosario <n_jobs>` para más detalles.

source: Affects shape of transform output only when voting='soft' If voting='soft' and flatten_transform=True, transform method returns matrix with shape (n_samples, n_classifiers * n_classes). If flatten_transform=False, it returns (n_classifiers, n_samples, n_classes).
es_es: Afecta a la forma de la salida de la transformación sólo cuando voting='soft'. Si voting='soft' y flatten_transform=True, el método de transformación devuelve una matriz con forma (n_samples, n_classifiers * n_classes). Si flatten_transform=False, devuelve (n_classifiers, n_samples, n_classes).

source: If True, the time elapsed while fitting will be printed as it is completed.
es_es: Si es True, el tiempo transcurrido durante el ajuste se imprimirá a medida que se complete.

source: Attributes
es_es: Atributos

source: list of classifiers
es_es: lista de clasificadores

source: The collection of fitted sub-estimators as defined in ``estimators`` that are not 'drop'.
es_es: La colección de subestimadores ajustados tal y como se definen en ``estimators`` que no son 'drop'.

source: Attribute to access any fitted sub-estimators by name.
es_es: Atributo para acceder a cualquier subestimador ajustado por su nombre.

source: array-like of shape (n_predictions,)
es_es: array-like de forma (n_predictions,)

source: The classes labels.
es_es: Las etiquetas de las clases.

source: Prediction voting regressor.
es_es: Regresor de predicción de voto.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the estimators.
es_es: Ajusta los estimadores.

source: Return class labels or probabilities for each estimator.
es_es: Devuelve las etiquetas de clase o probabilidades para cada estimador.

source: Get the parameters of an estimator from the ensemble.
es_es: Obtiene los parámetros de un estimador del conjunto (ensemble).

source: Predict class labels for X.
es_es: Predice etiquetas de clase para X.

source: Return the mean accuracy on the given test data and labels.
es_es: Devuelve la precisión media en los datos de prueba y las etiquetas dados.

source: Set the parameters of an estimator from the ensemble.
es_es: Obtiene los parámetros de un estimador del conjunto (ensemble).

source: Return class labels or probabilities for X for each estimator.
es_es: Devuelve las etiquetas de clase o las probabilidades de X para cada estimador.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: Training vectors, where n_samples is the number of samples and n_features is the number of features.
es_es: Vectores de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Target values.
es_es: Valores objetivo.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights. If None, then samples are equally weighted. Note that this is supported only if all underlying estimators support sample weights.
es_es: Ponderaciones de la muestra. Si es None, entonces las muestras están igualmente ponderadas. Ten en cuenta que esto sólo es soportado si todos los estimadores subyacentes soportan ponderaciones de muestra.

source: Returns
es_es: Devuelve

source: Return predictions for X for each estimator.
es_es: Devuelve las predicciones de X para cada estimador.

source: {array-like, sparse matrix, dataframe} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix, dataframe} de forma (n_samples, n_features)

source: Input samples
es_es: Muestras de entrada

source: ndarray of shape (n_samples,), default=None
es_es: ndarray de forma (n_classes,), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: arreglo ndarray de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: Returns the parameters given in the constructor as well as the estimators contained within the `estimators` parameter.
es_es: Devuelve los parámetros dados en el constructor así como los estimadores contenidos en el parámetro `estimators`.

source: Setting it to True gets the various estimators and the parameters of the estimators as well.
es_es: Al establecerlo como True se obtienen los distintos estimadores y los parámetros de los mismos.

source: The input samples.
es_es: Las muestras de entrada.

source: Predicted class labels.
es_es: Etiquetas de clase predichas.

source: Compute probabilities of possible outcomes for samples in X.
es_es: Calcula las probabilidades de los posibles resultados de las muestras en X.

source: array-like of shape (n_samples, n_classes)
es_es: array-like de forma (n_samples, n_classes)

source: Weighted average probability for each class per sample.
es_es: Probabilidad media ponderada de cada clase por muestra.

source: In multi-label classification, this is the subset accuracy which is a harsh metric since you require for each sample that each label set be correctly predicted.
es_es: En la clasificación multietiqueta, se trata de la precisión del subconjunto que es una métrica rigurosa, ya que se requiere para cada muestra que cada conjunto de etiquetas sea predicho correctamente.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Test samples.
es_es: Muestras de prueba.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True labels for `X`.
es_es: Etiquetas True para `X`.

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: Mean accuracy of ``self.predict(X)`` wrt. `y`.
es_es: Precisión media de ``self.predict(X)`` con respecto a `y`.

source: Valid parameter keys can be listed with `get_params()`. Note that you can directly set the parameters of the estimators contained in `estimators`.
es_es: Las claves de los parámetros válidos se pueden listar con `get_params()`. Ten en cuenta que puede establecer directamente los parámetros de los estimadores contenidos en `estimators`.

source: Specific parameters using e.g. `set_params(parameter_name=new_value)`. In addition, to setting the parameters of the estimator, the individual estimator of the estimators can also be set, or can be removed by setting them to 'drop'.
es_es: Parámetros específicos utilizando, por ejemplo, `set_params(parameter_name=new_value)`. Además de establecer los parámetros del estimador, también se puede establecer el estimador individual de los estimadores, o se puede eliminar estableciéndolos en `drop`.

source: probabilities_or_labels
es_es: probabilidades_o_etiquetas

source: If `voting='soft'` and `flatten_transform=True`:
es_es: Si `voting='soft'` y `flatten_transform=True`:

source: returns ndarray of shape (n_classifiers, n_samples * n_classes), being class probabilities calculated by each classifier.
es_es: devuelve ndarray de forma (n_classifiers, n_samples * n_classes), siendo las probabilidades de clase calculadas por cada clasificador.

source: If `voting='soft' and `flatten_transform=False`:
es_es: Si `voting='soft' y `flatten_transform=False`:

source: ndarray of shape (n_classifiers, n_samples, n_classes)
es_es: ndarray de forma (n_classifiers, n_samples, n_classes)

source: If `voting='hard'`:
es_es: Si `voting='hard'`:

source: ndarray of shape (n_samples, n_classifiers), being class labels predicted by each classifier.
es_es: ndarray de forma (n_samples, n_classifiers), siendo las etiquetas de clase predichas por cada clasificador.
