Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_extraction.image.reconstruct_from_patches_2d.po
Languages: es_es

source: Reconstruct the image from all of its patches.
es_es: Reconstruye la imagen a partir de todos sus fragmentos.

source: Patches are assumed to overlap and the image is constructed by filling in the patches from left to right, top to bottom, averaging the overlapping regions.
es_es: Se asume que los fragmentos se superponen y la imagen se construye rellenando los fragmentos de izquierda a derecha, de arriba a abajo, promediando las regiones superpuestas.

source: Read more in the :ref:`User Guide <image_feature_extraction>`.
es_es: Lee más en el :ref:`Manual de usuario <image_feature_extraction>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_patches, patch_height, patch_width) or (n_patches, patch_height, patch_width, n_channels)
es_es: ndarray de forma (n_patches, patch_height, patch_width) o (n_patches, patch_height, patch_width, n_channels)

source: The complete set of patches. If the patches contain colour information, channels are indexed along the last dimension: RGB patches would have `n_channels=3`.
es_es: El conjunto completo de fragmentos. Si los fragmentos contienen información de color, los canales se indexan a lo largo de la última dimensión: Los fragmentos RGB tendrían `n_channels=3`.

source: tuple of int (image_height, image_width) or (image_height, image_width, n_channels)
es_es: tuple of int (image_height, image_width) o (image_height, image_width, n_channels)

source: The size of the image that will be reconstructed.
es_es: El tamaño de la imagen que se reconstruirá.

source: Returns
es_es: Devuelve

source: ndarray of shape image_size
es_es: ndarray de forma image_size

source: The reconstructed image.
es_es: La imagen reconstruida.
