Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.det_curve.po
Languages: es_es

source: Compute error rates for different probability thresholds.
es_es: Calcula las tasas de error para diferentes umbrales de probabilidad.

source: This metric is used for evaluation of ranking and error tradeoffs of a binary classification task.
es_es: Esta métrica se utiliza para la evaluación del ranking y de compensaciones de error de una tarea de clasificación binaria.

source: Read more in the :ref:`User Guide <det_curve>`.
es_es: Más información en el :ref:`Manual de usuario <det_curve>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: True binary labels. If labels are not either {-1, 1} or {0, 1}, then pos_label should be explicitly given.
es_es: Etiquetas binarias verdaderas. Si las etiquetas no son {-1, 1} o {0, 1}, se debe indicar explícitamente pos_label.

source: ndarray of shape of (n_samples,)
es_es: ndarray de forma de (n_samples,)

source: Target scores, can either be probability estimates of the positive class, confidence values, or non-thresholded measure of decisions (as returned by "decision_function" on some classifiers).
es_es: Los puntajes objetivo, pueden ser estimados de probabilidad de la clase positiva, valores de confianza, o una medida sin umbrales de decisiones (como es devuelva por "decision_function" en algunos clasificadores).

source: int or str, default=None
es_es: entero o cadena, default=None

source: The label of the positive class. When ``pos_label=None``, if `y_true` is in {-1, 1} or {0, 1}, ``pos_label`` is set to 1, otherwise an error will be raised.
es_es: La etiqueta de la clase positiva. Cuando ``pos_label=None``, si `y_true` está en {-1, 1} o {0, 1}, ``pos_label`` se establece en 1, de lo contrario se producirá un error.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderados de muestras.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_thresholds,)
es_es: ndarray de forma (n_thresholds,)

source: False positive rate (FPR) such that element i is the false positive rate of predictions with score >= thresholds[i]. This is occasionally referred to as false acceptance propability or fall-out.
es_es: La tasa de falsos positivos (FPR) de tal forma que el elemento i es la tasa de falso positivos de predicciones con score >= thresholds[i]. De vez en cuando, esto es llamado probabilidad de falsa aceptación o caída.

source: False negative rate (FNR) such that element i is the false negative rate of predictions with score >= thresholds[i]. This is occasionally referred to as false rejection or miss rate.
es_es: La tasa de falsos negativos (FPR) de tal forma que el elemento i es la tasa de falso negativos de predicciones con score >= thresholds[i]. De vez en cuando, esto es llamado falso rechazo o tasa de fallos.

source: Decreasing score values.
es_es: Disminuye los valores de puntuación.

source: Plot detection error tradeoff (DET) curve.
es_es: Trazar curva de error de detección (DET).

source: DET curve visualization.
es_es: Visualización de curvas DET.

source: Compute Receiver operating characteristic (ROC) curve.
es_es: Calcula la curva de características operativas del receptor (ROC).

source: Compute precision-recall curve.
es_es: Calcula la curva de precisión-exhaustividad.

source: Examples
es_es: Ejemplos
