Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.sparsefuncs.incr_mean_variance_axis.po
Languages: es_es

source: Compute incremental mean and variance along an axis on a CSR or CSC matrix.
es_es: Calcula la media y la varianza incremental a lo largo de un eje en una matriz CSR o CSC.

source: last_mean, last_var are the statistics computed at the last step by this function. Both must be initialized to 0-arrays of the proper size, i.e. the number of features in X. last_n is the number of samples encountered until now.
es_es: last_mean, last_var son los estadísticos calculados en el último paso por esta función. Ambos deben ser inicializados en 0-arreglos del tamaño adecuado es decir, el número de características en X. last_n es el número de muestras encontradas hasta ahora.

source: Parameters
es_es: Parámetros

source: CSR or CSC sparse matrix of shape (n_samples, n_features)
es_es: CSR o CSC matriz dispersa de forma (n_samples, n_features)

source: Input data.
es_es: Datos de entrada.

source: Axis along which the axis should be computed.
es_es: Eje a lo largo del cual se debe calcular el eje.

source: ndarray of shape (n_features,) or (n_samples,), dtype=floating
es_es: ndarray de forma (n_features,) o (n_samples,), dtype=floating

source: Array of means to update with the new data X. Should be of shape (n_features,) if axis=0 or (n_samples,) if axis=1.
es_es: Arreglo de medias para actualizar con los nuevos datos X. Debe tener la forma (n_features,) si axis=0 o (n_samples,) si axis=1.

source: Array of variances to update with the new data X. Should be of shape (n_features,) if axis=0 or (n_samples,) if axis=1.
es_es: Arreglo de varianzas para actualizar con los nuevos datos X. Debe tener la forma (n_características,) si axis=0 o (n_samples,) si axis=1.

source: float or ndarray of shape (n_features,) or (n_samples,), dtype=floating
es_es: float o ndarray de forma (n_features,) o (n_samples,), dtype=floating

source: Sum of the weights seen so far, excluding the current weights If not float, it should be of shape (n_samples,) if axis=0 or (n_features,) if axis=1. If float it corresponds to having same weights for all samples (or features).
es_es: Suma de las ponderaciones vistas hasta ahora, excluyendo los pesos actuales Si no es un número de punto flotante (float) debe ser de la forma (n_samples,) si axis=0 o (n_features,) si axis=1. Si es un número de punto flotante (float) corresponde a tener las mismas ponderaciones para todas las muestras (o características).

source: ndarray of shape (n_samples,) or (n_features,), default=None
es_es: ndarray de forma (n_samples,) o (n_features,), default=None

source: If axis is set to 0 shape is (n_samples,) or if axis is set to 1 shape is (n_features,). If it is set to None, then samples are equally weighted.
es_es: Si axis se establece en 0 la forma es (n_samples,) o si axis se establece en 1 la forma es (n_features,). Si se establece como None, las muestras se ponderan por igual.

source: Returns
es_es: Devuelve

source: Updated feature-wise means if axis = 0 or sample-wise means if axis = 1.
es_es: Medias actualizadas para cada característica si axis = 0 o para cada muestras si axis = 1.

source: Updated feature-wise variances if axis = 0 or sample-wise variances if axis = 1.
es_es: Varianzas actualizadas para cada característica si axis = 0 o para cada muestras si axis = 1.

source: ndarray of shape (n_features,) or (n_samples,), dtype=integral
es_es: ndarray de forma (n_features,) o (n_samples,), dtype=integral

source: Updated number of seen samples per feature if axis=0 or number of seen features per sample if axis=1.
es_es: Número actualizado de muestras vistas por característica si axis=0 o el número de características vistas por muestra si axis=1.

source: If weights is not None, n is a sum of the weights of the seen samples or features instead of the actual number of seen samples or features.
es_es: Si las ponderaciones no son None, n es una suma de las ponderaciones de las muestras o características vistas en lugar del número real de muestras o características vistas.

source: Notes
es_es: Notas

source: NaNs are ignored in the algorithm.
es_es: Los NaN son ignorados en el algoritmo.
