Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.datasets.load_iris.po
Languages: es_es

source: Load and return the iris dataset (classification).
es_es: Carga y devuelve el conjunto de datos del iris (clasificación).

source: The iris dataset is a classic and very easy multi-class classification dataset.
es_es: El conjunto de datos del iris es un conjunto de datos de clasificación multiclase clásico y muy sencillo.

source: Classes
es_es: Clases

source: Samples per class
es_es: Muestras por clase

source: Samples total
es_es: Total de muestras

source: Dimensionality
es_es: Dimensionalidad

source: Features
es_es: Características

source: real, positive
es_es: reales, positivos

source: Read more in the :ref:`User Guide <iris_dataset>`.
es_es: Leer más en el :ref:`Manual de Usuario <iris_dataset>`.

source: Parameters
es_es: Parámetros

source: If True, returns ``(data, target)`` instead of a Bunch object. See below for more information about the `data` and `target` object.
es_es: Si es True, devuelve ``(data, target)`` en lugar de un objeto Bunch. Ver más abajo para más información sobre los objetos `data` y `target`.

source: If True, the data is a pandas DataFrame including columns with appropriate dtypes (numeric). The target is a pandas DataFrame or Series depending on the number of target columns. If `return_X_y` is True, then (`data`, `target`) will be pandas DataFrames or Series as described below.
es_es: Si es True, los datos son un DataFrame de pandas que incluye columnas con los dtypes apropiados (numéricos). El objetivo es un DataFrame o una Serie de pandas, dependiendo del número de columnas del objetivo. Si `return_X_y` es True, entonces (`data`, `target`) serán DataFrames o Series de Pandas como se describe más adelante.

source: Returns
es_es: Devuelve

source: Dictionary-like object, with the following attributes.
es_es: Objeto tipo dictionario, con los siguientes atributos.

source: {ndarray, dataframe} of shape (150, 4)
es_es: {ndarray, dataframe} de forma (150, 4)

source: The data matrix. If `as_frame=True`, `data` will be a pandas DataFrame.
es_es: La matriz de datos. Si `as_frame=True`, `data` será un DataFrame de pandas.

source: target: {ndarray, Series} of shape (150,)
es_es: target: {ndarray, Series} de forma (150,)

source: The classification target. If `as_frame=True`, `target` will be a pandas Series.
es_es: El objetivo de la clasificación. Si `as_frame=True`, `target` será una Serie de pandas.

source: The names of the dataset columns.
es_es: Los nombres de las columnas del conjunto de datos.

source: The names of target classes.
es_es: Los nombres de las clases objetivo.

source: frame: DataFrame of shape (150, 5)
es_es: frame: DataFrame de forma (150, 5)

source: Only present when `as_frame=True`. DataFrame with `data` and `target`.
es_es: Sólo está presente cuando `as_frame=True`. DataFrame con `data` y `target`.

source: The full description of the dataset.
es_es: La descripción completa del conjunto de datos.

source: The path to the location of the data.
es_es: La ruta de acceso a la ubicación de los datos.

source: **(data, target)** : tuple if ``return_X_y`` is True
es_es: **(data, target)** : tuple si ``return_X_y`` es True

source: tuple if
es_es: tuple si

source: Notes
es_es: Notas

source: Fixed two wrong data points according to Fisher's paper. The new version is the same as in R, but not as in the UCI Machine Learning Repository.
es_es: Se corrigieron dos puntos de datos erróneos según el documento de Fisher. La nueva versión es la misma que en R, pero no como en el Repositorio de Aprendizaje Automático de UCI.

source: Examples
es_es: Ejemplos

source: Let's say you are interested in the samples 10, 25, and 50, and want to know their class name.
es_es: Supongamos que estás interesado en las muestras 10, 25 y 50, y quieres saber su nombre de clase.

source: Examples using ``sklearn.datasets.load_iris``
es_es: Ejemplos usando ``sklearn.datasets.load_iris``
