Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_selection.mutual_info_regression.po
Languages: es_es

source: Estimate mutual information for a continuous target variable.
es_es: Estimar la información mutua para una variable objetivo continua.

source: Mutual information (MI) [R37d39d7589e2-1]_ between two random variables is a non-negative value, which measures the dependency between the variables. It is equal to zero if and only if two random variables are independent, and higher values mean higher dependency.
es_es: La información mutua (IM) [R37d39d7589e2-1]_ entre dos variables aleatorias es un valor no negativo que mide la dependencia entre las variables. Es igual a cero si y sólo si dos variables aleatorias son independientes, y los valores más altos significan una mayor dependencia.

source: The function relies on nonparametric methods based on entropy estimation from k-nearest neighbors distances as described in [R37d39d7589e2-2]_ and [R37d39d7589e2-3]_. Both methods are based on the idea originally proposed in [R37d39d7589e2-4]_.
es_es: La función se basa en métodos no paramétricos basados en la estimación de la entropía a partir de las distancias k- vecinos más cercanos, como se describe en [R37d39d7589e2-2]_ y [R37d39d7589e2-3]_. Ambos métodos se basan en la idea propuesta originalmente en [R37d39d7589e2-4]_.

source: It can be used for univariate features selection, read more in the :ref:`User Guide <univariate_feature_selection>`.
es_es: Se puede utilizar para la selección de características univariantes, lea más en la :ref:`Manual de usuario <univariate_feature_selection>`.

source: Parameters
es_es: Parámetros

source: array-like or sparse matrix, shape (n_samples, n_features)
es_es: tipo arreglo o matriz dispersa, de forma (n_samples, n_features)

source: Feature matrix.
es_es: Matrix de características.

source: array-like of shape (n_samples,)
es_es: tipo arreglo de forma (n_samples,)

source: Target vector.
es_es: Vector objetivo.

source: If bool, then determines whether to consider all features discrete or continuous. If array, then it should be either a boolean mask with shape (n_features,) or array with indices of discrete features. If 'auto', it is assigned to False for dense `X` and to True for sparse `X`.
es_es: Si es bool, entonces determina si se consideran todas las características discretas o continuas. Si es arreglo, entonces debe ser una máscara booleana con forma (n_características,) o arreglo con índices de características discretas. Si es 'auto', se asigna a False para `X` denso y a True para `X` disperso.

source: Number of neighbors to use for MI estimation for continuous variables, see [R37d39d7589e2-2]_ and [R37d39d7589e2-3]_. Higher values reduce variance of the estimation, but could introduce a bias.
es_es: Número de vecinos a utilizar para la estimación del IM para variables continuas, ver [R37d39d7589e2-2]_ y [R37d39d7589e2-3]_. Los valores más altos reducen la varianza de la estimación, pero podrían introducir un sesgo.

source: bool, default=True
es_es: booleano, default=True

source: Whether to make a copy of the given data. If set to False, the initial data will be overwritten.
es_es: Si se hace una copia de los datos dados. Si se establece en False, los datos iniciales se sobrescribirán.

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, default=None

source: Determines random number generation for adding small noise to continuous variables in order to remove repeated values. Pass an int for reproducible results across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Determina la generación de números aleatorios para añadir un pequeño ruido a las variables continuas con el fin de eliminar los valores repetidos. Pasa un int para obtener resultados reproducibles a través de múltiples llamadas a la función. Véase :term:`Glosario <random_state>`.

source: Returns
es_es: Devuelve

source: ndarray, shape (n_features,)
es_es: ndarray de forma (n_features,)

source: Estimated mutual information between each feature and the target.
es_es: Información mutua estimada entre cada característica y el objetivo.

source: Notes
es_es: Notas

source: The term "discrete features" is used instead of naming them "categorical", because it describes the essence more accurately. For example, pixel intensities of an image are discrete features (but hardly categorical) and you will get better results if mark them as such. Also note, that treating a continuous variable as discrete and vice versa will usually give incorrect results, so be attentive about that.
es_es: Se utiliza el término "características discretas" en lugar de denominarlas "categóricas", porque describe la esencia con mayor precisión. Por ejemplo, las intensidades de los píxeles de una imagen son características discretas (pero difícilmente categóricas) y obtendrá mejores resultados si las marca como tales. Tenga en cuenta también que tratar una variable continua como discreta y viceversa suele dar resultados incorrectos, así que esté atento a ello.

source: True mutual information can't be negative. If its estimate turns out to be negative, it is replaced by zero.
es_es: La información mutua verdadera no puede ser negativa. Si su estimación resulta negativa, se sustituye por cero.

source: References
es_es: Referencias

source: `Mutual Information <https://en.wikipedia.org/wiki/Mutual_information>`_ on Wikipedia.
es_es: `Información Mutua <https://es.wikipedia.org/wiki/Informaci%C3%B3n_mutua>`_ en Wikipedia.

source: Examples using ``sklearn.feature_selection.mutual_info_regression``
es_es: Ejemplos con ``sklearn.feature_selection.mutual_info_regression``
