Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.RandomizedSearchCV.po
Languages: es_es

source: Randomized search on hyper parameters.
es_es: Búsqueda aleatoria en los hiperparámetros.

source: RandomizedSearchCV implements a "fit" and a "score" method. It also implements "score_samples", "predict", "predict_proba", "decision_function", "transform" and "inverse_transform" if they are implemented in the estimator used.
es_es: RandomizedSearchCV implementa un método "fit" y otro "score". También implementa "score_samples", "predict", "predict_proba", "decision_function", "transform" e "inverse_transform" si están implementados en el estimador utilizado.

source: The parameters of the estimator used to apply these methods are optimized by cross-validated search over parameter settings.
es_es: Los parámetros del estimador utilizado para aplicar estos métodos se optimizan mediante una búsqueda validada cruzada sobre los ajustes de los parámetros.

source: In contrast to GridSearchCV, not all parameter values are tried out, but rather a fixed number of parameter settings is sampled from the specified distributions. The number of parameter settings that are tried is given by n_iter.
es_es: A diferencia de GridSearchCV, no se prueban todos los valores de los parámetros, sino que se muestrea un número fijo de ajustes de los parámetros a partir de las distribuciones especificadas. El número de ajustes de parámetros que se prueban viene dado por n_iter.

source: If all parameters are presented as a list, sampling without replacement is performed. If at least one parameter is given as a distribution, sampling with replacement is used. It is highly recommended to use continuous distributions for continuous parameters.
es_es: Si todos los parámetros se presentan como una lista, se realiza un muestreo sin reemplazo. Si al menos un parámetro se presenta como una distribución, se utiliza el muestreo con reemplazo. Se recomienda encarecidamente utilizar distribuciones continuas para los parámetros continuos.

source: Read more in the :ref:`User Guide <randomized_parameter_search>`.
es_es: Más información en el :ref:`Manual de usuario <randomized_parameter_search>`.

source: Parameters
es_es: Parámetros

source: estimator object.
es_es: objeto estimador.

source: A object of that type is instantiated for each grid point. This is assumed to implement the scikit-learn estimator interface. Either estimator needs to provide a ``score`` function, or ``scoring`` must be passed.
es_es: Un objeto de ese tipo es instanciado para cada punto de la cuadrícula. Se supone que esto implementa la interfaz del estimador de scikit-learn. O bien el estimador necesita proporcionar una función ``score``, o se debe pasar ``scoring``.

source: dict or list of dicts
es_es: dict o lista de dicts

source: Dictionary with parameters names (`str`) as keys and distributions or lists of parameters to try. Distributions must provide a ``rvs`` method for sampling (such as those from scipy.stats.distributions). If a list is given, it is sampled uniformly. If a list of dicts is given, first a dict is sampled uniformly, and then a parameter is sampled using that dict as above.
es_es: Diccionario con nombres de parámetros (`str`) como claves y distribuciones o listas de parámetros a probar. Las distribuciones deben proporcionar un método ``rvs`` para el muestreo (como los de scipy.stats.distributions). Si se da una lista, se muestrea uniformemente. Si se da una lista de dicts, primero se muestrea un dict de manera uniforme, y luego se muestrea un parámetro usando ese dict como arriba.

source: Number of parameter settings that are sampled. n_iter trades off runtime vs quality of the solution.
es_es: Número de ajustes de parámetros que se muestrean. n_iter compensa el tiempo de ejecución frente a la calidad de la solución.

source: str, callable, list, tuple or dict, default=None
es_es: str, callable, list/tuple o dict, default=None

source: Strategy to evaluate the performance of the cross-validated model on the test set.
es_es: Estrategia para evaluar el rendimiento del modelo validado de forma cruzada en el conjunto de pruebas.

source: If `scoring` represents a single score, one can use:
es_es: Si `scoring` representa una única puntuación, se puede utilizar:

source: a single string (see :ref:`scoring_parameter`);
es_es: una sola cadena (ver :ref:`scoring_parameter`);

source: a callable (see :ref:`scoring`) that returns a single value.
es_es: un callable o invocable (ver :ref:`scoring`) que devuelve un único valor.

source: If `scoring` reprents multiple scores, one can use:
es_es: Si `puntuación` representa múltiples puntuaciones, se puede utilizar:

source: a list or tuple of unique strings;
es_es: una lista o tupla de cadenas únicas;

source: a callable returning a dictionary where the keys are the metric names and the values are the metric scores;
es_es: un callable que devuelve un diccionario donde las claves son los nombres de las métricas y los valores son las puntuaciones de las métricas;

source: a dictionary with metric names as keys and callables a values.
es_es: un diccionario con los nombres de las métricas como claves e invocable como valores.

source: See :ref:`multimetric_grid_search` for an example.
es_es: Ver :ref:`multimetric_grid_search` para un ejemplo.

source: If None, the estimator's score method is used.
es_es: Si es None, se utiliza el método de puntuación del estimador.

source: Number of jobs to run in parallel. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa utilizar todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: `n_jobs` default changed from 1 to None
es_es: `n_jobs` predeterminado cambiado de 1 a None

source: int, or str, default=None
es_es: int, o str, default=None

source: Controls the number of jobs that get dispatched during parallel execution. Reducing this number can be useful to avoid an explosion of memory consumption when more jobs get dispatched than CPUs can process. This parameter can be:
es_es: Controla el número de trabajos que se envían durante la ejecución en paralelo. Reducir este número puede ser útil para evitar una explosión de consumo de memoria cuando se envían más trabajos de los que las CPUs pueden procesar. Este parámetro puede ser:

source: None, in which case all the jobs are immediately created and spawned. Use this for lightweight and fast-running jobs, to avoid delays due to on-demand spawning of the jobs
es_es: None, en cuyo caso todos los trabajos se crean y generan inmediatamente. Utilícelo para trabajos ligeros y de ejecución rápida, para evitar retrasos debidos a la generación de trabajos bajo demanda

source: An int, giving the exact number of total jobs that are spawned
es_es: Un int, que da el número exacto de trabajos totales que se generan

source: A str, giving an expression as a function of n_jobs, as in '2*n_jobs'
es_es: Una str, que da una expresión como función de n_jobs, como en '2*n_jobs'

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, por defecto=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de separación de la validación cruzada. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para utilizar la validación cruzada de 5 pliegues por defecto,

source: integer, to specify the number of folds in a `(Stratified)KFold`,
es_es: entero, para especificar el número de pliegues en un `(Stratified)KFold`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce (train, test) se separa como arreglos de índices.

source: For integer/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas enteras/None, si el estimador es un clasificador e ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulte la :ref:`Guía del usuario <cross_validation>` para conocer las distintas estrategias de validación cruzada que pueden utilizarse aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado es ``cv`` si no se cambia de 3 a 5 veces.

source: bool, str, or callable, default=True
es_es: booleano, default=True

source: Refit an estimator using the best found parameters on the whole dataset.
es_es: Reajustar un estimador utilizando los mejores parámetros encontrados en todo el conjunto de datos.

source: For multiple metric evaluation, this needs to be a `str` denoting the scorer that would be used to find the best parameters for refitting the estimator at the end.
es_es: Para la evaluación de métricas múltiples, debe ser una `str` que denote el calificador que se utilizaría para encontrar los mejores parámetros para reajustar el estimador al final.

source: Where there are considerations other than maximum score in choosing a best estimator, ``refit`` can be set to a function which returns the selected ``best_index_`` given the ``cv_results``. In that case, the ``best_estimator_`` and ``best_params_`` will be set according to the returned ``best_index_`` while the ``best_score_`` attribute will not be available.
es_es: Cuando hay consideraciones distintas de la puntuación máxima en la elección de un mejor estimador, ``refit`` puede establecerse en una función que devuelva el ``best_index_`` seleccionado dado el ``cv_results``. En ese caso, el ``best_estimator_`` y ``best_params`` se establecerán de acuerdo con el ``best_index_`` devuelto, mientras que el atributo ``best_score_`` no estará disponible.

source: The refitted estimator is made available at the ``best_estimator_`` attribute and permits using ``predict`` directly on this ``RandomizedSearchCV`` instance.
es_es: El estimador ajustado está disponible en el atributo ``best_estimator_`` y permite utilizar ``predict`` directamente en esta instancia de ``RandomizedSearchCV``.

source: Also for multiple metric evaluation, the attributes ``best_index_``, ``best_score_`` and ``best_params_`` will only be available if ``refit`` is set and all of them will be determined w.r.t this specific scorer.
es_es: También para la evaluación de múltiples métricas, los atributos ``best_index_``, ``best_score_`` y ``best_params_`` sólo estarán disponibles si se establece ``refit`` y todos ellos se determinarán con este estimador específico.

source: See ``scoring`` parameter to know more about multiple metric evaluation.
es_es: Ver el parámetro ``scoring`` para saber más sobre la evaluación de múltiples métricas.

source: Support for callable added.
es_es: Se ha añadido soporte para callable.

source: Controls the verbosity: the higher, the more messages.
es_es: Controla la verbosidad: cuanto más alta, más mensajes.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Pseudo random number generator state used for random uniform sampling from lists of possible values instead of scipy.stats distributions. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Estado del generador de números pseudoaleatorios utilizado para el muestreo uniforme aleatorio de las listas de valores posibles en lugar de las distribuciones de scipy.stats. Pase un int para una salida reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: 'raise' or numeric, default=np.nan
es_es: 'raise' o numérico, default=np.nan

source: Value to assign to the score if an error occurs in estimator fitting. If set to 'raise', the error is raised. If a numeric value is given, FitFailedWarning is raised. This parameter does not affect the refit step, which will always raise the error.
es_es: Valor a asignar a la puntuación si se produce un error en el ajuste del estimador. Si se establece como 'raise', el error se eleva. Si se da un valor numérico, se levanta FitFailedWarning. Este parámetro no afecta al paso de reajuste, que siempre elevará el error.

source: If ``False``, the ``cv_results_`` attribute will not include training scores. Computing training scores is used to get insights on how different parameter settings impact the overfitting/underfitting trade-off. However computing the scores on the training set can be computationally expensive and is not strictly required to select the parameters that yield the best generalization performance.
es_es: Si es ``False``, el atributo ``cv_results_`` no incluirá las puntuaciones de entrenamiento. El cálculo de las puntuaciones de entrenamiento se utiliza para obtener información sobre el impacto de los diferentes ajustes de los parámetros en el equilibrio entre sobreajuste e infraajuste. Sin embargo, calcular las puntuaciones en el conjunto de entrenamiento puede ser costoso desde el punto de vista informático y no es estrictamente necesario para seleccionar los parámetros que producen el mejor rendimiento de generalización.

source: Default value was changed from ``True`` to ``False``
es_es: El valor predeterminado se ha cambiado de ``True`` a ``False``

source: Attributes
es_es: Atributos

source: dict of numpy (masked) ndarrays
es_es: dict de numpy (masked) ndarrays

source: A dict with keys as column headers and values as columns, that can be imported into a pandas ``DataFrame``.
es_es: Un dict con claves como cabeceras de columna y valores como columnas, que puede ser importado en un ``DataFrame`` de pandas.

source: For instance the below given table
es_es: Por ejemplo, la siguiente tabla

source: will be represented by a ``cv_results_`` dict of::
es_es: será representado por un dict ``cv_results_`` de::

source: NOTE
es_es: NOTA

source: The key ``'params'`` is used to store a list of parameter settings dicts for all the parameter candidates.
es_es: La clave ``'params`` se utiliza para almacenar una lista de diccionarios (dicts) de configuración de parámetros para todos los candidatos a parámetros.

source: The ``mean_fit_time``, ``std_fit_time``, ``mean_score_time`` and ``std_score_time`` are all in seconds.
es_es: El ``mean_fit_time``, ``std_fit_time``, ``mean_score_time`` y ``std_score_time`` están todos en segundos.

source: For multi-metric evaluation, the scores for all the scorers are available in the ``cv_results_`` dict at the keys ending with that scorer's name (``'_<scorer_name>'``) instead of ``'_score'`` shown above. ('split0_test_precision', 'mean_train_precision' etc.)
es_es: Para la evaluación multimétrica, las puntuaciones de todos los puntuadores están disponibles en el diccionario ``cv_results_`` en las claves que terminan con el nombre de ese puntuador (``'_<scorer_name>'``) en lugar de ``'_score'`` mostradas anteriormente. ('split0_test_precision', 'mean_train_precision' etc.)

source: estimator
es_es: estimador

source: Estimator that was chosen by the search, i.e. estimator which gave highest score (or smallest loss if specified) on the left out data. Not available if ``refit=False``.
es_es: Estimador que fue elegido por la búsqueda, es decir, el estimador que dio la mayor puntuación (o la menor pérdida si se especifica) en los datos dejados de lado. No está disponible si ``refit=False``.

source: For multi-metric evaluation, this attribute is present only if ``refit`` is specified.
es_es: Para la evaluación multimétrica, este atributo sólo está presente si se especifica ``refit``.

source: See ``refit`` parameter for more information on allowed values.
es_es: Ver el parámetro ``refit`` para más información sobre los valores permitidos.

source: Mean cross-validated score of the best_estimator.
es_es: Puntuación media de validación cruzada del mejor estimador.

source: For multi-metric evaluation, this is not available if ``refit`` is ``False``. See ``refit`` parameter for more information.
es_es: Para la evaluación multimétrica, esto no está disponible si ``refit`` es ``False``. Para más información, consulte el parámetro ``refit``.

source: This attribute is not available if ``refit`` is a function.
es_es: Este atributo no está disponible si ``refit`` es una función.

source: Parameter setting that gave the best results on the hold out data.
es_es: Ajuste del parámetro que dio los mejores resultados en los datos de retención.

source: The index (of the ``cv_results_`` arrays) which corresponds to the best candidate parameter setting.
es_es: El índice (de los arreglos ``cv_results_``) que corresponde al mejor ajuste de parámetros candidato.

source: The dict at ``search.cv_results_['params'][search.best_index_]`` gives the parameter setting for the best model, that gives the highest mean score (``search.best_score_``).
es_es: El diccionario (dict) en ``search.cv_results_['params'][search.best_index_]`` da la configuración de parámetros para el mejor modelo, que da la puntuación media más alta (``search.best_score_``).

source: function or a dict
es_es: function o un dict

source: Scorer function used on the held out data to choose the best parameters for the model.
es_es: Función de puntuación utilizada en los datos retenidos para elegir los mejores parámetros para el modelo.

source: For multi-metric evaluation, this attribute holds the validated ``scoring`` dict which maps the scorer key to the scorer callable.
es_es: Para la evaluación multimétrica, este atributo contiene el diccionario validado ``scoring`` que mapea la clave del puntuador (scorer) al puntuador invocable (callable).

source: The number of cross-validation splits (folds/iterations).
es_es: El número de separaciones de validación cruzada (pliegues/iteraciones).

source: Seconds used for refitting the best model on the whole dataset.
es_es: Segundos utilizados para reajustar el mejor modelo en todo el conjunto de datos.

source: This is present only if ``refit`` is not False.
es_es: Esto está presente sólo si ``refit`` no es False.

source: Whether or not the scorers compute several metrics.
es_es: Si los puntuadores calculan o no varias métricas.

source: Does exhaustive search over a grid of parameters.
es_es: Realiza una búsqueda exhaustiva sobre una parrilla de parámetros.

source: A generator over parameter settings, constructed from param_distributions.
es_es: Un generador sobre los ajustes de los parámetros, construido a partir de param_distributions.

source: Notes
es_es: Notas

source: The parameters selected are those that maximize the score of the held-out data, according to the scoring parameter.
es_es: Los parámetros seleccionados son los que maximizan la puntuación de los datos retenidos, según el parámetro de puntuación.

source: If `n_jobs` was set to a value higher than one, the data is copied for each parameter setting(and not `n_jobs` times). This is done for efficiency reasons if individual jobs take very little time, but may raise errors if the dataset is large and not enough memory is available. A workaround in this case is to set `pre_dispatch`. Then, the memory is copied only `pre_dispatch` many times. A reasonable value for `pre_dispatch` is `2 * n_jobs`.
es_es: Si `n_jobs` se estableció en un valor superior a uno, los datos se copian para cada ajuste de parámetros (y no `n_jobs` veces). Esto se hace por razones de eficiencia si los trabajos individuales llevan muy poco tiempo, pero puede dar lugar a errores si el conjunto de datos es grande y no hay suficiente memoria disponible. Una solución en este caso es establecer `pre_dispatch`. Entonces, la memoria se copia sólo `pre_dispatch` muchas veces. Un valor razonable para `pre_dispatch` es `2 * n_jobs`.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Call decision_function on the estimator with the best found parameters.
es_es: Llama a decision_function en el estimador con los mejores parámetros encontrados.

source: Run fit with all sets of parameters.
es_es: Ejecutar el ajuste con todos los conjuntos de parámetros.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Call inverse_transform on the estimator with the best found params.
es_es: Llamar a inverse_transform en el estimador con los mejores parámetros encontrados.

source: Call predict on the estimator with the best found parameters.
es_es: Llama a predict en el estimador con los mejores parámetros encontrados.

source: Call predict_log_proba on the estimator with the best found parameters.
es_es: Llamar a predict_log_proba en el estimador con los mejores parámetros encontrados.

source: Call predict_proba on the estimator with the best found parameters.
es_es: Llamar a predict_proba en el estimador con los mejores parámetros encontrados.

source: Returns the score on the given data, if the estimator has been refit.
es_es: Devuelve la puntuación en los datos dados, si el estimador ha sido reajustado.

source: Call score_samples on the estimator with the best found parameters.
es_es: Establece los paráLlamar a score_samples en el estimador con los mejores parámetros encontrados.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Call transform on the estimator with the best found parameters.
es_es: Llama a la transformación del estimador con los mejores parámetros encontrados.

source: Only available if ``refit=True`` and the underlying estimator supports ``decision_function``.
es_es: Sólo está disponible si ``refit=True`` y el estimador subyacente soporta ``decision_function``.

source: indexable, length n_samples
es_es: indexable, longitud n_samples

source: Must fulfill the input assumptions of the underlying estimator.
es_es: Debe cumplir los supuestos de entrada del estimador subyacente.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Training vector, where n_samples is the number of samples and n_features is the number of features.
es_es: Vector de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples, n_output) or (n_samples,), default=None
es_es: array-like de forma (n_samples, n_output) o (n_samples,), default=None

source: Target relative to X for classification or regression; None for unsupervised learning.
es_es: Objetivo relativo a X para la clasificación o la regresión; ninguno para el aprendizaje no supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`~sklearn.model_selection.GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al separar el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia de "Grupo" :term:`cv` (por ejemplo, :class:`~sklearn.model_selection.GroupKFold`).

source: dict of str -> object
es_es: dict de str -> object

source: Parameters passed to the ``fit`` method of the estimator
es_es: Parámetros pasados al método ``fit`` del estimador

source: bool, default=True
es_es: booleano, default=True
