Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.cluster.ward_tree.po
Languages: es_es

source: Ward clustering based on a Feature matrix.
es_es: Agrupamiento de Ward basado en una matriz de características.

source: Recursively merges the pair of clusters that minimally increases within-cluster variance.
es_es: Fusiona recursivamente el par de conglomerados que aumenta mínimamente la varianza dentro del conglomerado.

source: The inertia matrix uses a Heapq-based representation.
es_es: La matriz de inercia utiliza una representación basada en Heapq.

source: This is the structured version, that takes into account some topological structure between samples.
es_es: Esta es la versión estructurada, que tiene en cuenta cierta estructura topológica entre las muestras.

source: Read more in the :ref:`User Guide <hierarchical_clustering>`.
es_es: Más información en el :ref:`Manual de usuario <hierarchical_clustering>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: feature matrix representing n_samples samples to be clustered
es_es: matriz de características que representa n_samples muestras a agrupar

source: sparse matrix, default=None
es_es: matriz dispersa, default=None

source: connectivity matrix. Defines for each sample the neighboring samples following a given structure of the data. The matrix is assumed to be symmetric and only the upper triangular half is used. Default is None, i.e, the Ward algorithm is unstructured.
es_es: matriz de conectividad. Define para cada muestra las muestras de vecindario siguiendo una estructura determinada de los datos. Se supone que la matriz es simétrica y sólo se utiliza la mitad triangular superior. Por defecto es None, es decir, el algoritmo de Ward no tiene estructura.

source: Stop early the construction of the tree at n_clusters. This is useful to decrease computation time if the number of clusters is not small compared to the number of samples. In this case, the complete tree is not computed, thus the 'children' output is of limited use, and the 'parents' output should rather be used. This option is valid only when specifying a connectivity matrix.
es_es: Detener anticipadamente la construcción del árbol en n_clusters. Esto es útil para reducir el tiempo de cálculo si el número de conglomerados no es pequeño en comparación con el número de muestras. En este caso, no se calcula el árbol completo, por lo que la salida de 'children' tiene una utilidad limitada, y debería utilizarse más bien la salida de 'parents'. Esta opción sólo es válida cuando se especifica una matriz de conectividad.

source: If True, return the distance between the clusters.
es_es: Si es True, devuelve la distancia entre los conglomerados.

source: Returns
es_es: Salida

source: ndarray of shape (n_nodes-1, 2)
es_es: ndarray de forma (n_nodes-1, 2)

source: The children of each non-leaf node. Values less than `n_samples` correspond to leaves of the tree which are the original samples. A node `i` greater than or equal to `n_samples` is a non-leaf node and has children `children_[i - n_samples]`. Alternatively at the i-th iteration, children[i][0] and children[i][1] are merged to form node `n_samples + i`
es_es: Los hijos de cada nodo que no es hoja. Los valores inferiores a `n_samples` corresponden a las hojas del árbol que son las muestras originales. Un nodo `i` mayor o igual que `n_samples` es un nodo no hoja y tiene hijos `children_[i - n_samples]`. Como alternativa, en la iteración i-th, los hijos[i][0] y los hijos[i][1] se fusionan para formar el nodo `n_samples + i`

source: The number of connected components in the graph.
es_es: El número de componentes conectados en el grafo.

source: The number of leaves in the tree
es_es: El número de hojas en el árbol

source: ndarray of shape (n_nodes,) or None
es_es: ndarray de forma (n_nodes,) o None

source: The parent of each node. Only returned when a connectivity matrix is specified, elsewhere 'None' is returned.
es_es: El padre de cada nodo. Sólo se devuelve cuando se especifica una matriz de conectividad, en caso contrario se devuelve 'None'.

source: ndarray of shape (n_nodes-1,)
es_es: ndarray de forma (n_nodes-1,)

source: Only returned if return_distance is set to True (for compatibility). The distances between the centers of the nodes. `distances[i]` corresponds to a weighted euclidean distance between the nodes `children[i, 1]` and `children[i, 2]`. If the nodes refer to leaves of the tree, then `distances[i]` is their unweighted euclidean distance. Distances are updated in the following way (from scipy.hierarchy.linkage):
es_es: Sólo se devuelve si return_distance se establece en True (para compatibilidad). Las distancias entre los centros de los nodos. `distances[i]` corresponde a una distancia euclidiana ponderada entre los nodos `children[i, 1]` y `children[i, 2]`. Si los nodos se refieren a las hojas del árbol, entonces `distancias[i]` es su distancia euclidiana no ponderada. Las distancias se actualizan de la siguiente manera (de scipy.hierarchy.linkage):

source: The new entry :math:`d(u,v)` is computed as follows,
es_es: La nueva entrada :math:`d(u,v)` se calcula de la siguiente manera,

source: where :math:`u` is the newly joined cluster consisting of clusters :math:`s` and :math:`t`, :math:`v` is an unused cluster in the forest, :math:`T=|v|+|s|+|t|`, and :math:`|*|` is the cardinality of its argument. This is also known as the incremental algorithm.
es_es: donde :math:`u` es el conglomerado recién unido que consiste en conglomerados :math:`s` y :math:`t`, :math:`v` es un conglomerado no utilizado en el bosque, :math:`T=|v|+|s|+|t|`, y :math:`|*|` es la cardinalidad de su argumento. Esto también se conoce como el algoritmo incremental.
