Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.validation.check_*_fitted.po
Languages: es_es

source: Perform is_fitted validation for estimator.
es_es: Realiza la validación is_fitted para el estimador.

source: Checks if the estimator is fitted by verifying the presence of fitted attributes (ending with a trailing underscore) and otherwise raises a NotFittedError with the given message.
es_es: Comprueba si el estimador está ajustado verificando la presencia de atributos ajustados (que terminan con un guión bajo al final) y en caso contrario genera un NotFittedError con el mensaje dado.

source: This utility is meant to be used internally by estimators themselves, typically in their own predict / transform methods.
es_es: Esta utilidad está pensada para ser utilizada internamente por los propios estimadores, normalmente en sus propios métodos de predicción/transformación.

source: Parameters
es_es: Parámetros

source: estimator instance
es_es: instancia de estimador

source: estimator instance for which the check is performed.
es_es: instancia del estimador para el que se realiza la comprobación.

source: str, list or tuple of str, default=None
es_es: cadena, lista o tupla de cadenas, default=None

source: Attribute name(s) given as string or a list/tuple of strings Eg.: ``["coef_", "estimator_", ...], "coef_"``
es_es: Nombre(s) del atributo dado(s) como cadena o una lista/tupla de cadenas Por ejemplo: ``["coef_", "estimator_", ...], "coef_"``

source: If `None`, `estimator` is considered fitted if there exist an attribute that ends with a underscore and does not start with double underscore.
es_es: Si es `None`, `estimator` se considera ajustado si existe un atributo que termine con un guión bajo y no empiece con doble guión bajo.

source: The default error message is, "This %(name)s instance is not fitted yet. Call 'fit' with appropriate arguments before using this estimator."
es_es: El mensaje de error predeterminado es: "This %(name)s instance is not fitted yet. Call 'fit' with appropriate arguments before using this estimator."

source: For custom messages if "%(name)s" is present in the message string, it is substituted for the estimator name.
es_es: Para mensajes personalizados, si "%(name)s" está presente en la cadena del mensaje, se sustituye por el nombre del estimador.

source: Eg. : "Estimator, %(name)s, must be fitted before sparsifying".
es_es: Por ejemplo: "Estimator, %(name)s, must be fitted before sparsifying".

source: callable, {all, any}, default=all
es_es: invocable, {all, any}, default=all

source: Specify whether all or any of the given attributes must exist.
es_es: Especifica si deben existir todos o alguno de los atributos dados.

source: Returns
es_es: Devuelve

source: Raises
es_es: Genera

source: If the attributes are not found.
es_es: Si no se encuentran los atributos.
