Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.model_selection.learning_curve.po
Languages: es_es

source: Learning curve.
es_es: Curva de aprendizaje.

source: Determines cross-validated training and test scores for different training set sizes.
es_es: Determina las puntuaciones de entrenamiento y de prueba con validación cruzada para diferentes tamaños de conjuntos de entrenamiento.

source: A cross-validation generator splits the whole dataset k times in training and test data. Subsets of the training set with varying sizes will be used to train the estimator and a score for each training subset size and the test set will be computed. Afterwards, the scores will be averaged over all k runs for each training subset size.
es_es: Un generador de validación cruzada separa el conjunto de datos k veces en datos de entrenamiento y de prueba. Se utilizarán subconjuntos del conjunto de entrenamiento con tamaños variables para entrenar el estimador y se calculará una puntuación para cada tamaño de subconjunto de entrenamiento y el conjunto de prueba. Después, las puntuaciones se promediarán en todas las k ejecuciones para cada tamaño de subconjunto de entrenamiento.

source: Read more in the :ref:`User Guide <learning_curve>`.
es_es: Más información en el :ref:`Manual de usuario <learning_curve>`.

source: Parameters
es_es: Parámetros

source: object type that implements the "fit" and "predict" methods
es_es: tipo de objeto que implementa los métodos "fit" y "predict"

source: An object of that type which is cloned for each validation.
es_es: Un objeto de ese tipo que se clona para cada validación.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Training vector, where n_samples is the number of samples and n_features is the number of features.
es_es: Vector de entrenamiento, donde n_samples es el número de muestras y n_features es el número de características.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: Target relative to X for classification or regression; None for unsupervised learning.
es_es: Objetivo relativo a X para la clasificación o la regresión; ninguno para el aprendizaje no supervisado.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Group labels for the samples used while splitting the dataset into train/test set. Only used in conjunction with a "Group" :term:`cv` instance (e.g., :class:`GroupKFold`).
es_es: Etiquetas de grupo para las muestras utilizadas al dividir el conjunto de datos en conjunto de entrenamiento/prueba. Sólo se utiliza junto con una instancia de :term:`cv` "Group" (por ejemplo, :class:`GroupKFold`).

source: array-like of shape (n_ticks,), default=np.linspace(0.1, 1.0, 5)
es_es: array-like de forma (n_ticks,), default=np.linspace(0.1, 1.0, 5)

source: Relative or absolute numbers of training examples that will be used to generate the learning curve. If the dtype is float, it is regarded as a fraction of the maximum size of the training set (that is determined by the selected validation method), i.e. it has to be within (0, 1]. Otherwise it is interpreted as absolute sizes of the training sets. Note that for classification the number of samples usually have to be big enough to contain at least one sample from each class.
es_es: Número relativo o absoluto de ejemplos de entrenamiento que se utilizarán para generar la curva de aprendizaje. Si el dtype es de punto flotante (float), se considera una fracción del tamaño máximo del conjunto de entrenamiento (que viene determinado por el método de validación seleccionado), es decir, tiene que estar dentro de (0, 1]. En caso contrario, se interpreta como el tamaño absoluto de los conjuntos de entrenamiento. Tenga en cuenta que, para la clasificación, el número de muestras suele ser lo suficientemente grande como para contener al menos una muestra de cada clase.

source: int, cross-validation generator or an iterable, default=None
es_es: int, generador de validación cruzada o un iterable, por defecto=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de separación de la validación cruzada. Las entradas posibles para cv son:

source: None, to use the default 5-fold cross validation,
es_es: None, para usar la validación cruzada de 5 pliegues por defecto,

source: int, to specify the number of folds in a `(Stratified)KFold`,
es_es: int, para especificar el número de pliegues en un `(Stratified)KFold`,

source: :term:`CV splitter`,
es_es: :term:`separador de CV`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce (train, test) se separa como arreglos de índices.

source: For int/None inputs, if the estimator is a classifier and ``y`` is either binary or multiclass, :class:`StratifiedKFold` is used. In all other cases, :class:`KFold` is used.
es_es: Para entradas int/None, si el estimador es un clasificador y ``y`` es binario o multiclase, se utiliza :class:`StratifiedKFold`. En todos los demás casos, se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado es ``cv`` si se cambia de 3 a 5 veces.

source: str or callable, default=None
es_es: cadena o invocable, default=None

source: A str (see model evaluation documentation) or a scorer callable object / function with signature ``scorer(estimator, X, y)``.
es_es: Un str (ver la documentación sobre la evaluación del modelo) o un objeto / función puntuador invocable con la firma ``scorer(estimator, X, y)``.

source: If the estimator supports incremental learning, this will be used to speed up fitting for different training set sizes.
es_es: Si el estimador admite el aprendizaje incremental, se utilizará para acelerar el ajuste para diferentes tamaños de conjuntos de entrenamiento.

source: Number of jobs to run in parallel. Training the estimator and computing the score are parallelized over the different training and test sets. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de trabajos a ejecutar en paralelo. El entrenamiento del estimador y el cálculo de la puntuación se ejecutan en paralelo sobre los diferentes conjuntos de entrenamiento y prueba. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: int or str, default='all'
es_es: int o str, default='all'

source: Number of predispatched jobs for parallel execution (default is all). The option can reduce the allocated memory. The str can be an expression like '2*n_jobs'.
es_es: Número de trabajos predespachados para la ejecución en paralelo (por defecto son todos). La opción puede reducir la memoria asignada. La cadena puede ser una expresión como '2*n_jobs'.

source: Controls the verbosity: the higher, the more messages.
es_es: Controla la verbosidad: cuanto más alta, más mensajes.

source: Whether to shuffle training data before taking prefixes of it based on``train_sizes``.
es_es: Si se mezclan los datos de entrenamiento antes de tomar prefijos de los mismos basados en ``train_sizes``.

source: int, RandomState instance or None, default=None
es_es: int, instancia RandomState o None, por defecto=None

source: Used when ``shuffle`` is True. Pass an int for reproducible output across multiple function calls. See :term:`Glossary <random_state>`.
es_es: Se utiliza cuando ``shuffle`` es True. Pase un int para que la salida sea reproducible a través de múltiples llamadas a la función. Ver :term:`Glosario <random_state>`.

source: 'raise' or numeric, default=np.nan
es_es: 'raise' o numérico, default=np.nan

source: Value to assign to the score if an error occurs in estimator fitting. If set to 'raise', the error is raised. If a numeric value is given, FitFailedWarning is raised.
es_es: Valor a asignar a la puntuación si se produce un error en el ajuste del estimador. Si se establece como 'raise', el error se eleva. Si se da un valor numérico, se levanta FitFailedWarning.

source: Whether to return the fit and score times.
es_es: Si se devuelven los tiempos de ajuste y puntuación.

source: Parameters to pass to the fit method of the estimator.
es_es: Parámetros para pasar al método de ajuste del estimador.

source: Returns
es_es: Devuelve

source: array of shape (n_unique_ticks,)
es_es: arreglo de forma (n_unique_ticks,)

source: Numbers of training examples that has been used to generate the learning curve. Note that the number of ticks might be less than n_ticks because duplicate entries will be removed.
es_es: Número de ejemplos de entrenamiento que se ha utilizado para generar la curva de aprendizaje. Tener en cuenta que el número de ticks podría ser menor que n_ticks porque se eliminarán las entradas duplicadas.

source: array of shape (n_ticks, n_cv_folds)
es_es: arreglo de forma (n_ticks, n_cv_folds)

source: Scores on training sets.
es_es: Puntuaciones en los conjuntos de entrenamiento.

source: Scores on test set.
es_es: Puntuaciones en conjunto de pruebas.

source: Times spent for fitting in seconds. Only present if ``return_times`` is True.
es_es: Tiempo empleado en el ajuste en segundos. Sólo está presente si ``return_times`` es True.

source: Times spent for scoring in seconds. Only present if ``return_times`` is True.
es_es: Tiempo empleado para la puntuación en segundos. Sólo está presente si ``return_times`` es True.

source: Notes
es_es: Notas

source: See :ref:`examples/model_selection/plot_learning_curve.py <sphx_glr_auto_examples_model_selection_plot_learning_curve.py>`
es_es: Ver :ref:`examples/model_selection/plot_learning_curve.py <sphx_glr_auto_examples_model_selection_plot_learning_curve.py>`

source: Examples using ``sklearn.model_selection.learning_curve``
es_es: Ejemplos usando ``sklearn.model_selection.learning_curve``
