Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.LabelBinarizer.po
Languages: es_es

source: Binarize labels in a one-vs-all fashion.
es_es: Binariza las etiquetas de una forma uno contra todos (one-vs-all).

source: Several regression and binary classification algorithms are available in scikit-learn. A simple way to extend these algorithms to the multi-class classification case is to use the so-called one-vs-all scheme.
es_es: Varios algoritmos de regresión y clasificación binaria están disponibles en scikit-learn. Una forma sencilla de extender estos algoritmos al caso de la clasificación multiclase es utilizar el llamado esquema de uno contra todos.

source: At learning time, this simply consists in learning one regressor or binary classifier per class. In doing so, one needs to convert multi-class labels to binary labels (belong or does not belong to the class). LabelBinarizer makes this process easy with the transform method.
es_es: En el momento del aprendizaje, esto consiste simplemente en aprender un regresor o clasificador binario por clase. Para ello, hay que convertir las etiquetas multiclase en etiquetas binarias (pertenece o no pertenece a la clase). LabelBinarizer facilita este proceso con el método de transformación.

source: At prediction time, one assigns the class for which the corresponding model gave the greatest confidence. LabelBinarizer makes this easy with the inverse_transform method.
es_es: En el momento de la predicción, se asigna la clase para la que el modelo correspondiente dio la mayor confianza. LabelBinarizer lo facilita con el método inverse_transform.

source: Read more in the :ref:`User Guide <preprocessing_targets>`.
es_es: Lee más en el :ref:`Manual de usuario <preprocessing_targets>`.

source: Parameters
es_es: Parámetros

source: Value with which negative labels must be encoded.
es_es: Valor con el que se deben codificar las etiquetas negativas.

source: Value with which positive labels must be encoded.
es_es: Valor con el que se deben codificar las etiquetas positivas.

source: True if the returned array from transform is desired to be in sparse CSR format.
es_es: True si se desea que el arreglo devuelto por la transformación esté en formato CSR disperso.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_classes,)
es_es: ndarray de forma (n_classes,)

source: Holds the label for each class.
es_es: Contiene la etiqueta para cada clase.

source: Represents the type of the target data as evaluated by utils.multiclass.type_of_target. Possible type are 'continuous', 'continuous-multioutput', 'binary', 'multiclass', 'multiclass-multioutput', 'multilabel-indicator', and 'unknown'.
es_es: Representa el tipo de los datos objetivo evaluados por utils.multiclass.type_of_target. Los tipos posibles son 'continuous', 'continuous-multioutput', 'binary', 'multiclass', 'multiclass-multioutput', 'multilabel-indicator' y 'unknown'.

source: True if the input data to transform is given as a sparse matrix, False otherwise.
es_es: True si los datos de entrada a transformar se dan como una matriz dispersa, False en caso contrario.

source: Function to perform the transform operation of LabelBinarizer with fixed classes.
es_es: Función para realizar la operación de transformación de LabelBinarizer con clases fijas.

source: Encode categorical features using a one-hot aka one-of-K scheme.
es_es: Codifica las características categóricas utilizando un esquema one-hot también conocido como uno de K (one-of-K).

source: Examples
es_es: Ejemplos

source: Binary targets transform to a column vector
es_es: Los objetivos binarios se transforman en un vector columna

source: Passing a 2D matrix for multilabel classification
es_es: Pasando una matriz 2D para la clasificación multietiqueta

source: Methods
es_es: Métodos

source: Fit label binarizer.
es_es: Ajusta el binarizador de etiquetas.

source: Fit label binarizer and transform multi-class labels to binary labels.
es_es: Ajusta el binarizador de etiquetas y transforma las etiquetas multiclase en etiquetas binarias.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Transform binary labels back to multi-class labels.
es_es: Transforma etiquetas binarias de nuevo en etiquetas multiclase.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Transform multi-class labels to binary labels.
es_es: Transforma etiquetas de multiclase en etiquetas binarias.

source: ndarray of shape (n_samples,) or (n_samples, n_classes)
es_es: ndarray de forma (n_samples,) o (n_samples, n_classes)

source: Target values. The 2-d matrix should only contain 0 and 1, represents multilabel classification.
es_es: Valores objetivo. La matriz 2-d sólo debe contener 0 y 1, representa la clasificación multietiqueta.

source: Returns
es_es: Devuelve

source: returns an instance of self.
es_es: devuelve una instancia de sí misma.

source: The output of transform is sometimes referred to as the 1-of-K coding scheme.
es_es: La salida de la transformación se denomina a veces esquema de codificación 1-de-K.

source: {ndarray, sparse matrix} of shape (n_samples,) or (n_samples, n_classes)
es_es: {ndarray, sparse matrix} de forma (n_samples,) o (n_samples, n_classes)

source: Target values. The 2-d matrix should only contain 0 and 1, represents multilabel classification. Sparse matrix can be CSR, CSC, COO, DOK, or LIL.
es_es: Valores objetivo. La matriz 2-d sólo debe contener 0 y 1, representa la clasificación multietiqueta. La matriz dispersa puede ser CSR, CSC, COO, DOK o LIL.

source: {ndarray, sparse matrix} of shape (n_samples, n_classes)
es_es: {ndarray, sparse matrix} de forma (n_samples, n_classes)

source: Shape will be (n_samples, 1) for binary problems. Sparse matrix will be of CSR format.
es_es: La forma será (n_samples, 1) para los problemas binarios. La matriz dispersa tendrá el formato CSR.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros mapeados a sus valores.

source: Target values. All sparse matrices are converted to CSR before inverse transformation.
es_es: Valores objetivo. Todas las matrices dispersas se convierten en CSR antes de la transformación inversa.

source: Threshold used in the binary and multi-label cases.
es_es: Umbral utilizado en los casos binarios y multietiqueta.

source: Use 0 when ``Y`` contains the output of decision_function (classifier). Use 0.5 when ``Y`` contains the output of predict_proba.
es_es: Utiliza 0 cuando ``Y`` contenga la salida de decision_function (clasificador). Utiliza 0,5 cuando ``Y`` contenga la salida de predict_proba.

source: If None, the threshold is assumed to be half way between neg_label and pos_label.
es_es: Si es None, se asume que el umbral está a medio camino entre neg_label y pos_label.

source: {ndarray, sparse matrix} of shape (n_samples,)
es_es: {ndarray, sparse matrix} de forma (n_samples,)

source: Target values. Sparse matrix will be of CSR format.
es_es: Valores objetivo. La matriz dispersa tendrá el formato CSR.

source: Notes
es_es: Notas

source: In the case when the binary labels are fractional (probabilistic), inverse_transform chooses the class with the greatest value. Typically, this allows to use the output of a linear model's decision_function method directly as the input of inverse_transform.
es_es: En el caso de que las etiquetas binarias sean fraccionarias (probabilísticas), inverse_transform elige la clase con el mayor valor. Normalmente, esto permite utilizar la salida del método decision_function de un modelo lineal directamente como entrada de inverse_transform.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: The output of transform is sometimes referred to by some authors as the 1-of-K coding scheme.
es_es: Algunos autores denominan a la salida de la transformación el esquema de codificación 1-de-K.

source: {array, sparse matrix} of shape (n_samples,) or (n_samples, n_classes)
es_es: {array, sparse matrix} de forma (n_samples,) o (n_samples, n_classes)
