Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.pairwise_distances.po
Languages: es_es

source: Compute the distance matrix from a vector array X and optional Y.
es_es: Calcula la matriz de distancia de un arreglo vectorial X y opcional Y.

source: This method takes either a vector array or a distance matrix, and returns a distance matrix. If the input is a vector array, the distances are computed. If the input is a distances matrix, it is returned instead.
es_es: Este método toma un arreglo vectorial o una matriz de distancia, y devuelve una matriz de distancia. Si la entrada es un arreglo vectorial, las distancias se calculan. Si la entrada es una matriz de distancia, se devuelve en su lugar.

source: This method provides a safe way to take a distance matrix as input, while preserving compatibility with many other algorithms that take a vector array.
es_es: Este método proporciona una forma segura de tomar una matriz de distancia como entrada, preservando la compatibilidad con muchos otros algoritmos que toman un arreglo vectorial.

source: If Y is given (default is None), then the returned matrix is the pairwise distance between the arrays from both X and Y.
es_es: Si se da Y (por defecto no es None), entonces la matriz devuelta es la distancia paralela entre los arreglos de X y Y.

source: Valid values for metric are:
es_es: Valores válidos para la métrica son:

source: From scikit-learn: ['cityblock', 'cosine', 'euclidean', 'l1', 'l2', 'manhattan']. These metrics support sparse matrix inputs. ['nan_euclidean'] but it does not yet support sparse matrices.
es_es: From scikit-learn: ['cityblock', 'cosine', 'euclidean', 'l1', 'l2', 'manhattan']. Estas métricas soportan entradas de matriz esparse. ['nan_euclidean'] pero todavía no soporta matrices dispersas.

source: From scipy.spatial.distance: ['braycurtis', 'canberra', 'chebyshev', 'correlation', 'dice', 'hamming', 'jaccard', 'kulsinski', 'mahalanobis', 'minkowski', 'rogerstanimoto', 'russellrao', 'seuclidean', 'sokalmichener', 'sokalsneath', 'sqeuclidean', 'yule'] See the documentation for scipy.spatial.distance for details on these metrics. These metrics do not support sparse matrix inputs.
es_es: Desde scipy.spatial.distance: ['braycurtis', 'canberra', 'chebyshev', 'correlation', 'dice', 'hamming', 'card', 'kulsinski', 'mahalanobis', 'minkowski', 'rogerstanimoto', 'russellrao', 'seuclidean', 'sokalmichener', 'sokalsneath', 'sqeuclidean', 'yule'] Ver la documentación para la ciencia. patial.distance para obtener detalles sobre estas métricas. Estas métricas no soportan entradas de matriz dispersa.

source: Note that in the case of 'cityblock', 'cosine' and 'euclidean' (which are valid scipy.spatial.distance metrics), the scikit-learn implementation will be used, which is faster and has support for sparse matrices (except for 'cityblock'). For a verbose description of the metrics from scikit-learn, see the __doc__ of the sklearn.pairwise.distance_metrics function.
es_es: Tenga en cuenta que en el caso de 'cityblock', 'cosine' y 'euclidean' (que son métricas válidas de scipy.spatial.distance), se utilizará la implementación de scikit-learn, que es más rápida y tiene soporte para matrices dispersas (excepto para 'cityblock'). Para una descripción detallada de las métricas de scikit-learn, véase el __doc__ de la función sklearn.pairwise.distance_metrics.

source: Read more in the :ref:`User Guide <metrics>`.
es_es: Más información en el :ref:`Manual de usuario <metrics>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_samples_X, n_samples_X) or (n_samples_X, n_features)
es_es: ndarray de forma (n_samples_X, n_samples_X) o (n_samples_X, n_features)

source: Array of pairwise distances between samples, or a feature array. The shape of the array should be (n_samples_X, n_samples_X) if metric == "precomputed" and (n_samples_X, n_features) otherwise.
es_es: Arreglo de distancias entre pares de muestras, o un arreglo de características. La forma del arreglo debe ser (n_samples_X, n_samples_X) si metric == "precomputed" y (n_samples_X, n_features) en caso contrario.

source: ndarray of shape (n_samples_Y, n_features), default=None
es_es: ndarray de forma (n_samples_Y, n_features), default=None

source: An optional second feature array. Only allowed if metric != "precomputed".
es_es: Un segundo arreglo de características opcional. Sólo se permite si metric != "precomputed".

source: str or callable, default='euclidean'
es_es: cadena de caracteres o invocable, default='euclidean'

source: The metric to use when calculating distance between instances in a feature array. If metric is a string, it must be one of the options allowed by scipy.spatial.distance.pdist for its metric parameter, or a metric listed in ``pairwise.PAIRWISE_DISTANCE_FUNCTIONS``. If metric is "precomputed", X is assumed to be a distance matrix. Alternatively, if metric is a callable function, it is called on each pair of instances (rows) and the resulting value recorded. The callable should take two arrays from X as input and return a value indicating the distance between them.
es_es: La métrica que se utilizará para calcular la distancia entre instancias en un arreglo de características. Si la métrica es una cadena, debe ser una de las opciones permitidas por scipy.spatial.distance.pdist para su parámetro de métrica, o una métrica listada en ``pairwise.PAIRWISE_DISTANCE_FUNCTIONS``. Si la métrica es "precomputed", se asume que X es una matriz de distancia. Alternativamente, si la métrica es una función invocable, se llama a cada par de instancias (filas) y se registra el valor resultante. El invocable debe tomar dos arreglos de X como entrada y devolver un valor que indique la distancia entre ellos.

source: int, default=None
es_es: entero, default=None

source: The number of jobs to use for the computation. This works by breaking down the pairwise matrix into n_jobs even slices and computing them in parallel.
es_es: El número de trabajos a utilizar para el cálculo. Esto funciona descomponiendo la matriz por pares en n_jobs partes iguales y calculándolas en paralelo.

source: ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Consulta :term:`Glosario <n_jobs>` para más detalles.

source: bool or 'allow-nan', default=True
es_es: booleano o 'allow-nan', default=True

source: Whether to raise an error on np.inf, np.nan, pd.NA in array. Ignored for a metric listed in ``pairwise.PAIRWISE_DISTANCE_FUNCTIONS``. The possibilities are:
es_es: Si se produce un error en np.inf, np.nan, pd.NA en el arreglo. Ignorado para una métrica listada en ``pairwise.PAIRWISE_DISTANCE_FUNCTIONS``. Las posibilidades son:

source: True: Force all values of array to be finite.
es_es: Verdadero: Forzar que todos los valores de la matriz sean finitos.

source: False: accepts np.inf, np.nan, pd.NA in array.
es_es: False: acepta np.inf, np.nan, pd.NA en el arreglo.

source: 'allow-nan': accepts only np.nan and pd.NA values in array. Values cannot be infinite.
es_es: 'allow-nan': sólo acepta valores np.nan y pd.NA en el arreglo. Los valores no pueden ser infinitos.

source: ``force_all_finite`` accepts the string ``'allow-nan'``.
es_es: ``force_all_finite`` acepta la cadena ``'allow-nan'``.

source: Accepts `pd.NA` and converts it into `np.nan`.
es_es: Acepta `pd.NA` y lo convierte en `np.nan`.

source: optional keyword parameters
es_es: parámetros opcionales de palabra clave

source: Any further parameters are passed directly to the distance function. If using a scipy.spatial.distance metric, the parameters are still metric dependent. See the scipy docs for usage examples.
es_es: Cualquier parámetro adicional se pasa directamente a la función de distancia. Si se utiliza una métrica scipy.spatial.distance, los parámetros siguen siendo dependientes de la métrica. Consulta los documentos scipy para ver ejemplos de uso.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples_X, n_samples_X) or (n_samples_X, n_samples_Y)
es_es: ndarray de forma (n_samples_X, n_samples_X) o (n_samples_X, n_samples_Y)

source: A distance matrix D such that D_{i, j} is the distance between the ith and jth vectors of the given matrix X, if Y is None. If Y is not None, then D_{i, j} is the distance between the ith array from X and the jth array from Y.
es_es: Una matriz D de distancia tal que D_{i, j} es la distancia entre los vectores i-ésimo y j-ésimo de la matriz dada X, si Y no lo es. Si Y no es None, entonces D_{i, j} es la distancia entre el arreglo i-ésimo de X y el arreglo j-ésimo de Y.

source: Performs the same calculation as this function, but returns a generator of chunks of the distance matrix, in order to limit memory usage.
es_es: Realiza el mismo cálculo que esta función, pero devuelve un generador de fragmentos de la matriz de distancia, para limitar el uso de memoria.

source: Computes the distances between corresponding elements of two arrays.
es_es: Calcula las distancias entre los elementos correspondientes de dos arreglos.
