Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.silhouette_samples.po
Languages: es_es

source: Compute the Silhouette Coefficient for each sample.
es_es: Calcula el Coeficiente de Silueta para cada muestra.

source: The Silhouette Coefficient is a measure of how well samples are clustered with samples that are similar to themselves. Clustering models with a high Silhouette Coefficient are said to be dense, where samples in the same cluster are similar to each other, and well separated, where samples in different clusters are not very similar to each other.
es_es: El Coeficiente de Silueta es una medida de qué también se agrupan las muestras con muestras que son similares a ellas mismas. Se dice que los modelos de agrupamiento con un Coeficiente de Silueta alto son densos, cuando las muestras en el mismo grupo son similares entre sí, y están bien separadas, cuando las muestras en diferentes grupos no son muy similares entre sí.

source: The Silhouette Coefficient is calculated using the mean intra-cluster distance (``a``) and the mean nearest-cluster distance (``b``) for each sample. The Silhouette Coefficient for a sample is ``(b - a) / max(a, b)``. Note that Silhouette Coefficient is only defined if number of labels is 2 ``<= n_labels <= n_samples - 1``.
es_es: El Coeficiente de Silueta se calcula utilizando la distancia media dentro del conglomerado (``a``) y la distancia media entre conglomerados más cercanos (``b``) para cada muestra. El Coeficiente de Silueta de una muestra es ``(b - a) / max(a, b)``. Ten en cuenta que el Coeficiente de Silueta sólo se define si el número de etiquetas es ``2 <= n_labels <= n_samples - 1``.

source: This function returns the Silhouette Coefficient for each sample.
es_es: Esta función devuelve el Coeficiente de Silueta para cada muestra.

source: The best value is 1 and the worst value is -1. Values near 0 indicate overlapping clusters.
es_es: El mejor valor es 1 y el peor valor es -1. Los valores cercanos a 0 indican conglomerados superpuestos.

source: Read more in the :ref:`User Guide <silhouette_coefficient>`.
es_es: Lee más en el :ref:`Manual de usuario <silhouette_coefficient>`.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples_a, n_samples_a) if metric == "precomputed" or (n_samples_a, n_features) otherwise
es_es: array-like de forma (n_samples_a, n_samples_a) si metric == "precomputed" o (n_samples_a, n_features) en caso contrario

source: An array of pairwise distances between samples, or a feature array.
es_es: Un arreglo de distancias entre pares de muestras, o un arreglo de características.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Label values for each sample.
es_es: Valores de etiqueta para cada muestra.

source: str or callable, default='euclidean'
es_es: str o invocable, default='euclidean'

source: The metric to use when calculating distance between instances in a feature array. If metric is a string, it must be one of the options allowed by :func:`sklearn.metrics.pairwise.pairwise_distances`. If ``X`` is the distance array itself, use "precomputed" as the metric. Precomputed distance matrices must have 0 along the diagonal.
es_es: La métrica a utilizar cuando se calcula la distancia entre instancias en un arreglo de características. Si la métrica es una cadena, debe ser una de las opciones permitidas por :func:`sklearn.metrics.pairwise.pairwise_distances`. Si ``X`` es el propio arreglo de distancias, utiliza "precomputed" como métrica. Las matrices de distancia precalculadas deben tener 0 en la diagonal.

source: Any further parameters are passed directly to the distance function. If using a ``scipy.spatial.distance`` metric, the parameters are still metric dependent. See the scipy docs for usage examples.
es_es: Cualquier parámetro adicional se pasa directamente a la función de distancia. Si utilizas una métrica scipy.spatial.distance, los parámetros siguen siendo dependientes de la métrica. Consulta los documentos scipy para ver ejemplos de uso.

source: Returns
es_es: Devuelve

source: Silhouette Coefficients for each sample.
es_es: Coeficientes de Silueta para cada muestra.

source: References
es_es: Referencias
