Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.check_array.po
Languages: es_es

source: Input validation on an array, list, sparse matrix or similar.
es_es: Validación de entrada en un arreglo, lista, matriz dispersa o similar.

source: By default, the input is checked to be a non-empty 2D array containing only finite values. If the dtype of the array is object, attempt converting to float, raising on failure.
es_es: Por defecto, se comprueba que la entrada es un arreglo 2D no vacío que contiene sólo valores finitos. Si el dtype del arreglo es un objeto, se intenta convertir a de punto flotante (float), y se produce un error.

source: Parameters
es_es: Parámetros

source: object
es_es: objeto

source: Input object to check / convert.
es_es: Objeto de entrada a comprobar/convertir.

source: str, bool or list/tuple of str, default=False
es_es: str, booleano o lista/tupla de str, default=False

source: String[s] representing allowed sparse matrix formats, such as 'csc', 'csr', etc. If the input is sparse but not in the allowed format, it will be converted to the first listed format. True allows the input to be any format. False means that a sparse matrix input will raise an error.
es_es: Cadena[s] que representa los formatos de matriz dispersa permitidos, como 'csc', 'csr', etc. Si la entrada es dispersa pero no está en el formato permitido, se convertirá al primer formato de la lista. True permite que la entrada sea cualquier formato. False significa que una entrada de matriz dispersa dará lugar a un error.

source: If a CSR, CSC, COO or BSR sparse matrix is supplied and accepted by accept_sparse, accept_large_sparse=False will cause it to be accepted only if its indices are stored with a 32-bit dtype.
es_es: Si se suministra una matriz dispersa CSR, CSC, COO o BSR y se acepta mediante accept_sparse, accept_large_sparse=False hará que se acepte sólo si sus índices se almacenan con un dtype de 32 bits.

source: 'numeric', type, list of type or None, default='numeric'
es_es: 'numeric', type, lista de tipos o None, default='numeric'

source: Data type of result. If None, the dtype of the input is preserved. If "numeric", dtype is preserved unless array.dtype is object. If dtype is a list of types, conversion on the first type is only performed if the dtype of the input is not in the list.
es_es: Tipo de datos del resultado. Si es None, se conserva el dtype de la entrada. Si es "numérico", se preserva el tipo de datos a menos que array.dtype sea un objeto. Si dtype es una lista de tipos, la conversión en el primer tipo sólo se realiza si el dtype de la entrada no está en la lista.

source: {'F', 'C'} or None, default=None
es_es: {'F', 'C'} o None, default=None

source: Whether an array will be forced to be fortran or c-style. When order is None (default), then if copy=False, nothing is ensured about the memory layout of the output array; otherwise (copy=True) the memory layout of the returned array is kept as close as possible to the original array.
es_es: Si se forzara un arreglo al estilo fortran o c. Cuando la orden es None (predeterminado), entonces si copy=False, no se asegura nada sobre la disposición de memoria del arreglo de salida; en caso contrario (copy=True) la disposición de memoria del arreglo devuelto se mantiene lo más cerca posible del arreglo original.

source: bool, default=False
es_es: booleano, default=False

source: Whether a forced copy will be triggered. If copy=False, a copy might be triggered by a conversion.
es_es: Si se activará una copia forzada. Si copy=False, una copia podría ser desencadenada por una conversión.

source: bool or 'allow-nan', default=True
es_es: bool o 'allow-nan', default=True

source: Whether to raise an error on np.inf, np.nan, pd.NA in array. The possibilities are:
es_es: Si se debe lanzar un error sobre np.inf, np.nan, pd.NA en el arreglo. Las posibilidades son:

source: True: Force all values of array to be finite.
es_es: Verdadero: Fuerza que todos los valores del arreglo sean finitos.

source: False: accepts np.inf, np.nan, pd.NA in array.
es_es: False: acepta np.inf, np.nan, pd.NA en el arreglo.

source: 'allow-nan': accepts only np.nan and pd.NA values in array. Values cannot be infinite.
es_es: ``allow-nan``: sólo acepta valores np.nan y pd.NA en el arreglo. Los valores no pueden ser infinitos.

source: ``force_all_finite`` accepts the string ``'allow-nan'``.
es_es: ``force_all_finite`` acepta la cadena ``'allow-nan``.

source: Accepts `pd.NA` and converts it into `np.nan`
es_es: Acepta `pd.NA` y lo convierte en `np.nan`

source: Whether to raise a value error if array is not 2D.
es_es: Si se debe emitir un error de valor si el arreglo no es 2D.

source: Whether to allow array.ndim > 2.
es_es: Permitir o no el arreglo.ndim > 2.

source: Make sure that the array has a minimum number of samples in its first axis (rows for a 2D array). Setting to 0 disables this check.
es_es: Asegúrese de que el arreglo tiene un número mínimo de muestras en su primer eje (filas para un arreglo 2D). El valor 0 desactiva esta comprobación.

source: Make sure that the 2D array has some minimum number of features (columns). The default value of 1 rejects empty datasets. This check is only enforced when the input data has effectively 2 dimensions or is originally 1D and ``ensure_2d`` is True. Setting to 0 disables this check.
es_es: Asegúrese de que el arreglo 2D tiene un número mínimo de características (columnas). El valor por defecto de 1 rechaza los conjuntos de datos vacíos. Esta comprobación sólo se aplica cuando los datos de entrada tienen efectivamente 2 dimensiones o son originalmente 1D y ``ensure_2d`` es True. El valor 0 desactiva esta comprobación.

source: str or estimator instance, default=None
es_es: str o instancia del estimador, default=None

source: If passed, include the name of the estimator in warning messages.
es_es: Si se pasa, incluye el nombre del estimador en los mensajes de advertencia.

source: Returns
es_es: Devuelve

source: The converted and validated array.
es_es: El arreglo convertido y validado.
