Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.consensus_score.po
Languages: es_es

source: The similarity of two sets of biclusters.
es_es: La similitud de dos conjuntos de biclusters.

source: Similarity between individual biclusters is computed. Then the best matching between sets is found using the Hungarian algorithm. The final score is the sum of similarities divided by the size of the larger set.
es_es: Se calcula la similitud entre los biclusters individuales. Entonces se encuentra la mejor coincidencia entre conjuntos utilizando el algoritmo Húngaro. La puntuación final es la suma de similitudes divididas por el tamaño del conjunto más grande.

source: Read more in the :ref:`User Guide <biclustering>`.
es_es: Más información en el :ref:`Manual de usuario <biclustering>`.

source: Parameters
es_es: Parámetros

source: (rows, columns)
es_es: (filas, columnas)

source: Tuple of row and column indicators for a set of biclusters.
es_es: Tupla de indicadores de fila y columna para un conjunto de biclusters.

source: Another set of biclusters like ``a``.
es_es: Otro conjunto de biclusters como ``a``.

source: 'jaccard' or callable, default='jaccard'
es_es: 'jaccard' o invocable, default='jaccard'

source: May be the string "jaccard" to use the Jaccard coefficient, or any function that takes four arguments, each of which is a 1d indicator vector: (a_rows, a_columns, b_rows, b_columns).
es_es: Podría ser la cadena "jaccard" para usar el coeficiente Jaccard, o cualquier función que tome cuatro argumentos, cada uno de los cuales es un vector de indicador 1d: (a_rows, a_columns, b_rows, b_columns).

source: References
es_es: Referencias
