Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.random.sample_without_replacement.po
Languages: es_es

source: Sample integers without replacement.
es_es: Muestra de enteros sin reemplazo.

source: Select n_samples integers from the set [0, n_population) without replacement.
es_es: Selecciona n_samples enteras del conjunto [0, n_population) sin reemplazo.

source: Parameters
es_es: Parámetros

source: The size of the set to sample from.
es_es: El tamaño del conjunto del que se tomará la muestra.

source: The number of integer to sample.
es_es: El número de enteros a muestrear.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: If int, random_state is the seed used by the random number generator; If RandomState instance, random_state is the random number generator; If None, the random number generator is the RandomState instance used by `np.random`.
es_es: Si es un número entero (int), random_state es la semilla utilizada por el generador de números aleatorios; Si es una instancia de RandomState, random_state es el generador de números aleatorios; Si es None, el generador de números aleatorios es la instancia de RandomState utilizada por `np.random`.

source: If method == "auto", the ratio of n_samples / n_population is used to determine which algorithm to use: If ratio is between 0 and 0.01, tracking selection is used. If ratio is between 0.01 and 0.99, numpy.random.permutation is used. If ratio is greater than 0.99, reservoir sampling is used. The order of the selected integers is undefined. If a random order is desired, the selected subset should be shuffled.
es_es: Si method == "auto", se utiliza la proporción n_samples / n_population para determinar el algoritmo a utilizar: Si la proporción está entre 0 y 0.01, se utiliza la selección de seguimiento. Si la proporción está entre 0.01 y 0.99, se utiliza numpy.random.permutation. Si la proporción es mayor que 0.99, se utiliza el muestreo de reservorio. El orden de los enteros seleccionados no está definido. Si se desea un orden aleatorio, se debe revolver el subconjunto seleccionado.

source: If method =="tracking_selection", a set based implementation is used which is suitable for `n_samples` <<< `n_population`.
es_es: Si method =="tracking_selection", se utiliza una implementación basada en conjuntos que es adecuada para `n_samples` <<< `n_population`.

source: If method == "reservoir_sampling", a reservoir sampling algorithm is used which is suitable for high memory constraint or when O(`n_samples`) ~ O(`n_population`). The order of the selected integers is undefined. If a random order is desired, the selected subset should be shuffled.
es_es: Si method == "reservoir_sampling", se utiliza un algoritmo de muestreo de reservorio que es adecuado para una alta restricción de memoria o cuando O(`n_samples`) ~ O(`n_population`). El orden de los enteros seleccionados no está definido. Si se desea un orden aleatorio, se debe revolver el subconjunto seleccionado.

source: If method == "pool", a pool based algorithm is particularly fast, even faster than the tracking selection method. However, a vector containing the entire population has to be initialized. If n_samples ~ n_population, the reservoir sampling method is faster.
es_es: Si method == "pool", un algoritmo basado en pool es particularmente rápido, incluso más rápido que el método de selección de seguimiento. Sin embargo, hay que inicializar un vector que contenga toda la población. Si n_samples ~ n_population, el método de muestreo de reservorio es más rápido.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples,)
es_es: ndarray de forma (n_samples,)

source: The sampled subsets of integer. The subset of selected integer might not be randomized, see the method argument.
es_es: Los subconjuntos de enteros muestreados. El subconjunto de enteros seleccionados podría no ser aleatorio, ver el argumento del método.
