Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.recall_score.po
Languages: es_es

source: Compute the recall.
es_es: Calcula la exhaustividad.

source: The recall is the ratio ``tp / (tp + fn)`` where ``tp`` is the number of true positives and ``fn`` the number of false negatives. The recall is intuitively the ability of the classifier to find all the positive samples.
es_es: La exhaustividad es la razón ``tp / (tp + fn)`` donde ``tp`` es el número de verdaderos positivos y ``fn`` el número de falsos negativos. La exhaustividad es, intuitivamente, la capacidad del clasificador para encontrar todas las muestras positivas.

source: The best value is 1 and the worst value is 0.
es_es: El mejor valor es 1 y el peor valor es 0.

source: Read more in the :ref:`User Guide <precision_recall_f_measure_metrics>`.
es_es: Lee más en el :ref:`Manual de usuario <precision_recall_f_measure_metrics>`.

source: Parameters
es_es: Parámetros

source: 1d array-like, or label indicator array / sparse matrix
es_es: array-like 1d, o arreglo indicador de etiqueta / matriz dispersa

source: Ground truth (correct) target values.
es_es: Valores objetivo (correctos) de verdad fundamental.

source: Estimated targets as returned by a classifier.
es_es: Objetivos estimados devueltos por un clasificador.

source: The set of labels to include when ``average != 'binary'``, and their order if ``average is None``. Labels present in the data can be excluded, for example to calculate a multiclass average ignoring a majority negative class, while labels not present in the data will result in 0 components in a macro average. For multilabel targets, labels are column indices. By default, all labels in ``y_true`` and ``y_pred`` are used in sorted order.
es_es: El conjunto de etiquetas a incluir cuando ``average != 'binary'``, y su orden si ``average is None``. Las etiquetas presentes en los datos pueden ser excluidas, por ejemplo para calcular un promedio multiclase ignorando una clase mayoritariamente negativa, mientras que las etiquetas no presentes en los datos resultarán en 0 componentes en un macro promedio. Para los objetivos multietiqueta, las etiquetas son índices de columna. Por defecto, todas las etiquetas en ``y_true`` y ``y_pred`` se utilizan en orden ordenado.

source: Parameter `labels` improved for multiclass problem.
es_es: Parámetro `labels` mejorado para problemas multiclase.

source: str or int, default=1
es_es: str o int, default=1

source: The class to report if ``average='binary'`` and the data is binary. If the data are multiclass or multilabel, this will be ignored; setting ``labels=[pos_label]`` and ``average != 'binary'`` will report scores for that label only.
es_es: La clase para informar si ``average='binary'`` y los datos son binarios. Si los datos son multiclase o multietiqueta, esto se ignorará; la configuración de `` labels = [pos_label] '' y `` average! = 'binary'`` reportará puntajes para esa etiqueta solamente.

source: This parameter is required for multiclass/multilabel targets. If ``None``, the scores for each class are returned. Otherwise, this determines the type of averaging performed on the data:
es_es: Este parámetro es necesario para objetivos multiclase/multietiqueta. Si es ``None``, se devuelven las puntuaciones de cada clase. De lo contrario, determina el tipo de promedio realizado en los datos:

source: Only report results for the class specified by ``pos_label``. This is applicable only if targets (``y_{true,pred}``) are binary.
es_es: Sólo informa de los resultados para la clase especificada por ``pos_label``. Esto es aplicable sólo si los objetivos (``y_{true,pred}``) son binarios.

source: Calculate metrics globally by counting the total true positives, false negatives and false positives.
es_es: Calcula las métricas globalmente contando el total de verdaderos positivos, falsos negativos y falsos positivos.

source: Calculate metrics for each label, and find their unweighted mean. This does not take label imbalance into account.
es_es: Calcula las métricas para cada etiqueta y encuentra su media no ponderada. Esto no tiene en cuenta el desequilibrio de etiquetas.

source: Calculate metrics for each label, and find their average weighted by support (the number of true instances for each label). This alters 'macro' to account for label imbalance; it can result in an F-score that is not between precision and recall.
es_es: Calcula las métricas para cada etiqueta y encuentra su promedio ponderado por soporte (el número de instancias verdaderas para cada etiqueta). Esto altera 'macro' para tener en cuenta el desequilibrio de la etiqueta; puede resultar en una puntuación F que no esté entre la precisión y la exhaustividad.

source: Calculate metrics for each instance, and find their average (only meaningful for multilabel classification where this differs from :func:`accuracy_score`).
es_es: Calcula las métricas para cada instancia, y encuentra su promedio (sólo tiene sentido para la clasificación multietiqueta donde esto difiere de :func:`accuracy_score`).

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: "warn", 0 or 1, default="warn"
es_es: "warn", 0 o 1, default="warn"

source: Sets the value to return when there is a zero division. If set to "warn", this acts as 0, but warnings are also raised.
es_es: Establece el valor que se devolverá cuando haya una división cero. Si se establece en "warn", esto actúa como 0, pero también se generan advertencias.

source: Returns
es_es: Devuelve

source: float (if average is not None) or array of float of shape
es_es: float (if average is not None) o array of float of shape

source: (n_unique_labels,) Recall of the positive class in binary classification or weighted average of the recall of each class for the multiclass task.
es_es: (n_unique_labels,) Exhaustividad de la clase positiva en la clasificación binaria o promedio ponderado de la exhaustividad de cada clase para la tarea multiclase.

source: Notes
es_es: Notas

source: When ``true positive + false negative == 0``, recall returns 0 and raises ``UndefinedMetricWarning``. This behavior can be modified with ``zero_division``.
es_es: Cuando ``true positive + false positive == 0``, la exhaustividad devuelve 0 y genera ``UndefinedMetricWarning``. Este comportamiento puede ser modificado con ``zero_division``.

source: Examples
es_es: Ejemplos

source: Examples using ``sklearn.metrics.recall_score``
es_es: Ejemplos utilizando ``sklearn.metrics.recall_score``
