Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.dcg_score.po
Languages: es_es

source: Compute Discounted Cumulative Gain.
es_es: Calcula la Ganancia Acumulada Descontada.

source: Sum the true scores ranked in the order induced by the predicted scores, after applying a logarithmic discount.
es_es: Suma las verdaderas puntuaciones clasificadas en el orden inducido por las puntuaciones predichas, después de aplicar un descuento logarítmico.

source: This ranking metric yields a high value if true labels are ranked high by ``y_score``.
es_es: Esta métrica de clasificación produce un valor alto si las etiquetas verdaderas son clasificadas como altas por ``y_score``.

source: Usually the Normalized Discounted Cumulative Gain (NDCG, computed by ndcg_score) is preferred.
es_es: Normalmente se prefiere la Ganancia Cumulativa Normalizada con Descontado (NDCG, calculada por ndcg_score).

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_samples, n_labels)
es_es: ndarray de forma (n_samples, n_labels)

source: True targets of multilabel classification, or true scores of entities to be ranked.
es_es: Objetivos reales de clasificación multietiqueta, o verdaderas puntuaciones de entidades a clasificar.

source: Target scores, can either be probability estimates, confidence values, or non-thresholded measure of decisions (as returned by "decision_function" on some classifiers).
es_es: Los puntajes objetivo, pueden ser estimados de probabilidad, valores de confianza, o una medida sin umbrales de decisiones (como es devuelva por "decision_function" en algunos clasificadores).

source: int, default=None
es_es: entero, default=None

source: Only consider the highest k scores in the ranking. If None, use all outputs.
es_es: Sólo considera las puntuaciones k más altas en la clasificación. Si es None, utiliza todas las salidas.

source: float, default=2
es_es: flotante, default=2

source: Base of the logarithm used for the discount. A low value means a sharper discount (top results are more important).
es_es: Base del logaritmo utilizado para el descuento. Un valor bajo significa un descuento más nítido (los resultados tope son más importantes).

source: ndarray of shape (n_samples,), default=None
es_es: ndarray de forma (n_samples,), default=None

source: Sample weights. If None, all samples are given the same weight.
es_es: Ponderaciones de las muestras. Si es None, todas las muestras tienen el mismo ponderado.

source: bool, default=False
es_es: booleano, default=False

source: Assume that there are no ties in y_score (which is likely to be the case if y_score is continuous) for efficiency gains.
es_es: Asume que no hay vínculos en y_score (lo que probablemente sea el caso si y_score es continuo) para las ganancias de eficiencia.

source: Returns
es_es: Devuelve

source: float
es_es: flotante

source: The averaged sample DCG scores.
es_es: Los puntajes de muestra DCG promediados.

source: The Discounted Cumulative Gain divided by the Ideal Discounted Cumulative Gain (the DCG obtained for a perfect ranking), in order to have a score between 0 and 1.
es_es: La Ganancia Acumulativa con Descuento (DCG) dividida por la Ganancia Acumulativa con Descuento Ideal (el DCG obtenido por un ranking perfecto), para tener un puntaje entre 0 y 1.

source: References
es_es: Referencias

source: `Wikipedia entry for Discounted Cumulative Gain <https://en.wikipedia.org/wiki/Discounted_cumulative_gain>`_.
es_es: `Entrada de Wikipedia para Ganancia Acumulada Descontada <https://en.wikipedia.org/wiki/Discounted_cumulative_gain>`_.

source: Examples
es_es: Ejemplos
