Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_extraction.image.img_to_graph.po
Languages: es_es

source: Graph of the pixel-to-pixel gradient connections
es_es: Grafo de las conexiones de gradiente de píxel-a-píxel

source: Edges are weighted with the gradient values.
es_es: Los bordes se ponderan con los valores del gradiente.

source: Read more in the :ref:`User Guide <image_feature_extraction>`.
es_es: Lee más en el :ref:`Manual de usuario <image_feature_extraction>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (height, width) or (height, width, channel)
es_es: ndarray de forma (height, width) o (height, width, channel)

source: 2D or 3D image.
es_es: Imagen 2D o 3D.

source: ndarray of shape (height, width) or (height, width, channel), dtype=bool, default=None
es_es: ndarray de forma (height, width) o (height, width, channel), dtype=bool, default=None

source: An optional mask of the image, to consider only part of the pixels.
es_es: Una máscara opcional de la imagen, para considerar sólo una parte de los píxeles.

source: np.ndarray or a sparse matrix class, default=sparse.coo_matrix
es_es: np.ndarray o una sparse matrix class, default=sparse.coo_matrix

source: The class to use to build the returned adjacency matrix.
es_es: La clase que se utilizará para construir la matriz de adyacencia devuelta.

source: The data of the returned sparse matrix. By default it is the dtype of img
es_es: Los datos de la matriz dispersa devuelta. Por defecto es el dtype de img

source: Notes
es_es: Notas

source: For scikit-learn versions 0.14.1 and prior, return_as=np.ndarray was handled by returning a dense np.matrix instance. Going forward, np.ndarray returns an np.ndarray, as expected.
es_es: Para las versiones de scikit-learn 0.14.1 y anteriores, return_as=np.ndarray se manejaba devolviendo una instancia densa de np.matrix. A partir de ahora, np.ndarray devuelve un np.ndarray, como se esperaba.

source: For compatibility, user code relying on this method should wrap its calls in ``np.asarray`` to avoid type issues.
es_es: Por compatibilidad, el código de usuario que depende de este método debe envolver sus invocaciones en ``np.asarray`` para evitar incidencias de tipo (type).
