Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.ensemble.RandomTreesEmbedding.po
Languages: es_es

source: An ensemble of totally random trees.
es_es: Un conjunto de árboles totalmente aleatorios.

source: An unsupervised transformation of a dataset to a high-dimensional sparse representation. A datapoint is coded according to which leaf of each tree it is sorted into. Using a one-hot encoding of the leaves, this leads to a binary coding with as many ones as there are trees in the forest.
es_es: Una transformación no supervisada de un conjunto de datos a una representación dispersa de alta dimensión. Un punto de datos se codifica según la hoja de cada árbol en la que se clasifica. Utilizando una codificación one-hot de las hojas, se obtiene una codificación binaria con tantos unos como árboles hay en el bosque.

source: The dimensionality of the resulting representation is ``n_out <= n_estimators * max_leaf_nodes``. If ``max_leaf_nodes == None``, the number of leaf nodes is at most ``n_estimators * 2 ** max_depth``.
es_es: La dimensionalidad de la representación resultante es ``n_out <= n_estimators * max_leaf_nodes``. Si ``max_leaf_nodes == None``, el número de nodos hoja es como máximo ``n_estimators * 2 ** max_depth``.

source: Read more in the :ref:`User Guide <random_trees_embedding>`.
es_es: Más información en el :ref:`Manual de usuario <random_trees_embedding>`.

source: Parameters
es_es: Parámetros

source: Number of trees in the forest.
es_es: Número de árboles en el bosque.

source: The default value of ``n_estimators`` changed from 10 to 100 in 0.22.
es_es: El valor predeterminado de ``n_estimators`` cambió de 10 a 100 en 0.22.

source: The maximum depth of each tree. If None, then nodes are expanded until all leaves are pure or until all leaves contain less than min_samples_split samples.
es_es: La profundidad máxima de cada árbol. Si es None, los nodos se expanden hasta que todas las hojas sean puras o hasta que todas las hojas contengan menos de min_samples_split muestras.

source: int or float, default=2
es_es: int o float, default=2

source: The minimum number of samples required to split an internal node:
es_es: El número mínimo de muestras requeridas para dividir un nodo interno:

source: If int, then consider `min_samples_split` as the minimum number.
es_es: Si es int, entonces considera `min_samples_split` como el número mínimo.

source: If float, then `min_samples_split` is a fraction and `ceil(min_samples_split * n_samples)` is the minimum number of samples for each split.
es_es: Si es float, entonces `min_samples_split` es una fracción y `ceil(min_samples_split * n_samples)` es el número mínimo de muestras para cada división.

source: Added float values for fractions.
es_es: Se han añadido valores float para las fracciones.

source: int or float, default=1
es_es: int o float, default=1

source: The minimum number of samples required to be at a leaf node. A split point at any depth will only be considered if it leaves at least ``min_samples_leaf`` training samples in each of the left and right branches. This may have the effect of smoothing the model, especially in regression.
es_es: El número mínimo de muestras requerido para estar en un nodo hoja. Un punto de división en cualquier profundidad sólo se considerará si deja al menos ``min_samples_leaf`` muestras de entrenamiento en cada una de las ramas izquierda y derecha. Esto puede tener el efecto de suavizar el modelo, especialmente en la regresión.

source: If int, then consider `min_samples_leaf` as the minimum number.
es_es: Si es int, entonces considera `min_samples_leaf` como el número mínimo.

source: If float, then `min_samples_leaf` is a fraction and `ceil(min_samples_leaf * n_samples)` is the minimum number of samples for each node.
es_es: Si es float, entonces `min_samples_leaf` es una fracción y `ceil(min_samples_leaf * n_samples)` es el número mínimo de muestras para cada nodo.

source: The minimum weighted fraction of the sum total of weights (of all the input samples) required to be at a leaf node. Samples have equal weight when sample_weight is not provided.
es_es: La fracción mínima ponderada de la suma total de las ponderaciones (de todas las muestras de entrada) requerida para estar en un nodo de hoja. Las muestras tienen la misma ponderación cuando no se proporciona sample_weight.

source: Grow trees with ``max_leaf_nodes`` in best-first fashion. Best nodes are defined as relative reduction in impurity. If None then unlimited number of leaf nodes.
es_es: Hace crecer árboles con ``max_leaf_nodes`` en modo best-first. Los mejores nodos se definen como una reducción relativa de la impureza. Si es None, el número de nodos hoja es ilimitado.

source: A node will be split if this split induces a decrease of the impurity greater than or equal to this value.
es_es: Un nodo se dividirá si esta división induce una disminución de la impureza mayor o igual a este valor.

source: The weighted impurity decrease equation is the following::
es_es: La ecuación de disminución de impurezas ponderada es la siguiente::

source: where ``N`` is the total number of samples, ``N_t`` is the number of samples at the current node, ``N_t_L`` is the number of samples in the left child, and ``N_t_R`` is the number of samples in the right child.
es_es: donde ``N`` es el número total de muestras, ``N_t`` es el número de muestras en el nodo actual, ``N_t_L`` es el número de muestras en el hijo izquierdo, y ``N_t_R`` es el número de muestras en el hijo derecho.

source: ``N``, ``N_t``, ``N_t_R`` and ``N_t_L`` all refer to the weighted sum, if ``sample_weight`` is passed.
es_es: ``N``, ``N_t``, ``N_t_R`` y ``N_t_L`` se refieren a la suma ponderada, si se le pasa ``sample_weight``.

source: Threshold for early stopping in tree growth. A node will split if its impurity is above the threshold, otherwise it is a leaf.
es_es: El umbral para la parada anticipada del crecimiento del árbol. Un nodo se dividirá si su impureza está por encima del umbral, de lo contrario será una hoja.

source: ``min_impurity_split`` has been deprecated in favor of ``min_impurity_decrease`` in 0.19. The default value of ``min_impurity_split`` has changed from 1e-7 to 0 in 0.23 and it will be removed in 1.0 (renaming of 0.25). Use ``min_impurity_decrease`` instead.
es_es: El valor de ``min_impurity_split`` ha quedado obsoleto en favor de ``min_impurity_decrease`` en la versión 0.19. El valor predeterminado de ``min_impurity_split`` ha cambiado de 1e-7 a 0 en 0.23 y se eliminará en 1.0 (cambio de nombre de 0.25). Utilice ``min_impurity_decrease`` en su lugar.

source: Whether or not to return a sparse CSR matrix, as default behavior, or to return a dense array compatible with dense pipeline operators.
es_es: Ya sea para devolver o no una matriz de CSR dispersa, como comportamiento predeterminado, o para devolver un arreglo denso compatible con operadores de pipeline densos.

source: The number of jobs to run in parallel. :meth:`fit`, :meth:`transform`, :meth:`decision_path` and :meth:`apply` are all parallelized over the trees. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: El número de trabajos a ejecutar en paralelo. :meth:`fit`, :meth:`transform`, :meth:`decision_path` y :meth:`apply` se paralelizan sobre los árboles. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa que se utilizan todos los procesadores. Ver :term:`Glosario <n_jobs>` para más detalles.

source: int, RandomState instance or None, default=None
es_es: entero, instancia de RandomState o None, default=None

source: Controls the generation of the random `y` used to fit the trees and the draw of the splits for each feature at the trees' nodes. See :term:`Glossary <random_state>` for details.
es_es: Controla la generación del estado 'y' aleatorio utilizado para ajustar los árboles y escoger las divisiones para cada característica en los nodos de los árboles. Ver :term:`Glosario <random_state>` para más detalles.

source: Controls the verbosity when fitting and predicting.
es_es: Controla la verbosidad al ajustar y predecir.

source: When set to ``True``, reuse the solution of the previous call to fit and add more estimators to the ensemble, otherwise, just fit a whole new forest. See :term:`the Glossary <warm_start>`.
es_es: Cuando se establece en ``True``, se reutiliza la solución de la llamada anterior para ajustar y añadir más estimadores al conjunto(ensemble), de lo contrario, sólo se ajusta un bosque nuevo. Ver :term:`el Glosario <warm_start>`.

source: Attributes
es_es: Atributos

source: DecisionTreeClassifier instance
es_es: Instancia DecisionTreeClassifier

source: The child estimator template used to create the collection of fitted sub-estimators.
es_es: La plantilla del estimador hijo utilizada para crear la colección de sub-estimadores ajustados.

source: list of DecisionTreeClassifier instances
es_es: list de instancias DecisionTreeClassifier

source: The collection of fitted sub-estimators.
es_es: La colección de sub-estimadores ajustados.

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features,)

source: The impurity-based feature importances.
es_es: La importancia de las características basadas en la impureza.

source: The number of features when ``fit`` is performed.
es_es: El número de características cuando se realiza ``fit``.

source: The number of outputs when ``fit`` is performed.
es_es: El número de salidas cuando se realiza ``fit``.

source: OneHotEncoder instance
es_es: Instancia OneHotEncoder

source: One-hot encoder used to create the sparse embedding.
es_es: Codificador one-hot utilizado para crear la incrustación dispersa.

source: References
es_es: Referencias

source: P. Geurts, D. Ernst., and L. Wehenkel, "Extremely randomized trees", Machine Learning, 63(1), 3-42, 2006.
es_es: P. Geurts, D. Ernst., y L. Wehenkel, "Extremely randomized trees", Machine Learning, 63(1), 3-42, 2006.

source: Moosmann, F. and Triggs, B. and Jurie, F. "Fast discriminative visual codebooks using randomized clustering forests" NIPS 2007
es_es: Moosmann, F. and Triggs, B. y Jurie, F. "Fast discriminative visual codebooks using randomized clustering forests" NIPS 2007

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Apply trees in the forest to X, return leaf indices.
es_es: Aplica los árboles del bosque a X, devuelve los índices de las hojas.

source: Return the decision path in the forest.
es_es: Devuelve la ruta de decisión en el bosque.

source: Fit estimator.
es_es: Ajusta el estimador.

source: Fit estimator and transform dataset.
es_es: Ajusta el estimador y transforma el conjunto de datos.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Transform dataset.
es_es: Transforma el conjunto de datos.

source: {array-like, sparse matrix} of shape (n_samples, n_features)
es_es: {array-like, sparse matrix} de forma (n_samples, n_features)

source: The input samples. Internally, its dtype will be converted to ``dtype=np.float32``. If a sparse matrix is provided, it will be converted into a sparse ``csr_matrix``.
es_es: Las muestras de entrada. Internamente, su dtype se convertirá a ``dtype=np.float32``. Si se proporciona una matriz dispersa, se convertirá a una dispersa ``csr_matrix``.

source: Returns
es_es: Devuelve

source: ndarray of shape (n_samples, n_estimators)
es_es: ndarray de forma (n_samples, n_estimators)

source: For each datapoint x in X and for each tree in the forest, return the index of the leaf x ends up in.
es_es: Para cada punto de datos x en X y para cada árbol del bosque, devuelve el índice de la hoja en la que termina x.

source: sparse matrix of shape (n_samples, n_nodes)
es_es: matriz dispersa de forma (n_samples, n_nodes)

source: Return a node indicator matrix where non zero elements indicates that the samples goes through the nodes. The matrix is of CSR format.
es_es: Devuelve una matriz de indicadores de nodos donde los elementos distintos de cero indican que las muestras pasan por los nodos. La matriz tiene el formato CSR.

source: ndarray of shape (n_estimators + 1,)
es_es: ndarray de forma (n_estimators + 1,)

source: The columns from indicator[n_nodes_ptr[i]:n_nodes_ptr[i+1]] gives the indicator value for the i-th estimator.
es_es: Las columnas de indicador[n_nodes_ptr[i]:n_nodes_ptr[i+1]] dan el valor del indicador para el i-ésimo estimador.

source: The higher, the more important the feature. The importance of a feature is computed as the (normalized) total reduction of the criterion brought by that feature. It is also known as the Gini importance.
es_es: Cuanto más alta sea, más importante será la característica. La importancia de una característica se calcula como la reducción total (normalizada) del criterio que aporta esa característica. También se conoce como importancia de Gini.

source: Warning: impurity-based feature importances can be misleading for high cardinality features (many unique values). See :func:`sklearn.inspection.permutation_importance` as an alternative.
es_es: Advertencia: las importancias de característica basadas en la impureza pueden ser engañosas para las características de alta cardinalidad (muchos valores únicos). Ver :func:`sklearn.inspection.permutation_importance` como una alternativa.

source: The values of this array sum to 1, unless all trees are single node trees consisting of only the root node, in which case it will be an array of zeros.
es_es: Los valores de este arreglo suman 1, a menos que todos los árboles sean árboles de un solo nodo que consistan sólo en el nodo raíz, en cuyo caso será una matriz de ceros.

source: The input samples. Use ``dtype=np.float32`` for maximum efficiency. Sparse matrices are also supported, use sparse ``csc_matrix`` for maximum efficiency.
es_es: Las muestras de entrada. Utilice ``dtype=np.float32`` para obtener la máxima eficiencia. También se admiten matrices dispersas, utilice ``csc_matrix`` dispersa para obtener la máxima eficiencia.

source: Ignored
es_es: Ignorado

source: Not used, present for API consistency by convention.
es_es: No se utiliza, está presente para la coherencia de la API por convención.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights. If None, then samples are equally weighted. Splits that would create child nodes with net zero or negative weight are ignored while searching for a split in each node. In the case of classification, splits are also ignored if they would result in any single class carrying a negative weight in either child node.
es_es: Ponderación de las muestras. Si es None, las muestras se ponderan por igual. Las divisiones que crearían nodos hijos con ponderación neta cero o negativa se ignoran al buscar una división en cada nodo. En el caso de la clasificación, las divisiones también se ignoran si dan lugar a que una sola clase tenga una ponderación negativa en cualquiera de los nodos hijos.

source: Input data used to build forests. Use ``dtype=np.float32`` for maximum efficiency.
es_es: Datos de entrada utilizados para construir bosques. Utilice ``dtype=np.float32`` para obtener la máxima eficiencia.

source: sparse matrix of shape (n_samples, n_out)
es_es: matriz dispersa de forma (n_samples, n_output)

source: Transformed dataset.
es_es: Conjunto de datos transformado.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Nombres de parámetros mapeados a sus valores.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: estimator instance
es_es: instancia del estimador

source: Estimator instance.
es_es: Instancia del estimador.

source: Input data to be transformed. Use ``dtype=np.float32`` for maximum efficiency. Sparse matrices are also supported, use sparse ``csr_matrix`` for maximum efficiency.
es_es: Datos de entrada a ser transformados. Utilice ``dtype=np.float32`` para obtener la máxima eficiencia. Las matrices dispersas también están soportadas, utilice ``csr_matrix`` dispersa para una máxima eficiencia.

source: Examples using ``sklearn.ensemble.RandomTreesEmbedding``
es_es: Ejemplos utilizando ``sklearn.ensemble.RandomTreesEmbedding``
