Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.utils.*_float_array.po
Languages: es_es

source: Converts an array-like to an array of floats.
es_es: Convierte un tipo de array en un arreglo de de puntos flotante (float).

source: The new dtype will be np.float32 or np.float64, depending on the original type. The function can create a copy or modify the argument depending on the argument copy.
es_es: El nuevo dtype será np.float32 o np.float64, dependiendo del tipo original. La función puede crear una copia o modificar el argumento dependiendo de la copia del argumento.

source: Parameters
es_es: Parámetros

source: If True, a copy of X will be created. If False, a copy may still be returned if X's dtype is not a floating point type.
es_es: Si es True, se creará una copia de X. Si es False, aún puede devolverse una copia si el dtype de X no es un tipo de punto flotante.

source: bool or 'allow-nan', default=True
es_es: booleano o 'allow-nan', default=True

source: Whether to raise an error on np.inf, np.nan, pd.NA in X. The possibilities are:
es_es: Si se produce un error en np.inf, np.nan, pd.NA en X. Las posibilidades son:

source: True: Force all values of X to be finite.
es_es: Verdadero: Forzar que todos los valores de X sean finitos.

source: False: accepts np.inf, np.nan, pd.NA in X.
es_es: False: acepta en X np.inf, np.nan, pd.NA.

source: 'allow-nan': accepts only np.nan and pd.NA values in X. Values cannot be infinite.
es_es: 'allow-nan': sólo acepta en X valores np.nan y pd.NA. Los valores no pueden ser infinitos.

source: ``force_all_finite`` accepts the string ``'allow-nan'``.
es_es: ``force_all_finite`` acepta la cadena ``'allow-nan'``.

source: Accepts `pd.NA` and converts it into `np.nan`
es_es: Acepta `pd.NA` y lo convierte en `np.nan`

source: Returns
es_es: Devuelve

source: An array of type float.
es_es: Un arreglo de tipo de punto flotante (float).
