Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.preprocessing.MinMaxScaler.po
Languages: es_es

source: Transform features by scaling each feature to a given range.
es_es: Transforma las características escalando cada una de ellas a un rango determinado.

source: This estimator scales and translates each feature individually such that it is in the given range on the training set, e.g. between zero and one.
es_es: Este estimador escala y traduce cada característica individualmente de manera que se encuentre en el rango dado en el conjunto de entrenamiento, por ejemplo, entre cero y uno.

source: The transformation is given by::
es_es: La transformación viene dada por::

source: where min, max = feature_range.
es_es: donde min, max = feature_range.

source: This transformation is often used as an alternative to zero mean, unit variance scaling.
es_es: Esta transformación se utiliza a menudo como alternativa al escalamiento de media cero y varianza unitaria.

source: Read more in the :ref:`User Guide <preprocessing_scaler>`.
es_es: Lee más en el :ref:`Manual de usuario <preprocessing_scaler>`.

source: Parameters
es_es: Parámetros

source: tuple (min, max), default=(0, 1)
es_es: tupla (min, max), default=(0, 1)

source: Desired range of transformed data.
es_es: Rango deseado de datos transformados.

source: Set to False to perform inplace row normalization and avoid a copy (if the input is already a numpy array).
es_es: Establécelo en False para realizar la normalización de filas en el lugar y evitar una copia (si la entrada ya es un arreglo numpy).

source: Set to True to clip transformed values of held-out data to provided `feature range`.
es_es: Establécelo en True para recortar los valores transformados de los datos retenidos en el `feature range` proporcionado.

source: Attributes
es_es: Atributos

source: ndarray of shape (n_features,)
es_es: ndarray de forma (n_features,)

source: Per feature adjustment for minimum. Equivalent to ``min - X.min(axis=0) * self.scale_``
es_es: Ajuste por característica para el mínimo. Equivalente a ``min - X.min(axis=0) * self.scale_``

source: Per feature relative scaling of the data. Equivalent to ``(max - min) / (X.max(axis=0) - X.min(axis=0))``
es_es: Escalamiento relativo de los datos por característica. Equivalente a ``(max - min) / (X.max(axis=0) - X.min(axis=0))``

source: *scale_* attribute.
es_es: Atributo *scale_*.

source: Per feature minimum seen in the data
es_es: Por característica mínima vista en los datos

source: Per feature maximum seen in the data
es_es: Por característica máxima vista en los datos

source: Per feature range ``(data_max_ - data_min_)`` seen in the data
es_es: Por rango de características ``(data_max_ - data_min_)`` visto en los datos

source: The number of samples processed by the estimator. It will be reset on new calls to fit, but increments across ``partial_fit`` calls.
es_es: El número de muestras procesadas por el estimador. Se restablecerá en las nuevas invocaciones a fit, pero se incrementará a través de las invocaciones a ``partial_fit``.

source: Equivalent function without the estimator API.
es_es: Función equivalente sin la API del estimador.

source: Notes
es_es: Notas

source: NaNs are treated as missing values: disregarded in fit, and maintained in transform.
es_es: Los NaNs son tratados como valores faltantes: no se tienen en cuenta en el ajuste y se mantienen en la transformación.

source: For a comparison of the different scalers, transformers, and normalizers, see :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.
es_es: Para una comparación de los diferentes escaladores, transformadores y normalizadores, consulta :ref:`examples/preprocessing/plot_all_scaling.py <sphx_glr_auto_examples_preprocessing_plot_all_scaling.py>`.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Compute the minimum and maximum to be used for later scaling.
es_es: Calcula el mínimo y el máximo que se utilizará para el escalamiento posterior.

source: Fit to data, then transform it.
es_es: Ajusta a los datos y luego los transforma.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Undo the scaling of X according to feature_range.
es_es: Deshace el escalamiento de X según feature_range.

source: Online computation of min and max on X for later scaling.
es_es: Cálculo en línea de mínimos y máximos en X para su posterior escalamiento.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: Scale features of X according to feature_range.
es_es: Características escaladas de X según feature_range.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: The data used to compute the per-feature minimum and maximum used for later scaling along the features axis.
es_es: Los datos utilizados para calcular el mínimo y el máximo por característica usados para el posterior escalamiento a lo largo del eje de las características.

source: Ignored.
es_es: Ignorado.

source: Returns
es_es: Devuelve

source: Fitted scaler.
es_es: Escalador ajustado.

source: Fits transformer to `X` and `y` with optional parameters `fit_params` and returns a transformed version of `X`.
es_es: Ajusta el transformador a `X` e `y` con los parámetros opcionales `fit_params` y devuelve una versión transformada de `X`.

source: Input samples.
es_es: Muestras de entrada.

source: array-like of shape (n_samples,) or (n_samples, n_outputs), default=None
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs), default=None

source: Target values (None for unsupervised transformations).
es_es: Valores objetivo (None para transformaciones no supervisadas).

source: Additional fit parameters.
es_es: Parámetros de ajuste adicionales.

source: ndarray array of shape (n_samples, n_features_new)
es_es: arreglo ndarray de forma (n_samples, n_features_new)

source: Transformed array.
es_es: Arreglo transformado.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros mapeados a sus valores.

source: Input data that will be transformed. It cannot be sparse.
es_es: Datos de entrada que serán transformados. No pueden ser dispersos.

source: ndarray of shape (n_samples, n_features)
es_es: ndarray de forma (n_samples, n_features)

source: Transformed data.
es_es: Datos transformados.

source: All of X is processed as a single batch. This is intended for cases when :meth:`fit` is not feasible due to very large number of `n_samples` or because X is read from a continuous stream.
es_es: Todo X se procesa como un único lote. Esto está pensado para casos en los que :meth:`fit` no es factible debido a un número muy grande de `n_samples` o porque X se lee de un flujo continuo.

source: The data used to compute the mean and standard deviation used for later scaling along the features axis.
es_es: Los datos utilizados para calcular la media y la desviación estándar que se usan para el posterior escalamiento a lo largo del eje de las características.

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: Input data that will be transformed.
es_es: Datos de entrada que serán transformados.

source: Examples using ``sklearn.preprocessing.MinMaxScaler``
es_es: Ejemplos utilizando ``sklearn.preprocessing.MinMaxScaler``
