Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.ConfusionMatrixDisplay.po
Languages: es_es

source: Confusion Matrix visualization.
es_es: Visualización de la matriz de confusión.

source: It is recommend to use :func:`~sklearn.metrics.plot_confusion_matrix` to create a :class:`ConfusionMatrixDisplay`. All parameters are stored as attributes.
es_es: Se recomienda utilizar :func:`~sklearn.metrics.plot_confusion_matrix` para crear una :class:`ConfusionMatrixDisplay`. Todos los parámetros se almacenan como atributos.

source: Read more in the :ref:`User Guide <visualizations>`.
es_es: Más información en el :ref:`Manual de usuario <visualizations>`.

source: Parameters
es_es: Parámetros

source: ndarray of shape (n_classes, n_classes)
es_es: ndarray de forma (n_samples, n_classes)

source: Confusion matrix.
es_es: Matriz de confusión.

source: ndarray of shape (n_classes,), default=None
es_es: ndarray de forma (n_classes,), default=None

source: Display labels for plot. If None, display labels are set from 0 to `n_classes - 1`.
es_es: Las etiquetas de visualización para la gráfica. Si es None, las etiquetas de visualización se establecen de 0 a `n_classes - 1`.

source: Attributes
es_es: Atributos

source: matplotlib AxesImage
es_es: AxesImage de matplotlib

source: Image representing the confusion matrix.
es_es: Imagen que representa la matriz de confusión.

source: ndarray of shape (n_classes, n_classes), dtype=matplotlib Text, or None
es_es: ndarray de forma (n_classes, n_classes), dtype=matplotlib Text, o None

source: Array of matplotlib axes. `None` if `include_values` is false.
es_es: Arreglo de ejes de matplotlib. `None` si `include_values` es falso.

source: matplotlib Axes
es_es: Ejes de matplotlib

source: Axes with confusion matrix.
es_es: Ejes con matriz de confusión.

source: matplotlib Figure
es_es: Figura de matplotlib

source: Figure containing the confusion matrix.
es_es: Figura que contiene la matriz de confusión.

source: Compute Confusion Matrix to evaluate the accuracy of a classification.
es_es: Calcula la matriz de confusión para evaluar la precisión de una clasificación.

source: Plot Confusion Matrix.
es_es: Gráfica de la Matriz de Confusión.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Plot visualization.
es_es: Visualización de la gráfica.

source: bool, default=True
es_es: booleano, default=True

source: Includes values in confusion matrix.
es_es: Incluye valores en la matriz de confusión.

source: str or matplotlib Colormap, default='viridis'
es_es: cadena de caracteres o matplotlib Colormap, default='viridis'

source: Colormap recognized by matplotlib.
es_es: Mapa de colores reconocido por matplotlib.

source: {'vertical', 'horizontal'} or float, default='horizontal'
es_es: {'vertical', 'horizontal'} o flotante, default='horizontal'

source: Rotation of xtick labels.
es_es: Rotación de etiquetas xtick.

source: str, default=None
es_es: cadena de caracteres, default=None

source: Format specification for values in confusion matrix. If `None`, the format specification is 'd' or '.2g' whichever is shorter.
es_es: Especificación de formato para los valores en la matriz de confusión. Si en `None`, la especificación de formato es 'd' o '.2g' que sea más corta.

source: matplotlib axes, default=None
es_es: ejes matplotlib, default=None

source: Axes object to plot on. If `None`, a new figure and axes is created.
es_es: Objeto de ejes en los que dibujar. Si es `None`, se crea una nueva figura y ejes.

source: Whether or not to add a colorbar to the plot.
es_es: Añadir o no una barra de colores al gráfico.

source: Returns
es_es: Salida

source: Examples using ``sklearn.metrics.ConfusionMatrixDisplay``
es_es: Ejemplos usando ``sklearn.metrics.ConfusionMatrixDisplay``
