Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.feature_selection.f_classif.po
Languages: es_es

source: Compute the ANOVA F-value for the provided sample.
es_es: Calcula el valor-F de ANOVA para la muestra proporcionada.

source: Read more in the :ref:`User Guide <univariate_feature_selection>`.
es_es: Lee más en el :ref:`Manual de usuario <univariate_feature_selection>`.

source: Parameters
es_es: Parámetros

source: {array-like, sparse matrix} shape = [n_samples, n_features]
es_es: {array-like, sparse matrix} forma = [n_samples, n_features]

source: The set of regressors that will be tested sequentially.
es_es: El conjunto de regresores que se probarán secuencialmente.

source: array of shape(n_samples)
es_es: arreglo de forma (n_samples)

source: The data matrix.
es_es: La matriz de datos.

source: Returns
es_es: Devuelve

source: array, shape = [n_features,]
es_es: arreglo, forma = [n_features,]

source: The set of F values.
es_es: El conjunto de valores F.

source: The set of p-values.
es_es: El conjunto de p-valores.

source: Chi-squared stats of non-negative features for classification tasks.
es_es: Estadísticas Chi-cuadrado de las características no negativas para las tareas de clasificación.

source: F-value between label/feature for regression tasks.
es_es: Valor-F entre etiqueta/característica para tareas de regresión.

source: Examples using ``sklearn.feature_selection.f_classif``
es_es: Ejemplos utilizando ``sklearn.feature_selection.f_classif``
