Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.linear_model.LassoLarsCV.po
Languages: es_es

source: Cross-validated Lasso, using the LARS algorithm.
es_es: Validación cruzada Lasso, utilizando el algoritmo LARS.

source: See glossary entry for :term:`cross-validation estimator`.
es_es: Ver la entrada del glosario para el :term:`estimador de validación cruzada`.

source: The optimization objective for Lasso is::
es_es: El objetivo de optimización para Lasso es::

source: Read more in the :ref:`User Guide <least_angle_regression>`.
es_es: Lee más en el :ref:`Manual de usuario <least_angle_regression>`.

source: Parameters
es_es: Parámetros

source: whether to calculate the intercept for this model. If set to false, no intercept will be used in calculations (i.e. data is expected to be centered).
es_es: si se calcula el intercepto para este modelo. Si se establece en False, no se utilizará ningún intercepto en los cálculos (es decir, se espera que los datos estén centrados).

source: bool or int, default=False
es_es: bool o int, default=False

source: Sets the verbosity amount.
es_es: Establece la cantidad de verbosidad.

source: Maximum number of iterations to perform.
es_es: Número máximo de iteraciones a realizar.

source: This parameter is ignored when ``fit_intercept`` is set to False. If True, the regressors X will be normalized before regression by subtracting the mean and dividing by the l2-norm. If you wish to standardize, please use :class:`~sklearn.preprocessing.StandardScaler` before calling ``fit`` on an estimator with ``normalize=False``.
es_es: Este parámetro es ignorado cuando ``fit_intercept`` se establece en False. Si es True, los regresores X serán normalizados antes de la regresión restando la media y dividiendo por la norma l2. Si deseas estandarizar, por favor utiliza :class:`~sklearn.preprocessing.StandardScaler` antes de invocar a ``fit`` en un estimador con ``normalize=False``.

source: bool or 'auto' , default='auto'
es_es: bool o 'auto' , default='auto'

source: Whether to use a precomputed Gram matrix to speed up calculations. If set to ``'auto'`` let us decide. The Gram matrix cannot be passed as argument since we will use only subsets of X.
es_es: Si se utiliza una matriz de Gram precalculada para acelerar los cálculos. Si se establece como ``'auto'``, nosotros decidimos. La matriz de Gram no se puede pasar como argumento ya que sólo utilizaremos subconjuntos de X.

source: int, cross-validation generator or an iterable, default=None
es_es: entero, generador de validación cruzada o un iterable, default=None

source: Determines the cross-validation splitting strategy. Possible inputs for cv are:
es_es: Determina la estrategia de división de la validación cruzada. Las posibles entradas para cv son:

source: None, to use the default 5-fold cross-validation,
es_es: None, para utilizar la validación cruzada de 5 partes por defecto,

source: integer, to specify the number of folds.
es_es: entero, para especificar el número de partes.

source: :term:`CV splitter`,
es_es: :term:`Separador de validación cruzada`,

source: An iterable yielding (train, test) splits as arrays of indices.
es_es: Un iterable que produce divisiones (train, test) como arreglos de índices.

source: For integer/None inputs, :class:`KFold` is used.
es_es: Para entradas None/de enteros se utiliza :class:`KFold`.

source: Refer :ref:`User Guide <cross_validation>` for the various cross-validation strategies that can be used here.
es_es: Consulta el :ref:`Manual de usuario <cross_validation>` para las diversas estrategias de validación cruzada que pueden ser utilizadas aquí.

source: ``cv`` default value if None changed from 3-fold to 5-fold.
es_es: El valor predeterminado de ``cv``, None, cambió de 3 partes a 5 partes.

source: The maximum number of points on the path used to compute the residuals in the cross-validation
es_es: El número máximo de puntos en el camino utilizado para calcular los residuos en la validación cruzada

source: int or None, default=None
es_es: int o None, default=None

source: Number of CPUs to use during the cross validation. ``None`` means 1 unless in a :obj:`joblib.parallel_backend` context. ``-1`` means using all processors. See :term:`Glossary <n_jobs>` for more details.
es_es: Número de CPUs a utilizar durante la validación cruzada. ``None`` significa 1 a menos que esté en un contexto :obj:`joblib.parallel_backend`. ``-1`` significa utilizar todos los procesadores. Ver el :term:`Glosario <n_jobs>` para más detalles.

source: The machine-precision regularization in the computation of the Cholesky diagonal factors. Increase this for very ill-conditioned systems. Unlike the ``tol`` parameter in some iterative optimization-based algorithms, this parameter does not control the tolerance of the optimization.
es_es: La regularización de máquina-precisión en el cálculo de los factores diagonales de Cholesky. Aumenta este parámetro para sistemas muy mal condicionados. A diferencia del parámetro ``tol`` en algunos algoritmos basados en la optimización iterativa, este parámetro no controla la tolerancia de la optimización.

source: If True, X will be copied; else, it may be overwritten.
es_es: Si es True, X se copiará; si no, puede ser sobrescrito.

source: Restrict coefficients to be >= 0. Be aware that you might want to remove fit_intercept which is set True by default. Under the positive restriction the model coefficients do not converge to the ordinary-least-squares solution for small values of alpha. Only coefficients up to the smallest alpha value (``alphas_[alphas_ > 0.].min()`` when fit_path=True) reached by the stepwise Lars-Lasso algorithm are typically in congruence with the solution of the coordinate descent Lasso estimator. As a consequence using LassoLarsCV only makes sense for problems where a sparse solution is expected and/or reached.
es_es: Restringe los coeficientes para que sean >= 0. Ten en cuenta que podrías querer eliminar fit_intercept que está establecido como True por defecto. Bajo la restricción positiva los coeficientes del modelo no convergen a la solución de mínimos cuadrados ordinarios para valores pequeños de alfa. Sólo los coeficientes hasta el valor más pequeño de alfa (``alphas_[alphas_ > 0.].min()`` cuando fit_path=True) alcanzados por el algoritmo de Lars-Lasso por pasos suelen estar en congruencia con la solución del estimador Lasso de descenso coordinado. En consecuencia, el uso de LassoLarsCV sólo tiene sentido para los problemas en los que se espera y/o se alcanza una solución dispersa.

source: Attributes
es_es: Atributos

source: array-like of shape (n_features,)
es_es: array-like de forma (n_features,)

source: parameter vector (w in the formulation formula)
es_es: vector de parámetros (w en la fórmula de formulación)

source: independent term in decision function.
es_es: término independiente en la función de decisión.

source: array-like of shape (n_features, n_alphas)
es_es: array-like de forma (n_features, n_alphas)

source: the varying values of the coefficients along the path
es_es: los valores variables de los coeficientes a lo largo del camino

source: the estimated regularization parameter alpha
es_es: el parámetro de regularización estimado alfa

source: array-like of shape (n_alphas,)
es_es: array-like de forma (n_alphas,)

source: the different values of alpha along the path
es_es: los diferentes valores de alfa a lo largo del camino

source: array-like of shape (n_cv_alphas,)
es_es: array-like de forma (n_cv_alphas,)

source: all the values of alpha along the path for the different folds
es_es: todos los valores de alfa a lo largo del camino para las diferentes partes

source: array-like of shape (n_folds, n_cv_alphas)
es_es: array-like de forma (n_folds, n_cv_alphas)

source: the mean square error on left-out for each fold along the path (alpha values given by ``cv_alphas``)
es_es: el error cuadrático medio en la salida para cada parte a lo largo del camino (valores alfa dados por ``cv_alphas``)

source: array-like or int
es_es: array-like o int

source: the number of iterations run by Lars with the optimal alpha.
es_es: el número de iteraciones ejecutadas por Lars con el alfa óptimo.

source: list of int
es_es: list de int

source: Indices of active variables at the end of the path.
es_es: Índices de las variables activas al final del camino.

source: Notes
es_es: Notas

source: The object solves the same problem as the LassoCV object. However, unlike the LassoCV, it find the relevant alphas values by itself. In general, because of this property, it will be more stable. However, it is more fragile to heavily multicollinear datasets.
es_es: El objeto resuelve el mismo problema que el objeto LassoCV. Sin embargo, a diferencia de LassoCV, encuentra los valores de las alfas relevantes por sí mismo. En general, debido a esta propiedad, será más estable. Sin embargo, es más frágil a los conjuntos de datos con multicolinealidad fuerte.

source: It is more efficient than the LassoCV if only a small number of features are selected compared to the total number, for instance if there are very few samples compared to the number of features.
es_es: Es más eficiente que LassoCV si sólo se selecciona un número pequeño de características en comparación con el número total, por ejemplo, si hay muy pocas muestras en comparación con el número de características.

source: Examples
es_es: Ejemplos

source: Methods
es_es: Métodos

source: Fit the model using X, y as training data.
es_es: Ajusta el modelo utilizando X, y como datos de entrenamiento.

source: Get parameters for this estimator.
es_es: Obtiene los parámetros para este estimador.

source: Predict using the linear model.
es_es: Predice utilizando el modelo lineal.

source: Return the coefficient of determination :math:`R^2` of the prediction.
es_es: Devuelve el coeficiente de determinación :math:`R^2` de la predicción.

source: Set the parameters of this estimator.
es_es: Establece los parámetros de este estimador.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: Training data.
es_es: Datos de entrenamiento.

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: Target values.
es_es: Valores objetivo.

source: Returns
es_es: Devuelve

source: returns an instance of self.
es_es: devuelve una instancia de sí misma.

source: If True, will return the parameters for this estimator and contained subobjects that are estimators.
es_es: Si es True, devolverá los parámetros para este estimador y los subobjetos contenidos que son estimadores.

source: Parameter names mapped to their values.
es_es: Los nombres de los parámetros mapeados a sus valores.

source: array-like or sparse matrix, shape (n_samples, n_features)
es_es: array-like o matriz dispersa, de forma (n_samples, n_features)

source: Samples.
es_es: Muestras.

source: array, shape (n_samples,)
es_es: array, forma (n_samples,)

source: Returns predicted values.
es_es: Devuelve los valores predichos.

source: The coefficient :math:`R^2` is defined as :math:`(1 - \frac{u}{v})`, where :math:`u` is the residual sum of squares ``((y_true - y_pred) ** 2).sum()`` and :math:`v` is the total sum of squares ``((y_true - y_true.mean()) ** 2).sum()``. The best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of `y`, disregarding the input features, would get a :math:`R^2` score of 0.0.
es_es: El coeficiente :math:`R^2` se define como :math:`(1 - \frac{u}{v})`, donde :math:`u` es la suma de cuadrados de los residuos ``((y_true - y_pred) ** 2).sum()`` y :math:`v` es la suma de cuadrados total ``((y_true - y_true.mean()) ** 2).sum()``. La mejor puntuación posible es 1.0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de `y`, sin tener en cuenta las características de entrada, obtendría una puntuación :math:`R^2` de 0.0.

source: Test samples. For some estimators this may be a precomputed kernel matrix or a list of generic objects instead with shape ``(n_samples, n_samples_fitted)``, where ``n_samples_fitted`` is the number of samples used in the fitting for the estimator.
es_es: Muestras de prueba. Para algunos estimadores puede ser una matriz de núcleo precalculada o una lista de objetos genéricos con forma ``(n_samples, n_samples_fitted)``, donde ``n_samples_fitted`` es el número de muestras utilizadas en el ajuste para el estimador.

source: array-like of shape (n_samples,) or (n_samples, n_outputs)
es_es: array-like de forma (n_samples,) o (n_samples, n_outputs)

source: True values for `X`.
es_es: Valores verdaderos para `X`.

source: array-like of shape (n_samples,), default=None
es_es: array-like de forma (n_samples,), default=None

source: Sample weights.
es_es: Ponderaciones de la muestra.

source: :math:`R^2` of ``self.predict(X)`` wrt. `y`.
es_es: :math:`R^2` de ``self.predict(X)`` con respecto a `y`.

source: The :math:`R^2` score used when calling ``score`` on a regressor uses ``multioutput='uniform_average'`` from version 0.23 to keep consistent with default value of :func:`~sklearn.metrics.r2_score`. This influences the ``score`` method of all the multioutput regressors (except for :class:`~sklearn.multioutput.MultiOutputRegressor`).
es_es: La puntuación :math:`R^2` utilizada al invocar a ``score`` en un regresor utiliza ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la consistencia con el valor predeterminado de :func:`~sklearn.metrics.r2_score`. Esto influye en el método ``score`` de todos los regresores de salida múltiple (excepto para :class:`~sklearn.multioutput.MultiOutputRegressor`).

source: The method works on simple estimators as well as on nested objects (such as :class:`~sklearn.pipeline.Pipeline`). The latter have parameters of the form ``<component>__<parameter>`` so that it's possible to update each component of a nested object.
es_es: El método funciona tanto en estimadores simples como en objetos anidados (como :class:`~sklearn.pipeline.Pipeline`). Estos últimos tienen parámetros de la forma ``<component>__<parameter>`` para que sea posible actualizar cada componente de un objeto anidado.

source: Estimator parameters.
es_es: Parámetros del estimador.

source: Estimator instance.
es_es: Instancia del estimador.

source: Examples using ``sklearn.linear_model.LassoLarsCV``
es_es: Ejemplos utilizando ``sklearn.linear_model.LassoLarsCV``
