Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.*.BiclusterMixin.po
Languages: es_es

source: Mixin class for all bicluster estimators in scikit-learn.
es_es: Clase Mixin para todos los estimadores de bicluster en scikit-learn.

source: Attributes
es_es: Atributos

source: Convenient way to get row and column indicators together.
es_es: Una forma conveniente de obtener indicadores de fila y columna juntos.

source: Methods
es_es: Métodos

source: Row and column indices of the `i`'th bicluster.
es_es: Índices de fila y columna del `i`' ésimo bicluster.

source: Shape of the `i`'th bicluster.
es_es: Forma del `i`' ésimo bicluster.

source: Return the submatrix corresponding to bicluster `i`.
es_es: Devuelve la submatriz correspondiente al bicluster `i`.

source: Returns the ``rows_`` and ``columns_`` members.
es_es: Devuelve los miembros ``rows_`` y ``columns_``.

source: Only works if ``rows_`` and ``columns_`` attributes exist.
es_es: Solo funciona si los atributos ``rows_`` y ``columns_`` existen.

source: Parameters
es_es: Parámetros

source: The index of the cluster.
es_es: El índice del conglomerado.

source: Returns
es_es: Devuelve

source: Indices of rows in the dataset that belong to the bicluster.
es_es: Índices de las filas del conjunto de datos que pertenecen al bicluster.

source: Indices of columns in the dataset that belong to the bicluster.
es_es: Índices de columnas en el conjunto de datos que pertenecen al bicluster.

source: Number of rows in the bicluster.
es_es: Número de filas en el bicluster.

source: Number of columns in the bicluster.
es_es: Número de columnas en el bicluster.

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: The data.
es_es: Los datos.

source: ndarray of shape (n_rows, n_cols)
es_es: ndarray de forma (n_rows, n_cols)

source: The submatrix corresponding to bicluster `i`.
es_es: La submatriz correspondiente al bicluster `i`.

source: Notes
es_es: Notas

source: Works with sparse matrices. Only works if ``rows_`` and ``columns_`` attributes exist.
es_es: Funciona con matrices dispersas. Sólo funciona si existen los atributos ``rows_`` y ``columns_``.
