Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/generated/sklearn.metrics.fowlkes_mallows_score.po
Languages: es_es

source: Measure the similarity of two clusterings of a set of points.
es_es: Mide la similitud de dos agrupaciones de un conjunto de puntos.

source: The Fowlkes-Mallows index (FMI) is defined as the geometric mean between of the precision and recall::
es_es: El índice Fowlkes-Mallows (FMI) se define como la media geométrica entre la precisión y la exhaustividad::

source: Where ``TP`` is the number of **True Positive** (i.e. the number of pair of points that belongs in the same clusters in both ``labels_true`` and ``labels_pred``), ``FP`` is the number of **False Positive** (i.e. the number of pair of points that belongs in the same clusters in ``labels_true`` and not in ``labels_pred``) and ``FN`` is the number of **False Negative** (i.e the number of pair of points that belongs in the same clusters in ``labels_pred`` and not in ``labels_True``).
es_es: Donde ``TP`` es el número de **Verdaderos Positivos** (es decir, el número de pares de puntos que pertenecen a los mismos conglomerados tanto en ``labels_true`` como en ``labels_pred``), ``FP`` es el número de **Falsos Positivos** (es decir, el número de pares de puntos que pertenecen a los mismos conglomerados en ``labels_true`` y no en ``labels_pred``) y ``FN`` es el número de **Falsos Negativos** (es decir, el número de puntos que pertenecen a los mismos conglomerados en ``labels_pred`` y no en ``labels_True``).

source: The score ranges from 0 to 1. A high value indicates a good similarity between two clusters.
es_es: La puntuación oscila entre 0 y 1. Un valor alto indica una buena similitud entre dos conglomerados.

source: Read more in the :ref:`User Guide <fowlkes_mallows_scores>`.
es_es: Lee más en el :ref:`Manual de usuario <fowlkes_mallows_scores>`.

source: Parameters
es_es: Parámetros

source: **labels_true** : int array, shape = (``n_samples``,)
es_es: **labels_true** : arreglo entero, forma = (``n_samples``,)

source: int array, shape = (
es_es: arreglo entero, forma = (

source: A clustering of the data into disjoint subsets.
es_es: Una agrupación de los datos en subconjuntos disjuntos.

source: **labels_pred** : array, shape = (``n_samples``, )
es_es: **labels_pred** : arreglo, forma = (``n_samples``, )

source: array, shape = (
es_es: arreglo, forma = (

source: bool, default=False
es_es: booleano, default=False

source: Compute contingency matrix internally with sparse matrix.
es_es: Calcula la matriz de contingencia internamente con la matriz dispersa.

source: Returns
es_es: Devuelve

source: float
es_es: flotante

source: The resulting Fowlkes-Mallows score.
es_es: El puntaje Fowlkes-Mallows resultante.

source: References
es_es: Referencias

source: `Wikipedia entry for the Fowlkes-Mallows Index <https://en.wikipedia.org/wiki/Fowlkes-Mallows_index>`_
es_es: `Entrada de Wikipedia para el Índice Fowlkes-Mallows <https://en.wikipedia.org/wiki/Fowlkes-Mallows_index>`_

source: Examples
es_es: Ejemplos

source: Perfect labelings are both homogeneous and complete, hence have score 1.0::
es_es: Los etiquetados perfectos son homogéneos y completos, por lo que tienen una puntuación de 1,0::

source: If classes members are completely split across different clusters, the assignment is totally random, hence the FMI is null::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente aleatoria, por tanto el FMI es nulo::
