Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/mixture/plot_concentration_prior.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_mixture_plot_concentration_prior.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_mixture_plot_concentration_prior.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Concentration Prior Type Analysis of Variation Bayesian Gaussian Mixture
es_es: Análisis del Tipo de Concentración a priori de la Variación de Mezcla Gaussiana Bayesiana

source: This example plots the ellipsoids obtained from a toy dataset (mixture of three Gaussians) fitted by the ``BayesianGaussianMixture`` class models with a Dirichlet distribution prior (``weight_concentration_prior_type='dirichlet_distribution'``) and a Dirichlet process prior (``weight_concentration_prior_type='dirichlet_process'``). On each figure, we plot the results for three different values of the weight concentration prior.
es_es: Este ejemplo muestra los elipsoides obtenidos de un conjunto de datos de juguete (mezcla de tres gaussianas) ajustados por los modelos de clase ``BayesianGaussianMixture`` con una distribución de Dirichlet a priori (``weight_concentration_prior_type='dirichlet_distribution'``) y un proceso de Dirichlet a priori (``weight_concentration_prior_type='dirichlet_process'``). En cada figura, representamos los resultados para tres valores diferentes de la concentración de la ponderación a priori.

source: The ``BayesianGaussianMixture`` class can adapt its number of mixture components automatically. The parameter ``weight_concentration_prior`` has a direct link with the resulting number of components with non-zero weights. Specifying a low value for the concentration prior will make the model put most of the weight on few components set the remaining components weights very close to zero. High values of the concentration prior will allow a larger number of components to be active in the mixture.
es_es: La clase ``BayesianGaussianMixture`` puede adaptar su número de componentes de la mezcla automáticamente. El parámetro ``weight_concentration_prior`` tiene una relación directa con el número resultante de componentes con ponderaciones distintas de cero. Especificar un valor bajo para la concentración a priori hará que el modelo ponga la mayor parte de las ponderaciones en pocos componentes y que las ponderaciones de los componentes restantes sean muy cercanas a cero. Los valores altos de la concentración a priori permitirán que un mayor número de componentes estén activos en la mezcla.

source: The Dirichlet process prior allows to define an infinite number of components and automatically selects the correct number of components: it activates a component only if it is necessary.
es_es: El proceso de Dirichlet a priori permite definir un número infinito de componentes y selecciona automáticamente el número correcto de componentes: activa un componente sólo si es necesario.

source: On the contrary the classical finite mixture model with a Dirichlet distribution prior will favor more uniformly weighted components and therefore tends to divide natural clusters into unnecessary sub-components.
es_es: Por el contrario, el modelo clásico de mezcla finita con una distribución de Dirichlet a priori favorecerá a los componentes más uniformemente ponderados y, por tanto, tiende a dividir los conglomerados naturales en subcomponentes innecesarios.

source: **Total running time of the script:** ( 0 minutes 10.525 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 10.525 segundos)

source: :download:`Download Python source code: plot_concentration_prior.py <plot_concentration_prior.py>`
es_es: :download:`Descargar el código fuente de Python: plot_concentration_prior.py <plot_concentration_prior.py>`

source: :download:`Download Jupyter notebook: plot_concentration_prior.ipynb <plot_concentration_prior.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_concentration_prior.ipynb <plot_concentration_prior.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
