Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/mixture/plot_gmm_covariances.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_mixture_plot_gmm_covariances.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_mixture_plot_gmm_covariances.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: GMM covariances
es_es: Covarianzas GMM

source: Demonstration of several covariances types for Gaussian mixture models.
es_es: Demostración de varios tipos de covarianzas para modelos de mezcla Gaussiana.

source: See :ref:`gmm` for more information on the estimator.
es_es: Consulta :ref:`gmm` para obtener más información sobre el estimador.

source: Although GMM are often used for clustering, we can compare the obtained clusters with the actual classes from the dataset. We initialize the means of the Gaussians with the means of the classes from the training set to make this comparison valid.
es_es: Aunque las GMM se utilizan a menudo para el agrupamiento, podemos comparar los conglomerados obtenidos con las clases reales del conjunto de datos. Inicializamos las medias de las Gaussianas con las medias de las clases del conjunto de entrenamiento para que esta comparación sea válida.

source: We plot predicted labels on both training and held out test data using a variety of GMM covariance types on the iris dataset. We compare GMMs with spherical, diagonal, full, and tied covariance matrices in increasing order of performance. Although one would expect full covariance to perform best in general, it is prone to overfitting on small datasets and does not generalize well to held out test data.
es_es: Graficamos las etiquetas predichas tanto en los datos de entrenamiento como en los datos de prueba retenidos utilizando una variedad de tipos de covarianza GMM en el conjunto de datos iris. Comparamos los GMM con matrices de covarianza esféricas, diagonales, completas y ligadas en orden creciente de rendimiento. Aunque cabría esperar que la covarianza completa tuviera el mejor rendimiento en general, es propensa a sobreajustarse en conjuntos de datos pequeños y no se generaliza bien a los datos de prueba retenidos.

source: On the plots, train data is shown as dots, while test data is shown as crosses. The iris dataset is four-dimensional. Only the first two dimensions are shown here, and thus some points are separated in other dimensions.
es_es: En los gráficos, los datos de entrenamiento se muestran como puntos, mientras que los datos de prueba se muestran como cruces. El conjunto de datos iris tiene cuatro dimensiones. Aquí sólo se muestran las dos primeras dimensiones, por lo que algunos puntos están separados en otras dimensiones.

source: **Total running time of the script:** ( 0 minutes 0.401 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.401 segundos)

source: :download:`Download Python source code: plot_gmm_covariances.py <plot_gmm_covariances.py>`
es_es: :download:`Descargar el código fuente de Python: plot_gmm_covariances.py <plot_gmm_covariances.py>`

source: :download:`Download Jupyter notebook: plot_gmm_covariances.ipynb <plot_gmm_covariances.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_gmm_covariances.ipynb <plot_gmm_covariances.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
