Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/common_pitfalls.po
Languages: es

source: Common pitfalls and recommended practices
es: Fallas comunes y prácticas recomendadas

source: The purpose of this chapter is to illustrate some common pitfalls and anti-patterns that occur when using scikit-learn. It provides examples of what **not** to do, along with a corresponding correct example.
es: El propósito de este capítulo es ilustrar algunas fallas comunes y antipatrones que ocurren cuando se utiliza scikit-learn. Proporciona ejemplos de lo que **no** hacer, junto con un ejemplo correcto correspondiente.

source: Inconsistent preprocessing
es: Preprocesamiento inconsistente

source: scikit-learn provides a library of :ref:`data-transforms`, which may clean (see :ref:`preprocessing`), reduce (see :ref:`data_reduction`), expand (see :ref:`kernel_approximation`) or generate (see :ref:`feature_extraction`) feature representations. If these data transforms are used when training a model, they also must be used on subsequent datasets, whether it's test data or data in a production system. Otherwise, the feature space will change, and the model will not be able to perform effectively.
es: scikit-learn proporciona una biblioteca de :ref:`data-transforms`, que puede limpiar (ver :ref:`preprocessing`), reducir (ver :ref:`data_reduction`), expandir (ver :ref:`kernel_aproximation`) o generar (ver las representaciones de características de :ref:`feature_extraction`). Si estas transformaciones de datos se utilizan cuando se capacita un modelo, también deben ser utilizadas en conjuntos de datos subsiguientes, si se trata de datos de prueba o datos en un sistema en producción. De lo contrario, el espacio de características cambiará, y el modelo no podrá funcionar eficazmente.

source: For the following example, let's create a synthetic dataset with a single feature::
es: Para el siguiente ejemplo, vamos a crear un conjunto de datos sintéticos con una única característica::

source: **Wrong**
es: **Incorrecto**

source: The train dataset is scaled, but not the test dataset, so model performance on the test dataset is worse than expected::
es: El conjunto de datos de entrenamiento es escalado, pero no el conjunto de datos de prueba, por lo que el rendimiento del modelo en el conjunto de datos de prueba es peor de lo esperado::

source: **Right**
es: **Correcto**

source: Instead of passing the non-transformed `X_test` to `predict`, we should transform the test data, the same way we transformed the training data::
es: En lugar de pasar el `X_test` no transformado a `predic`, debemos transformar los datos de prueba, de la misma manera que transformamos los datos de entrenamiento::

source: Alternatively, we recommend using a :class:`Pipeline <sklearn.pipeline.Pipeline>`, which makes it easier to chain transformations with estimators, and reduces the possibility of forgetting a transformation::
es: Alternativamente, recomendamos usar un :class:`Pipeline <sklearn.pipeline.Pipeline>`, lo que hace más fácil encadenar las transformaciones con estimadores y reduce la posibilidad de olvidar una transformación::

source: Pipelines also help avoiding another common pitfall: leaking the test data into the training data.
es: Los pipelines también ayudan a evitar otra falla común: filtrar los datos de prueba en los datos de entrenamiento.

source: Data leakage
es: Fuga de datos

source: Data leakage occurs when information that would not be available at prediction time is used when building the model. This results in overly optimistic performance estimates, for example from :ref:`cross-validation <cross_validation>`, and thus poorer performance when the model is used on actually novel data, for example during production.
es: La fuga de datos ocurre cuando la información que no este disponible a tiempo de predicción se utiliza al construir el modelo. Esto resulta en estimaciones de rendimiento demasiado optimistas, por ejemplo de :ref:`validación cruzada <cross_validation>`, y por lo tanto rendimiento empobrecido cuando el modelo se utiliza en datos realmente nuevos, por ejemplo durante producción.

source: A common cause is not keeping the test and train data subsets separate. Test data should never be used to make choices about the model. **The general rule is to never call** `fit` **on the test data**. While this may sound obvious, this is easy to miss in some cases, for example when applying certain pre-processing steps.
es: Una causa común es no mantener separados los subconjuntos de datos de prueba y entrenamiento. Los datos de prueba nunca deben utilizarse para tomar decisiones acerca del modelo. **La regla general es nunca llamar** `fit` **en los datos de prueba**. Aunque esto puede parecer obvio, esto es fácil de perder en algunos casos, por ejemplo cuando se aplican ciertos pasos de preprocesamiento.

source: Although both train and test data subsets should receive the same preprocessing transformation (as described in the previous section), it is important that these transformations are only learnt from the training data. For example, if you have a normalization step where you divide by the average value, the average should be the average of the train subset, **not** the average of all the data. If the test subset is included in the average calculation, information from the test subset is influencing the model.
es: Aunque tanto los subconjuntos de datos de entrenamiento como de prueba deben recibir la misma transformación de preprocesamiento (como se describe en la sección anterior), es importante que estas transformaciones sólo se aprendan de los datos de entrenamiento. Por ejemplo, si se tiene un paso de normalización donde se divide entre el valor promedio, el promedio debe ser el promedio del subconjunto de entrenamiento, **no** el promedio de todos los datos. Si el subconjunto de pruebas está incluido en el cálculo promedio, la información del subconjunto de pruebas está influyendo en el modelo.

source: An example of data leakage during preprocessing is detailed below.
es: A continuación se detalla un ejemplo de fuga de datos durante el preprocesamiento.

source: Data leakage during pre-processing
es: Fuga de datos durante el preprocesamiento

source: We here choose to illustrate data leakage with a feature selection step. This risk of leakage is however relevant with almost all transformations in scikit-learn, including (but not limited to) :class:`~sklearn.preprocessing.StandardScaler`, :class:`~sklearn.impute.SimpleImputer`, and :class:`~sklearn.decomposition.PCA`.
es: Aquí elegimos ilustrar la fuga de datos con un paso de selección de características. Este riesgo de fuga es sin embargo relevante con casi todas las transformaciones en scikit-learn, incluyendo (pero no limitado a) :class:`~sklearn. reprocessing.StandardScaler`, :class:`~sklearn.impute.SimpleImputer y :class:`~sklearn.decomposition.PCA`.

source: A number of :ref:`feature_selection` functions are available in scikit-learn. They can help remove irrelevant, redundant and noisy features as well as improve your model build time and performance. As with any other type of preprocessing, feature selection should **only** use the training data. Including the test data in feature selection will optimistically bias your model.
es: Un número de funciones :ref:`feature_selection` están disponibles en scikit-learn. Pueden ayudar a eliminar características irrelevantes, redundantes y ruidosas, así como a mejorar el tiempo y el rendimiento de su modelo. Como en cualquier otro tipo de preprocesamiento, la selección de características debe **sólo** usar los datos de entrenamiento. Incluir los datos de prueba en la selección de características optimizará el sesgo de su modelo.

source: To demonstrate we will create this binary classification problem with 10,000 randomly generated features::
es: Para demostrar crearemos este problema de clasificación binaria con 10.000 características generadas aleatoriamente::

source: Using all the data to perform feature selection results in an accuracy score much higher than chance, even though our targets are completely random. This randomness means that our `X` and `y` are independent and we thus expect the accuracy to be around 0.5. However, since the feature selection step 'sees' the test data, the model has an unfair advantage. In the incorrect example below we first use all the data for feature selection and then split the data into training and test subsets for model fitting. The result is a much higher than expected accuracy score::
es: El uso de todos los datos para realizar la selección de características da como resultado una puntuación de precisión muy superior al azar, a pesar de que nuestros objetivos son completamente aleatorios. Esta aleatoriedad significa que nuestros `X` y `y` son independientes y por lo tanto esperamos que la precisión sea de alrededor de 0.5. Sin embargo, dado que el paso de selección de características "ve" los datos de prueba, el modelo tiene una ventaja injusta. En el ejemplo incorrecto de abajo utilizamos primero todos los datos para la selección de características y luego dividimos los datos en subconjuntos de entrenamiento y de pruebas para el ajuste del modelo. El resultado es una puntuación de precisión muy superior a la esperada::

source: To prevent data leakage, it is good practice to split your data into train and test subsets **first**. Feature selection can then be formed using just the train dataset. Notice that whenever we use `fit` or `fit_transform`, we only use the train dataset. The score is now what we would expect for the data, close to chance::
es: Para evitar la fuga de datos, es una buena práctica dividir los datos en subconjuntos de entrenamiento y de prueba **primero**. La selección de características se puede formar utilizando sólo el conjunto de datos del entrenamiento. Ten en cuenta que cada vez que usamos `fit` o `fit_transform`, sólo usamos el conjunto de datos de entrenamiento. La puntuación es ahora la que cabría esperar para los datos, cercana al azar::

source: Here again, we recommend using a :class:`~sklearn.pipeline.Pipeline` to chain together the feature selection and model estimators. The pipeline ensures that only the training data is used when performing `fit` and the test data is used only for calculating the accuracy score::
es: De nuevo, recomendamos utilizar una :class:`~sklearn.pipeline.Pipeline` para encadenar la selección de características y los estimadores del modelo. El pipeline garantiza que sólo se utilicen los datos de entrenamiento al realizar el `fit` y que los datos de prueba se utilicen únicamente para calcular la puntuación de precisión::

source: The pipeline can also be fed into a cross-validation function such as :func:`~sklearn.model_selection.cross_val_score`. Again, the pipeline ensures that the correct data subset and estimator method is used during fitting and predicting::
es: El pipeline también puede ser alimentado en una función de validación cruzada como :func:`~sklearn.model_selection.cross_val_score`. De nuevo, el pipeline asegura que el subconjunto de datos correcto y el método de estimación se utilicen durante el ajuste y la predicción::

source: How to avoid data leakage
es: Cómo evitar fuga de datos

source: Below are some tips on avoiding data leakage:
es: A continuación hay algunos consejos para evitar fugas de datos:

source: Always split the data into train and test subsets first, particularly before any preprocessing steps.
es: Siempre dividir los datos en subconjuntos de entrenamiento y de pruebas primero, especialmente antes de cualquier paso de preprocesamiento.

source: Never include test data when using the `fit` and `fit_transform` methods. Using all the data, e.g., `fit(X)`, can result in overly optimistic scores.
es: Nunca incluya datos de prueba cuando utilice los métodos `fit` y `fit_transform`. Usando todos los datos, por ejemplo, `fit(X)`, puede resultar en puntuaciones demasiado optimistas.

source: Conversely, the `transform` method should be used on both train and test subsets as the same preprocessing should be applied to all the data. This can be achieved by using `fit_transform` on the train subset and `transform` on the test subset.
es: Por el contrario, el método `transform` debe utilizarse tanto en el subconjunto de entrenamiento como en el de prueba, ya que debe aplicarse el mismo preprocesamiento a todos los datos. Esto puede lograrse utilizando `fit_transform` en el subconjunto de entrenamiento y `transform` en el subconjunto de prueba.

source: The scikit-learn :ref:`pipeline <pipeline>` is a great way to prevent data leakage as it ensures that the appropriate method is performed on the correct data subset. The pipeline is ideal for use in cross-validation and hyper-parameter tuning functions.
es: El scikit-learn :ref:`pipeline <pipeline>` es una gran manera de evitar la fuga de datos, ya que asegura que el método apropiado se realiza en el subconjunto de datos correcto. El pipeline es ideal para su uso en funciones de validación cruzada y de ajuste de hiperparámetros.

source: Controlling randomness
es: Control de aleatoriedad

source: Some scikit-learn objects are inherently random. These are usually estimators (e.g. :class:`~sklearn.ensemble.RandomForestClassifier`) and cross-validation splitters (e.g. :class:`~sklearn.model_selection.KFold`). The randomness of these objects is controlled via their `random_state` parameter, as described in the :term:`Glossary <random_state>`. This section expands on the glossary entry, and describes good practices and common pitfalls w.r.t. to this subtle parameter.
es: Algunos objetos de scikit-learn son inherentemente aleatorios. Estos suelen ser estimadores (por ejemplo, :class:`~sklearn.ensemble.RandomForestClassifier`) y separadores de validación cruzada (por ejemplo, :class:`~sklearn.model_selection.KFold`). La aleatoriedad de estos objetos se controla a través de su parámetro `random_state`, como se describe en el :term:`Glosario <random_state>`. Esta sección se expande en la entrada del glosario, y describe buenas prácticas y fallas comunes con respecto a este parámetro sutil.

source: Recommendation summary
es: Resumen de recomendaciones

source: For an optimal robustness of cross-validation (CV) results, pass `RandomState` instances when creating estimators, or leave `random_state` to `None`. Passing integers to CV splitters is usually the safest option and is preferable; passing `RandomState` instances to splitters may sometimes be useful to achieve very specific use-cases. For both estimators and splitters, passing an integer vs passing an instance (or `None`) leads to subtle but significant differences, especially for CV procedures. These differences are important to understand when reporting results.
es: Para una robustez óptima de los resultados de la validación cruzada (CV), pasa las instancias de `RandomState` al crear estimadores, o deja `random_state` a `None`. Pasar enteros a separadores CV es generalmente la opción más segura y es preferible; pasar las instancias de `RandomState` a los separadores puede ser útil a veces para lograr casos de uso muy específicos. Tanto para los estimadores como para los separadores, pasar un entero vs pasar una instancia (o `None`) conduce a diferencias sutiles pero significativas, especialmente para los procedimientos de CV. Estas diferencias son importantes para entender cuando se reportan resultados.

source: For reproducible results across executions, remove any use of `random_state=None`.
es: Para resultados reproducibles a través de ejecuciones, elimine cualquier uso de `random_state=None`.

source: Using `None` or `RandomState` instances, and repeated calls to `fit` and `split`
es: Usando instancias de `None` o `RandomState`, y llamadas repetidas a `fit` y `split`

source: The `random_state` parameter determines whether multiple calls to :term:`fit` (for estimators) or to :term:`split` (for CV splitters) will produce the same results, according to these rules:
es: El parámetro `random_state` determina si varias llamadas a :term:`fit` (para estimadores) o a :term:`split` (para separadores CV) producirán los mismos resultados. de acuerdo a estas reglas:

source: If an integer is passed, calling `fit` or `split` multiple times always yields the same results.
es: Si se pasa un entero, llamar a `fit` o `split` varias veces siempre produce los mismos resultados.

source: If `None` or a `RandomState` instance is passed: `fit` and `split` will yield different results each time they are called, and the succession of calls explores all sources of entropy. `None` is the default value for all `random_state` parameters.
es: Si se pasa `None` o una instancia `RandomState`: `fit` y `split` producirán diferentes resultados cada vez que se llamen, y la sucesión de llamadas explora todas las fuentes de entropía. `None` es el valor predeterminado para todos los parámetros `random_state`.

source: We here illustrate these rules for both estimators and CV splitters.
es: Aquí se ilustra estas normas tanto para estimadores como para separadores CV.

source: Since passing `random_state=None` is equivalent to passing the global `RandomState` instance from `numpy` (`random_state=np.random.mtrand._rand`), we will not explicitly mention `None` here. Everything that applies to instances also applies to using `None`.
es: Dado que pasar `random_state=None` es equivalente a pasar la instancia global de `RandomState` desde `numpy` (`random_state=np.random. trand._rand`), no mencionaremos explícitamente `None` aquí. Todo lo que aplica a las instancias también se aplica al uso de `None`.

source: Estimators
es: Estimadores

source: Passing instances means that calling `fit` multiple times will not yield the same results, even if the estimator is fitted on the same data and with the same hyper-parameters::
es: Pasar instancias significa que llamar `fit` varias veces no producirá los mismos resultados, incluso si el estimador se ajusta a los mismos datos y con los mismos hiperparámetros::

source: We can see from the snippet above that repeatedly calling `sgd.fit` has produced different models, even if the data was the same. This is because the Random Number Generator (RNG) of the estimator is consumed (i.e. mutated) when `fit` is called, and this mutated RNG will be used in the subsequent calls to `fit`. In addition, the `rng` object is shared across all objects that use it, and as a consequence, these objects become somewhat inter-dependent. For example, two estimators that share the same `RandomState` instance will influence each other, as we will see later when we discuss cloning. This point is important to keep in mind when debugging.
es: Podemos ver desde el fragmento de código de arriba que la llamada repetidamente `sgd.fit` ha producido modelos diferentes, incluso si los datos eran los mismos. Esto se debe a que el Generador de Números Aleatorios (RNG) del estimador es consumido (i.e. mutado) cuando `fit` es llamado, y este RNG mutado será usado en las llamadas subsiguientes a `fit`. Además, el objeto `rng` se comparte a través de todos los objetos que lo usan, y como consecuencia, estos objetos se vuelven algo interdependientes. Por ejemplo, dos estimadores que comparten la misma instancia de `RandomState` influirán entre sí, como veremos más adelante cuando discutamos la clonación. Este punto es importante tener en cuenta a la hora de depurar.

source: If we had passed an integer to the `random_state` parameter of the :class:`~sklearn.ensemble.RandomForestClassifier`, we would have obtained the same models, and thus the same scores each time. When we pass an integer, the same RNG is used across all calls to `fit`. What internally happens is that even though the RNG is consumed when `fit` is called, it is always reset to its original state at the beginning of `fit`.
es: Si hubiéramos pasado un entero al parámetro `random_state` del :class:`~sklearn.ensemble. andomForestClassifier`, habríamos obtenido los mismos modelos, y por lo tanto los mismos puntajes cada vez. Cuando pasamos un entero, el mismo RNG se usa a través de todas las llamadas a `fit`. Lo que ocurre internamente es que aunque el RNG se consume cuando se llama `fit`, siempre se reinicia a su estado original al principio de `fit`.

source: CV splitters
es: Separadores de CV (Validación cruzada)

source: Randomized CV splitters have a similar behavior when a `RandomState` instance is passed; calling `split` multiple times yields different data splits::
es: Los separadores aleatorios CV tienen un comportamiento similar cuando se pasa una instancia de `RandomState`; llamar a `split` varias veces produce diferentes divisiones de datos::

source: We can see that the splits are different from the second time `split` is called. This may lead to unexpected results if you compare the performance of multiple estimators by calling `split` many times, as we will see in the next section.
es: Podemos ver que las divisiones son diferentes de la segunda vez que se llama `split`. Esto puede llevar a resultados inesperados si compara el rendimiento de múltiples estimadores llamando a `split` muchas veces, como veremos en la siguiente sección.

source: Common pitfalls and subtleties
es: Fallas comunes y sutilezas

source: While the rules that govern the `random_state` parameter are seemingly simple, they do however have some subtle implications. In some cases, this can even lead to wrong conclusions.
es: Aunque las reglas que rigen el parámetro `random_state` son aparentemente sencillas, sin embargo tienen algunas implicaciones sutiles. En algunos casos, esto puede incluso conducir a conclusiones equivocadas.

source: **Different `random_state` types lead to different cross-validation procedures**
es: **Diferentes tipos de `random_state` conducen a diferentes procedimientos de validación cruzada**

source: Depending on the type of the `random_state` parameter, estimators will behave differently, especially in cross-validation procedures. Consider the following snippet::
es: Dependiendo del tipo del parámetro `random_state`, los estimadores se comportarán de forma diferente, especialmente en los procedimientos de validación cruzada. Considere el siguiente fragmento de código::

source: We see that the cross-validated scores of `rf_123` and `rf_inst` are different, as should be expected since we didn't pass the same `random_state` parameter. However, the difference between these scores is more subtle than it looks, and **the cross-validation procedures that were performed by** :func:`~sklearn.model_selection.cross_val_score` **significantly differ in each case**:
es: Vemos que las puntuaciones de validación cruzada de `rf_123` y `rf_inst` son diferentes, como era de esperar ya que no pasamos el mismo parámetro `random_state`. Sin embargo, la diferencia entre estas puntuaciones es más sutil de lo que parece, y **los procedimientos de validación cruzada que fueron realizados por** :func:`~sklearn.model_selection.cross_val_score` **difieren significativamente en cada caso**:

source: Since `rf_123` was passed an integer, every call to `fit` uses the same RNG: this means that all random characteristics of the random forest estimator will be the same for each of the 5 folds of the CV procedure. In particular, the (randomly chosen) subset of features of the estimator will be the same across all folds.
es: Dado que a `rf_123` se le pasó un número entero, cada llamada a `fit` utiliza el mismo RNG: esto significa que todas las características aleatorias del estimador de bosque aleatorio serán las mismas para cada uno de los 5 pliegues del procedimiento CV. En particular, el subconjunto (elegido al azar) de características del estimador será el mismo en todos los pliegues.
