Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/common_pitfalls.po
Languages: es

source: Since `rf_inst` was passed a `RandomState` instance, each call to `fit` starts from a different RNG. As a result, the random subset of features will be different for each folds.
es: Como a `rf_inst` se le pasó una instancia de `RandomState`, cada llamada a `fit` parte de un RNG diferente. Como resultado, el subconjunto aleatorio de características será diferente para cada pliegue.

source: While having a constant estimator RNG across folds isn't inherently wrong, we usually want CV results that are robust w.r.t. the estimator's randomness. As a result, passing an instance instead of an integer may be preferable, since it will allow the estimator RNG to vary for each fold.
es: Aunque tener un estimador RNG constante en todos los pliegues no es intrínsecamente incorrecto, normalmente queremos resultados de CV que sean robustos con respecto a la aleatoriedad del estimador. Como resultado, pasar una instancia en lugar de un entero puede ser preferible, ya que permitirá que el RNG del estimador varíe para cada pliegue.

source: Here, :func:`~sklearn.model_selection.cross_val_score` will use a non-randomized CV splitter (as is the default), so both estimators will be evaluated on the same splits. This section is not about variability in the splits. Also, whether we pass an integer or an instance to :func:`~sklearn.datasets.make_classification` isn't relevant for our illustration purpose: what matters is what we pass to the :class:`~sklearn.ensemble.RandomForestClassifier` estimator.
es: Aquí, :func:`~sklearn.model_selection.cross_val_score` usará un separador de CV no aleatoriado (como es el predeterminado), así que ambos estimadores serán evaluados en los mismos separadores. Esta sección no trata de variabilidad en los separadores. También, si pasamos un entero o una instancia a :func:`~sklearn.datasets. ake_classification` no es relevante para nuestro propósito de ilustración: lo que importa es lo que pasamos al estimador :class:`~sklearn.ensemble.RandomForestClassifier`.

source: **Cloning**
es: **Clonado**

source: Another subtle side effect of passing `RandomState` instances is how :func:`~sklearn.clone` will work::
es: Otro sutil efecto secundario de pasar instancias de `RandomState` es cómo funcionará :func:`~sklearn.clone`::

source: Since a `RandomState` instance was passed to `a`, `a` and `b` are not clones in the strict sense, but rather clones in the statistical sense: `a` and `b` will still be different models, even when calling `fit(X, y)` on the same data. Moreover, `a` and `b` will influence each-other since they share the same internal RNG: calling `a.fit` will consume `b`'s RNG, and calling `b.fit` will consume `a`'s RNG, since they are the same. This bit is true for any estimators that share a `random_state` parameter; it is not specific to clones.
es: Dado que se ha pasado una instancia de `RandomState` a `a`, `a` y `b` no son clones en sentido estricto, sino clones en sentido estadístico: `a` y `b` seguirán siendo modelos diferentes, incluso cuando se llame a `fit(X, y)` con los mismos datos. Además, `a` y `b` se influirán mutuamente ya que comparten el mismo RNG interno: llamar a `a.fit` consumirá el RNG de `b`, y llamar a `b.fit` consumirá el RNG de `a`, ya que son el mismo. Esto es válido para cualquier estimador que comparta el parámetro `random_state`; no es específico de los clones.

source: If an integer were passed, `a` and `b` would be exact clones and they would not influence each other.
es: Si se pasara un entero, `a` y `b` serían clones exactos y no influirían entre sí.

source: Even though :func:`~sklearn.clone` is rarely used in user code, it is called pervasively throughout scikit-learn codebase: in particular, most meta-estimators that accept non-fitted estimators call :func:`~sklearn.clone` internally (:class:`~sklearn.model_selection.GridSearchCV`, :class:`~sklearn.ensemble.StackingClassifier`, :class:`~sklearn.calibration.CalibratedClassifierCV`, etc.).
es: Aunque :func:`~sklearn.clone` se usa raramente en el código de usuario, se llama de forma generalizada en todo el código base de scikit-learn: en particular, la mayoría de los meta-estimadores que aceptan estimadores no ajustados llaman internamente a :func:`~sklearn.clone (:class:`~sklearn.model_selection.GridSearchCV`, :class:`~sklearn.ensemble.StackingClassifier`, :class:`~sklearn.calibration.CalibratedClassifierCV`, etc.).

source: When passed a `RandomState` instance, CV splitters yield different splits each time `split` is called. When comparing different estimators, this can lead to overestimating the variance of the difference in performance between the estimators::
es: Cuando se les pasa una instancia de `RandomState`, los separadores de CV producen diferentes divisiones cada vez que se llama a `split`. Al comparar diferentes estimadores, esto puede llevar a sobreestimar la varianza de la diferencia de rendimiento entre los estimadores::

source: Directly comparing the performance of the :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis` estimator vs the :class:`~sklearn.naive_bayes.GaussianNB` estimator **on each fold** would be a mistake: **the splits on which the estimators are evaluated are different**. Indeed, :func:`~sklearn.model_selection.cross_val_score` will internally call `cv.split` on the same :class:`~sklearn.model_selection.KFold` instance, but the splits will be different each time. This is also true for any tool that performs model selection via cross-validation, e.g. :class:`~sklearn.model_selection.GridSearchCV` and :class:`~sklearn.model_selection.RandomizedSearchCV`: scores are not comparable fold-to-fold across different calls to `search.fit`, since `cv.split` would have been called multiple times. Within a single call to `search.fit`, however, fold-to-fold comparison is possible since the search estimator only calls `cv.split` once.
es: Comparar directamente el rendimiento del estimador :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis` frente al estimador :class:`~sklearn.naive_bayes.GaussianNB` **en cada pliegue** sería un error: **las divisiones en las que se evalúan los estimadores son diferentes**. De hecho, :func:`~sklearn.model_selection.cross_val_score` llamará internamente a `cv.split` en la misma instancia :class:`~sklearn.model_selection.KFold`, pero las divisiones serán diferentes cada vez. Esto también es cierto para cualquier herramienta que realice la selección del modelo a través de la validación cruzada, por ejemplo, :class:`~sklearn.model_selection.GridSearchCV` y :class:`~sklearn.model_selection.RandomizedSearchCV`: las puntuaciones no son comparables pliegue a pliegue a través de diferentes llamadas a `search.fit`, ya que `cv.split` habría sido llamado varias veces. Sin embargo, dentro de una sola llamada a `search.fit`, la comparación entre pliegues es posible ya que el estimador de búsqueda sólo llama a `cv.split` una vez.

source: For comparable fold-to-fold results in all scenarios, one should pass an integer to the CV splitter: `cv = KFold(shuffle=True, random_state=0)`.
es: Para obtener resultados comparables entre pliegues en todos los escenarios, se debe pasar un número entero al separador de CV: `cv = KFold(shuffle=True, random_state=0)`.

source: While fold-to-fold comparison is not advisable with `RandomState` instances, one can however expect that average scores allow to conclude whether one estimator is better than another, as long as enough folds and data are used.
es: Aunque la comparación entre pliegues no es aconsejable con las instancias de `RandomState`, se puede esperar que las puntuaciones medias permitan concluir si un estimador es mejor que otro, siempre que se utilicen suficientes pliegues y datos.

source: What matters in this example is what was passed to :class:`~sklearn.model_selection.KFold`. Whether we pass a `RandomState` instance or an integer to :func:`~sklearn.datasets.make_classification` is not relevant for our illustration purpose. Also, neither :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis` nor :class:`~sklearn.naive_bayes.GaussianNB` are randomized estimators.
es: Lo que importa en este ejemplo es lo que se pasó a :class:`~sklearn.model_selection.KFold`. Si pasamos una instancia de `RandomState` o un entero a :func:`~sklearn.datasets.make_classification` no es relevante para nuestro propósito de ilustración. Además, ni :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis` ni :class:`~sklearn.naive_bayes.GaussianNB` son estimadores aleatorios.

source: General recommendations
es: Recomendaciones generales

source: Getting reproducible results across multiple executions
es: Obteniendo resultados reproducibles a través de múltiples ejecuciones

source: In order to obtain reproducible (i.e. constant) results across multiple *program executions*, we need to remove all uses of `random_state=None`, which is the default. The recommended way is to declare a `rng` variable at the top of the program, and pass it down to any object that accepts a `random_state` parameter::
es: Para obtener resultados reproducibles (es decir, constantes) a través de múltiples *ejecuciones del programa*, necesitamos eliminar todos los usos de `random_state=None`, que es el valor por defecto. La forma recomendada es declarar una variable `rng` en la parte superior del programa, y pasarla a cualquier objeto que acepte un parámetro `random_state`::

source: We are now guaranteed that the result of this script will always be 0.84, no matter how many times we run it. Changing the global `rng` variable to a different value should affect the results, as expected.
es: Ahora tenemos la garantía que el resultado de este script será siempre 0.84, sin importar cuántas veces lo ejecutemos. Cambiar la variable global `rng` a un valor diferente debería afectar los resultados, como se esperaba.

source: It is also possible to declare the `rng` variable as an integer. This may however lead to less robust cross-validation results, as we will see in the next section.
es: También es posible declarar la variable `rng` como un entero. Sin embargo, esto puede llevar a resultados de validación cruzada menos robustos, como veremos en la siguiente sección.

source: We do not recommend setting the global `numpy` seed by calling `np.random.seed(0)`. See `here <https://stackoverflow.com/questions/5836335/consistently-create-same-random-numpy-array/5837352#comment6712034_5837352>`_ for a discussion.
es: No recomendamos establecer la semilla global `numpy` llamando `np.random.seed(0)`. Ver `aquí <https://stackoverflow.com/questions/5836335/consistently-create-same-random-numpy-array/5837352#comment6712034_5837352>`_ para una discusión.

source: Robustness of cross-validation results
es: Robustez de los resultados de validación cruzada

source: When we evaluate a randomized estimator performance by cross-validation, we want to make sure that the estimator can yield accurate predictions for new data, but we also want to make sure that the estimator is robust w.r.t. its random initialization. For example, we would like the random weights initialization of a :class:`~sklearn.linear_model.SGDCLassifier` to be consistently good across all folds: otherwise, when we train that estimator on new data, we might get unlucky and the random initialization may lead to bad performance. Similarly, we want a random forest to be robust w.r.t the set of randomly selected features that each tree will be using.
es: Cuando evaluamos el rendimiento de un estimador aleatorio mediante validación cruzada, queremos asegurarnos de que el estimador puede producir predicciones precisas para los nuevos datos, pero también queremos asegurarnos de que el estimador es robusto con respecto a su inicialización aleatoria. Por ejemplo, nos gustaría que la inicialización de las ponderaciones aleatorias de un :class:`~sklearn.linear_model.SGDCLassifier` fuera consistentemente buena en todos los pliegues: de lo contrario, cuando entrenemos ese estimador con nuevos datos, podríamos tener mala suerte y la inicialización aleatoria podría conducir a un mal rendimiento. Del mismo modo, queremos que un bosque aleatorio sea robusto con respecto al conjunto de características seleccionadas aleatoriamente que utilizará cada árbol.

source: For these reasons, it is preferable to evaluate the cross-validation preformance by letting the estimator use a different RNG on each fold. This is done by passing a `RandomState` instance (or `None`) to the estimator initialization.
es: Por estas razones, es preferible evaluar el rendimiento de la validación cruzada dejando que el estimador utilice un RNG diferente en cada pliegue. Esto se hace pasando una instancia de `RandomState` (o `None`) a la inicialización del estimador.

source: When we pass an integer, the estimator will use the same RNG on each fold: if if the estimator performs well (or bad), as evaluated by CV, it might just be because we got lucky (or unlucky) with that specific seed. Passing instances leads to more robust CV results, and makes the comparison between various algorithms fairer. It also helps limiting the temptation to treat the estimator's RNG as a hyper-parameter that can be tuned.
es: Cuando pasamos un número entero, el estimador utilizará el mismo RNG en cada pliegue: si el estimador funciona bien (o mal), según la evaluación de CV, puede ser sólo porque tuvimos suerte (o mala suerte) con esa semilla específica. Pasar instancias conduce a resultados de CV más robustos, y hace que la comparación entre varios algoritmos sea más justa. También ayuda a limitar la tentación de tratar el RNG del estimador como un hiperparámetro que se puede ajustar.

source: Whether we pass `RandomState` instances or integers to CV splitters has no impact on robustness, as long as `split` is only called once. When `split` is called multiple times, fold-to-fold comparison isn't possible anymore. As a result, passing integer to CV splitters is usually safer and covers most use-cases.
es: El hecho de que pasemos instancias de `RandomState` o enteros a los divisores de CV no tiene ningún impacto en la robustez, siempre y cuando se llame a `split` sólo una vez. Cuando se llama a `split` varias veces, la comparación entre pliegues ya no es posible. Como resultado, pasar enteros a los separadores CV es normalmente más seguro y cubre la mayoría de los casos de uso.
