Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/datasets.po
Languages: es

source: Dataset loading utilities
es: Herramientas de carga de conjuntos de datos

source: The ``sklearn.datasets`` package embeds some small toy datasets as introduced in the :ref:`Getting Started <loading_example_dataset>` section.
es: El paquete ``sklearn.datasets`` incorpora algunos pequeños conjuntos de datos de prueba, tal y como se introdujo en la sección :ref:`Iniciando <loading_example_dataset>`.

source: This package also features helpers to fetch larger datasets commonly used by the machine learning community to benchmark algorithms on data that comes from the 'real world'.
es: Este paquete también cuenta con ayudantes para obtener conjuntos de datos más grandes, comúnmente utilizados por la comunidad de aprendizaje automático para referenciar algoritmos con datos procedentes del "mundo real".

source: To evaluate the impact of the scale of the dataset (``n_samples`` and ``n_features``) while controlling the statistical properties of the data (typically the correlation and informativeness of the features), it is also possible to generate synthetic data.
es: Para evaluar el impacto de la escala del conjunto de datos (``n_samples`` y ``n_features``) mientras se controlan las propiedades estadísticas de los datos (normalmente la correlación y la informatividad de las características), también es posible generar datos sintéticos.

source: **General dataset API.** There are three main kinds of dataset interfaces that can be used to get datasets depending on the desired type of dataset.
es: **API de conjunto de datos generales.** Hay tres tipos principales de interfaces de datos que pueden ser usados para obtener conjuntos de datos dependiendo del tipo de datos deseado.

source: **The dataset loaders.** They can be used to load small standard datasets, described in the :ref:`toy_datasets` section.
es: **Los cargadores de conjuntos de datos.** Pueden utilizarse para cargar pequeños conjuntos de datos estándar, descritos en la sección :ref:`toy_datasets`.

source: **The dataset fetchers.** They can be used to download and load larger datasets, described in the :ref:`real_world_datasets` section.
es: **Los recolectores de conjuntos de datos.** Pueden ser usados para descargar y cargar conjuntos de datos más grandes, descritos en la sección :ref:`real_world_datasets`.

source: Both loaders and fetchers functions return a :class:`~sklearn.utils.Bunch` object holding at least two items: an array of shape ``n_samples`` * ``n_features`` with key ``data`` (except for 20newsgroups) and a numpy array of length ``n_samples``, containing the target values, with key ``target``.
es: Tanto las funciones cargadoras como recolectoras devuelven un objeto :class:`~sklearn.utils.Bunch` que contiene al menos dos elementos: una arreglo de la forma ``n_samples`` * ``n_features`` con la clave ``data`` (excepto 20newsgroups) y un arreglo de numpy de longitud ``n_samples``, que contiene los valores de destino, con la clave ``target``.

source: The Bunch object is a dictionary that exposes its keys as attributes. For more information about Bunch object, see :class:`~sklearn.utils.Bunch`.
es: El objeto Bunch es un diccionario que expone sus claves como atributos. Para más información sobre el objeto Bunch, vea :class:`~sklearn.utils.Bunch`.

source: It's also possible for almost all of these function to constrain the output to be a tuple containing only the data and the target, by setting the ``return_X_y`` parameter to ``True``.
es: También es posible que casi todas estas funciones limiten la salida a ser una tupla que contenga sólo los datos y el objetivo, estableciendo el parámetro ``return_X_y`` a ``True``.

source: The datasets also contain a full description in their ``DESCR`` attribute and some contain ``feature_names`` and ``target_names``. See the dataset descriptions below for details.
es: Los conjuntos de datos también contienen una descripción completa en su atributo ``DESCR`` y algunos contienen ``feature_names`` y ``target_names``. Ver las descripciones del conjunto de datos a continuación para más detalles.

source: **The dataset generation functions.** They can be used to generate controlled synthetic datasets, described in the :ref:`sample_generators` section.
es: **Las funciones de generación de conjuntos de datos.** Pueden utilizarse para generar conjuntos de datos sintéticos controlados, descritos en la sección :ref:`sample_generators`.

source: These functions return a tuple ``(X, y)`` consisting of a ``n_samples`` * ``n_features`` numpy array ``X`` and an array of length ``n_samples`` containing the targets ``y``.
es: Estas funciones devuelven una tupla ``(X, y)`` que consiste de ``n_samples`` * ``n_features`` arreglo de numpy ``X`` y un arreglo de longitud ``n_samples`` que contiene los objetivos ``y``.

source: In addition, there are also miscellaneous tools to load datasets of other formats or from other locations, described in the :ref:`loading_other_datasets` section.
es: Además, también hay varias herramientas para cargar conjuntos de datos de otros formatos o desde otras ubicaciones, descritas en la sección :ref:`loading_other_datasets`.
