Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/faq.po
Languages: es

source: But in the end the real culprit is Python's ``multiprocessing`` that does ``fork`` without ``exec`` to reduce the overhead of starting and using new Python processes for parallel computing. Unfortunately this is a violation of the POSIX standard and therefore some software editors like Apple refuse to consider the lack of fork-safety in Accelerate / vecLib as a bug.
es: Pero al final el verdadero responsable es el ``multiprocessing`` de Python, que hace ``fork`` sin ``exec`` para reducir la sobrecarga de iniciar y usar nuevos procesos Python para computación paralela. Desafortunadamente esto es una violación del estándar POSIX y por lo tanto algunos editores de software como Apple se niegan a considerar la falta de seguridad de bifurcación en Accelerate / vecLib como un error.

source: In Python 3.4+ it is now possible to configure ``multiprocessing`` to use the 'forkserver' or 'spawn' start methods (instead of the default 'fork') to manage the process pools. To work around this issue when using scikit-learn, you can set the ``JOBLIB_START_METHOD`` environment variable to 'forkserver'. However the user should be aware that using the 'forkserver' method prevents joblib.Parallel to call function interactively defined in a shell session.
es: En Python 3.4 + ahora es posible configurar ``multiprocessing`` para usar los métodos de inicio 'forkserver' o 'spawn' (en lugar de 'fork' por defecto) para administrar los grupos de subprocesos. Para solucionar esta incedencia al usar scikit-learn, puede establecer la variable de entorno ``JOBLIB_START_METHOD`` a 'forkserver'. Sin embargo, el usuario debe tener en cuenta que el uso del método 'forkserver' impide que joblib.Parallel llame a la función definida interactivamente en una sesión de terminal.

source: If you have custom code that uses ``multiprocessing`` directly instead of using it via joblib you can enable the 'forkserver' mode globally for your program: Insert the following instructions in your main script::
es: Si tienes código personalizado que utiliza ``multiprocessing`` directamente en lugar de usarlo a través de joblib puedes activar globalmente el modo 'forkserver' para tu programa: Inserta las siguientes instrucciones en tu script principal::

source: You can find more default on the new start methods in the `multiprocessing documentation <https://docs.python.org/3/library/multiprocessing.html#contexts-and-start-methods>`_.
es: Puede encontrar más información sobre los nuevos métodos de inicio en el `documentación multiprocesamiento <https://docs.python.org/3/library/multiprocessing.html#contexts-and-start-methods>`_.

source: Why does my job use more cores than specified with n_jobs?
es: ¿Por qué mi trabajo utiliza más núcleos que los especificados con n_jobs?

source: This is because ``n_jobs`` only controls the number of jobs for routines that are parallelized with ``joblib``, but parallel code can come from other sources:
es: Esto es porque ``n_jobs`` sólo controla el número de trabajos para rutinas que son paralelizadas con ``joblib``, pero el código paralelo puede provenir de otras fuentes:

source: some routines may be parallelized with OpenMP (for code written in C or Cython).
es: algunas rutinas pueden ser paralelizadas con OpenMP (para código escrito en C o Cython).

source: scikit-learn relies a lot on numpy, which in turn may rely on numerical libraries like MKL, OpenBLAS or BLIS which can provide parallel implementations.
es: scikit-learn depende mucho de numpy, que a su vez puede depender de bibliotecas numéricas como MKL, OpenBLAS o BLIS, que pueden proporcionar implementaciones paralelas.

source: For more details, please refer to our :ref:`Parallelism notes <parallelism>`.
es: Para más detalles, por favor consulta nuestras :ref:`Notas de paralelismo <parallelism>`.

source: Why is there no support for deep or reinforcement learning / Will there be support for deep or reinforcement learning in scikit-learn?
es: ¿Por qué no hay soporte para el aprendizaje profundo o de refuerzo / Habrá soporte para el aprendizaje profundo o de refuerzo en scikit-learn?

source: Deep learning and reinforcement learning both require a rich vocabulary to define an architecture, with deep learning additionally requiring GPUs for efficient computing. However, neither of these fit within the design constraints of scikit-learn; as a result, deep learning and reinforcement learning are currently out of scope for what scikit-learn seeks to achieve.
es: Tanto el aprendizaje profundo como el aprendizaje por refuerzo requieren un rico vocabulario para definir una arquitectura, y el aprendizaje profundo requiere además GPUs para una computación eficiente. Sin embargo, ninguno de los dos encaja en las restricciones de diseño de scikit-learn; como resultado, el aprendizaje profundo y el aprendizaje por refuerzo están actualmente fuera del alcance de lo que scikit-learn pretende lograr.

source: You can find more information about addition of gpu support at `Will you add GPU support?`_.
es: Puedes encontrar más información sobre la adición de soporte para la GPU en `¿Agregarán soporte para la GPU?`.

source: Note that scikit-learn currently implements a simple multilayer perceptron in :mod:`sklearn.neural_network`. We will only accept bug fixes for this module. If you want to implement more complex deep learning models, please turn to popular deep learning frameworks such as `tensorflow <https://www.tensorflow.org/>`_, `keras <https://keras.io/>`_ and `pytorch <https://pytorch.org/>`_.
es: Ten en cuenta que scikit-learn actualmente implementa un simple perceptrón multicapa en :mod:`sklearn.neural_network`. Sólo aceptaremos correcciones de errores para este módulo. Si deseas implementar modelos de aprendizaje profundo más complejos, por favor, diríjste a marcos de aprendizaje profundo populares como `tensorflow <https://www.tensorflow.org/>`_, `keras <https://keras.io/>`_ y `pytorch <https://pytorch.org/>`_.

source: Why is my pull request not getting any attention?
es: ¿Por qué mi pull request no recibe ninguna atención?

source: The scikit-learn review process takes a significant amount of time, and contributors should not be discouraged by a lack of activity or review on their pull request. We care a lot about getting things right the first time, as maintenance and later change comes at a high cost. We rarely release any "experimental" code, so all of our contributions will be subject to high use immediately and should be of the highest quality possible initially.
es: El proceso de revisión de scikit-learn toma una cantidad significativa de tiempo y los contribuyentes no deben verse desalentados por la falta de actividad o revisión de su solicitud de pull. Nos preocupa mucho hacer las cosas bien en primer intento, ya que el mantenimiento y el cambio posterior tiene un alto coste. Rara vez liberamos cualquier código "experimental", por lo que todas nuestras contribuciones estarán sujetas a un alto uso inmediatamente y deben ser de la más alta calidad posible inicialmente.

source: Beyond that, scikit-learn is limited in its reviewing bandwidth; many of the reviewers and core developers are working on scikit-learn on their own time. If a review of your pull request comes slowly, it is likely because the reviewers are busy. We ask for your understanding and request that you not close your pull request or discontinue your work solely because of this reason.
es: Además de eso, scikit-learn está limitado en su ancho de banda de revisión; muchos de los revisores y desarrolladores principales están trabajando en scikit-learn por cuanta propia. Si una revisión de su pull request llega con lentitud, es probable porque los revisores están ocupados. Pedimos tu comprensión y te solicitamos que no cierres su pull request o suspendas tu trabajo únicamente por esta razón.

source: How do I set a ``random_state`` for an entire execution?
es: ¿Cómo establezco un ``random_state`` para una ejecución completa?

source: Please refer to :ref:`randomness`.
es: Por favor, consulta :ref:`randomness`.

source: Why do categorical variables need preprocessing in scikit-learn, compared to other tools?
es: ¿Por qué las variables categóricas necesitan preprocesamiento en scikit-learn, en comparación con otras herramientas?

source: Most of scikit-learn assumes data is in NumPy arrays or SciPy sparse matrices of a single numeric dtype. These do not explicitly represent categorical variables at present. Thus, unlike R's data.frames or pandas.DataFrame, we require explicit conversion of categorical features to numeric values, as discussed in :ref:`preprocessing_categorical_features`. See also :ref:`sphx_glr_auto_examples_compose_plot_column_transformer_mixed_types.py` for an example of working with heterogeneous (e.g. categorical and numeric) data.
es: La mayor parte de scikit-learn asume que los datos están en arreglos de NumPy o matrices dispersas de SciPy de un solo dtype numérico. Estos no representan explícitamente variables categóricas en este momento. Por lo que, a diferencia de los data.frames de R o pandas.DataFrame , se requiere la conversión explícita de características categóricas a valores numéricos, como se explica en :ref:`preprocessing_categorical_features`. Ver también :ref:`sphx_glr_auto_examples_compose_plot_column_transformer_mixed_types.py` para un ejemplo de trabajo con datos heterogéneos (por ejemplo, categóricos y numéricos).

source: Why does Scikit-learn not directly work with, for example, pandas.DataFrame?
es: ¿Por qué Scikit-learn no funciona directamente con, por ejemplo, pandas.DataFrame?

source: The homogeneous NumPy and SciPy data objects currently expected are most efficient to process for most operations. Extensive work would also be needed to support Pandas categorical types. Restricting input to homogeneous types therefore reduces maintenance cost and encourages usage of efficient data structures.
es: Los objetos de datos homogéneos de NumPy y SciPy que se esperan actualmente son los más eficientes para procesar la mayoría de las operaciones. También se necesitaría un gran trabajo para soportar los tipos categóricos de Pandas. Por tanto, restringir la entrada a tipos homogéneos reduce el coste de mantenimiento y fomenta el uso de estructuras de datos eficientes.

source: Do you plan to implement transform for target y in a pipeline?
es: ¿Piensan implementar la transformación para el objetivo y en un pipeline?

source: Currently transform only works for features X in a pipeline. There's a long-standing discussion about not being able to transform y in a pipeline. Follow on github issue `#4143 <https://github.com/scikit-learn/scikit-learn/issues/4143>`_. Meanwhile check out :class:`~compose.TransformedTargetRegressor`, `pipegraph <https://github.com/mcasl/PipeGraph>`_, `imbalanced-learn <https://github.com/scikit-learn-contrib/imbalanced-learn>`_. Note that Scikit-learn solved for the case where y has an invertible transformation applied before training and inverted after prediction. Scikit-learn intends to solve for use cases where y should be transformed at training time and not at test time, for resampling and similar uses, like at `imbalanced-learn`. In general, these use cases can be solved with a custom meta estimator rather than a Pipeline
es: Actualmente transformar sólo funciona para las características X en un pipeline. Hay una larga discusión sobre la imposibilidad de transformar y en un pipeline. Sigue en github el tema `#4143 <https://github.com/scikit-learn/scikit-learn/issues/4143>`_. Mientras tanto revisa :class:`~compose.TransformedTargetRegressor`, `pipegraph <https://github.com/mcasl/PipeGraph>`_, `imbalanced-learn <https://github.com/scikit-learn-contrib/imbalanced-learn>`_. Observa que Scikit-learn ha resuelto el caso en el que y tiene una transformación invertible aplicada antes del entrenamiento e invertida después de la predicción. Scikit-learn pretende resolver los casos de uso en los que y debe transformarse en el momento del entrenamiento y no en el momento de la prueba, para el remuestreo y usos similares, como en `imbalanced-learn`. En general, estos casos de uso pueden ser resueltos con un estimador meta personalizado en lugar de un Pipeline
