Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/faq.po
Languages: es

source: Frequently Asked Questions
es: Preguntas Frecuentes

source: Here we try to give some answers to questions that regularly pop up on the mailing list.
es: Aquí tratamos de dar algunas respuestas a las preguntas que surgen regularmente en la lista de correo.

source: What is the project name (a lot of people get it wrong)?
es: ¿Cuál es el nombre del proyecto (mucha gente tiende a equivocarse)?

source: scikit-learn, but not scikit or SciKit nor sci-kit learn. Also not scikits.learn or scikits-learn, which were previously used.
es: scikit-learn, pero no scikit o SciKit ni sci-kit learn. Tampoco scikits.learn o scikits-learn, que se utilizaban anteriormente.

source: How do you pronounce the project name?
es: ¿Cómo pronuncias el nombre del proyecto?

source: sy-kit learn. sci stands for science!
es: sy-kit learn. ¡sci es por ciencia!

source: Why scikit?
es: ¿Por qué scikit?

source: There are multiple scikits, which are scientific toolboxes built around SciPy. You can find a list at `<https://scikits.appspot.com/scikits>`_. Apart from scikit-learn, another popular one is `scikit-image <https://scikit-image.org/>`_.
es: Hay múltiples scikits, las cuales son cajas de herramientas científicas construidas alrededor de SciPy. Puedes encontrar una lista en `<https://scikits.appspot.com/scikits>`_. Aparte de la scikit-learn, otra popular es `scikit-image <https://scikit-image.org/>`_.

source: How can I contribute to scikit-learn?
es: ¿Cómo puedo contribuir a scikit-learn?

source: See :ref:`contributing`. Before wanting to add a new algorithm, which is usually a major and lengthy undertaking, it is recommended to start with :ref:`known issues <new_contributors>`. Please do not contact the contributors of scikit-learn directly regarding contributing to scikit-learn.
es: Ver :ref:`contributing`. Antes de querer añadir un nuevo algoritmo, que suele ser un gran y largo cometido, es recomendable comenzar con :ref:`incidencias conocidas <new_contributors>`. Por favor, no te pongas en contacto con los colaboradores de scikit-learn directamente para contribuir a scikit-learn.

source: What's the best way to get help on scikit-learn usage?
es: ¿Cuál es la mejor manera de obtener ayuda en el uso de scikit-learn?

source: **For general machine learning questions**, please use `Cross Validated <https://stats.stackexchange.com/>`_ with the ``[machine-learning]`` tag.
es: **Para preguntas generales de aprendizaje automático**, por favor usa `Cross Validated <https://stats.stackexchange.com/>`_ con la etiqueta ``[machine-learning]```.

source: **For scikit-learn usage questions**, please use `Stack Overflow <https://stackoverflow.com/questions/tagged/scikit-learn>`_ with the ``[scikit-learn]`` and ``[python]`` tags. You can alternatively use the `mailing list <https://mail.python.org/mailman/listinfo/scikit-learn>`_.
es: **Para preguntas de uso de scikit-learn**, por favor usa `Stack Overflow <https://stackoverflow.com/questions/tagged/scikit-learn>`_ con las etiquetas ``[scikit-learn]`` y ``[python]``. Puedes usar alternativamente la `lista de correo <https://mail.python.org/mailman/listinfo/scikit-learn>`_.

source: Please make sure to include a minimal reproduction code snippet (ideally shorter than 10 lines) that highlights your problem on a toy dataset (for instance from ``sklearn.datasets`` or randomly generated with functions of ``numpy.random`` with a fixed random seed). Please remove any line of code that is not necessary to reproduce your problem.
es: Por favor, asegúrate de incluir un fragmento mínimo de código de reproducción (idealmente menos de 10 líneas) que resalte su problema en un conjunto de datos de prueba (por ejemplo de ``sklearn. atasets`` o generado aleatoriamente con funciones de ``numpy.random`` con una semilla aleatoria fija). Por favor, elimine cualquier línea de código que no sea necesaria para reproducir su problema.

source: The problem should be reproducible by simply copy-pasting your code snippet in a Python shell with scikit-learn installed. Do not forget to include the import statements.
es: El problema debería ser reproducible copiando el fragmento de código en un terminal de Python con scikit-learn instalado. No olvides incluir las declaraciones de importación.

source: More guidance to write good reproduction code snippets can be found at:
es: Puedes encontrar más orientación para escribir un buen fragmento de código de reproducción en:

source: If your problem raises an exception that you do not understand (even after googling it), please make sure to include the full traceback that you obtain when running the reproduction script.
es: Si tu problema plantea una excepción que no entiendes (incluso después de buscarlo en google), por favor asegúrate de incluir el rastreo completo que se obtiene al ejecutar el script de reproducción.

source: For bug reports or feature requests, please make use of the `issue tracker on GitHub <https://github.com/scikit-learn/scikit-learn/issues>`_.
es: Para informes de errores o solicitudes de características, utiliza el `gestor de incidencias en GitHub <https://github.com/scikit-learn/scikit-learn/issues>`_.

source: There is also a `scikit-learn Gitter channel <https://gitter.im/scikit-learn/scikit-learn>`_ where some users and developers might be found.
es: También hay un `canal de scikit-learn Gitter <https://gitter.im/scikit-learn/scikit-learn>`_ donde se pueden encontrar algunos usuarios y desarrolladores.

source: **Please do not email any authors directly to ask for assistance, report bugs, or for any other issue related to scikit-learn.**
es: **Por favor, no envíes un correo electrónico a ningún autor directamente para pedir asistencia, reportar errores o cualquier otra incidencia relacionada con scikit-learn.**

source: How should I save, export or deploy estimators for production?
es: ¿Cómo debo guardar, exportar o desplegar estimadores para producción?

source: See :ref:`model_persistence`.
es: Ver :ref:`model_persistence`.

source: How can I create a bunch object?
es: ¿Cómo puedo crear un objeto de tipo bunch?

source: Bunch objects are sometimes used as an output for functions and methods. They extend dictionaries by enabling values to be accessed by key, `bunch["value_key"]`, or by an attribute, `bunch.value_key`.
es: A veces se utilizan objetos de tipo bunch como salida para funciones y métodos. Extienden diccionarios habilitando que los valores sean accedidos por clave, `bunch["value_key"]`, o por un atributo, `bunch.value_key`.

source: They should not be used as an input; therefore you almost never need to create a ``Bunch`` object, unless you are extending the scikit-learn's API.
es: No deben ser usados como entrada; por lo tanto casi nunca necesitas crear un objeto ``Bunch``, a menos que estés extendiendo la API de scikit-learn.

source: How can I load my own datasets into a format usable by scikit-learn?
es: ¿Cómo puedo cargar mis propios conjuntos de datos en un formato utilizable por scikit-learn?

source: Generally, scikit-learn works on any numeric data stored as numpy arrays or scipy sparse matrices. Other types that are convertible to numeric arrays such as pandas DataFrame are also acceptable.
es: En general, scikit-learn funciona con cualquier dato numérico almacenado como arreglos de numpy o matrices dispersas de scipy. Otros tipos convertibles a arreglos numéricos como pandas DataFrame también son aceptables.

source: For more information on loading your data files into these usable data structures, please refer to :ref:`loading external datasets <external_datasets>`.
es: Para más información sobre cómo cargar sus archivos de datos en estas estructuras de datos utilizables, consulta :ref:`cargando conjuntos de datos externos <external_datasets>`.

source: What are the inclusion criteria for new algorithms ?
es: ¿Cuáles son los criterios de inclusión de nuevos algoritmos?

source: We only consider well-established algorithms for inclusion. A rule of thumb is at least 3 years since publication, 200+ citations, and wide use and usefulness. A technique that provides a clear-cut improvement (e.g. an enhanced data structure or a more efficient approximation technique) on a widely-used method will also be considered for inclusion.
es: Sólo consideramos algoritmos bien establecidos para la inclusión. Una regla general es al menos 3 años desde la publicación, más de 200 citas y un uso amplio y útil. Una técnica que proporciona una mejora clara (p. ej. Una estructura de datos mejorada o una técnica de aproximación más eficiente) sobre un método ampliamente utilizado también se considerará para su inclusión.

source: From the algorithms or techniques that meet the above criteria, only those which fit well within the current API of scikit-learn, that is a ``fit``, ``predict/transform`` interface and ordinarily having input/output that is a numpy array or sparse matrix, are accepted.
es: De los algoritmos o técnicas que cumplen con los criterios anteriores, sólo aquellos que se ajustan bien dentro de la API actual de scikit-learn, que es una interfaz ``fit``, ``predic/transform`` y normalmente teniendo una entrada/salida que es un arreglo de numpy o una matriz dispersa, son aceptados.

source: The contributor should support the importance of the proposed addition with research papers and/or implementations in other similar packages, demonstrate its usefulness via common use-cases/applications and corroborate performance improvements, if any, with benchmarks and/or plots. It is expected that the proposed algorithm should outperform the methods that are already implemented in scikit-learn at least in some areas.
es: El colaborador debe apoyar la importancia de la adición propuesta con documentos de investigación y/o implementaciones en otros paquetes similares, demostrar su utilidad a través de casos de uso/aplicaciones comunes y mejoras de rendimiento corroborado, si existen, con pruebas y/o gráficos de rendimiento. Se espera que el algoritmo propuesto supere los métodos que ya están implementados en scikit-learn al menos en algunas áreas.

source: Inclusion of a new algorithm speeding up an existing model is easier if:
es: La inclusión de un nuevo algoritmo acelerando un modelo existente es más fácil si:

source: it does not introduce new hyper-parameters (as it makes the library more future-proof),
es: no introduce nuevos hiper-parámetros (ya que hace que la biblioteca este más preparada en el futuro),

source: it is easy to document clearly when the contribution improves the speed and when it does not, for instance "when n_features >> n_samples",
es: es fácil documentar claramente cuando la contribución mejora la velocidad y cuando no lo hace, por ejemplo "cuando n_características >> n_muestras",

source: benchmarks clearly show a speed up.
es: las pruebas de rendimiento muestran claramente una aceleración.

source: Also, note that your implementation need not be in scikit-learn to be used together with scikit-learn tools. You can implement your favorite algorithm in a scikit-learn compatible way, upload it to GitHub and let us know. We will be happy to list it under :ref:`related_projects`. If you already have a package on GitHub following the scikit-learn API, you may also be interested to look at `scikit-learn-contrib <https://scikit-learn-contrib.github.io>`_.
es: Además, ten en cuenta que tu implementación no tiene por qué estar en scikit-learn para ser usada junto con herramientas de scikit-learn. Puedes implementar tu algoritmo favorito de una manera compatible con scikit-learn, cargarlo a GitHub y hacernoslo saber. Estaremos encantados de listarlo en :ref:`related_projects`. Si ya tienes un paquete en GitHub siguiendo la API de scikit-learn, también podrías estar interesado en ver `scikit-learn-contrib <https://scikit-learn-contrib.github.io>`_.

source: Why are you so selective on what algorithms you include in scikit-learn?
es: ¿Por qué son tan selectivos sobre qué algoritmos incluir en scikit-learn?

source: Code comes with maintenance cost, and we need to balance the amount of code we have with the size of the team (and add to this the fact that complexity scales non linearly with the number of features). The package relies on core developers using their free time to fix bugs, maintain code and review contributions. Any algorithm that is added needs future attention by the developers, at which point the original author might long have lost interest. See also :ref:`new_algorithms_inclusion_criteria`. For a great read about long-term maintenance issues in open-source software, look at `the Executive Summary of Roads and Bridges <https://www.fordfoundation.org/media/2976/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure.pdf#page=8>`_
es: El código viene con un costo de mantenimiento, y necesitamos equilibrar la cantidad de código que tenemos con el tamaño del equipo (y añadir a esto el hecho de que la complejidad no es lineal con el número de características). El paquete se basa en desarrolladores principales que utilizan su tiempo libre para corregir errores, mantener el código y revisar contribuciones. Cualquier algoritmo que se agregue necesita atención futura por parte de los desarrolladores, en cuyo momento el autor original podría haber perdido mucho interés. Ver también :ref:`new_algorithms_inclusion_criteria`. Para obtener una buena lectura sobre asuntos de mantenimiento a largo plazo en software de código abierto, consulte `el Resumen Ejecutivo de carreteras y puentes <https://www.fordfoundation.org/media/2976/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure.pdf#page=8>`_

source: Why did you remove HMMs from scikit-learn?
es: ¿Por qué eliminaron HMMs de scikit-learn?

source: See :ref:`adding_graphical_models`.
es: Ver :ref:`adding_graphical_models`.

source: Will you add graphical models or sequence prediction to scikit-learn?
es: ¿Añadirán modelos gráficos o predicción de secuencias a scikit-learn?

source: Not in the foreseeable future. scikit-learn tries to provide a unified API for the basic tasks in machine learning, with pipelines and meta-algorithms like grid search to tie everything together. The required concepts, APIs, algorithms and expertise required for structured learning are different from what scikit-learn has to offer. If we started doing arbitrary structured learning, we'd need to redesign the whole package and the project would likely collapse under its own weight.
es: No en el futuro previsible. scikit-learn trata de proporcionar una API unificada para las tareas básicas en el aprendizaje automático, con pipelines y meta-algoritmos como la búsqueda de cuadrícula para vincular todo. Los conceptos requeridos, las APIs, los algoritmos y la experiencia requerida para el aprendizaje estructurado son diferentes de lo que ofrece scikit-learn. Si empezáramos a hacer un aprendizaje estructurado arbitrario, tendríamos que rediseñar todo el paquete y el proyecto probablemente se derrumbaría por su propio peso.

source: There are two project with API similar to scikit-learn that do structured prediction:
es: Hay dos proyectos con la API similar al de scikit-learn que hacen predicción estructurada:

source: `pystruct <https://pystruct.github.io/>`_ handles general structured learning (focuses on SSVMs on arbitrary graph structures with approximate inference; defines the notion of sample as an instance of the graph structure)
es: `pystruct <https://pystruct.github.io/>`_ maneja el aprendizaje estructurado general (se enfoca en los SSVMs en estructuras de grafos arbitrarios con inferencia aproximada; define la noción de muestra como una instancia de la estructura de grafo)

source: `seqlearn <https://larsmans.github.io/seqlearn/>`_ handles sequences only (focuses on exact inference; has HMMs, but mostly for the sake of completeness; treats a feature vector as a sample and uses an offset encoding for the dependencies between feature vectors)
es: `seqlearn <https://larsmans.github.io/seqlearn/>`_ maneja sólo secuencias (se enfoca en la inferencia exacta; tiene HMMs, pero sobre todo en aras de la integridad; trata un vector de característica como una muestra y utiliza una codificación offset para las dependencias entre vectores de características)

source: Will you add GPU support?
es: ¿Añadirán soporte para GPU?

source: No, or at least not in the near future. The main reason is that GPU support will introduce many software dependencies and introduce platform specific issues. scikit-learn is designed to be easy to install on a wide variety of platforms. Outside of neural networks, GPUs don't play a large role in machine learning today, and much larger gains in speed can often be achieved by a careful choice of algorithms.
es: No, o al menos no en un futuro cercano. La razón principal es que el soporte de GPU introducirá muchas dependencias de software e introducirá incidencias específicas de la plataforma. scikit-learn está diseñado para ser fácil de instalar en una amplia variedad de plataformas. Fuera de redes neuronales, los GPUs no juegan un papel importante en el aprendizaje automático de hoy, y muchas más ganancias en velocidad pueden lograrse a menudo mediante una cuidadosa selección de algoritmos.

source: Do you support PyPy?
es: ¿Soportan PyPy?

source: In case you didn't know, `PyPy <https://pypy.org/>`_ is an alternative Python implementation with a built-in just-in-time compiler. Experimental support for PyPy3-v5.10+ has been added, which requires Numpy 1.14.0+, and scipy 1.1.0+.
es: En caso de que no lo sepas, `PyPy <https://pypy.org/>`_ es una implementación alternativa de Python con un compilador integrado just-in-time. Se ha añadido soporte experimental para PyPy3-v5.10+, que requiere Numpy 1.14.0+, y scipy 1.1.0+.

source: How do I deal with string data (or trees, graphs...)?
es: ¿Cómo se tratan los datos de cadenas (o árboles, gráficos...)?

source: scikit-learn estimators assume you'll feed them real-valued feature vectors. This assumption is hard-coded in pretty much all of the library. However, you can feed non-numerical inputs to estimators in several ways.
es: los estimadores de scikit-learn asumen que les alimentarán vectores de características de valor real. Esta suposición está codificada en casi toda la biblioteca. Sin embargo, puede alimentar entradas no numéricas a los estimadores de varias maneras.

source: If you have text documents, you can use a term frequency features; see :ref:`text_feature_extraction` for the built-in *text vectorizers*. For more general feature extraction from any kind of data, see :ref:`dict_feature_extraction` and :ref:`feature_hashing`.
es: Si tiene documentos de texto, puede utilizar las características de frecuencia del término; consulte :ref:`text_feature_extraction` para los *vectorizadores de texto* incorporados. Para extraer más características generales de cualquier tipo de datos, consulta :ref:`dict_feature_extraction` y :ref:`feature_hashing`.

source: Another common case is when you have non-numerical data and a custom distance (or similarity) metric on these data. Examples include strings with edit distance (aka. Levenshtein distance; e.g., DNA or RNA sequences). These can be encoded as numbers, but doing so is painful and error-prone. Working with distance metrics on arbitrary data can be done in two ways.
es: Otro caso común es cuando se tienen datos no numéricos y una métrica de distancia (o similar) personalizada en estos datos. Los ejemplos incluyen cadenas con distancia de edición (también conocida como distancia Levenshtein; por ejemplo, secuencias de ADN o ARN). Estas pueden ser codificadas como números, pero hacerlo es doloroso y propenso a errores. Trabajar con métricas de distancia en datos arbitrarios puede hacerse de dos maneras.

source: Firstly, many estimators take precomputed distance/similarity matrices, so if the dataset is not too large, you can compute distances for all pairs of inputs. If the dataset is large, you can use feature vectors with only one "feature", which is an index into a separate data structure, and supply a custom metric function that looks up the actual data in this data structure. E.g., to use DBSCAN with Levenshtein distances::
es: En primer lugar, muchos estimadores toman matrices de distancia/similitud precalculadas, por lo que si el conjunto de datos no es demasiado grande, se pueden calcular las distancias para todos los pares de entradas. Si el conjunto de datos es grande, puede utilizar vectores de características con una sola "característica", que es un índice en una estructura de datos separada, y suministrar una función métrica personalizada que busque los datos reales en esta estructura de datos. Por ejemplo, para utilizar DBSCAN con distancias Levenshtein::

source: (This uses the third-party edit distance package ``leven``.)
es: (Esto utiliza el paquete de distancia de edición de terceros ``leven``.)

source: Similar tricks can be used, with some care, for tree kernels, graph kernels, etc.
es: Se pueden utilizar trucos similares, con cierto cuidado, para los núcleos de árboles, gráficos, etc.

source: Why do I sometime get a crash/freeze with n_jobs > 1 under OSX or Linux?
es: ¿Por qué a veces se produce un fallo o congelación con n_jobs > 1 en OSX o Linux?

source: Several scikit-learn tools such as ``GridSearchCV`` and ``cross_val_score`` rely internally on Python's `multiprocessing` module to parallelize execution onto several Python processes by passing ``n_jobs > 1`` as an argument.
es: Varias herramientas de scikit-learn como ``GridSearchCV`` y ``cross_val_score`` se basan internamente en el módulo `multiprocessing` de Python para paralelizar la ejecución en varios procesos de Python pasando ``n_jobs > 1`` como argumento.

source: The problem is that Python ``multiprocessing`` does a ``fork`` system call without following it with an ``exec`` system call for performance reasons. Many libraries like (some versions of) Accelerate / vecLib under OSX, (some versions of) MKL, the OpenMP runtime of GCC, nvidia's Cuda (and probably many others), manage their own internal thread pool. Upon a call to `fork`, the thread pool state in the child process is corrupted: the thread pool believes it has many threads while only the main thread state has been forked. It is possible to change the libraries to make them detect when a fork happens and reinitialize the thread pool in that case: we did that for OpenBLAS (merged upstream in main since 0.2.10) and we contributed a `patch <https://gcc.gnu.org/bugzilla/show_bug.cgi?id=60035>`_ to GCC's OpenMP runtime (not yet reviewed).
es: El problema es que el ``multiprocesamiento`` de Python hace una llamada de sistema con el método ``fork`` sin seguirla con una llamada de sistema ``exec`` por razones de rendimiento. Muchas bibliotecas como (algunas de sus versiones) Accelerate / vecLib bajo OSX, (algunas de sus versiones) MKL, el OpenMP runtime de GCC, Cuda de nvidia (y probablemente muchos otros), gestionan su propio grupo de subprocesos internos. Tras una llamada a `fork`, el estado del grupo de subprocesos en el proceso hijo está corrupto: el grupo de subprocesos cree que tiene muchos hilos mientras que sólo el estado principal del subproceso ha sido bifurcado. Es posible cambiar las bibliotecas para hacerlas detectar cuando ocurre un fork y reinicializar el grupo de subprocesos en ese caso: lo hicimos para OpenBLAS (se fusionó en main desde 0.2.10) y hemos contribuido con un `patch <https://gcc.gnu.org/bugzilla/show_bug.cgi?id=60035>`_ a OpenMP runtime de GCC (no revisado aún).
