Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/getting_started.po
Languages: es

source: Getting Started
es: Iniciando

source: The purpose of this guide is to illustrate some of the main features that ``scikit-learn`` provides. It assumes a very basic working knowledge of machine learning practices (model fitting, predicting, cross-validation, etc.). Please refer to our :ref:`installation instructions <installation-instructions>` for installing ``scikit-learn``.
es: El propósito de esta guía es ilustrar algunas de las características principales que proporciona ``scikit-learn``. Asume un conocimiento muy básico de las prácticas de aprendizaje automático (ajuste de modelos, predicción, validación cruzada, etc.). Por favor, consulta nuestras :ref:`instrucciones de instalación <installation-instructions>` para instalar ``scikit-learn``.

source: ``Scikit-learn`` is an open source machine learning library that supports supervised and unsupervised learning. It also provides various tools for model fitting, data preprocessing, model selection and evaluation, and many other utilities.
es: ``Scikit-learn`` es una biblioteca de aprendizaje automático de código abierto que soporta el aprendizaje supervisado y no supervisado. También proporciona varias herramientas para el ajuste de modelos, preprocesamiento de datos, selección y evaluación de modelos, y muchas otras utilidades.

source: Fitting and predicting: estimator basics
es: Ajuste y predicción: fundamentos de los estimadores

source: ``Scikit-learn`` provides dozens of built-in machine learning algorithms and models, called :term:`estimators`. Each estimator can be fitted to some data using its :term:`fit` method.
es: ``Scikit-learn`` proporciona docenas de algoritmos de aprendizaje automático incorporados y modelos, llamados :term:`estimators`. Cada estimador se puede ajustar a algunos datos utilizando su método :term:`fit`.

source: Here is a simple example where we fit a :class:`~sklearn.ensemble.RandomForestClassifier` to some very basic data::
es: Aquí hay un ejemplo simple donde se ajusta un :class:`~sklearn.ensemble.RandomForestClassifier` en algunos datos muy básicos::

source: The :term:`fit` method generally accepts 2 inputs:
es: El método :term:`fit` generalmente acepta 2 entradas:

source: The samples matrix (or design matrix) :term:`X`. The size of ``X`` is typically ``(n_samples, n_features)``, which means that samples are represented as rows and features are represented as columns.
es: La matriz de muestras (o la matriz de diseño) :term:`X`. El tamaño de ``X`` es normalmente ``(n_samples, n_features)``, lo que significa que las muestras se representan como filas y características se representan como columnas.

source: The target values :term:`y` which are real numbers for regression tasks, or integers for classification (or any other discrete set of values). For unsupervized learning tasks, ``y`` does not need to be specified. ``y`` is usually 1d array where the ``i`` th entry corresponds to the target of the ``i`` th sample (row) of ``X``.
es: Los valores de destino :term:`y` que son números reales para las tareas de regresión, o enteros para la clasificación (o cualquier otro conjunto discreto de valores). Para tareas de aprendizaje no supervisadas, ``y`` no necesita ser especificado. ``y`` es generalmente un arreglo 1d donde la entrada ``i`` corresponde al destino de la muestra número ``i`` (fila) de ``X``.

source: Both ``X`` and ``y`` are usually expected to be numpy arrays or equivalent :term:`array-like` data types, though some estimators work with other formats such as sparse matrices.
es: Se espera que tanto ``X`` como ``y`` sean arreglos de numpy o tipos de datos equivalentes de :term:`array-like`, aunque algunos estimadores trabajan con otros formatos tales como matrices dispersas.

source: Once the estimator is fitted, it can be used for predicting target values of new data. You don't need to re-train the estimator::
es: Una vez que el estimador está ajustado, se puede utilizar para predecir los valores de destino de los nuevos datos. No es necesario volver a entrenar el estimador::

source: Transformers and pre-processors
es: Transformadores y preprocesadores

source: Machine learning workflows are often composed of different parts. A typical pipeline consists of a pre-processing step that transforms or imputes the data, and a final predictor that predicts target values.
es: Los flujos de trabajo de aprendizaje automático a menudo están compuestos de diferentes partes. Un pipeline típico consiste en un paso de preprocesamiento que transforma o imputa los datos, y un predictor final que predice los valores de destino.

source: In ``scikit-learn``, pre-processors and transformers follow the same API as the estimator objects (they actually all inherit from the same ``BaseEstimator`` class). The transformer objects don't have a :term:`predict` method but rather a :term:`transform` method that outputs a newly transformed sample matrix ``X``::
es: En ``scikit-learn``, los preprocesadores y transformadores siguen la misma API que los objetos del estimador (todos en realidad heredan de la misma clase ``BaseEstimator``). Los objetos transformadores no tienen un método :term:`predict` sino un método :term:`transform` que produce una matriz de ejemplo recién transformada ``X``::

source: Sometimes, you want to apply different transformations to different features: the :ref:`ColumnTransformer<column_transformer>` is designed for these use-cases.
es: A veces, quieres aplicar diferentes transformaciones a diferentes características: la :ref:`ColumnTransformer<column_transformer>` está diseñada para estos casos de uso.

source: Pipelines: chaining pre-processors and estimators
es: Pipelines: preprocesadores y estimadores de cadenas

source: Transformers and estimators (predictors) can be combined together into a single unifying object: a :class:`~sklearn.pipeline.Pipeline`. The pipeline offers the same API as a regular estimator: it can be fitted and used for prediction with ``fit`` and ``predict``. As we will see later, using a pipeline will also prevent you from data leakage, i.e. disclosing some testing data in your training data.
es: Los transformadores y estimadores (predictores) se pueden combinar juntos en un solo objeto unificador: un :class:`~sklearn.pipeline.Pipeline`. El pipeline ofrece la misma API que un estimador regular: puede ser ajustado y utilizado para predicción con ``fit`` y ``predict``. Como veremos más adelante, el uso de un pipeline también evitará la fuga de datos, es decir, revelar algunos datos de prueba en sus datos de entrenamiento.

source: In the following example, we :ref:`load the Iris dataset <datasets>`, split it into train and test sets, and compute the accuracy score of a pipeline on the test data::
es: En el siguiente ejemplo, :ref:`cargar el conjunto de datos Iris <datasets>`, lo dividimos en conjuntos de entrenamientos y de pruebas, y calculamos la puntuación exacta de un pipeline en los datos de prueba::

source: Model evaluation
es: Evaluación del modelo

source: Fitting a model to some data does not entail that it will predict well on unseen data. This needs to be directly evaluated. We have just seen the :func:`~sklearn.model_selection.train_test_split` helper that splits a dataset into train and test sets, but ``scikit-learn`` provides many other tools for model evaluation, in particular for :ref:`cross-validation <cross_validation>`.
es: Ajustar un modelo a algunos datos no implica que vaya a predecir bien sobre datos no vistos. Esto necesita ser evaluado directamente. Acabamos de ver el ayudante :func:`~sklearn.model_selection.train_test_split` que divide un conjunto de datos en conjuntos de entrenamiento y pruebas, pero ``scikit-learn`` proporciona muchas otras herramientas para la evaluación del modelo, en particular para :ref:`validación cruzada <cross_validation>`.

source: We here briefly show how to perform a 5-fold cross-validation procedure, using the :func:`~sklearn.model_selection.cross_validate` helper. Note that it is also possible to manually iterate over the folds, use different data splitting strategies, and use custom scoring functions. Please refer to our :ref:`User Guide <cross_validation>` for more details::
es: Aquí mostramos brevemente cómo realizar un procedimiento de validación cruzada de 5 pliegues, usando el ayudante :func:`~sklearn.model_selection.cross_validate`. Ten en cuenta que también es posible iterar manualmente sobre los pliegues, usar diferentes estrategias de división de datos y usar funciones personalizadas de puntuación. Por favor, consulta nuestra :ref:`Guía de usuario <cross_validation>` para más detalles::

source: Automatic parameter searches
es: Búsqueda automática de parámetros

source: All estimators have parameters (often called hyper-parameters in the literature) that can be tuned. The generalization power of an estimator often critically depends on a few parameters. For example a :class:`~sklearn.ensemble.RandomForestRegressor` has a ``n_estimators`` parameter that determines the number of trees in the forest, and a ``max_depth`` parameter that determines the maximum depth of each tree. Quite often, it is not clear what the exact values of these parameters should be since they depend on the data at hand.
es: Todos los estimadores tienen parámetros (a menudo llamados hiper-parámetros en la literatura) que pueden ser sintonizados. La potencia de generalización de un estimador a menudo depende de unos pocos parámetros. Por ejemplo, un :class:`~sklearn.ensemble.RandomForestRegressor` tiene el parámetro ``n_estimators`` que determina el número de árboles en el bosque, y un parámetro ``max_depth`` que determina la profundidad máxima de cada árbol. Muy a menudo, no está claro cuáles deben ser los valores exactos de estos parámetros, ya que dependen de los datos disponibles.

source: ``Scikit-learn`` provides tools to automatically find the best parameter combinations (via cross-validation). In the following example, we randomly search over the parameter space of a random forest with a :class:`~sklearn.model_selection.RandomizedSearchCV` object. When the search is over, the :class:`~sklearn.model_selection.RandomizedSearchCV` behaves as a :class:`~sklearn.ensemble.RandomForestRegressor` that has been fitted with the best set of parameters. Read more in the :ref:`User Guide <grid_search>`::
es: ``Scikit-learn`` proporciona herramientas para encontrar automáticamente las mejores combinaciones de parámetros (a través de validación cruzada). En el siguiente ejemplo, buscamos aleatoriamente el espacio de parámetros de un bosque aleatorio con un objeto :class:`~sklearn.model_selection.RandomizedSearchCV`. Cuando la búsqueda termina, el :class:`~sklearn.model_selection.RandomizedSearchCV` se comporta como un :class:`~sklearn.ensemble. andomForestRegressor` que ha sido ajustado con el mejor conjunto de parámetros. Lee más en la :ref:`Guía de Usuario <grid_search>`::

source: In practice, you almost always want to :ref:`search over a pipeline <composite_grid_search>`, instead of a single estimator. One of the main reasons is that if you apply a pre-processing step to the whole dataset without using a pipeline, and then perform any kind of cross-validation, you would be breaking the fundamental assumption of independence between training and testing data. Indeed, since you pre-processed the data using the whole dataset, some information about the test sets are available to the train sets. This will lead to over-estimating the generalization power of the estimator (you can read more in this `Kaggle post <https://www.kaggle.com/alexisbcook/data-leakage>`_).
es: En la práctica, casi siempre quieres :ref:`buscar sobre un pipeline <composite_grid_search>`, en lugar de un solo estimador. Una de las razones principales es que si se aplica un paso de preprocesamiento a todo el conjunto de datos sin usar un pipeline, y luego realizar cualquier tipo de validación cruzada, estaríamos rompiendo el supuesto fundamental de independencia entre los datos de entrenamiento y de pruebas. De hecho, dado que se preprocesaron los datos utilizando el conjunto de datos completo, algunas informaciones sobre los conjuntos de pruebas están disponibles para los de entrenamiento. Esto llevará a sobreestimar el poder de generalización del estimador (puedes leer más en este `post de Kaggle <https://www.kaggle.com/alexisbcook/data-leakage>`_).

source: Using a pipeline for cross-validation and searching will largely keep you from this common pitfall.
es: El uso de un pipeline para la validación cruzada y la búsqueda te evitará en gran medida este fallo común.

source: Next steps
es: Pasos siguientes

source: We have briefly covered estimator fitting and predicting, pre-processing steps, pipelines, cross-validation tools and automatic hyper-parameter searches. This guide should give you an overview of some of the main features of the library, but there is much more to ``scikit-learn``!
es: Hemos cubierto brevemente el ajuste y predicción del estimador, pasos de preprocesamiento, pipelines, herramientas de validación cruzada y búsquedas automáticas de hiper-parámetros. Esta guía debería darte una visión general de algunas de las principales características de la biblioteca, pero ¡hay mucho más en ``scikit-learn``!

source: Please refer to our :ref:`user_guide` for details on all the tools that we provide. You can also find an exhaustive list of the public API in the :ref:`api_ref`.
es: Por favor, consulta nuestra :ref:`user_guide` para obtener más información sobre todas las herramientas que proporcionamos. También puede encontrar una lista exhaustiva de la API pública en el :ref:`api_ref`.

source: You can also look at our numerous :ref:`examples <general_examples>` that illustrate the use of ``scikit-learn`` in many different contexts.
es: También puedes mirar nuestros numerosos :ref:`ejemplos <general_examples>` que ilustran el uso de ``scikit-learn`` en muchos contextos diferentes.

source: The :ref:`tutorials <tutorial_menu>` also contain additional learning resources.
es: Los :ref:`tutoriales <tutorial_menu>` también contienen recursos de aprendizaje adicionales.
