Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: Glossary of Common Terms and API Elements
es: Glosario de Términos Comunes y Elementos de la API

source: This glossary hopes to definitively represent the tacit and explicit conventions applied in Scikit-learn and its API, while providing a reference for users and contributors. It aims to describe the concepts and either detail their corresponding API or link to other relevant parts of the documentation which do so. By linking to glossary entries from the API Reference and User Guide, we may minimize redundancy and inconsistency.
es: Este glosario espera representar definitivamente las convenciones tácitas y explícitas aplicadas en scikit-learn y su API, proporcionando al mismo tiempo una referencia para los usuarios y colaboradores. Su objetivo es describir los conceptos y detallar su correspondiente API o bien enlazar con otras partes relevantes de la documentación que lo hagan. Al enlazar con las entradas de glosario de la Referencia de la API y la Guía de Usuario, podemos minimizar la redundancia y la inconsistencia.

source: We begin by listing general concepts (and any that didn't fit elsewhere), but more specific sets of related terms are listed below: :ref:`glossary_estimator_types`, :ref:`glossary_target_types`, :ref:`glossary_methods`, :ref:`glossary_parameters`, :ref:`glossary_attributes`, :ref:`glossary_sample_props`.
es: Empezamos por listar los conceptos generales (y cualquiera que no encajaba en otra parte), pero conjuntos más específicos de términos relacionados se listan a continuación: :ref:`glossary_estimator_types`, :ref:`glossary_target_types`, :ref:`glossary_methods`, :ref:`glossary_parameters`, :ref:`glossary_attributes`, :ref:`glossary_sample_props`.

source: General Concepts
es: Conceptos Generales

source: 1d array
es: Arreglo 1D

source: One-dimensional array. A NumPy array whose ``.shape`` has length 1. A vector.
es: Un arreglo unidimensional. Un arreglo NumPy cuyo ``.shape`` tiene longitud 1. Un vector.

source: 2d array
es: Arreglo 2D

source: Two-dimensional array. A NumPy array whose ``.shape`` has length 2. Often represents a matrix.
es: Un arreglo bidimensional. Un arreglo NumPy cuyo ``.shape`` tiene longitud 2. A menudo representa una matriz.

source: Refers to both the *specific* interfaces for estimators implemented in Scikit-learn and the *generalized* conventions across types of estimators as described in this glossary and :ref:`overviewed in the contributor documentation <api_overview>`.
es: Se refiere tanto a las interfaces *específicas* para los estimadores implementados en scikit-learn como a las convenciones *generalizadas* entre los tipos de estimadores, tal como se describe en este glosario y :ref:`se resume en la documentación de los colaboradores <api_overview>`.

source: The specific interfaces that constitute Scikit-learn's public API are largely documented in :ref:`api_ref`. However, we less formally consider anything as public API if none of the identifiers required to access it begins with ``_``. We generally try to maintain :term:`backwards compatibility` for all objects in the public API.
es: Las interfaces específicas que constituyen la API pública de scikit-learn están ampliamente documentadas en :ref:`api_ref`. Sin embargo, consideramos menos formalmente cualquier cosa como API pública si ninguno de los identificadores requeridos para acceder a ella comienza con ``_``. En general, tratamos de mantener :term:`compatibilidad con versiones anteriores` para todos los objetos en la API pública.

source: Private API, including functions, modules and methods beginning ``_`` are not assured to be stable.
es: La API privada, incluyendo funciones, módulos y métodos que empiezan por ``_`` no tienen garantizada su estabilidad.

source: The most common data format for *input* to Scikit-learn estimators and functions, array-like is any type object for which :func:`numpy.asarray` will produce an array of appropriate shape (usually 1 or 2-dimensional) of appropriate dtype (usually numeric).
es: El formato de datos más común de *entrada* a los estimadores y funciones de Scikit-learn, array-like es cualquier tipo objeto para el que :func:`numpy.asarray` producirá un arreglo de forma apropiada (normalmente de 1 o 2 dimensiones) de dtype apropiado (normalmente numérico).

source: This includes:
es: Esto incluye:

source: a numpy array
es: un arreglo numpy

source: a list of numbers
es: una lista de números

source: a list of length-k lists of numbers for some fixed length k
es: una lista de listas de números de longitud-k para alguna longitud fija k

source: a :class:`pandas.DataFrame` with all columns numeric
es: una :class:`pandas.DataFrame` con todas las columnas numéricas

source: a numeric :class:`pandas.Series`
es: una :class:`pandas.Series` numérica

source: It excludes:
es: Excluye:

source: a :term:`sparse matrix`
es: una :term:`matriz dispersa`

source: an iterator
es: un iterador

source: a generator
es: un generador

source: Note that *output* from scikit-learn estimators and functions (e.g. predictions) should generally be arrays or sparse matrices, or lists thereof (as in multi-output :class:`tree.DecisionTreeClassifier`'s ``predict_proba``). An estimator where ``predict()`` returns a list or a `pandas.Series` is not valid.
es: Tenga en cuenta que las *salidas* de los estimadores y funciones de scikit-learn (por ejemplo, las predicciones) deben ser generalmente arreglos o matrices dispersas, o listas de las mismas (como en ``predict_proba`` de la :class:`tree.DecisionTreeClassifier` de salida múltiple). Un estimador en el que ``predict()`` devuelve una lista o una ``pandas.Series`` no es válido.

source: attribute
es: atributo

source: attributes
es: atributos

source: We mostly use attribute to refer to how model information is stored on an estimator during fitting. Any public attribute stored on an estimator instance is required to begin with an alphabetic character and end in a single underscore if it is set in :term:`fit` or :term:`partial_fit`. These are what is documented under an estimator's *Attributes* documentation. The information stored in attributes is usually either: sufficient statistics used for prediction or transformation; :term:`transductive` outputs such as :term:`labels_` or :term:`embedding_`; or diagnostic data, such as :term:`feature_importances_`. Common attributes are listed :ref:`below <glossary_attributes>`.
es: La mayoría de las veces utilizamos atributo para referirnos a cómo se almacena la información del modelo en un estimador durante el ajuste. Cualquier atributo público almacenado en una instancia del estimador debe empezar con un carácter alfabético y terminar con un solo guión bajo si se establece en :term:`fit` o :term:`partial_fit`. Esto es lo que se encuentra en la documentación *Atributos* de un estimador. La información almacenada en los atributos suele ser: estadísticos suficientes utilizados para la predicción o la transformación; salidas :term:`transductivo`(as) como :term:`labels_` o :term:`embedding_`; o datos de diagnóstico, como :term:`feature_importances_`. Los atributos comunes se listan :ref:`a continuación <glossary_attributes>`.

source: A public attribute may have the same name as a constructor :term:`parameter`, with a ``_`` appended. This is used to store a validated or estimated version of the user's input. For example, :class:`decomposition.PCA` is constructed with an ``n_components`` parameter. From this, together with other parameters and the data, PCA estimates the attribute ``n_components_``.
es: Un atributo público puede tener el mismo nombre que un :term:`parámetro` del constructor, con un ``_` añadido. Se utiliza para almacenar una versión validada o estimada de la entrada del usuario. Por ejemplo, :class:`decomposition.PCA` se construye con un parámetro ``n_components``. A partir de esto, junto con otros parámetros y los datos, PCA estima el atributo ``n_componentes_``.

source: Further private attributes used in prediction/transformation/etc. may also be set when fitting. These begin with a single underscore and are not assured to be stable for public access.
es: También pueden establecerse otros atributos privados utilizados en la predicción/transformación/etc. durante el ajuste. Estos empiezan con un solo guión bajo y no se asegura que sean estables para el acceso público.

source: A public attribute on an estimator instance that does not end in an underscore should be the stored, unmodified value of an ``__init__`` :term:`parameter` of the same name. Because of this equivalence, these are documented under an estimator's *Parameters* documentation.
es: Un atributo público en una instancia del estimador que no termine en un guión bajo debe ser el valor almacenado y no modificado de un :term:`parámetro` ``__init__`` del mismo nombre. Debido a esta equivalencia, se agregan en la documentación de *Parámetros* de un estimador.

source: backwards compatibility
es: compatibilidad con versiones anteriores

source: We generally try to maintain backward compatibility (i.e. interfaces and behaviors may be extended but not changed or removed) from release to release but this comes with some exceptions:
es: Por lo general, intentamos mantener la compatibilidad con versiones anteriores (es decir, las interfaces y los comportamientos pueden ampliarse, pero no modificarse ni eliminarse) de una versión a otra, pero esto tiene algunas excepciones:

source: Public API only
es: Solamente API pública

source: The behavior of objects accessed through private identifiers (those beginning ``_``) may be changed arbitrarily between versions.
es: El comportamiento de los objetos a los que se accede a través de identificadores privados (los que empiezan por ``_``) puede cambiar arbitrariamente entre versiones.

source: As documented
es: Como está documentado

source: We will generally assume that the users have adhered to the documented parameter types and ranges. If the documentation asks for a list and the user gives a tuple, we do not assure consistent behavior from version to version.
es: Por lo general, asumiremos que los usuarios se han ceñido a los tipos y rangos de parámetros documentados. Si la documentación pide una lista y el usuario proporciona una tupla, no garantizamos un comportamiento consistente de una versión a otra.

source: Deprecation
es: Obsolescencia

source: Behaviors may change following a :term:`deprecation` period (usually two releases long). Warnings are issued using Python's :mod:`warnings` module.
es: Los comportamientos pueden cambiar tras un periodo de :term:`obsolescencia` (normalmente de dos versiones). Las advertencias se emiten utilizando el módulo :mod:`warnings` de Python.

source: Keyword arguments
es: Argumentos de palabras clave

source: We may sometimes assume that all optional parameters (other than X and y to :term:`fit` and similar methods) are passed as keyword arguments only and may be positionally reordered.
es: A veces podemos suponer que todos los parámetros opcionales (que no sean X e y para :term:`fit` y métodos similares) se pasan sólo como argumentos de palabra clave y pueden ser reordenados posicionalmente.

source: Bug fixes and enhancements
es: Corrección de errores y mejoras

source: Bug fixes and -- less often -- enhancements may change the behavior of estimators, including the predictions of an estimator trained on the same data and :term:`random_state`. When this happens, we attempt to note it clearly in the changelog.
es: Las correcciones de errores y -menos a menudo- las mejoras pueden cambiar el comportamiento de los estimadores, incluyendo las predicciones de un estimador entrenado con los mismos datos y :term:`random_state`. Cuando esto ocurre, intentamos indicarlo claramente en el registro de cambios.

source: Serialization
es: Serialización

source: We make no assurances that pickling an estimator in one version will allow it to be unpickled to an equivalent model in the subsequent version. (For estimators in the sklearn package, we issue a warning when this unpickling is attempted, even if it may happen to work.) See :ref:`persistence_limitations`.
es: No aseguramos que el pickling de un estimador en una versión permita que sea unpickled a un modelo equivalente en la versión siguiente. (En el caso de los estimadores del paquete sklearn, emitimos una advertencia cuando se intenta realizar este unpickling, incluso si es posible que funcione). Ver :ref:`persistence_limitations`.

source: We provide limited backwards compatibility assurances for the estimator checks: we may add extra requirements on estimators tested with this function, usually when these were informally assumed but not formally tested.
es: Proporcionamos garantías limitadas de compatibilidad con versiones anteriores para las comprobaciones de los estimadores: podemos añadir requisitos adicionales a los estimadores probados con esta función, normalmente cuando éstos se asumían de manera informal pero no se probaban formalmente.

source: Despite this informal contract with our users, the software is provided as is, as stated in the license. When a release inadvertently introduces changes that are not backward compatible, these are known as software regressions.
es: A pesar de este contrato informal con nuestros usuarios, el software se proporciona tal cual, tal como se indica en la licencia. Cuando una versión introduce inadvertidamente cambios que no son compatibles con las versiones anteriores, estos se conocen como regresiones de software.

source: callable
es: invocable

source: A function, class or an object which implements the ``__call__`` method; anything that returns True when the argument of `callable() <https://docs.python.org/3/library/functions.html#callable>`_.
es: Una función, una clase o un objeto que implementa el método ``__call__``; cualquier cosa que devuelva True cuando sea el argumento de `callable() <https://docs.python.org/3/library/functions.html#callable>`_.

source: categorical feature
es: característica categórica

source: A categorical or nominal :term:`feature` is one that has a finite set of discrete values across the population of data. These are commonly represented as columns of integers or strings. Strings will be rejected by most scikit-learn estimators, and integers will be treated as ordinal or count-valued. For the use with most estimators, categorical variables should be one-hot encoded. Notable exceptions include tree-based models such as random forests and gradient boosting models that often work better and faster with integer-coded categorical variables. :class:`~sklearn.preprocessing.OrdinalEncoder` helps encoding string-valued categorical features as ordinal integers, and :class:`~sklearn.preprocessing.OneHotEncoder` can be used to one-hot encode categorical features. See also :ref:`preprocessing_categorical_features` and the `categorical-encoding <https://contrib.scikit-learn.org/categorical-encoding>`_ package for tools related to encoding categorical features.
es: Una :term:`característica` categórica o nominal es aquella que tiene un conjunto finito de valores discretos en la población de datos. Normalmente se representan como columnas de enteros o cadenas. Las cadenas serán rechazadas por la mayoría de los estimadores de scikit-learn, y los enteros serán tratados como ordinales o valores de conteo. Para el uso con la mayoría de los estimadores, las variables categóricas deben ser codificadas one-hot. Algunas excepciones notables son los modelos basados en árboles, como los modelos de bosques aleatorios y de potenciación del gradiente, que suelen funcionar mejor y más rápido con variables categóricas codificadas con números enteros. :class:`~sklearn.preprocessing.OrdinalEncoder` ayuda a codificar las características categóricas con valores de cadena como enteros ordinales, y :class:`~sklearn.preprocessing.OneHotEncoder` puede utilizarse para codificar one-hot las características categóricas. Véase también :ref:`preprocessing_categorical_features` y el paquete `categorical-encoding <https://contrib.scikit-learn.org/categorical-encoding>`_ para las herramientas relacionadas con la codificación de características categóricas.

source: clone
es: clonar

source: cloned
es: clonado

source: To copy an :term:`estimator instance` and create a new one with identical :term:`parameters`, but without any fitted :term:`attributes`, using :func:`~sklearn.base.clone`.
es: Para copiar una :term:`instancia del estimador` y crear una nueva con :term:`parámetros` idénticos, pero sin :term:`atributos` ajustados, utilizando :func:`~sklearn.base.clone`.

source: When ``fit`` is called, a :term:`meta-estimator` usually clones a wrapped estimator instance before fitting the cloned instance. (Exceptions, for legacy reasons, include :class:`~pipeline.Pipeline` and :class:`~pipeline.FeatureUnion`.)
es: Cuando se llama a ``fit``, un :term:`meta-estimator` normalmente clona una instancia de estimador wrapped antes de ajustar la instancia clonada. (Las excepciones, por razones de legado, incluyen :class:`~pipeline.Pipeline` y :class:`~pipeline.FeatureUnion`.)

source: If the estimator's `random_state` parameter is an integer (or if the estimator doesn't have a `random_state` parameter), an *exact clone* is returned: the clone and the original estimator will give the exact same results. Otherwise, *statistical clone* is returned: the clone might yield different results from the original estimator. More details can be found in :ref:`randomness`.
es: Si el parámetro `random_state` del estimador es un entero (o si el estimador no tiene un parámetro `random_state`), se devuelve un *clon exacto*: el clon y el estimador original darán exactamente los mismos resultados. En caso contrario, se devuelve un *clon estadístico*: el clon puede dar resultados diferentes a los del estimador original. Puedes encontrar más detalles en :ref:`randomness`.

source: common tests
es: tests comunes

source: This refers to the tests run on almost every estimator class in Scikit-learn to check they comply with basic API conventions. They are available for external use through :func:`utils.estimator_checks.check_estimator`, with most of the implementation in ``sklearn/utils/estimator_checks.py``.
es: Esto se refiere a las pruebas que se ejecutan en casi todas las clases de estimadores en scikit-learn para comprobar que cumplen con las convenciones básicas de la API. Están disponibles para uso externo a través de :func:`utils.estimator_checks.check_estimator`, con la mayor parte de la implementación en ``sklearn/utils/estimator_checks.py``.

source: Note: Some exceptions to the common testing regime are currently hard-coded into the library, but we hope to replace this by marking exceptional behaviours on the estimator using semantic :term:`estimator tags`.
es: Nota: Algunas excepciones al régimen común de pruebas son actualmente de codificación fija en la biblioteca, pero esperamos reemplazar esto marcando comportamientos excepcionales en el estimador usando :term:`etiquetas del estimador` (semánticas).

source: deprecation
es: obsolescencia

source: We use deprecation to slowly violate our :term:`backwards compatibility` assurances, usually to to:
es: Usamos la obsolescencia para violar lentamente nuestras garantías de :term:`compatibilidad con versiones anteriores`, generalmente para:

source: change the default value of a parameter; or
es: cambiar el valor por defecto de un parámetro; o

source: remove a parameter, attribute, method, class, etc.
es: eliminar un parámetro, atributo, método, clase, etc.

source: We will ordinarily issue a warning when a deprecated element is used, although there may be limitations to this. For instance, we will raise a warning when someone sets a parameter that has been deprecated, but may not when they access that parameter's attribute on the estimator instance.
es: Normalmente emitiremos una advertencia cuando se utilice un elemento obsoleto aunque puede haber limitaciones en este sentido. Por ejemplo, emitiremos una advertencia cuando alguien establezca un parámetro que haya sido obsoleto, pero puede que no lo hagamos cuando accedan al atributo de ese parámetro en la instancia del estimador.

source: See the :ref:`Contributors' Guide <contributing_deprecation>`.
es: Ver la :ref:`Guía de Colaboradores <contributing_deprecation>`.

source: dimensionality
es: dimensionalidad

source: May be used to refer to the number of :term:`features` (i.e. :term:`n_features`), or columns in a 2d feature matrix. Dimensions are, however, also used to refer to the length of a NumPy array's shape, distinguishing a 1d array from a 2d matrix.
es: Puede usarse para referirse al número de :term:`características` (es decir, :term:`n_features`), o de columnas en una matriz de características 2D. Sin embargo, las dimensiones también se utilizan para referirse a la longitud de la forma de un arreglo NumPy, distinguiendo un arreglo 1D de una matriz 2D.

source: docstring
es: cadena de documentación

source: The embedded documentation for a module, class, function, etc., usually in code as a string at the beginning of the object's definition, and accessible as the object's ``__doc__`` attribute.
es: La documentación incrustada para un módulo, clase, función, etc., normalmente en el código como una cadena al principio de la definición del objeto, y accesible como el atributo ``__doc__`` del objeto.

source: We try to adhere to `PEP257 <https://www.python.org/dev/peps/pep-0257/>`_, and follow `NumpyDoc conventions <https://numpydoc.readthedocs.io/en/latest/format.html>`_.
es: Intentamos adherirnos a la `PEP257 <https://www.python.org/dev/peps/pep-0257/>`_, y seguir `las convenciones de NumpyDoc <https://numpydoc.readthedocs.io/en/latest/format.html>`_.

source: double underscore
es: doble guión bajo

source: double underscore notation
es: notación de doble guión bajo

source: When specifying parameter names for nested estimators, ``__`` may be used to separate between parent and child in some contexts. The most common use is when setting parameters through a meta-estimator with :term:`set_params` and hence in specifying a search grid in :ref:`parameter search <grid_search>`. See :term:`parameter`. It is also used in :meth:`pipeline.Pipeline.fit` for passing :term:`sample properties` to the ``fit`` methods of estimators in the pipeline.
es: Cuando se especifican los nombres de los parámetros para los estimadores anidados, se puede utilizar ``__`` para separar entre padre e hijo en algunos contextos. El uso más común es cuando se establecen parámetros a través de un meta estimador con :term:`set_params` y por lo tanto en la especificación de una cuadrícula de búsqueda en :ref:`la búsqueda de parámetros <grid_search>`. Ver :term:`parámetro`. También se utiliza en :meth:`pipeline.Pipeline.fit` para pasar :term:`propiedades de la muestra` a los métodos ``fit`` de los estimadores en el pipeline.

source: data type
es: tipo de dato

source: NumPy arrays assume a homogeneous data type throughout, available in the ``.dtype`` attribute of an array (or sparse matrix). We generally assume simple data types for scikit-learn data: float or integer. We may support object or string data types for arrays before encoding or vectorizing. Our estimators do not work with struct arrays, for instance.
es: Los arreglos de NumPy asumen un tipo de datos homogéneo en todo momento, disponible en el atributo ``.dtype`` de un arreglo (o matriz dispersa). Generalmente asumimos tipos de datos simples para los datos de scikit-learn: de punto flotante (float) o entero. Podemos admitir tipos de datos de objeto o de cadena para los arreglos antes de codificarlos o vectorizarlos. Nuestros estimadores no funcionan con arreglos struct, por ejemplo.
