Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: A memory efficiency strategy that keeps data on disk rather than copying it into main memory. Memory maps can be created for arrays that can be read, written, or both, using :obj:`numpy.memmap`. When using :term:`joblib` to parallelize operations in Scikit-learn, it may automatically memmap large arrays to reduce memory duplication overhead in multiprocessing.
es: Una estrategia de eficiencia de memoria que mantiene los datos en el disco en lugar de copiarlos en la memoria principal. Los mapas de memoria pueden ser creados para arreglos que pueden ser leídos, escritos, o ambos, usando :obj:`numpy.memmap`. Cuando se utiliza :term:`joblib` para paralelizar las operaciones en scikit-learn, se pueden crear automáticamente mapas de memoria para arreglos grandes para reducir la sobrecarga de duplicación de memoria en el multiprocesamiento.

source: missing values
es: valores faltantes

source: Most Scikit-learn estimators do not work with missing values. When they do (e.g. in :class:`impute.SimpleImputer`), NaN is the preferred representation of missing values in float arrays. If the array has integer dtype, NaN cannot be represented. For this reason, we support specifying another ``missing_values`` value when :term:`imputation` or learning can be performed in integer space. :term:`Unlabeled data <unlabeled data>` is a special case of missing values in the :term:`target`.
es: La mayoría de los estimadores de scikit-learn no trabajan con valores faltantes. Cuando lo hacen (por ejemplo, en :class:`impute.SimpleImputer`), NaN es la representación preferida de los valores faltantes en los arreglos de punto flotante (float). Si el arreglo tiene un dtype entero, no se puede representar NaN. Por esta razón, apoyamos la especificación de otro valor ``missing_values`` cuando :term:`imputación` o el aprendizaje se puede realizar en el espacio de enteros. :term:`Datos no etiquetados <unlabeled data>` es un caso especial de valores faltantes en el :term:`objetivo`.

source: The number of :term:`features`.
es: El número de :term:`características`.

source: The number of :term:`outputs` in the :term:`target`.
es: El número de :term:`salidas` en el :term:`objetivo`.

source: The number of :term:`samples`.
es: El número de :term:`muestras`.

source: Synonym for :term:`n_outputs`.
es: Sinónimo de :term:`n_outputs`.

source: narrative docs
es: documentos narrativos

source: narrative documentation
es: documentación narrativa

source: An alias for :ref:`User Guide <user_guide>`, i.e. documentation written in ``doc/modules/``. Unlike the :ref:`API reference <api_ref>` provided through docstrings, the User Guide aims to:
es: Un alias para :ref:`Manual de Usuario <user_guide>`, es decir, la documentación escrita en ``doc/modules/``. A diferencia de la :ref:`Referencia API <api_ref>` proporcionada a través de docstrings, el Manual de Usuario tiene como objetivo:

source: group tools provided by Scikit-learn together thematically or in terms of usage;
es: agrupar las herramientas proporcionadas por scikit-learn de forma temática o en términos de uso;

source: motivate why someone would use each particular tool, often through comparison;
es: dar motivos de por qué alguien utilizaría cada herramienta en particular, a menudo mediante la comparación;

source: provide both intuitive and technical descriptions of tools;
es: proporcionar descripciones tanto intuitivas como técnicas de las herramientas;

source: provide or link to :term:`examples` of using key features of a tool.
es: proporcionar o enlazar con :term:`ejemplos` de uso de las características clave de una herramienta.

source: A shorthand for Numpy due to the conventional import statement::
es: Una abreviatura de Numpy debido a la declaración de importación convencional::

source: online learning
es: aprendizaje en línea

source: Where a model is iteratively updated by receiving each batch of ground truth :term:`targets` soon after making predictions on corresponding batch of data. Intrinsically, the model must be usable for prediction after each batch. See :term:`partial_fit`.
es: Donde un modelo se actualiza de forma iterativa recibiendo cada lote de :term:`objetivos` de verdad fundamental poco después de hacer predicciones sobre el lote de datos correspondiente. Intrínsecamente, el modelo debe ser utilizable para la predicción después de cada lote. Ver :term:`partial_fit`.

source: out-of-core
es: fuera del núcleo

source: An efficiency strategy where not all the data is stored in main memory at once, usually by performing learning on batches of data. See :term:`partial_fit`.
es: Una estrategia de eficiencia en la que no se almacenan todos los datos en la memoria principal a la vez, normalmente realizando el aprendizaje en lotes de datos. Ver :term:`partial_fit`.

source: outputs
es: salidas

source: Individual scalar/categorical variables per sample in the :term:`target`. For example, in multilabel classification each possible label corresponds to a binary output. Also called *responses*, *tasks* or *targets*. See :term:`multiclass multioutput` and :term:`continuous multioutput`.
es: Variables escalares/categóricas individuales por muestra en el :term:`objetivo`. Por ejemplo, en la clasificación multietiqueta cada etiqueta posible corresponde a una salida binaria. También se denominan *respuestas*, *tareas* u *objetivos*. Ver :term:`multiclase multisalida` y :term:`salida múltiple continua`.

source: pair
es: par

source: A tuple of length two.
es: Una tupla de longitud dos.

source: parameter
es: parámetro

source: parameters
es: parámetros

source: param
es: parámetro

source: params
es: parámetros

source: We mostly use *parameter* to refer to the aspects of an estimator that can be specified in its construction. For example, ``max_depth`` and ``random_state`` are parameters of :class:`RandomForestClassifier`. Parameters to an estimator's constructor are stored unmodified as attributes on the estimator instance, and conventionally start with an alphabetic character and end with an alphanumeric character. Each estimator's constructor parameters are described in the estimator's docstring.
es: La mayoría de las veces utilizamos *parámetro* para referirnos a los aspectos de un estimador que pueden especificarse en su construcción. Por ejemplo, ``max_depth`` y ``random_state`` son parámetros de :class:`RandomForestClassifier`. Los parámetros del constructor de un estimador se almacenan sin modificar como atributos en la instancia del estimador, y convencionalmente empiezan con un carácter alfabético y terminan con un carácter alfanumérico. Los parámetros del constructor de cada estimador se describen en la cadena de documentación del estimador.

source: We do not use parameters in the statistical sense, where parameters are values that specify a model and can be estimated from data. What we call parameters might be what statisticians call hyperparameters to the model: aspects for configuring model structure that are often not directly learnt from data. However, our parameters are also used to prescribe modeling operations that do not affect the learnt model, such as :term:`n_jobs` for controlling parallelism.
es: No utilizamos parámetros en el sentido estadístico, en el que los parámetros son valores que especifican un modelo y pueden estimarse a partir de los datos. Lo que llamamos parámetros podría ser lo que los estadísticos llaman hiperparámetros del modelo: aspectos para configurar la estructura del modelo que a menudo no se aprenden directamente de los datos. Sin embargo, nuestros parámetros también se utilizan para prescribir operaciones de modelado que no afectan al modelo entrenado, como :term:`n_jobs` para controlar el paralelismo.

source: When talking about the parameters of a :term:`meta-estimator`, we may also be including the parameters of the estimators wrapped by the meta-estimator. Ordinarily, these nested parameters are denoted by using a :term:`double underscore` (``__``) to separate between the estimator-as-parameter and its parameter. Thus ``clf = BaggingClassifier(base_estimator=DecisionTreeClassifier(max_depth=3))`` has a deep parameter ``base_estimator__max_depth`` with value ``3``, which is accessible with ``clf.base_estimator.max_depth`` or ``clf.get_params()['base_estimator__max_depth']``.
es: Cuando se habla de los parámetros de un :term:`meta-estimador`, también se pueden incluir los parámetros de los estimadores incluidos (wrapped) en el meta-estimador. Normalmente, estos parámetros anidados se denotan utilizando un :term:`subrayado doble` (``__``) para separar entre el estimador-como-parámetro y su parámetro. Así, ``clf = BaggingClassifier(base_estimator=DecisionTreeClassifier(max_depth=3))`` tiene un parámetro de profundidad ``base_estimator__max_depth`` con valor ``3``, al que se puede acceder con ``clf.base_estimator.max_depth`` o ``clf.get_params()['base_estimator__max_depth']``.

source: The list of parameters and their current values can be retrieved from an :term:`estimator instance` using its :term:`get_params` method.
es: La lista de parámetros y sus valores actuales pueden recuperarse de una :term:`instancia del estimador` utilizando su método :term:`get_params`.

source: Between construction and fitting, parameters may be modified using :term:`set_params`. To enable this, parameters are not ordinarily validated or altered when the estimator is constructed, or when each parameter is set. Parameter validation is performed when :term:`fit` is called.
es: Entre la construcción y el ajuste, los parámetros pueden modificarse utilizando :term:`set_params`. Para permitir esto, los parámetros no se validan o modifican normalmente cuando se construye el estimador, o cuando se establece cada parámetro. La validación de los parámetros se realiza cuando se llama a :term:`fit`.

source: Common parameters are listed :ref:`below <glossary_parameters>`.
es: Los parámetros comunes están listados :ref:`abajo <glossary_parameters>`.

source: pairwise metric
es: métrica por pares

source: pairwise metrics
es: métricas por pares

source: In its broad sense, a pairwise metric defines a function for measuring similarity or dissimilarity between two samples (with each ordinarily represented as a :term:`feature vector`). We particularly provide implementations of distance metrics (as well as improper metrics like Cosine Distance) through :func:`metrics.pairwise_distances`, and of kernel functions (a constrained class of similarity functions) in :func:`metrics.pairwise_kernels`. These can compute pairwise distance matrices that are symmetric and hence store data redundantly.
es: En su sentido más amplio, una métrica por pares define una función para medir la similitud o disimilitud entre dos muestras (cada una de las cuales se representa normalmente como un :term:`vector de características`). En particular, proporcionamos implementaciones de métricas de distancia (así como métricas impropias como la Distancia Coseno) a través de :func:`metrics.pairwise_distances`, y de funciones kernel (una clase restringida de funciones de similitud) en :func:`metrics.pairwise_kernels`. Éstas pueden calcular matrices de distancia por pares que son simétricas y, por tanto, almacenan datos de forma redundante.

source: See also :term:`precomputed` and :term:`metric`.
es: Véase también :term:`precalculado` y :term:`metric`.

source: Note that for most distance metrics, we rely on implementations from :mod:`scipy.spatial.distance`, but may reimplement for efficiency in our context. The :mod:`neighbors` module also duplicates some metric implementations for integration with efficient binary tree search data structures.
es: Ten en cuenta que para la mayoría de las métricas de distancia, dependemos de las implementaciones de :mod:`scipy.spatial.distance`, pero podemos reimplementarlas por eficiencia en nuestro contexto. El módulo :mod:`neighbors` también duplica algunas implementaciones de métricas para su integración con estructuras de datos de búsqueda de árboles binarios eficientes.

source: A shorthand for `Pandas <https://pandas.pydata.org>`_ due to the conventional import statement::
es: Una abreviatura de `Pandas <https://pandas.pydata.org>`_ debido a la declaración de importación convencional::

source: precomputed
es: precalculado

source: Where algorithms rely on :term:`pairwise metrics`, and can be computed from pairwise metrics alone, we often allow the user to specify that the :term:`X` provided is already in the pairwise (dis)similarity space, rather than in a feature space. That is, when passed to :term:`fit`, it is a square, symmetric matrix, with each vector indicating (dis)similarity to every sample, and when passed to prediction/transformation methods, each row corresponds to a testing sample and each column to a training sample.
es: Donde los algoritmos dependen de :term:`métricas por pares`, y pueden calcularse sólo a partir de las métricas por pares, a menudo permitimos al usuario especificar que el :term:`X` proporcionado ya está en el espacio de (des)similitud por pares, en lugar de en un espacio de características. Es decir, cuando se pasa a :term:`fit`, es una matriz cuadrada y simétrica, en la que cada arreglo indica la (des)similitud con cada muestra, y cuando se pasa a los métodos de predicción/transformación, cada fila corresponde a una muestra de prueba y cada columna a una muestra de entrenamiento.

source: Use of precomputed X is usually indicated by setting a ``metric``, ``affinity`` or ``kernel`` parameter to the string 'precomputed'. If this is the case, then the estimator should set the `pairwise` estimator tag as True.
es: El uso de X precalculado suele indicarse estableciendo un parámetro ``metric``, ``affinity`` o ``kernel`` con la cadena 'precomputed'. Si este es el caso, el estimador debe establecer la etiqueta del estimador `pairwise` como True.

source: Data that can be represented as a matrix with :term:`samples` on the first axis and a fixed, finite set of :term:`features` on the second is called rectangular.
es: Los datos que pueden representarse como una matriz con :term:`muestras` en el primer eje y un conjunto fijo y finito de :term:`características` en el segundo se denominan rectangulares.

source: This term excludes samples with non-vectorial structures, such as text, an image of arbitrary size, a time series of arbitrary length, a set of vectors, etc. The purpose of a :term:`vectorizer` is to produce rectangular forms of such data.
es: Este término excluye las muestras con estructuras no vectoriales, como un texto, una imagen de tamaño arbitrario, una serie de tiempo de longitud arbitraria, un conjunto de vectores, etc. El propósito de un :term:`vectorizador` es producir formas rectangulares de tales datos.

source: sample
es: muestra

source: samples
es: muestras

source: We usually use this term as a noun to indicate a single feature vector. Elsewhere a sample is called an instance, data point, or observation. ``n_samples`` indicates the number of samples in a dataset, being the number of rows in a data array :term:`X`.
es: Solemos utilizar este término como sustantivo para indicar un único vector de características. En otras partes, una muestra se denomina instancia, punto de datos u observación. ``n_samples`` indica el número de muestras de un conjunto de datos, siendo el número de filas de un arreglo de datos :term:`X`.

source: sample property
es: propiedad de la muestra

source: sample properties
es: propiedades muestrales

source: A sample property is data for each sample (e.g. an array of length n_samples) passed to an estimator method or a similar function, alongside but distinct from the :term:`features` (``X``) and :term:`target` (``y``). The most prominent example is :term:`sample_weight`; see others at :ref:`glossary_sample_props`.
es: Una propiedad de la muestra se refiere a datos para cada muestra (por ejemplo, un arreglo de longitud n_samples) que se pasa a un método de estimación o a una función similar, junto con, pero distinto de, :term:`características` (``X``) y :term:`objetivo` (``y``). El ejemplo más destacado es :term:`sample_weight`; ver otros en :ref:`glossary_sample_props`.

source: As of version 0.19 we do not have a consistent approach to handling sample properties and their routing in :term:`meta-estimators`, though a ``fit_params`` parameter is often used.
es: A partir de la versión 0.19 no tenemos un enfoque consistente para manejar las propiedades muestrales y su enrutamiento en :term:`meta-estimadores`, aunque a menudo se utiliza un parámetro ``fit_params``.

source: A venue for publishing Scikit-learn-compatible libraries that are broadly authorized by the core developers and the contrib community, but not maintained by the core developer team. See https://scikit-learn-contrib.github.io.
es: Un lugar para publicar bibliotecas compatibles con scikit-learn que están ampliamente autorizadas por los desarrolladores principales y la comunidad de colaboradores, pero que no son mantenidas por el equipo de desarrolladores principales. Ver https://scikit-learn-contrib.github.io.

source: scikit-learn enhancement proposals
es: propuestas de mejora de scikit-learn

source: Changes to the API principles and changes to dependencies or supported versions happen via a :ref:`SLEP <slep>` and follows the decision-making process outlined in :ref:`governance`. For all votes, a proposal must have been made public and discussed before the vote. Such a proposal must be a consolidated document, in the form of a ‘Scikit-Learn Enhancement Proposal’ (SLEP), rather than a long discussion on an issue. A SLEP must be submitted as a pull-request to `enhancement proposals <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ using the `SLEP template <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_.
es: Los cambios en los principios de la API y los cambios en las dependencias o en las versiones soportadas se producen a través de una :ref:`SLEP <slep>` y siguen el proceso de toma de decisiones descrito en :ref:`governance`. Para todas las votaciones, una propuesta debe haberse hecho pública y debatido antes de la votación. Dicha propuesta debe ser un documento consolidado, en forma de "Propuesta de Mejora de Scikit-Learn" (Scikit-Learn Enhancement Proposal, SLEP), en lugar de una larga discusión sobre un tema. Una SLEP debe enviarse como un pull-request a `propuestas de mejora <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ utilizando la `plantilla SLEP <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_.

source: semi-supervised
es: semi-supervisado

source: semi-supervised learning
es: aprendizaje semi-supervisado

source: semisupervised
es: semi supervisado

source: Learning where the expected prediction (label or ground truth) is only available for some samples provided as training data when :term:`fitting` the model. We conventionally apply the label ``-1`` to :term:`unlabeled` samples in semi-supervised classification.
es: Aprendizaje en el que la predicción esperada (etiqueta o verdad fundamental) sólo está disponible para algunas muestras proporcionadas como datos de entrenamiento al hacer el :term:`ajuste` del modelo. Convencionalmente aplicamos la etiqueta ``-1`` a las muestras :term:`sin etiquetar` en la clasificación semi supervisada.

source: sparse matrix
es: matriz dispersa

source: sparse graph
es: gráfico disperso

source: A representation of two-dimensional numeric data that is more memory efficient the corresponding dense numpy array where almost all elements are zero. We use the :mod:`scipy.sparse` framework, which provides several underlying sparse data representations, or *formats*. Some formats are more efficient than others for particular tasks, and when a particular format provides especial benefit, we try to document this fact in Scikit-learn parameter descriptions.
es: Una representación de datos numéricos bidimensionales que es más eficiente en cuanto a la memoria que el correspondiente arreglo de numpy denso donde casi todos los elementos son cero. Utilizamos el framework :mod:`scipy.sparse`, que proporciona varias representaciones de datos dispersos subyacentes, o *formatos*. Algunos formatos son más eficientes que otros para tareas particulares, y cuando un formato particular proporciona un beneficio especial, tratamos de documentar este hecho en las descripciones de los parámetros de scikit-learn.

source: Some sparse matrix formats (notably CSR, CSC, COO and LIL) distinguish between *implicit* and *explicit* zeros. Explicit zeros are stored (i.e. they consume memory in a ``data`` array) in the data structure, while implicit zeros correspond to every element not otherwise defined in explicit storage.
es: Algunos formatos de matrices dispersas (especialmente CSR, CSC, COO y LIL) distinguen entre ceros *implícitos* y *explícitos*. Los ceros explícitos se almacenan (es decir, consumen memoria en un arreglo de ``datos``) en la estructura de datos, mientras que los ceros implícitos corresponden a todos los elementos no definidos en el almacenamiento explícito.

source: Two semantics for sparse matrices are used in Scikit-learn:
es: En scikit-learn se utilizan dos semánticas para las matrices dispersas:

source: matrix semantics
es: semánticas de matriz

source: The sparse matrix is interpreted as an array with implicit and explicit zeros being interpreted as the number 0. This is the interpretation most often adopted, e.g. when sparse matrices are used for feature matrices or :term:`multilabel indicator matrices`.
es: La matriz dispersa se interpreta como una matriz en la que los ceros implícitos y explícitos se interpretan como el número 0. Esta es la interpretación que se adopta con más frecuencia, por ejemplo, cuando se utilizan matrices dispersas para matrices de características o :term:`matrices indicatrices multietiqueta`.

source: graph semantics
es: semánticas de gráfico

source: As with :mod:`scipy.sparse.csgraph`, explicit zeros are interpreted as the number 0, but implicit zeros indicate a masked or absent value, such as the absence of an edge between two vertices of a graph, where an explicit value indicates an edge's weight. This interpretation is adopted to represent connectivity in clustering, in representations of nearest neighborhoods (e.g. :func:`neighbors.kneighbors_graph`), and for precomputed distance representation where only distances in the neighborhood of each point are required.
es: Al igual que con :mod:`scipy.sparse.csgraph`, los ceros explícitos se interpretan como el número 0, pero los ceros implícitos indican un valor enmascarado o ausente, como la ausencia de una arista entre dos vértices de un grafo, donde un valor explícito indica el peso de una arista. Esta interpretación se adopta para representar la conectividad en el conglomerado, en las representaciones de vecindarios más cercanos (por ejemplo, :func:`neighbors.kneighbors_graph`), y para la representación de distancias precalculadas donde sólo se requieren las distancias en el vecindario de cada punto.

source: When working with sparse matrices, we assume that it is sparse for a good reason, and avoid writing code that densifies a user-provided sparse matrix, instead maintaining sparsity or raising an error if not possible (i.e. if an estimator does not / cannot support sparse matrices).
es: Cuando se trabaja con matrices dispersas, asumimos que son dispersas por una buena razón, y evitamos escribir código que densifique una matriz dispersa proporcionada por el usuario, manteniendo en su lugar la dispersidad o generando un error si no es posible (es decir, si un estimador no soporta / no puede soportar matrices dispersas).

source: supervised
es: supervisado

source: supervised learning
es: aprendizaje supervisado
