Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: Our documentation can sometimes give information about the dtype precision, e.g. `np.int32`, `np.int64`, etc. When the precision is provided, it refers to the NumPy dtype. If an arbitrary precision is used, the documentation will refer to dtype `integer` or `floating`. Note that in this case, the precision can be platform dependent. The `numeric` dtype refers to accepting both `integer` and `floating`.
es: Nuestra documentación puede dar a veces información sobre la precisión del dtype, por ejemplo `np.int32`, `np.int64`, etc. Cuando se proporciona la precisión, se refiere al dtype de NumPy. Si se utiliza una precisión arbitraria, la documentación se referirá al dtype `integer` o `floating`. Ten en cuenta que en este caso, la precisión puede ser dependiente de la plataforma. El dtype `numeric` se refiere a aceptar tanto `integer` como `floating`.

source: TODO: Mention efficiency and precision issues; casting policy.
es: TODO: Mencionar incidencias de eficiencia y precisión; política de reparto.

source: We try to apply `duck typing <https://en.wikipedia.org/wiki/Duck_typing>`_ to determine how to handle some input values (e.g. checking whether a given estimator is a classifier). That is, we avoid using ``isinstance`` where possible, and rely on the presence or absence of attributes to determine an object's behaviour. Some nuance is required when following this approach:
es: Intentamos aplicar `duck typing <https://en.wikipedia.org/wiki/Duck_typing>`_ para determinar cómo manejar algunos valores de entrada (por ejemplo, comprobar si un estimador dado es un clasificador). Es decir, evitamos utilizar ``isinstance`` siempre que sea posible, y nos basamos en la presencia o ausencia de atributos para determinar el comportamiento de un objeto. Es necesario hacer algunas matizaciones cuando se sigue este enfoque:

source: For some estimators, an attribute may only be available once it is :term:`fitted`. For instance, we cannot a priori determine if :term:`predict_proba` is available in a grid search where the grid includes alternating between a probabilistic and a non-probabilistic predictor in the final step of the pipeline. In the following, we can only determine if ``clf`` is probabilistic after fitting it on some data::
es: Para algunos estimadores, un atributo sólo puede estar disponible una vez que es :term:`ajustado`. Por ejemplo, no podemos determinar a priori si :term:`predict_proba` está disponible en una búsqueda exhaustiva en la que la cuadrícula incluye la alternancia entre un predictor probabilístico y uno no probabilístico en el último paso del pipeline. A continuación, sólo podemos determinar si ``clf`` es probabilístico después de ajustarlo a algunos datos::

source: This means that we can only check for duck-typed attributes after fitting, and that we must be careful to make :term:`meta-estimators` only present attributes according to the state of the underlying estimator after fitting.
es: Esto significa que sólo podemos comprobar los atributos duck-typed después del ajuste, y que debemos tener cuidado para que los :term:`meta estimadores` sólo presenten atributos según el estado del estimador subyacente después del ajuste.

source: Checking if an attribute is present (using ``hasattr``) is in general just as expensive as getting the attribute (``getattr`` or dot notation). In some cases, getting the attribute may indeed be expensive (e.g. for some implementations of :term:`feature_importances_`, which may suggest this is an API design flaw). So code which does ``hasattr`` followed by ``getattr`` should be avoided; ``getattr`` within a try-except block is preferred.
es: Comprobar si un atributo está presente (usando ``hasattr``) es en general tan costoso como obtener el atributo (``getattr`` o notación de puntos). En algunos casos, obtener el atributo puede ser realmente costoso (por ejemplo, para algunas implementaciones de :term:`feature_importances_`, lo que puede sugerir que se trata de un defecto de diseño de la API). Así que el código que ejecuta ``hasattr`` seguido de ``getattr`` debe ser evitado; ``getattr`` dentro de un bloque try-except es preferible.

source: For determining some aspects of an estimator's expectations or support for some feature, we use :term:`estimator tags` instead of duck typing.
es: Para determinar algunos aspectos de las expectativas de un estimador o el soporte para alguna característica, utilizamos :term:`etiquetas del estimador` en lugar de duck typing.

source: early stopping
es: parada anticipada

source: This consists in stopping an iterative optimization method before the convergence of the training loss, to avoid over-fitting. This is generally done by monitoring the generalization score on a validation set. When available, it is activated through the parameter ``early_stopping`` or by setting a positive :term:`n_iter_no_change`.
es: Consiste en detener un método de optimización iterativo antes de la convergencia de la pérdida asociada al entrenamiento, para evitar el sobreajuste. Por lo general, esto se hace controlando la puntuación de generalización en un conjunto de validación. Cuando está disponible, se activa a través del parámetro ``early_stopping`` o estableciendo un :term:`n_iter_no_change` positivo.

source: estimator instance
es: instancia del estimador

source: We sometimes use this terminology to distinguish an :term:`estimator` class from a constructed instance. For example, in the following, ``cls`` is an estimator class, while ``est1`` and ``est2`` are instances::
es: A veces utilizamos esta terminología para distinguir una clase :term:`estimador` de una instancia construida. Por ejemplo, en lo siguiente, ``cls`` es una clase estimador, mientras que ``est1`` y ``est2`` son instancias::

source: examples
es: ejemplos

source: We try to give examples of basic usage for most functions and classes in the API:
es: Intentamos dar ejemplos de uso básico para la mayoría de las funciones y clases de la API:

source: as doctests in their docstrings (i.e. within the ``sklearn/`` library code itself).
es: como doctests en sus cadenas de documentación (es decir, dentro del propio código de la biblioteca ``sklearn/``).

source: as examples in the :ref:`example gallery <general_examples>` rendered (using `sphinx-gallery <https://sphinx-gallery.readthedocs.io/>`_) from scripts in the ``examples/`` directory, exemplifying key features or parameters of the estimator/function. These should also be referenced from the User Guide.
es: como ejemplos en la :ref:`galería de ejemplos <general_examples>` renderizada (usando `sphinx-gallery <https://sphinx-gallery.readthedocs.io/>`_) a partir de scripts en el directorio ``examples/``, ejemplificando características o parámetros clave del estimador/función. Estos también deben ser referenciados desde el Manual de Usuario.

source: sometimes in the :ref:`User Guide <user_guide>` (built from ``doc/``) alongside a technical description of the estimator.
es: a veces en el :ref:`Manual de Usuario <user_guide>` (construido a partir de ``doc/``) junto a una descripción técnica del estimador.

source: An experimental tool is already usable but its public API, such as default parameter values or fitted attributes, is still subject to change in future versions without the usual :term:`deprecation` warning policy.
es: Una herramienta experimental ya es utilizable, pero su API pública, como los valores de los parámetros por defecto o los atributos ajustados, sigue estando sujeta a cambios en futuras versiones sin la habitual política de advertencias de :term:`obsolescencia`.

source: evaluation metric
es: métrica de evaluación

source: evaluation metrics
es: métricas de evaluación

source: Evaluation metrics give a measure of how well a model performs. We may use this term specifically to refer to the functions in :mod:`metrics` (disregarding :mod:`metrics.pairwise`), as distinct from the :term:`score` method and the :term:`scoring` API used in cross validation. See :ref:`model_evaluation`.
es: Las métricas de evaluación dan una medida del rendimiento de un modelo. Podemos utilizar este término específicamente para referirnos a las funciones de :mod:`metrics` (sin tener en cuenta :mod:`metrics.pairwise`), a diferencia del método :term:`score` y la API :term:`scoring` utilizada en la validación cruzada. Véase :ref:`model_evaluation`.

source: These functions usually accept a ground truth (or the raw data where the metric evaluates clustering without a ground truth) and a prediction, be it the output of :term:`predict` (``y_pred``), of :term:`predict_proba` (``y_proba``), or of an arbitrary score function including :term:`decision_function` (``y_score``). Functions are usually named to end with ``_score`` if a greater score indicates a better model, and ``_loss`` if a lesser score indicates a better model. This diversity of interface motivates the scoring API.
es: Estas funciones suelen aceptar una verdad fundamental (o los datos crudos en los que la métrica evalúa el agrupamiento sin una verdad fundamental) y una predicción, ya sea la salida de :term:`predict` (``y_pred``), de :term:`predict_proba` (``y_proba``), o de una función de puntuación arbitraria incluyendo :term:`decision_function` (``y_score``). Las funciones suelen tener un nombre que termina con ``_score`` si una puntuación mayor indica un modelo mejor, y ``_loss`` si una puntuación menor indica un modelo mejor. Esta diversidad de interfaz motiva la API de puntuación.

source: Note that some estimators can calculate metrics that are not included in :mod:`metrics` and are estimator-specific, notably model likelihoods.
es: Tenga en cuenta que algunos estimadores pueden calcular métricas que no están incluidas en :mod:`metrics` y que son específicas del estimador, especialmente las verosimilitudes del modelo.

source: estimator tags
es: etiquetas del estimador

source: A proposed feature (e.g. :issue:`8022`) by which the capabilities of an estimator are described through a set of semantic tags. This would enable some runtime behaviors based on estimator inspection, but it also allows each estimator to be tested for appropriate invariances while being excepted from other :term:`common tests`.
es: Una característica propuesta (por ejemplo, :issue:`8022`) por la cual las capacidades de un estimador se describen a través de un conjunto de etiquetas semánticas. Esto permitiría algunos comportamientos en tiempo de ejecución basados en la inspección del estimador, pero también permite que cada estimador se someta a las pruebas de invarianzas apropiadas mientras se exceptúa de otros :term:`tests comunes`.

source: Some aspects of estimator tags are currently determined through the :term:`duck typing` of methods like ``predict_proba`` and through some special attributes on estimator objects:
es: Algunos aspectos de las etiquetas del estimador se determinan actualmente a través del :term:`duck typing` de métodos como ``predict_proba`` y a través de algunos atributos especiales en los objetos de los estimadores:

source: This string-valued attribute identifies an estimator as being a classifier, regressor, etc. It is set by mixins such as :class:`base.ClassifierMixin`, but needs to be more explicitly adopted on a :term:`meta-estimator`. Its value should usually be checked by way of a helper such as :func:`base.is_classifier`.
es: Este atributo con valor de cadena identifica un estimador como clasificador, regresor, etc. Se establece mediante mixins como :class:`base.ClassifierMixin`, pero debe adoptarse más explícitamente en un :term:`meta-estimador`. Su valor debe comprobarse normalmente mediante un helper como :func:`base.is_classifier`.

source: This boolean attribute indicates whether the data (``X``) passed to :func:`fit` and similar methods consists of pairwise measures over samples rather than a feature representation for each sample. It is usually ``True`` where an estimator has a ``metric`` or ``affinity`` or ``kernel`` parameter with value 'precomputed'. Its primary purpose is that when a :term:`meta-estimator` extracts a sub-sample of data intended for a pairwise estimator, the data needs to be indexed on both axes, while other data is indexed only on the first axis.
es: Este atributo booleano indica si los datos (``X``) pasados a :func:`fit` y métodos similares consisten en medidas de pares sobre muestras en lugar de una representación de características para cada muestra. Suele ser ``True`` cuando un estimador tiene un parámetro ``metric`` o ``affinity`` o ``kernel`` con valor ``precalculado``. Su propósito principal es que cuando un :term:`meta-estimador` extrae una submuestra de datos destinada a un estimador por pares, los datos necesitan ser indexados en ambos ejes, mientras que otros datos son indexados sólo en el primer eje.

source: The _pairwise attribute is deprecated in 0.24. From 1.1 (renaming of 0.26) onward, the `pairwise` estimator tag should be used instead.
es: El atributo _pairwise queda obsoleto en 0.24. A partir de la versión 1.1 (cambio de nombre de la versión 0.26), se utilizará la etiqueta del estimador `pairwise`.

source: For more detailed info, see :ref:`estimator_tags`.
es: Para obtener información más detallada, ver :ref:`estimator_tags`.

source: feature
es: característica

source: features
es: características

source: feature vector
es: vector de características

source: In the abstract, a feature is a function (in its mathematical sense) mapping a sampled object to a numeric or categorical quantity. "Feature" is also commonly used to refer to these quantities, being the individual elements of a vector representing a sample. In a data matrix, features are represented as columns: each column contains the result of applying a feature function to a set of samples.
es: En abstracto, una característica es una función (en su sentido matemático) que asigna un objeto muestreado a una cantidad numérica o categórica. El término "característica" también se utiliza comúnmente para referirse a estas cantidades, siendo los elementos individuales de un vector que representa una muestra. En una matriz de datos, las características se representan como columnas: cada columna contiene el resultado de aplicar una función de característica a un conjunto de muestras.

source: Elsewhere features are known as attributes, predictors, regressors, or independent variables.
es: En otras partes, las características se conocen como atributos, predictores, regresores o variables independientes.

source: Nearly all estimators in scikit-learn assume that features are numeric, finite and not missing, even when they have semantically distinct domains and distributions (categorical, ordinal, count-valued, real-valued, interval). See also :term:`categorical feature` and :term:`missing values`.
es: Casi todos los estimadores de scikit-learn asumen que las características son numéricas, finitas y no faltan, incluso cuando tienen dominios y distribuciones semánticamente distintas (categóricas, ordinales, de valores de conteo, de valores reales, de intervalo). Ver también :term:`característica categórica` y :term:`valores faltantes`.

source: ``n_features`` indicates the number of features in a dataset.
es: ``n_features`` indica el número de características de un conjunto de datos.

source: fitting
es: ajuste

source: Calling :term:`fit` (or :term:`fit_transform`, :term:`fit_predict`, etc.) on an estimator.
es: Llamando a :term:`fit` (o :term:`fit_transform`, :term:`fit_predict`, etc.) en un estimador.

source: fitted
es: ajustado

source: The state of an estimator after :term:`fitting`.
es: El estado de un estimador después del :term:`ajuste`.

source: There is no conventional procedure for checking if an estimator is fitted. However, an estimator that is not fitted:
es: No existe un procedimiento convencional para comprobar si un estimador está ajustado. Sin embargo, un estimador que no está ajustado:

source: should raise :class:`exceptions.NotFittedError` when a prediction method (:term:`predict`, :term:`transform`, etc.) is called. (:func:`utils.validation.check_is_fitted` is used internally for this purpose.)
es: debería emitir :class:`exceptions.NotFittedError` cuando se llama a un método de predicción (:term:`predict`, :term:`transform`, etc.). (:func:`utils.validation.check_is_fitted` se utiliza internamente para este propósito).

source: should not have any :term:`attributes` beginning with an alphabetic character and ending with an underscore. (Note that a descriptor for the attribute may still be present on the class, but hasattr should return False)
es: no debe tener :term:`atributos` que comiencen con un carácter alfabético y termine con un guión bajo. (Ten en cuenta que un descriptor para el atributo todavía puede estar presente en la clase, pero hasattr debe devolver False).

source: function
es: función

source: We provide ad hoc function interfaces for many algorithms, while :term:`estimator` classes provide a more consistent interface.
es: Proporcionamos interfaces de funciones ad hoc para muchos algoritmos, mientras que las clases de :term:`estimador`(es) proporcionan una interfaz más consistente.

source: In particular, Scikit-learn may provide a function interface that fits a model to some data and returns the learnt model parameters, as in :func:`linear_model.enet_path`. For transductive models, this also returns the embedding or cluster labels, as in :func:`manifold.spectral_embedding` or :func:`cluster.dbscan`. Many preprocessing transformers also provide a function interface, akin to calling :term:`fit_transform`, as in :func:`preprocessing.maxabs_scale`. Users should be careful to avoid :term:`data leakage` when making use of these ``fit_transform``-equivalent functions.
es: En particular, scikit-learn puede proporcionar una interfaz de función que ajusta un modelo a algunos datos y devuelve los parámetros del modelo entrenado, como en :func:`linear_model.enet_path`. Para los modelos transductivos, también devuelve las etiquetas de embedding o de conglomerado, como en :func:`manifold.spectral_embedding` o :func:`cluster.dbscan`. Muchos transformadores de preprocesamiento también proporcionan una interfaz de función, similar a la llamada a :term:`fit_transform`, como en :func:`preprocessing.maxabs_scale`. Los usuarios deben tener cuidado de evitar :term:`fuga de datos` cuando hagan uso de estas funciones equivalentes a ``fit_transform``.

source: We do not have a strict policy about when to or when not to provide function forms of estimators, but maintainers should consider consistency with existing interfaces, and whether providing a function would lead users astray from best practices (as regards data leakage, etc.)
es: No tenemos una política estricta sobre cuándo proporcionar o no formas de función de los estimadores, pero los encargados del mantenimiento considerar la coherencia con las interfaces existentes, y si proporcionar una función podría apartar a los usuarios de las mejores prácticas (en lo que respecta a la fuga de datos, etc.).

source: gallery
es: galería

source: See :term:`examples`.
es: Ver :term:`ejemplos`.

source: hyperparameter
es: hiperparámetro

source: hyper-parameter
es: hiperparámetro

source: See :term:`parameter`.
es: Ver :term:`parámetro`.

source: impute
es: imputar

source: imputation
es: imputación

source: Most machine learning algorithms require that their inputs have no :term:`missing values`, and will not work if this requirement is violated. Algorithms that attempt to fill in (or impute) missing values are referred to as imputation algorithms.
es: La mayoría de los algoritmos de aprendizaje automático requieren que sus entradas no tengan :term:`valores faltantes`, y no funcionarán si se viola este requisito. Los algoritmos que intentan rellenar (o imputar) los valores faltantes se denominan algoritmos de imputación.

source: An :term:`array-like`, :term:`sparse matrix`, pandas DataFrame or sequence (usually a list).
es: Un :term:`array-like`, :term:`matriz dispersa`, DataFrame pandas o secuencia (generalmente una lista).

source: induction
es: inducción

source: inductive
es: inductivo(a)

source: Inductive (contrasted with :term:`transductive`) machine learning builds a model of some data that can then be applied to new instances. Most estimators in Scikit-learn are inductive, having :term:`predict` and/or :term:`transform` methods.
es: El aprendizaje automático inductivo (en contraste con :term:`transductivo`) construye un modelo de algunos datos que luego puede aplicarse a nuevas instancias. La mayoría de los estimadores en scikit-learn son inductivos, con métodos :term:`predict` y/o :term:`transform`.

source: A Python library (https://joblib.readthedocs.io) used in Scikit-learn to facilite simple parallelism and caching. Joblib is oriented towards efficiently working with numpy arrays, such as through use of :term:`memory mapping`. See :ref:`parallelism` for more information.
es: Una biblioteca de Python (https://joblib.readthedocs.io) utilizada en scikit-learn para facilitar el paralelismo simple y el almacenamiento en caché. Joblib está orientada a trabajar eficientemente con arreglos de numpy, por ejemplo mediante el uso de :term:`mapeo de memoria`. Ver :ref:`parallelism` para más información.

source: label indicator matrix
es: matriz indicatriz de etiqueta

source: multilabel indicator matrix
es: matriz indicatriz multietiqueta

source: multilabel indicator matrices
es: matrices indicatrices multietiqueta

source: The format used to represent multilabel data, where each row of a 2d array or sparse matrix corresponds to a sample, each column corresponds to a class, and each element is 1 if the sample is labeled with the class and 0 if not.
es: El formato utilizado para representar datos multietiqueta, en el que cada fila de un arreglo 2D o matriz dispersa corresponde a una muestra, cada columna corresponde a una clase, y cada elemento es 1 si la muestra está etiquetada con la clase y 0 si no es así.

source: leakage
es: fuga

source: data leakage
es: fuga de datos

source: A problem in cross validation where generalization performance can be over-estimated since knowledge of the test data was inadvertently included in training a model. This is a risk, for instance, when applying a :term:`transformer` to the entirety of a dataset rather than each training portion in a cross validation split.
es: Un problema en la validación cruzada en el que el rendimiento de la generalización puede sobreestimarse ya que el conocimiento de los datos de prueba se incluyó inadvertidamente en el entrenamiento de un modelo. Este es un riesgo, por ejemplo, cuando se aplica un :term:`transformador` a la totalidad de un conjunto de datos en lugar de a cada porción de entrenamiento en una división de validación cruzada.

source: We aim to provide interfaces (such as :mod:`pipeline` and :mod:`model_selection`) that shield the user from data leakage.
es: Nuestro objetivo es proporcionar interfaces (como :mod:`pipeline` y :mod:`model_selection`) que protejan al usuario de la fuga de datos.

source: memmapping
es: mapeo de memoria

source: memory map
es: mapa de memoria

source: memory mapping
es: mapeo de memoria
