Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: Learning where the expected prediction (label or ground truth) is available for each sample when :term:`fitting` the model, provided as :term:`y`. This is the approach taken in a :term:`classifier` or :term:`regressor` among other estimators.
es: Aprendizaje en el que la predicción esperada (etiqueta o verdad fundamental) está disponible para cada muestra cuando se hace el :term:`ajuste` del modelo, proporcionado como :term:`y`. Este es el enfoque adoptado en un :term:`clasificador` o :term:`regresor` entre otros estimadores.

source: target
es: objetivo

source: targets
es: objetivos

source: The *dependent variable* in :term:`supervised` (and :term:`semisupervised`) learning, passed as :term:`y` to an estimator's :term:`fit` method. Also known as *dependent variable*, *outcome variable*, *response variable*, *ground truth* or *label*. Scikit-learn works with targets that have minimal structure: a class from a finite set, a finite real-valued number, multiple classes, or multiple numbers. See :ref:`glossary_target_types`.
es: La *variable dependiente* en el aprendizaje :term:`supervisado` (y :term:`semisupervisado`), pasada como :term:`y` al método :term:`fit` de un estimador. También se conoce como *variable dependiente*, *variable de resultado*, *variable de respuesta*, *verdad fundamental* o *etiqueta*. Scikit-learn trabaja con objetivos que tienen una estructura mínima: una clase de un conjunto finito, un número finito de valor real, múltiples clases o múltiples números. Ver :ref:`glossary_target_types`.

source: transduction
es: transducción

source: transductive
es: transductivo

source: A transductive (contrasted with :term:`inductive`) machine learning method is designed to model a specific dataset, but not to apply that model to unseen data. Examples include :class:`manifold.TSNE`, :class:`cluster.AgglomerativeClustering` and :class:`neighbors.LocalOutlierFactor`.
es: Un método de aprendizaje automático transductivo (en contraste con :term:`inductivo(a)`) está diseñado para modelar un conjunto de datos específico, pero no para aplicar ese modelo a datos no vistos. Algunos ejemplos son :class:`manifold.TSNE`, :class:`cluster.AgglomerativeClustering` y :class:`neighbors.LocalOutlierFactor`.

source: unlabeled
es: sin etiquetar

source: unlabeled data
es: datos no etiquetados

source: Samples with an unknown ground truth when fitting; equivalently, :term:`missing values` in the :term:`target`. See also :term:`semisupervised` and :term:`unsupervised` learning.
es: Muestras con una verdad fundamental desconocida cuando se ajustan; equivalentemente, :term:`valores faltantes` en el :term:`objetivo`. Ver también el aprendizaje :term:`semisupervisado` y :term:`no supervisado`.

source: unsupervised
es: no supervisado

source: unsupervised learning
es: aprendizaje no supervisado

source: Learning where the expected prediction (label or ground truth) is not available for each sample when :term:`fitting` the model, as in :term:`clusterers` and :term:`outlier detectors`. Unsupervised estimators ignore any :term:`y` passed to :term:`fit`.
es: Aprendizaje en el que la predicción esperada (etiqueta o verdad fundamental) no está disponible para cada muestra cuando se hace el :term:`ajuste` del modelo, como en :term:`agrupadores` y :term:`detectores de valores atípicos`. Los estimadores no supervisados ignoran cualquier :term:`y` pasado a :term:`fit`.

source: Class APIs and Estimator Types
es: APIs de Clase y Tipos de Estimadores

source: classifier
es: clasificador

source: classifiers
es: clasificadores

source: A :term:`supervised` (or :term:`semi-supervised`) :term:`predictor` with a finite set of discrete possible output values.
es: Un :term:`predictor` :term:`supervisado` (o :term:`semi supervisado`) con un conjunto finito de posibles valores de salida discretos.

source: A classifier supports modeling some of :term:`binary`, :term:`multiclass`, :term:`multilabel`, or :term:`multiclass multioutput` targets. Within scikit-learn, all classifiers support multi-class classification, defaulting to using a one-vs-rest strategy over the binary classification problem.
es: Un clasificador soporta el modelado de algunos de los objetivos :term:`binario`, :term:`multiclase`, :term:`multietiqueta`, o :term:`multiclase multisalida`. Dentro de scikit-learn, todos los clasificadores soportan la clasificación multiclase, utilizando por defecto una estrategia de uno contra el resto sobre el problema de clasificación binaria.

source: Classifiers must store a :term:`classes_` attribute after fitting, and usually inherit from :class:`base.ClassifierMixin`, which sets their :term:`_estimator_type` attribute.
es: Los clasificadores deben almacenar un atributo :term:`classes_` después del ajuste, y normalmente heredan de :class:`base.ClassifierMixin`, que establece su atributo :term:`_estimator_type`.

source: A classifier can be distinguished from other estimators with :func:`~base.is_classifier`.
es: Un clasificador puede distinguirse de otros estimadores con :func:`~base.is_classifier`.

source: A classifier must implement:
es: Un clasificador debe implementar:

source: It may also be appropriate to implement :term:`decision_function`, :term:`predict_proba` and :term:`predict_log_proba`.
es: También puede ser apropiado implementar :term:`decision_function`, :term:`predict_proba` y :term:`predict_log_proba`.

source: clusterer
es: agrupador

source: clusterers
es: agrupadores

source: A :term:`unsupervised` :term:`predictor` with a finite set of discrete output values.
es: Un :term:`predictor` :term:`no supervisado` con un conjunto finito de valores de salida discretos.

source: A clusterer usually stores :term:`labels_` after fitting, and must do so if it is :term:`transductive`.
es: Un agrupador suele almacenar :term:`labels_` después del ajuste, y debe hacerlo si es :term:`transductivo`.

source: A clusterer must implement:
es: Un agrupador debe implementar:

source: :term:`fit_predict` if :term:`transductive`
es: :term:`fit_predict` si es :term:`transductivo`

source: :term:`predict` if :term:`inductive`
es: :term:`predict` si es :term:`inductivo(a)`

source: density estimator
es: estimador de la densidad

source: estimator
es: estimador

source: estimators
es: estimadores

source: An object which manages the estimation and decoding of a model. The model is estimated as a deterministic function of:
es: Un objeto que gestiona la estimación y decodificación de un modelo. El modelo se estima como una función determinista de:

source: :term:`parameters` provided in object construction or with :term:`set_params`;
es: :term:`parámetros` proporcionados en la construcción del objeto o con :term:`set_params`;

source: the global :mod:`numpy.random` random state if the estimator's :term:`random_state` parameter is set to None; and
es: el estado aleatorio global :mod:`numpy.random` si el parámetro :term:`random_state` del estimador se establece como None; y

source: any data or :term:`sample properties` passed to the most recent call to :term:`fit`, :term:`fit_transform` or :term:`fit_predict`, or data similarly passed in a sequence of calls to :term:`partial_fit`.
es: cualquier dato o :term:`propiedades muestrales` pasados a la llamada más reciente a :term:`fit`, :term:`fit_transform` o :term:`fit_predict`, o datos pasados de forma similar en una secuencia de llamadas a :term:`partial_fit`.

source: The estimated model is stored in public and private :term:`attributes` on the estimator instance, facilitating decoding through prediction and transformation methods.
es: El modelo estimado se almacena en los :term:`atributos` públicos y privados de la instancia del estimador, lo que facilita la decodificación mediante métodos de predicción y transformación.

source: Estimators must provide a :term:`fit` method, and should provide :term:`set_params` and :term:`get_params`, although these are usually provided by inheritance from :class:`base.BaseEstimator`.
es: Los estimadores tienen que proporcionar un método :term:`fit`, y deberían proporcionar :term:`set_params` y :term:`get_params`, aunque normalmente se proporcionan por herencia de :class:`base.BaseEstimator`.

source: The core functionality of some estimators may also be available as a :term:`function`.
es: La funcionalidad principal de algunos estimadores también puede estar disponible como una :term:`función`.

source: feature extractor
es: extractor de características

source: feature extractors
es: extractores de características

source: A :term:`transformer` which takes input where each sample is not represented as an :term:`array-like` object of fixed length, and produces an :term:`array-like` object of :term:`features` for each sample (and thus a 2-dimensional array-like for a set of samples). In other words, it (lossily) maps a non-rectangular data representation into :term:`rectangular` data.
es: Un :term:`transformador` que toma una entrada en la que cada muestra no está representada como un objeto :term:`array-like` de longitud fija, y produce un objeto :term:`array-like` de :term:`características` para cada muestra (y, por tanto, un array-like bidimensional para un conjunto de muestras). En otras palabras, mapea (con pérdida) una representación de datos no rectangulares en datos :term:`rectangular`(es).

source: Feature extractors must implement at least:
es: Los extractores de características deben implementar al menos:

source: meta-estimator
es: meta-estimador

source: meta-estimators
es: meta estimadores

source: metaestimator
es: meta estimador

source: metaestimators
es: meta estimadores

source: An :term:`estimator` which takes another estimator as a parameter. Examples include :class:`pipeline.Pipeline`, :class:`model_selection.GridSearchCV`, :class:`feature_selection.SelectFromModel` and :class:`ensemble.BaggingClassifier`.
es: Un :term:`estimador` que toma otro estimador como parámetro. Algunos ejemplos son :class:`pipeline.Pipeline`, :class:`model_selection.GridSearchCV`, :class:`feature_selection.SelectFromModel` y :class:`ensemble.BaggingClassifier`.

source: In a meta-estimator's :term:`fit` method, any contained estimators should be :term:`cloned` before they are fit (although FIXME: Pipeline and FeatureUnion do not do this currently). An exception to this is that an estimator may explicitly document that it accepts a pre-fitted estimator (e.g. using ``prefit=True`` in :class:`feature_selection.SelectFromModel`). One known issue with this is that the pre-fitted estimator will lose its model if the meta-estimator is cloned. A meta-estimator should have ``fit`` called before prediction, even if all contained estimators are pre-fitted.
es: En el método :term:`fit` de un meta-estimador, cualquier estimador contenido debe ser :term:`clonado` antes de ser ajustado (aunque FIXME: Pipeline y FeatureUnion no hacen esto actualmente). Una excepción a esto es que un estimador puede documentar explícitamente que acepta un estimador preajustado (por ejemplo, usando ``prefit=True`` en :class:`feature_selection.SelectFromModel`). Un problema conocido con esto es que el estimador preajustado perderá su modelo si el meta-estimador es clonado. Un meta-estimador llamar a ``fit`` antes de la predicción, incluso si todos los estimadores contenidos son preajustados.

source: In cases where a meta-estimator's primary behaviors (e.g. :term:`predict` or :term:`transform` implementation) are functions of prediction/transformation methods of the provided *base estimator* (or multiple base estimators), a meta-estimator should provide at least the standard methods provided by the base estimator. It may not be possible to identify which methods are provided by the underlying estimator until the meta-estimator has been :term:`fitted` (see also :term:`duck typing`), for which :func:`utils.metaestimators.if_delegate_has_method` may help. It should also provide (or modify) the :term:`estimator tags` and :term:`classes_` attribute provided by the base estimator.
es: En los casos en los que los comportamientos principales de un meta-estimador (por ejemplo, la implementación de :term:`predict` o :term:`transform`) son funciones de los métodos de predicción/transformación del *estimador base* proporcionado (o de múltiples estimadores base), un meta-estimador debe proporcionar al menos los métodos estándar proporcionados por el estimador base. Puede que no sea posible identificar qué métodos proporciona el estimador subyacente hasta que el meta-estimador haya sido :term:`ajustado` (ver también :term:`duck typing`), para lo cual :func:`utils.metaestimators.if_delegate_has_method` puede ayudar. También debería proporcionar (o modificar) las :term:`etiquetas del estimador` y el atributo :term:`classes_` proporcionados por el estimador base.

source: Meta-estimators should be careful to validate data as minimally as possible before passing it to an underlying estimator. This saves computation time, and may, for instance, allow the underlying estimator to easily work with data that is not :term:`rectangular`.
es: Los meta-estimadores deben tener cuidado de validar los datos lo menos posible antes de pasarlos a un estimador subyacente. Esto ahorra tiempo de cálculo y puede, por ejemplo, permitir que el estimador subyacente trabaje fácilmente con datos que no son :term:`rectangular`(es).

source: outlier detector
es: detector de valores atípicos

source: outlier detectors
es: detectores de valores atípicos

source: An :term:`unsupervised` binary :term:`predictor` which models the distinction between core and outlying samples.
es: Un :term:`predictor` binario :term:`no supervisado` que modela la distinción entre muestras centrales y periféricas.

source: Outlier detectors must implement:
es: Los detectores de valores atípicos deben implementar:

source: Inductive outlier detectors may also implement :term:`decision_function` to give a normalized inlier score where outliers have score below 0. :term:`score_samples` may provide an unnormalized score per sample.
es: Los detectores inductivos de valores atípicos también pueden implementar :term:`decision_function` para dar una puntuación normalizada de los valores atípicos cuando éstos tengan una puntuación inferior a 0. :term:`score_samples` puede proporcionar una puntuación no normalizada por muestra.

source: predictors
es: predictores

source: An :term:`estimator` supporting :term:`predict` and/or :term:`fit_predict`. This encompasses :term:`classifier`, :term:`regressor`, :term:`outlier detector` and :term:`clusterer`.
es: Un :term:`estimador` que soporta :term:`predict` y/o :term:`fit_predict`. Esto incluye :term:`clasificador`, :term:`regresor`, :term:`detector de valores atípicos` y :term:`agrupador`.

source: In statistics, "predictors" refers to :term:`features`.
es: En estadística, "predictores" se refiere a :term:`características`.

source: regressor
es: regresor

source: regressors
es: regresores

source: A :term:`supervised` (or :term:`semi-supervised`) :term:`predictor` with :term:`continuous` output values.
es: Un :term:`predictor` :term:`supervisado` (o :term:`semi-supervisado`) con valores de salida :term:`continuos <continuous>`.

source: Regressors usually inherit from :class:`base.RegressorMixin`, which sets their :term:`_estimator_type` attribute.
es: Los regresores suelen heredar de :class:`base.RegressorMixin`, que establece su atributo :term:`_estimator_type`.

source: A regressor can be distinguished from other estimators with :func:`~base.is_regressor`.
es: Un regresor puede distinguirse de otros estimadores con :func:`~base.is_regressor`.

source: A regressor must implement:
es: Un regresor debe implementar:

source: transformer
es: transformador

source: transformers
es: transformadores

source: An estimator supporting :term:`transform` and/or :term:`fit_transform`. A purely :term:`transductive` transformer, such as :class:`manifold.TSNE`, may not implement ``transform``.
es: Un estimador que soporta :term:`transform` y/o :term:`fit_transform`. Un transformador puramente :term:`transductivo`, como :class:`manifold.TSNE`, puede no implementar ``transform``.

source: vectorizer
es: vectorizador

source: vectorizers
es: vectorizadores

source: See :term:`feature extractor`.
es: Ver :term:`extractor de características`.

source: There are further APIs specifically related to a small family of estimators, such as:
es: Existen otras APIs relacionadas específicamente con una pequeña familia de estimadores, como:

source: cross-validation splitter
es: separador de validación cruzada

source: CV splitter
es: separador de validación cruzada

source: cross-validation generator
es: generador de validación cruzada

source: A non-estimator family of classes used to split a dataset into a sequence of train and test portions (see :ref:`cross_validation`), by providing :term:`split` and :term:`get_n_splits` methods. Note that unlike estimators, these do not have :term:`fit` methods and do not provide :term:`set_params` or :term:`get_params`. Parameter validation may be performed in ``__init__``.
es: Una familia de clases que no son estimadores y que se utilizan para dividir un conjunto de datos en una secuencia de partes de entrenamiento y de prueba (ver :ref:`cross_validation`), proporcionando métodos :term:`split` y :term:`get_n_splits`. Ten en cuenta que, a diferencia de los estimadores, éstas no tienen métodos :term:`fit` y no proporcionan :term:`set_params` o :term:`get_params`. La validación de parámetros puede realizarse en ``__init__``.

source: cross-validation estimator
es: estimador de validación cruzada

source: An estimator that has built-in cross-validation capabilities to automatically select the best hyper-parameters (see the :ref:`User Guide <grid_search>`). Some example of cross-validation estimators are :class:`ElasticNetCV <linear_model.ElasticNetCV>` and :class:`LogisticRegressionCV <linear_model.LogisticRegressionCV>`. Cross-validation estimators are named `EstimatorCV` and tend to be roughly equivalent to `GridSearchCV(Estimator(), ...)`. The advantage of using a cross-validation estimator over the canonical :term:`estimator` class along with :ref:`grid search <grid_search>` is that they can take advantage of warm-starting by reusing precomputed results in the previous steps of the cross-validation process. This generally leads to speed improvements. An exception is the :class:`RidgeCV <linear_model.RidgeCV>` class, which can instead perform efficient Leave-One-Out CV.
es: Un estimador que tiene incorporada la capacidad de validación cruzada para seleccionar automáticamente los mejores hiperparámetros (ver el :ref:`Manual de Usuario <grid_search>`). Algunos ejemplos de estimadores de validación cruzada son :class:`ElasticNetCV <linear_model.ElasticNetCV>` y :class:`LogisticRegressionCV <linear_model.LogisticRegressionCV>`. Los estimadores de validación cruzada se denominan `EstimatorCV` y suelen ser aproximadamente equivalentes a `GridSearchCV(Estimator(), ...)`. La ventaja de utilizar un estimador de validación cruzada sobre la clase canónica :term:`estimador` junto con la :ref:`búsqueda exhaustiva <grid_search>` es que pueden aprovechar el warm-starting reutilizando los resultados precalculados en los pasos anteriores del proceso de validación cruzada. Por lo general, esto supone una mejora de la velocidad. Una excepción es la clase :class:`RidgeCV <linear_model.RidgeCV>`, que en cambio puede realizar un eficiente Leave-One-Out CV.

source: scorer
es: puntuación (puntuador)

source: A non-estimator callable object which evaluates an estimator on given test data, returning a number. Unlike :term:`evaluation metrics`, a greater returned number must correspond with a *better* score. See :ref:`scoring_parameter`.
es: Un objeto invocable no estimador que evalúa un estimador en datos de prueba dados, devolviendo un número. A diferencia de las :term:`métricas de evaluación`, un número mayor devuelto debe corresponder con una *mejor* puntuación. Ver :ref:`scoring_parameter`.

source: Further examples:
es: Otros ejemplos:

source: Target Types
es: Tipos de Objetivos

source: binary
es: binario

source: A classification problem consisting of two classes. A binary target may be represented as for a :term:`multiclass` problem but with only two labels. A binary decision function is represented as a 1d array.
es: Un problema de clasificación que consta de dos clases. Un objetivo binario puede representarse como para un problema :term:`multiclase` pero con sólo dos etiquetas. Una función de decisión binaria se representa como un arreglo 1D.

source: Semantically, one class is often considered the "positive" class. Unless otherwise specified (e.g. using :term:`pos_label` in :term:`evaluation metrics`), we consider the class label with the greater value (numerically or lexicographically) as the positive class: of labels [0, 1], 1 is the positive class; of [1, 2], 2 is the positive class; of ['no', 'yes'], 'yes' is the positive class; of ['no', 'YES'], 'no' is the positive class. This affects the output of :term:`decision_function`, for instance.
es: Semánticamente, una clase suele considerarse la clase "positiva". A menos que se especifique lo contrario (por ejemplo, utilizando :term:`pos_label` en :term:`métricas de evaluación`), consideramos la etiqueta de clase con el mayor valor (numérico o lexicográfico) como la clase positiva: de las etiquetas [0, 1], 1 es la clase positiva; de [1, 2], 2 es la clase positiva; de ['no', 'yes'], 'yes' es la clase positiva; de ['no', 'YES'], 'no' es la clase positiva. Esto afecta a la salida de :term:`decision_function`, por ejemplo.

source: Note that a dataset sampled from a multiclass ``y`` or a continuous ``y`` may appear to be binary.
es: Ten en cuenta que un conjunto de datos muestreado de un ``y`` multiclase o un ``y`` continuo puede parecer binario.

source: :func:`~utils.multiclass.type_of_target` will return 'binary' for binary input, or a similar array with only a single class present.
es: :func:`~utils.multiclass.type_of_target` devolverá 'binary' para la entrada binaria, o un arreglo similar con una sola clase presente.

source: continuous
es: continuo

source: A regression problem where each sample's target is a finite floating point number represented as a 1-dimensional array of floats (or sometimes ints).
es: Un problema de regresión en el que el objetivo de cada muestra es un número de punto flotante finito representado como un arreglo unidimensional de números de punto flotante (floats) (o a veces ints).

source: :func:`~utils.multiclass.type_of_target` will return 'continuous' for continuous input, but if the data is all integers, it will be identified as 'multiclass'.
es: :func:`~utils.multiclass.type_of_target` devolverá 'continuous' para la entrada continua, pero si los datos son todos enteros, se identificará como 'multiclass'.

source: continuous multioutput
es: salida múltiple continua

source: continuous multi-output
es: salida múltiple continua

source: multioutput continuous
es: salida múltiple continua

source: multi-output continuous
es: salida múltiple continua

source: A regression problem where each sample's target consists of ``n_outputs`` :term:`outputs`, each one a finite floating point number, for a fixed int ``n_outputs > 1`` in a particular dataset.
es: Un problema de regresión en el que el objetivo de cada muestra consiste en ``n_outputs`` :term:`salidas`, cada una de ellas un número de punto flotante finito, para un int fijo ``n_outputs > 1`` en un conjunto de datos particular.
