Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: :func:`utils.check_random_state` is used internally to validate the input ``random_state`` and return a :class:`~numpy.random.RandomState` instance.
es: :func:`utils.check_random_state` se utiliza internamente para validar la entrada ``random_state`` y devolver una instancia de :class:`~numpy.random.RandomState`.

source: For more details on how to control the randomness of scikit-learn objects and avoid common pitfalls, you may refer to :ref:`randomness`.
es: Para más detalles sobre cómo controlar la aleatoriedad de los objetos de scikit-learn y evitar errores comunes, puedes consultar :ref:`randomness`.

source: Specifies the score function to be maximized (usually by :ref:`cross validation <cross_validation>`), or -- in some cases -- multiple score functions to be reported. The score function can be a string accepted by :func:`metrics.get_scorer` or a callable :term:`scorer`, not to be confused with an :term:`evaluation metric`, as the latter have a more diverse API. ``scoring`` may also be set to None, in which case the estimator's :term:`score` method is used. See :ref:`scoring_parameter` in the User Guide.
es: Especifica la función de puntuación que se va a maximizar (normalmente mediante :ref:`validación cruzada <cross_validation>`), o -- en algunos casos -- múltiples funciones de puntuación a ser reportadas. La función de puntuación puede ser una cadena aceptada por :func:`metrics.get_scorer` o un :term:`puntuador` invocable, que no debe confundirse con una :term:`métrica de evaluación`, ya que esta última tiene una API más diversa. ``scoring`` también se puede establecer como None, en cuyo caso se utiliza el método :term:`score` del estimador. Ver :ref:`scoring_parameter` en el Manual de Usuario.

source: Where multiple metrics can be evaluated, ``scoring`` may be given either as a list of unique strings, a dictionary with names as keys and callables as values or a callable that returns a dictionary. Note that this does *not* specify which score function is to be maximized, and another parameter such as ``refit`` maybe used for this purpose.
es: Donde múltiples métricas pueden ser evaluadas, ``scoring`` puede ser dado como una lista de cadenas únicas, un diccionario con nombres como claves y callables como valores o un callable que devuelve un diccionario. Ten en cuenta que esto *no* especifica qué función de puntuación debe ser maximizada, y otro parámetro como ``refit`` puede ser utilizado para este propósito.

source: The ``scoring`` parameter is validated and interpreted using :func:`metrics.check_scoring`.
es: El parámetro ``scoring`` se valida e interpreta mediante :func:`metrics.check_scoring`.

source: Logging is not handled very consistently in Scikit-learn at present, but when it is provided as an option, the ``verbose`` parameter is usually available to choose no logging (set to False). Any True value should enable some logging, but larger integers (e.g. above 10) may be needed for full verbosity. Verbose logs are usually printed to Standard Output. Estimators should not produce any output on Standard Output with the default ``verbose`` setting.
es: El logging no se maneja de manera muy consistente en scikit-learn en la actualidad, pero cuando se proporciona como una opción, el parámetro ``verbose`` suele estar disponible para elegir no registrar (establecido en False). Cualquier valor True debería permitir algún tipo de registro, pero los enteros más grandes (por ejemplo, por encima de 10) pueden ser necesarios para la verbosidad completa. Los registros verbosos se imprimen normalmente en la Salida Estándar. Los estimadores no deberían producir ninguna salida en la Salida Estándar con la configuración por defecto ``verbose``.

source: When fitting an estimator repeatedly on the same dataset, but for multiple parameter values (such as to find the value maximizing performance as in :ref:`grid search <grid_search>`), it may be possible to reuse aspects of the model learned from the previous parameter value, saving time. When ``warm_start`` is true, the existing :term:`fitted` model :term:`attributes` are used to initialize the new model in a subsequent call to :term:`fit`.
es: Cuando se ajusta un estimador repetidamente en el mismo conjunto de datos, pero para múltiples valores de parámetros (como para encontrar el valor que maximiza el rendimiento como en :ref:`búsqueda exhaustiva <grid_search>`), puede ser posible reutilizar aspectos del modelo aprendidos del valor de parámetro anterior, ahorrando tiempo. Cuando ``warm_start`` es verdadero, los :term:`atributos` del modelo :term:`ajustado` existente se utilizan para inicializar el nuevo modelo en una llamada posterior a :term:`fit`.

source: Note that this is only applicable for some models and some parameters, and even some orders of parameter values. For example, ``warm_start`` may be used when building random forests to add more trees to the forest (increasing ``n_estimators``) but not to reduce their number.
es: Ten en cuenta que esto sólo es aplicable para algunos modelos y algunos parámetros, e incluso algunos órdenes de valores de parámetros. Por ejemplo, ``warm_start`` puede utilizarse al construir bosques aleatorios para añadir más árboles al bosque (incrementando ``n_estimators``) pero no para reducir su número.

source: :term:`partial_fit` also retains the model between calls, but differs: with ``warm_start`` the parameters change and the data is (more-or-less) constant across calls to ``fit``; with ``partial_fit``, the mini-batch of data changes and model parameters stay fixed.
es: :term:`partial_fit` también conserva el modelo entre llamadas, pero difiere: con ``warm_start`` los parámetros cambian y los datos son (más o menos) constantes a través de las llamadas a ``fit``; con ``partial_fit``, el mini lote de datos cambia y los parámetros del modelo permanecen fijos.

source: There are cases where you want to use ``warm_start`` to fit on different, but closely related data. For example, one may initially fit to a subset of the data, then fine-tune the parameter search on the full dataset. For classification, all data in a sequence of ``warm_start`` calls to ``fit`` must include samples from each class.
es: Hay casos en los que se desea utilizar ``warm_start`` para ajustar en datos diferentes, pero estrechamente relacionados. Por ejemplo, uno puede ajustar inicialmente a un subconjunto de los datos, y luego afinar la búsqueda de parámetros en el conjunto de datos completo. Para la clasificación, todos los datos en una secuencia de llamadas ``warm_start`` a ``fit`` deben incluir muestras de cada clase.

source: Attributes
es: Atributos

source: See concept :term:`attribute`.
es: Ver el concepto :term:`atributo`.

source: A list of class labels known to the :term:`classifier`, mapping each label to a numerical index used in the model representation our output. For instance, the array output from :term:`predict_proba` has columns aligned with ``classes_``. For :term:`multi-output` classifiers, ``classes_`` should be a list of lists, with one class listing for each output. For each output, the classes should be sorted (numerically, or lexicographically for strings).
es: Una lista de etiquetas de clase conocidas por el :term:`clasificador`, mapeando cada etiqueta a un índice numérico utilizado en la representación del modelo de nuestra salida. Por ejemplo, el arreglo de salida de :term:`predict_proba` tiene columnas alineadas con ``classes_``. Para los clasificadores de :term:`salida múltiple`, ``classes_`` debe ser una lista de listas, con una lista de clases para cada salida. Para cada salida, las clases deben estar ordenadas (numéricamente, o lexicográficamente para cadenas).

source: ``classes_`` and the mapping to indices is often managed with :class:`preprocessing.LabelEncoder`.
es: ``classes_`` y el mapeo a los índices se suele gestionar con :class:`preprocessing.LabelEncoder`.

source: An affine transformation matrix of shape ``(n_components, n_features)`` used in many linear :term:`transformers` where :term:`n_components` is the number of output features and :term:`n_features` is the number of input features.
es: Una matriz de transformación afín de forma ``(n_components, n_features)`` utilizada en muchos :term:`transformadores` lineales donde :term:`n_components` es el número de características de salida y :term:`n_features` es el número de características de entrada.

source: See also :term:`components_` which is a similar attribute for linear predictors.
es: Ver también :term:`components_` que es un atributo similar para los predictores lineales.

source: The weight/coefficient matrix of a generalised linear model :term:`predictor`, of shape ``(n_features,)`` for binary classification and single-output regression, ``(n_classes, n_features)`` for multiclass classification and ``(n_targets, n_features)`` for multi-output regression. Note this does not include the intercept (or bias) term, which is stored in ``intercept_``.
es: La matriz de ponderaciones/coeficientes de un :term:`predictor` de modelo lineal generalizado, de forma ``(n_features,)`` para la clasificación binaria y la regresión de salida única, ``(n_clases, n_features)`` para la clasificación multiclase y ``(n_targets, n_features)`` para la regresión de salida múltiple. Ten en cuenta que esto no incluye el término de intercepto (o sesgo), que se almacena en ``intercept_``.

source: When available, ``feature_importances_`` is not usually provided as well, but can be calculated as the norm of each feature's entry in ``coef_``.
es: Cuando está disponible, ``feature_importances_`` no suele proporcionarse también, pero puede calcularse como la norma de la entrada de cada característica en ``coef_``.

source: See also :term:`components_` which is a similar attribute for linear transformers.
es: Ver también :term:`components_` que es un atributo similar para los transformadores lineales.

source: An embedding of the training data in :ref:`manifold learning <manifold>` estimators, with shape ``(n_samples, n_components)``, identical to the output of :term:`fit_transform`. See also :term:`labels_`.
es: Un embedding de los datos de entrenamiento en estimadores :ref:`aprendizaje múltiple <manifold>`, con forma ``(n_samples, n_components)``, idéntico a la salida de :term:`fit_transform`. Ver también :term:`labels_`.

source: The number of iterations actually performed when fitting an iterative estimator that may stop upon convergence. See also :term:`max_iter`.
es: El número de iteraciones realmente realizadas cuando se ajusta un estimador iterativo que puede detenerse en la convergencia. Ver también :term:`max_iter`.

source: A vector of shape ``(n_features,)`` available in some :term:`predictors` to provide a relative measure of the importance of each feature in the predictions of the model.
es: Un arreglo de forma ``(n_features,)`` disponible en algunos :term:`predictores` para proporcionar una medida relativa de la importancia de cada característica en las predicciones del modelo.

source: A vector containing a cluster label for each sample of the training data in :term:`clusterers`, identical to the output of :term:`fit_predict`. See also :term:`embedding_`.
es: Un arreglo que contiene una etiqueta de conglomerado para cada muestra de los datos de entrenamiento en :term:`agrupadores`, idéntica a la salida de :term:`fit_predict`. Ver también :term:`embedding_`.

source: Data and sample properties
es: Datos y propiedades de la muestra

source: See concept :term:`sample property`.
es: Ver el concepto :term:`propiedad de muestra`.

source: Used in cross-validation routines to identify samples that are correlated. Each value is an identifier such that, in a supporting :term:`CV splitter`, samples from some ``groups`` value may not appear in both a training set and its corresponding test set. See :ref:`group_cv`.
es: Se utiliza en las rutinas de validación cruzada para identificar las muestras que están correlacionadas. Cada valor es un identificador tal que, en un :term:`separador de validación cruzada` de apoyo, las muestras de algún valor de ``groups`` pueden no aparecer tanto en un conjunto de entrenamiento como en su correspondiente conjunto de prueba. Ver :ref:`group_cv`.

source: A relative weight for each sample. Intuitively, if all weights are integers, a weighted model or score should be equivalent to that calculated when repeating the sample the number of times specified in the weight. Weights may be specified as floats, so that sample weights are usually equivalent up to a constant positive scaling factor.
es: Una ponderación relativa para cada muestra. Intuitivamente, si todos las ponderaciones son números enteros, un modelo o puntuación ponderada debería ser equivalente a la calculada al repetir la muestra el número de veces especificado en la ponderación. Las ponderaciones pueden especificarse como números de punto flotante (floats), de modo que las ponderaciones de las muestras suelen ser equivalentes hasta un factor de escalamiento positivo constante.

source: FIXME Is this interpretation always the case in practice? We have no common tests.
es: FIXME ¿Es esta interpretación siempre el caso en la práctica? No tenemos tests comunes.

source: Some estimators, such as decision trees, support negative weights. FIXME: This feature or its absence may not be tested or documented in many estimators.
es: Algunos estimadores, como los árboles de decisión, admiten ponderaciones negativas. FIXME: Esta característica o su ausencia puede no estar probada o documentada en muchos estimadores.

source: This is not entirely the case where other parameters of the model consider the number of samples in a region, as with ``min_samples`` in :class:`cluster.DBSCAN`. In this case, a count of samples becomes to a sum of their weights.
es: Este no es del todo el caso en que otros parámetros del modelo consideran el número de muestras en una región, como ocurre con ``min_samples`` en :class:`cluster.DBSCAN`. En este caso, un conteo de muestras se convierte en una suma de sus ponderaciones.

source: In classification, sample weights can also be specified as a function of class with the :term:`class_weight` estimator :term:`parameter`.
es: En la clasificación, las ponderaciones de las muestras también pueden especificarse como una función de la clase con el :term:`parámetro` estimador :term:`class_weight`.

source: Denotes data that is observed at training and prediction time, used as independent variables in learning. The notation is uppercase to denote that it is ordinarily a matrix (see :term:`rectangular`). When a matrix, each sample may be represented by a :term:`feature` vector, or a vector of :term:`precomputed` (dis)similarity with each training sample. ``X`` may also not be a matrix, and may require a :term:`feature extractor` or a :term:`pairwise metric` to turn it into one before learning a model.
es: Denota los datos que se observan en el momento del entrenamiento y de la predicción, utilizados como variables independientes en el aprendizaje. La notación es mayúscula para indicar que se trata normalmente de una matriz (véase :term:`rectangular`). Cuando se trata de una matriz, cada muestra puede estar representada por un vector de :term:`características <característica>`, o un vector de (des)similitudes :term:`precalculado` con cada muestra de entrenamiento. ``X`` también puede no ser una matriz, y puede requerir un :term:`extractor de características` o una :term:`métrica por pares` para convertirla en una antes del aprendizaje de un modelo.

source: Shorthand for "transformed :term:`X`".
es: Abreviatura de ":term:`X` transformada".

source: Denotes data that may be observed at training time as the dependent variable in learning, but which is unavailable at prediction time, and is usually the :term:`target` of prediction. The notation may be uppercase to denote that it is a matrix, representing :term:`multi-output` targets, for instance; but usually we use ``y`` and sometimes do so even when multiple outputs are assumed.
es: Denota datos que pueden observarse en el momento del entrenamiento como variable dependiente en el aprendizaje, pero que no están disponibles en el momento de la predicción, y suele ser el :term:`objetivo` de la predicción. La notación puede ser mayúscula para indicar que se trata de una matriz, que representa objetivos de :term:`salida múltiple`, por ejemplo; pero normalmente utilizamos ``y`` y a veces lo hacemos incluso cuando se asumen múltiples salidas.
