Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: An array of shape ``(n_samples,)`` ``(n_samples, n_outputs)``. :term:`Multilabel <multilabel>` data may be represented as a sparse matrix if a sparse matrix was used in fitting. Each element should be one of the values in the classifier's :term:`classes_` attribute.
es: Un arreglo de forma ``(n_samples,)`` ``(n_samples, n_outputs)``. Los datos :term:`multietiqueta <multilabel>` pueden representarse como una matriz dispersa si se ha utilizado una matriz dispersa en el ajuste. Cada elemento debe ser uno de los valores del atributo :term:`classes_` del clasificador.

source: An array of shape ``(n_samples,)`` where each value is from 0 to ``n_clusters - 1`` if the corresponding sample is clustered, and -1 if the sample is not clustered, as in :func:`cluster.dbscan`.
es: Un arreglo de forma ``(n_samples,)`` donde cada valor es de 0 a ``n_clusters - 1`` si la muestra correspondiente está agrupada, y -1 si la muestra no está agrupada, como en :func:`cluster.dbscan`.

source: An array of shape ``(n_samples,)`` where each value is -1 for an outlier and 1 otherwise.
es: Un arreglo de forma ``(n_samples,)`` donde cada valor es -1 para un valor atípico y 1 en caso contrario.

source: A numeric array of shape ``(n_samples,)``, usually float64. Some regressors have extra options in their ``predict`` method, allowing them to return standard deviation (``return_std=True``) or covariance (``return_cov=True``) relative to the predicted value. In this case, the return value is a tuple of arrays corresponding to (prediction mean, std, cov) as required.
es: Un arreglo numérico de forma ``(n_samples,)``, normalmente float64. Algunos regresores tienen opciones adicionales en su método ``predict``, lo que les permite devolver la desviación estándar (``return_std=True``) o la covarianza (``return_cov=True``) relativa al valor predicho. En este caso, el valor devuelto es una tupla de arreglos correspondientes a (media de la predicción, std, cov) según se requiera.

source: The natural logarithm of the output of :term:`predict_proba`, provided to facilitate numerical stability.
es: El logaritmo natural de la salida de :term:`predict_proba`, proporcionado para facilitar la estabilidad numérica.

source: A method in :term:`classifiers` and :term:`clusterers` that can return probability estimates for each class/cluster. Its input is usually only some observed data, :term:`X`.
es: Un método en :term:`clasificadores` y :term:`agrupadores` que puede devolver estimaciones de probabilidad para cada clase/conglomerado. Su entrada suele ser sólo algunos datos observados, :term:`X`.

source: Output conventions are like those for :term:`decision_function` except in the :term:`binary` classification case, where one column is output for each class (while ``decision_function`` outputs a 1d array). For binary and multiclass predictions, each row should add to 1.
es: Las convenciones de salida son como las de :term:`decision_function`, excepto en el caso de la clasificación :term:`binaria <binary>`, donde una columna es la salida para cada clase (mientras que ``decision_function`` tiene como salida un arreglo 1D). Para las predicciones binarias y multiclase, cada fila debe sumar 1.

source: Like other methods, ``predict_proba`` should only be present when the estimator can make probabilistic predictions (see :term:`duck typing`). This means that the presence of the method may depend on estimator parameters (e.g. in :class:`linear_model.SGDClassifier`) or training data (e.g. in :class:`model_selection.GridSearchCV`) and may only appear after fitting.
es: Al igual que otros métodos, ``predict_proba`` sólo debe estar presente cuando el estimador puede realizar predicciones probabilísticas (ver :term:`duck typing`). Esto significa que la presencia del método puede depender de los parámetros del estimador (por ejemplo, en :class:`linear_model.SGDClassifier`) o de los datos de entrenamiento (por ejemplo, en :class:`model_selection.GridSearchCV`) y puede aparecer sólo después del ajuste.

source: A method on an estimator, usually a :term:`predictor`, which evaluates its predictions on a given dataset, and returns a single numerical score. A greater return value should indicate better predictions; accuracy is used for classifiers and R^2 for regressors by default.
es: Un método en un estimador, normalmente un :term:`predictor`, que evalúa sus predicciones en un conjunto de datos dado, y devuelve una única puntuación numérica. Un valor de retorno mayor debería indicar mejores predicciones; la precisión se utiliza para los clasificadores y R^2 para los regresores por defecto.

source: Some estimators implement a custom, estimator-specific score function, often the likelihood of the data under the model.
es: Algunos estimadores implementan una función de puntuación personalizada y específica del estimador, a menudo la verosimilitud de los datos bajo el modelo.

source: Available in any estimator, takes keyword arguments corresponding to keys in :term:`get_params`. Each is provided a new value to assign such that calling ``get_params`` after ``set_params`` will reflect the changed :term:`parameters`. Most estimators use the implementation in :class:`base.BaseEstimator`, which handles nested parameters and otherwise sets the parameter as an attribute on the estimator. The method is overridden in :class:`pipeline.Pipeline` and related estimators.
es: Disponible en cualquier estimador, toma argumentos de palabras clave correspondientes a las claves de :term:`get_params`. A cada uno se le proporciona un nuevo valor para asignar, de forma que al llamar a ``get_params`` después de ``set_params`` reflejará los :term:`parámetros` modificados. La mayoría de los estimadores utilizan la implementación en :class:`base.BaseEstimator`, que maneja los parámetros anidados y, en caso contrario, establece el parámetro como un atributo en el estimador. El método es sobreescrito en :class:`pipeline.Pipeline` y estimadores relacionados.

source: On a :term:`CV splitter` (not an estimator), this method accepts parameters (:term:`X`, :term:`y`, :term:`groups`), where all may be optional, and returns an iterator over ``(train_idx, test_idx)`` pairs. Each of {train,test}_idx is a 1d integer array, with values from 0 from ``X.shape[0] - 1`` of any length, such that no values appear in both some ``train_idx`` and its corresponding ``test_idx``.
es: En un :term:`separador de validación cruzada` (no un estimador), este método acepta parámetros (:term:`X`, :term:`y`, :term:`groups`), donde todos pueden ser opcionales, y devuelve un iterador sobre pares ``(train_idx, test_idx)``. Cada uno de {train,test}_idx es un arreglo 1D de enteros, con valores desde 0 hasta ``X.shape[0] - 1`` de cualquier longitud, de forma que no aparezcan valores tanto en algún ``train_idx`` como en su correspondiente ``test_idx``.

source: In a :term:`transformer`, transforms the input, usually only :term:`X`, into some transformed space (conventionally notated as :term:`Xt`). Output is an array or sparse matrix of length :term:`n_samples` and with the number of columns fixed after :term:`fitting`.
es: En un :term:`transformador`, transforma la entrada, normalmente sólo :term:`X`, en algún espacio transformado (convencionalmente anotado como :term:`Xt`). La salida es un arreglo o matriz dispersa de longitud :term:`n_samples` y con el número de columnas fijado después de :term:`ajustar`.

source: Parameters
es: Parámetros

source: These common parameter names, specifically used in estimator construction (see concept :term:`parameter`), sometimes also appear as parameters of functions or non-estimator constructors.
es: Estos nombres de parámetros comunes, utilizados específicamente en la construcción de estimadores (ver el concepto :term:`parámetro`), a veces también aparecen como parámetros de funciones o constructores no estimadores.

source: Used to specify sample weights when fitting classifiers as a function of the :term:`target` class. Where :term:`sample_weight` is also supported and given, it is multiplied by the ``class_weight`` contribution. Similarly, where ``class_weight`` is used in a :term:`multioutput` (including :term:`multilabel`) tasks, the weights are multiplied across outputs (i.e. columns of ``y``).
es: Se utiliza para especificar las ponderaciones de las muestras cuando se ajustan los clasificadores en función de la clase :term:`objetivo`. Donde :term:`sample_weight` también se admite y se da, se multiplica por la contribución de ``class_weight``. Del mismo modo, cuando se utiliza ``class_weight`` en tareas :term:`multisalida` (incluyendo :term:`multietiqueta`), las ponderaciones se multiplican por las salidas (es decir, las columnas de ``y``).

source: By default, all samples have equal weight such that classes are effectively weighted by their prevalence in the training data. This could be achieved explicitly with ``class_weight={label1: 1, label2: 1, ...}`` for all class labels.
es: Por defecto, todas las muestras tienen la misma ponderación, de manera que las clases se ponderan efectivamente por su prevalencia en los datos de entrenamiento. Esto podría lograrse explícitamente con ``class_weight={label1: 1, label2: 1, ...}`` para todas las etiquetas de clase.

source: More generally, ``class_weight`` is specified as a dict mapping class labels to weights (``{class_label: weight}``), such that each sample of the named class is given that weight.
es: De forma más general, ``class_weight`` se especifica como un diccionario que mapea etiquetas de clase a ponderaciones (``{class_label: weight}``), de forma que cada muestra de la clase nombrada recibe esa ponderación.

source: ``class_weight='balanced'`` can be used to give all classes equal weight by giving each sample a weight inversely related to its class's prevalence in the training data: ``n_samples / (n_classes * np.bincount(y))``. Class weights will be used differently depending on the algorithm: for linear models (such as linear SVM or logistic regression), the class weights will alter the loss function by weighting the loss of each sample by its class weight. For tree-based algorithms, the class weights will be used for reweighting the splitting criterion. **Note** however that this rebalancing does not take the weight of samples in each class into account.
es: Se puede utilizar ``class_weight='balanced'`` para dar a todas las clases la misma ponderación dando a cada muestra una ponderación inversamente relacionada con la prevalencia de su clase en los datos de entrenamiento: ``n_samples / (n_classes * np.bincount(y))``. Las ponderaciones de las clases se utilizarán de forma diferente según el algoritmo: para los modelos lineales (como las Máquinas de Vectores de Soporte [Support Vector Machines, SVM] lineales o la regresión logística), las ponderaciones de las clases alterarán la función de pérdida ponderando la pérdida de cada muestra por su ponderación de la clase. Para los algoritmos basados en árboles, las ponderaciones de la clase se utilizarán para reponderar el criterio de separación. **Note**, sin embargo, que este reequilibrio no tiene en cuenta la ponderación de las muestras en cada clase.

source: For multioutput classification, a list of dicts is used to specify weights for each output. For example, for four-class multilabel classification weights should be ``[{0: 1, 1: 1}, {0: 1, 1: 5}, {0: 1, 1: 1}, {0: 1, 1: 1}]`` instead of ``[{1:1}, {2:5}, {3:1}, {4:1}]``.
es: Para la clasificación multisalida, se utiliza una lista de diccionarios para especificar las ponderaciones de cada salida. Por ejemplo, para la clasificación multietiqueta de cuatro clases las ponderaciones deben ser ``[{0: 1, 1: 1}, {0: 1, 1: 5}, {0: 1, 1: 1}, {0: 1, 1: 1}]`` en lugar de ``[{1:1}, {2:5}, {3:1}, {4:1}]``.

source: The ``class_weight`` parameter is validated and interpreted with :func:`utils.compute_class_weight`.
es: El parámetro ``class_weight`` se valida e interpreta con :func:`utils.compute_class_weight`.

source: Determines a cross validation splitting strategy, as used in cross-validation based routines. ``cv`` is also available in estimators such as :class:`multioutput.ClassifierChain` or :class:`calibration.CalibratedClassifierCV` which use the predictions of one estimator as training data for another, to not overfit the training supervision.
es: Determina una estrategia de separación de validación cruzada, como la utilizada en las rutinas basadas en la validación cruzada. ``cv`` también está disponible en estimadores como :class:`multioutput.ClassifierChain` o :class:`calibration.CalibratedClassifierCV` que utilizan las predicciones de un estimador como datos de entrenamiento para otro, para no sobreajustar la supervisión de entrenamiento.

source: Possible inputs for ``cv`` are usually:
es: Las entradas posibles para ``cv`` son usualmente:

source: An integer, specifying the number of folds in K-fold cross validation. K-fold will be stratified over classes if the estimator is a classifier (determined by :func:`base.is_classifier`) and the :term:`targets` may represent a binary or multiclass (but not multioutput) classification problem (determined by :func:`utils.multiclass.type_of_target`).
es: Un número entero que especifica el número de pliegues en la validación cruzada K-fold. K-fold se estratificará sobre las clases si el estimador es un clasificador (determinado por :func:`base.is_classifier`) y los :term:`objetivos` pueden representar un problema de clasificación binario o multiclase (pero no de salida múltiple) (determinado por :func:`utils.multiclass.type_of_target`).

source: A :term:`cross-validation splitter` instance. Refer to the :ref:`User Guide <cross_validation>` for splitters available within Scikit-learn.
es: Una instancia de :term:`separador de validación cruzada`. Consulta el :ref:`Manual de Usuario <cross_validation>` para conocer los separadores disponibles en scikit-learn.

source: An iterable yielding train/test splits.
es: Un iterable que produce separaciones de entrenamiento/prueba.

source: With some exceptions (especially where not using cross validation at all is an option), the default is 5-fold.
es: Salvo algunas excepciones (especialmente cuando es una opción prescindir de la validación cruzada), el valor por defecto es de 5 pliegues.

source: ``cv`` values are validated and interpreted with :func:`utils.check_cv`.
es: Los valores de ``cv`` se validan e interpretan con :func:`utils.check_cv`.

source: For estimators involving iterative optimization, this determines the maximum number of iterations to be performed in :term:`fit`. If ``max_iter`` iterations are run without convergence, a :class:`exceptions.ConvergenceWarning` should be raised. Note that the interpretation of "a single iteration" is inconsistent across estimators: some, but not all, use it to mean a single epoch (i.e. a pass over every sample in the data).
es: Para los estimadores que implican una optimización iterativa, esto determina el número máximo de iteraciones a realizar en :term:`fit`. Si las iteraciones ``max_iter`` se ejecutan sin convergencia, se debe levantar un :class:`exceptions.ConvergenceWarning`. Ten en cuenta que la interpretación de "una sola iteración" es inconsistente entre los estimadores: algunos, pero no todos, lo utilizan para referirse a una sola época (es decir, una pasada por cada muestra en los datos).

source: FIXME perhaps we should have some common tests about the relationship between ConvergenceWarning and max_iter.
es: FIXME tal vez deberíamos tener algunos tests comunes sobre la relación entre ConvergenceWarning y max_iter.

source: Some estimators make use of :class:`joblib.Memory` to store partial solutions during fitting. Thus when ``fit`` is called again, those partial solutions have been memoized and can be reused.
es: Algunos estimadores hacen uso de :class:`joblib.Memory` para almacenar soluciones parciales durante el ajuste. Así, cuando se llama de nuevo a ``fit``, esas soluciones parciales han sido memorizadas y pueden ser reutilizadas.

source: A ``memory`` parameter can be specified as a string with a path to a directory, or a :class:`joblib.Memory` instance (or an object with a similar interface, i.e. a ``cache`` method) can be used.
es: Un parámetro ``memory`` puede especificarse como una cadena con una ruta a un directorio, o puede utilizarse una instancia de :class:`joblib.Memory` (o un objeto con una interfaz similar, es decir, un método ``cache``).

source: ``memory`` values are validated and interpreted with :func:`utils.validation.check_memory`.
es: Los valores de ``memory`` se validan e interpretan con :func:`utils.validation.check_memory`.

source: As a parameter, this is the scheme for determining the distance between two data points. See :func:`metrics.pairwise_distances`. In practice, for some algorithms, an improper distance metric (one that does not obey the triangle inequality, such as Cosine Distance) may be used.
es: Como parámetro, es el esquema para determinar la distancia entre dos puntos de datos. Ver :func:`metrics.pairwise_distances`. En la práctica, para algunos algoritmos, se puede utilizar una métrica de distancia inadecuada (una que no obedece a la desigualdad del triángulo, como la Distancia del Coseno).

source: XXX: hierarchical clustering uses ``affinity`` with this meaning.
es: XXX: el análisis de conglomerados jerárquico utiliza ``affinity`` con este significado.

source: We also use *metric* to refer to :term:`evaluation metrics`, but avoid using this sense as a parameter name.
es: También utilizamos *metric* para referirnos a :term:`métricas de evaluación`, pero evitamos utilizar este sentido como nombre de parámetro.

source: The number of features which a :term:`transformer` should transform the input into. See :term:`components_` for the special case of affine projection.
es: El número de características en las que un :term:`transformador` debe transformar la entrada. Ver :term:`components_` para el caso especial de la proyección afín.

source: Number of iterations with no improvement to wait before stopping the iterative procedure. This is also known as a *patience* parameter. It is typically used with :term:`early stopping` to avoid stopping too early.
es: Número de iteraciones sin mejora a esperar antes de detener el procedimiento iterativo. También se conoce como parámetro de *paciencia*. Se suele utilizar con :term:`parada anticipada` para evitar que se detenga demasiado pronto.

source: This parameter is used to specify how many concurrent processes or threads should be used for routines that are parallelized with :term:`joblib`.
es: Este parámetro se utiliza para especificar cuántos procesos o hilos concurrentes deben utilizarse para las rutinas que se paralelizan con :term:`joblib`.

source: ``n_jobs`` is an integer, specifying the maximum number of concurrently running workers. If 1 is given, no joblib parallelism is used at all, which is useful for debugging. If set to -1, all CPUs are used. For ``n_jobs`` below -1, (n_cpus + 1 + n_jobs) are used. For example with ``n_jobs=-2``, all CPUs but one are used.
es: ``n_jobs`` es un número entero, que especifica el número máximo de trabajadores que se ejecutan simultáneamente. Si se da 1, no se utiliza el paralelismo joblib en absoluto, lo que es útil para la depuración. Si se establece en -1, se utilizan todas las CPUs. Para ``n_jobs`` por debajo de -1, se utilizan (n_cpus + 1 + n_jobs). Por ejemplo, con ``n_jobs=-2``, se utilizan todas las CPUs excepto una.

source: ``n_jobs`` is ``None`` by default, which means *unset*; it will generally be interpreted as ``n_jobs=1``, unless the current :class:`joblib.Parallel` backend context specifies otherwise.
es: ``n_jobs`` es ``None`` por defecto, lo que significa *no establecido*; generalmente se interpretará como ``n_jobs=1``, a menos que el contexto actual del backend :class:`joblib.Parallel` especifique lo contrario.

source: For more details on the use of ``joblib`` and its interactions with scikit-learn, please refer to our :ref:`parallelism notes <parallelism>`.
es: Para más detalles sobre el uso de ``joblib`` y sus interacciones con scikit-learn, consulta nuestras :ref:`notas de paralelismo <parallelism>`.

source: Value with which positive labels must be encoded in binary classification problems in which the positive class is not assumed. This value is typically required to compute asymmetric evaluation metrics such as precision and recall.
es: Valor con el que deben codificarse las etiquetas positivas en los problemas de clasificación binaria en los que no se asume la clase positiva. Este valor suele ser necesario para calcular métricas de evaluación asimétricas como la precisión y la exhaustividad.

source: Whenever randomization is part of a Scikit-learn algorithm, a ``random_state`` parameter may be provided to control the random number generator used. Note that the mere presence of ``random_state`` doesn't mean that randomization is always used, as it may be dependent on another parameter, e.g. ``shuffle``, being set.
es: Cuando la aleatorización es parte de un algoritmo de scikit-learn, se puede proporcionar un parámetro ``random_state`` para controlar el generador de números aleatorios utilizado. Ten en cuenta que la mera presencia de ``random_state`` no significa que la aleatorización se utilice siempre, ya que puede depender de que se establezca otro parámetro, por ejemplo, ``shuffle``.

source: The passed value will have an effect on the reproducibility of the results returned by the function (:term:`fit`, :term:`split`, or any other function like :func:`~sklearn.cluster.k_means`). `random_state`'s value may be:
es: El valor pasado tendrá un efecto en la reproducibilidad de los resultados devueltos por la función (:term:`fit`, :term:`split`, o cualquier otra función como :func:`~sklearn.cluster.k_means`). El valor de `random_state` puede ser:

source: None (default)
es: None (por defecto)

source: Use the global random state instance from :mod:`numpy.random`. Calling the function multiple times will reuse the same instance, and will produce different results.
es: Utiliza la instancia global de estado aleatorio de :mod:`numpy.random`. Si se llama a la función varias veces, se reutilizará la misma instancia y se producirán resultados diferentes.

source: An integer
es: Un número entero

source: Use a new random number generator seeded by the given integer. Using an int will produce the same results across different calls. However, it may be worthwhile checking that your results are stable across a number of different distinct random seeds. Popular integer random seeds are 0 and `42 <https://en.wikipedia.org/wiki/Answer_to_the_Ultimate_Question_of_Life%2C_the_Universe%2C_and_Everything>`_.
es: Utiliza un nuevo generador de números aleatorios cuya semilla es el número entero dado. El uso de un int producirá los mismos resultados en diferentes llamadas. Sin embargo, puede valer la pena comprobar que sus resultados son estables a través de una serie de diferentes semillas aleatorias. Las semillas aleatorias enteras más populares son 0 y `42 <https://en.wikipedia.org/wiki/Answer_to_the_Ultimate_Question_of_Life%2C_the_Universe%2C_and_Everything>`_.

source: A :class:`numpy.random.RandomState` instance
es: Una instancia de :class:`numpy.random.RandomState`

source: Use the provided random state, only affecting other users of that same random state instance. Calling the function multiple times will reuse the same instance, and will produce different results.
es: Utiliza el estado aleatorio proporcionado, afectando únicamente a otros usuarios de esa misma instancia de estado aleatorio. Llamar a la función varias veces reutilizará la misma instancia, y producirá resultados diferentes.
