Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/glossary.po
Languages: es

source: Continuous multioutput targets are represented as multiple :term:`continuous` targets, horizontally stacked into an array of shape ``(n_samples, n_outputs)``.
es: Los objetivos de salida múltiple continua se representan como múltiples objetivos :term:`continuo`(s), apilados horizontalmente en un arreglo de forma ``(n_samples, n_outputs)``.

source: :func:`~utils.multiclass.type_of_target` will return 'continuous-multioutput' for continuous multioutput input, but if the data is all integers, it will be identified as 'multiclass-multioutput'.
es: :func:`~utils.multiclass.type_of_target` devolverá 'continuous-multioutput' para una entrada multisalida continua, pero si los datos son todos enteros, se identificará como 'multiclass-multioutput'.

source: multiclass
es: multiclase

source: multi-class
es: multi-clase

source: A classification problem consisting of more than two classes. A multiclass target may be represented as a 1-dimensional array of strings or integers. A 2d column vector of integers (i.e. a single output in :term:`multioutput` terms) is also accepted.
es: Un problema de clasificación que consta de más de dos clases. Un objetivo multiclase puede representarse como un arreglo unidimensional de cadenas o enteros. También se acepta un vector columna 2D de enteros (es decir, una única salida en términos :term:`multisalida`).

source: We do not officially support other orderable, hashable objects as class labels, even if estimators may happen to work when given classification targets of such type.
es: No soportamos oficialmente otros objetos ordenables y hashables como etiquetas de clase, aunque los estimadores puedan funcionar cuando se dan objetivos de clasificación de ese tipo.

source: For semi-supervised classification, :term:`unlabeled` samples should have the special label -1 in ``y``.
es: Para la clasificación semi supervisada, las muestras :term:`sin etiquetar` deben tener la etiqueta especial -1 en ``y``.

source: Within sckit-learn, all estimators supporting binary classification also support multiclass classification, using One-vs-Rest by default.
es: Dentro de sckit-learn, todos los estimadores que soportan la clasificación binaria también soportan la clasificación multiclase, utilizando One-vs-Rest por defecto.

source: A :class:`preprocessing.LabelEncoder` helps to canonicalize multiclass targets as integers.
es: Un :class:`preprocessing.LabelEncoder` ayuda a canonizar los objetivos multiclase como enteros.

source: :func:`~utils.multiclass.type_of_target` will return 'multiclass' for multiclass input. The user may also want to handle 'binary' input identically to 'multiclass'.
es: :func:`~utils.multiclass.type_of_target` devolverá 'multiclass' para la entrada multiclase. El usuario también puede querer manejar la entrada 'binary' de forma idéntica a 'multiclass'.

source: multiclass multioutput
es: multiclase multisalida

source: multi-class multi-output
es: multi-clase multi-salida

source: multioutput multiclass
es: multiclase multisalida

source: multi-output multi-class
es: multi-clase multi-salida

source: A classification problem where each sample's target consists of ``n_outputs`` :term:`outputs`, each a class label, for a fixed int ``n_outputs > 1`` in a particular dataset. Each output has a fixed set of available classes, and each sample is labeled with a class for each output. An output may be binary or multiclass, and in the case where all outputs are binary, the target is :term:`multilabel`.
es: Un problema de clasificación en el que el objetivo de cada muestra consiste en ``n_outputs`` :term:`salidas`, cada una una etiqueta de clase, para un int fijo ``n_outputs > 1`` en un conjunto de datos particular. Cada salida tiene un conjunto fijo de clases disponibles, y cada muestra está etiquetada con una clase para cada salida. Una salida puede ser binaria o multiclase, y en el caso de que todas las salidas sean binarias, el objetivo es :term:`multietiqueta`.

source: Multiclass multioutput targets are represented as multiple :term:`multiclass` targets, horizontally stacked into an array of shape ``(n_samples, n_outputs)``.
es: Los objetivos multisalida se representan como múltiples objetivos :term:`multiclase`, apilados horizontalmente en un arreglo de forma ``(n_samples, n_outputs)``.

source: XXX: For simplicity, we may not always support string class labels for multiclass multioutput, and integer class labels should be used.
es: XXX: Por razones de simplicidad, no siempre podemos admitir etiquetas de clase de cadena para multiclase multisalida, y se deben utilizar etiquetas de clase de enteros.

source: :mod:`multioutput` provides estimators which estimate multi-output problems using multiple single-output estimators. This may not fully account for dependencies among the different outputs, which methods natively handling the multioutput case (e.g. decision trees, nearest neighbors, neural networks) may do better.
es: :mod:`multioutput` proporciona estimadores que estiman problemas de salidas múltiples utilizando múltiples estimadores de una sola salida. Es posible que esto no tenga en cuenta las dependencias entre las diferentes salidas, algo que los métodos que manejan de forma nativa el caso de las salidas múltiples (por ejemplo, árboles de decisión, vecinos más cercanos, redes neuronales) pueden hacer mejor.

source: :func:`~utils.multiclass.type_of_target` will return 'multiclass-multioutput' for multiclass multioutput input.
es: :func:`~utils.multiclass.type_of_target` devolverá 'multiclass-multioutput' para una entrada multiclase multisalida.

source: multilabel
es: multietiqueta

source: multi-label
es: multi-etiqueta

source: A :term:`multiclass multioutput` target where each output is :term:`binary`. This may be represented as a 2d (dense) array or sparse matrix of integers, such that each column is a separate binary target, where positive labels are indicated with 1 and negative labels are usually -1 or 0. Sparse multilabel targets are not supported everywhere that dense multilabel targets are supported.
es: Un objetivo :term:`multiclase multisalida` donde cada salida es :term:`binario`(a). Puede representarse como un arreglo 2D (denso) o una matriz dispersa de enteros, de manera que cada columna es un objetivo binario independiente, donde las etiquetas positivas se indican con 1 y las negativas suelen ser -1 o 0. Los objetivos multietiqueta dispersos no se admiten en todos los casos en que los objetivos multietiqueta densos son admitidos.

source: Semantically, a multilabel target can be thought of as a set of labels for each sample. While not used internally, :class:`preprocessing.MultiLabelBinarizer` is provided as a utility to convert from a list of sets representation to a 2d array or sparse matrix. One-hot encoding a multiclass target with :class:`preprocessing.LabelBinarizer` turns it into a multilabel problem.
es: Semánticamente, un objetivo multietiqueta puede considerarse como un conjunto de etiquetas para cada muestra. Aunque no se utiliza internamente, :class:`preprocessing.MultiLabelBinarizer` se proporciona como una herramienta para convertir de una representación de lista de conjuntos a un arreglo 2D o matriz dispersa. La codificación one-hot de un objetivo multiclase con :class:`preprocessing.LabelBinarizer` lo convierte en un problema multietiqueta.

source: :func:`~utils.multiclass.type_of_target` will return 'multilabel-indicator' for multilabel input, whether sparse or dense.
es: :func:`~utils.multiclass.type_of_target` devolverá 'multilabel-indicator' para la entrada multietiqueta, ya sea dispersa o densa.

source: multioutput
es: salida múltiple

source: multi-output
es: salida múltiple

source: A target where each sample has multiple classification/regression labels. See :term:`multiclass multioutput` and :term:`continuous multioutput`. We do not currently support modelling mixed classification and regression targets.
es: Un objetivo en el que cada muestra tiene múltiples etiquetas de clasificación/regresión. Ver :term:`multiclase multisalida` y :term:`salida múltiple continua`. Actualmente no admitimos el modelado de objetivos mixtos de clasificación y regresión.

source: Methods
es: Métodos

source: In a fitted :term:`classifier` or :term:`outlier detector`, predicts a "soft" score for each sample in relation to each class, rather than the "hard" categorical prediction produced by :term:`predict`. Its input is usually only some observed data, :term:`X`.
es: En un :term:`clasificador` ajustado o :term:`detector de valores atípicos`, predice una puntuación "blanda" para cada muestra en relación con cada clase, en lugar de la predicción categórica "dura" producida por :term:`predict`. Su entrada suele ser sólo algunos datos observados, :term:`X`.

source: If the estimator was not already :term:`fitted`, calling this method should raise a :class:`exceptions.NotFittedError`.
es: Si el estimador no estaba ya :term:`ajustado`, la llamada a este método debería lanzar un :class:`exceptions.NotFittedError`.

source: Output conventions:
es: Convenciones de salida:

source: binary classification
es: clasificación binaria

source: A 1-dimensional array, where values strictly greater than zero indicate the positive class (i.e. the last class in :term:`classes_`).
es: Un arreglo unidimensional, donde los valores estrictamente mayores que cero indican la clase positiva (es decir, la última clase en :term:`classes_`).

source: multiclass classification
es: clasificación multiclase

source: A 2-dimensional array, where the row-wise arg-maximum is the predicted class. Columns are ordered according to :term:`classes_`.
es: Un arreglo bidimensional, en el que el arg-máximo por fila es la clase predicha. Las columnas se ordenan según :term:`classes_`.

source: multilabel classification
es: clasificación multietiqueta

source: Scikit-learn is inconsistent in its representation of multilabel decision functions. Some estimators represent it like multiclass multioutput, i.e. a list of 2d arrays, each with two columns. Others represent it with a single 2d array, whose columns correspond to the individual binary classification decisions. The latter representation is ambiguously identical to the multiclass classification format, though its semantics differ: it should be interpreted, like in the binary case, by thresholding at 0.
es: Scikit-learn es inconsistente en su representación de las funciones de decisión multietiqueta. Algunos estimadores la representan como una multiclase multisalida, es decir, una lista de arreglos 2D, cada uno con dos columnas. Otros la representan con un único arreglo 2D, cuyas columnas corresponden a las decisiones individuales de clasificación binaria. Esta última representación es ambiguamente idéntica al formato de clasificación multiclase, aunque su semántica difiere: debe interpretarse, como en el caso binario, fijando el umbral en 0.

source: TODO: `This gist <https://gist.github.com/jnothman/4807b1b0266613c20ba4d1f88d0f8cf5>`_ highlights the use of the different formats for multilabel.
es: TODO: `Este gist <https://gist.github.com/jnothman/4807b1b0266613c20ba4d1f88d0f8cf5>`_ destaca el uso de los diferentes formatos para la multietiqueta.

source: multioutput classification
es: clasificación multisalida

source: A list of 2d arrays, corresponding to each multiclass decision function.
es: Una lista de arreglos 2D, que corresponde a cada función de decisión multiclase.

source: outlier detection
es: detección de valores atípicos

source: A 1-dimensional array, where a value greater than or equal to zero indicates an inlier.
es: Un arreglo unidimensional, en el que un valor mayor o igual a cero indica un valor típico.

source: The ``fit`` method is provided on every estimator. It usually takes some :term:`samples` ``X``, :term:`targets` ``y`` if the model is supervised, and potentially other :term:`sample properties` such as :term:`sample_weight`. It should:
es: El método ``fit`` se proporciona en cada estimador. Normalmente toma algunas :term:`muestras` ``X``, :term:`objetivos` ``y`` si el modelo es supervisado, y potencialmente otras :term:`propiedades muestrales` como :term:`sample_weight`. Debería:

source: clear any prior :term:`attributes` stored on the estimator, unless :term:`warm_start` is used;
es: borrar cualquiera de los :term:`atributos` previos almacenados en el estimador, a menos que se utilice :term:`warm_start`;

source: validate and interpret any :term:`parameters`, ideally raising an error if invalid;
es: validar e interpretar cualquiera de los :term:`parámetros`, idealmente lanzando un error si no es válido;

source: validate the input data;
es: validar los datos de entrada;

source: estimate and store model attributes from the estimated parameters and provided data; and
es: estimar y almacenar los atributos del modelo a partir de los parámetros estimados y los datos proporcionados; y

source: return the now :term:`fitted` estimator to facilitate method chaining.
es: devolver el estimador ahora :term:`ajustado` para facilitar el encadenamiento de métodos.

source: :ref:`glossary_target_types` describes possible formats for ``y``.
es: :ref:`glossary_target_types` describe posibles formatos para ``y``.

source: Used especially for :term:`unsupervised`, :term:`transductive` estimators, this fits the model and returns the predictions (similar to :term:`predict`) on the training data. In clusterers, these predictions are also stored in the :term:`labels_` attribute, and the output of ``.fit_predict(X)`` is usually equivalent to ``.fit(X).predict(X)``. The parameters to ``fit_predict`` are the same as those to ``fit``.
es: Utilizado especialmente para los estimadores :term:`no supervisados <unsupervised>`, :term:`transductivos <transductive>`, ajusta el modelo y devuelve las predicciones (similar a :term:`predict`) sobre los datos de entrenamiento. En los agrupadores, estas predicciones también se almacenan en el atributo :term:`labels_`, y la salida de ``.fit_predict(X)`` suele ser equivalente a ``.fit(X).predict(X)``. Los parámetros de ``fit_predict`` son los mismos que los de ``fit``.

source: A method on :term:`transformers` which fits the estimator and returns the transformed training data. It takes parameters as in :term:`fit` and its output should have the same shape as calling ``.fit(X, ...).transform(X)``. There are nonetheless rare cases where ``.fit_transform(X, ...)`` and ``.fit(X, ...).transform(X)`` do not return the same value, wherein training data needs to be handled differently (due to model blending in stacked ensembles, for instance; such cases should be clearly documented). :term:`Transductive <transductive>` transformers may also provide ``fit_transform`` but not :term:`transform`.
es: Un método en :term:`transformadores` que ajusta el estimador y devuelve los datos de entrenamiento transformados. Toma parámetros como en :term:`fit` y su salida debería tener la misma forma que llamando a ``.fit(X, ...).transform(X)``. No obstante, hay casos raros en los que ``.fit_transform(X, ...)`` y ``.fit(X, ...).transform(X)`` no devuelven el mismo valor, donde los datos de entrenamiento deben tratarse de forma diferente (debido a la mezcla de modelos en ensembles apilados, por ejemplo; estos casos deben estar claramente documentados). Los transformadores :term:`transductivos <transductive>` también pueden proporcionar ``fit_transform`` pero no :term:`transform``.

source: One reason to implement ``fit_transform`` is that performing ``fit`` and ``transform`` separately would be less efficient than together. :class:`base.TransformerMixin` provides a default implementation, providing a consistent interface across transformers where ``fit_transform`` is or is not specialized.
es: Una de las razones para implementar ``fit_transform`` es que realizar ``fit`` y ``transform`` por separado sería menos eficiente que hacerlo conjuntamente. :class:`base.TransformerMixin` proporciona una implementación por defecto, proporcionando una interfaz consistente a través de los transformadores en los que ``fit_transform`` está o no especializado.

source: In :term:`inductive` learning -- where the goal is to learn a generalized model that can be applied to new data -- users should be careful not to apply ``fit_transform`` to the entirety of a dataset (i.e. training and test data together) before further modelling, as this results in :term:`data leakage`.
es: En el aprendizaje :term:`inductivo(a)` -- donde el objetivo es aprender un modelo generalizado que pueda aplicarse a nuevos datos -- los usuarios deben tener cuidado de no aplicar ``fit_transform`` a la totalidad de un conjunto de datos (es decir, los datos de entrenamiento y de prueba juntos) antes de seguir modelando, ya que esto resulta en :term:`fuga de datos`.

source: Primarily for :term:`feature extractors`, but also used for other transformers to provide string names for each column in the output of the estimator's :term:`transform` method. It outputs a list of strings and may take a list of strings as input, corresponding to the names of input columns from which output column names can be generated. By default input features are named x0, x1, ....
es: Principalmente para :term:`extractores de características`, pero también se utiliza para que otros transformadores proporcionen nombres de cadenas para cada columna en la salida del método :term:`transform` del estimador. Tiene como salida una lista de cadenas y puede tomar una lista de cadenas como entrada, correspondiente a los nombres de las columnas de entrada a partir de las cuales se pueden generar los nombres de las columnas de salida. Por defecto, las características de entrada se denominan x0, x1, ....

source: On a :term:`CV splitter` (not an estimator), returns the number of elements one would get if iterating through the return value of :term:`split` given the same parameters. Takes the same parameters as split.
es: En un :term:`separador de validación cruzada` (no un estimador), devuelve el número de elementos que se obtendría si se iterara a través del valor de retorno de :term:`split` dados los mismos parámetros. Toma los mismos parámetros que split.

source: Gets all :term:`parameters`, and their values, that can be set using :term:`set_params`. A parameter ``deep`` can be used, when set to False to only return those parameters not including ``__``, i.e. not due to indirection via contained estimators.
es: Obtiene todos los :term:`parámetros`, y sus valores, que pueden establecerse utilizando :term:`set_params`. Se puede utilizar un parámetro ``deep``, cuando se establece en False para devolver sólo aquellos parámetros que no incluyan ``__``, es decir, que no se deban a la indirección a través de estimadores contenidos.

source: Most estimators adopt the definition from :class:`base.BaseEstimator`, which simply adopts the parameters defined for ``__init__``. :class:`pipeline.Pipeline`, among others, reimplements ``get_params`` to declare the estimators named in its ``steps`` parameters as themselves being parameters.
es: La mayoría de los estimadores adoptan la definición de :class:`base.BaseEstimator`, que simplemente adopta los parámetros definidos para ``__init__``. :class:`pipeline.Pipeline`, entre otros, reimplementa ``get_params`` para declarar los estimadores nombrados en sus parámetros ``steps`` como parámetros en sí mismos.

source: Facilitates fitting an estimator in an online fashion. Unlike ``fit``, repeatedly calling ``partial_fit`` does not clear the model, but updates it with the data provided. The portion of data provided to ``partial_fit`` may be called a mini-batch. Each mini-batch must be of consistent shape, etc. In iterative estimators, ``partial_fit`` often only performs a single iteration.
es: Facilita el ajuste de un estimador en línea. A diferencia de ``fit``, llamar repetidamente a ``partial_fit`` no borra el modelo, sino que lo actualiza con los datos proporcionados. La porción de datos proporcionada a ``partial_fit`` puede llamarse mini lotes. Cada mini lote debe tener una forma consistente, etc. En los estimadores iterativos, ``partial_fit`` suele realizar una sola iteración.

source: ``partial_fit`` may also be used for :term:`out-of-core` learning, although usually limited to the case where learning can be performed online, i.e. the model is usable after each ``partial_fit`` and there is no separate processing needed to finalize the model. :class:`cluster.Birch` introduces the convention that calling ``partial_fit(X)`` will produce a model that is not finalized, but the model can be finalized by calling ``partial_fit()`` i.e. without passing a further mini-batch.
es: ``partial_fit`` también se puede utilizar para el aprendizaje :term:`out-of-core`, aunque normalmente se limita al caso en que el aprendizaje se puede realizar en línea, es decir, el modelo es utilizable después de cada ``partial_fit`` y no hay ningún procesamiento separado necesario para finalizar el modelo. :class:`cluster.Birch` introduce la convención de que llamar a ``partial_fit(X)`` producirá un modelo que no está finalizado, pero el modelo puede ser finalizado llamando a ``partial_fit()``, es decir, sin pasar un mini lote adicional.

source: Generally, estimator parameters should not be modified between calls to ``partial_fit``, although ``partial_fit`` should validate them as well as the new mini-batch of data. In contrast, ``warm_start`` is used to repeatedly fit the same estimator with the same data but varying parameters.
es: Generalmente, los parámetros del estimador no deben ser modificados entre llamadas a ``partial_fit``, aunque ``partial_fit`` debe validarlos así como el nuevo mini lote de datos. En cambio, ``warm_start`` se utiliza para ajustar repetidamente el mismo estimador con los mismos datos pero variando los parámetros.

source: Like ``fit``, ``partial_fit`` should return the estimator object.
es: Como ``fit``, ``partial_fit`` debe devolver el objeto estimador.

source: To clear the model, a new estimator should be constructed, for instance with :func:`base.clone`.
es: Para borrar el modelo, debe construirse un nuevo estimador, por ejemplo con :func:`base.clone`.

source: NOTE: Using ``partial_fit`` after ``fit`` results in undefined behavior.
es: NOTA: El uso de ``partial_fit`` después de ``fit`` resulta en un comportamiento indefinido.

source: Makes a prediction for each sample, usually only taking :term:`X` as input (but see under regressor output conventions below). In a :term:`classifier` or :term:`regressor`, this prediction is in the same target space used in fitting (e.g. one of {'red', 'amber', 'green'} if the ``y`` in fitting consisted of these strings). Despite this, even when ``y`` passed to :term:`fit` is a list or other array-like, the output of ``predict`` should always be an array or sparse matrix. In a :term:`clusterer` or :term:`outlier detector` the prediction is an integer.
es: Hace una predicción para cada muestra, normalmente sólo tomando :term:`X` como entrada (pero consulta las convenciones de salida del regresor más abajo). En un :term:`clasificador` o :term:`regresor`, esta predicción está en el mismo espacio objetivo utilizado en el ajuste (por ejemplo, uno de {'red', 'amber', 'green'} si el ``y`` en el ajuste consistió en estas cadenas). A pesar de esto, incluso cuando ``y`` pasado a :term:`fit` es una lista u otro array-like, la salida de ``predict`` debe ser siempre un arreglo o matriz dispersa. En un :term:`agrupador` o :term:`detector de valores atípicos` la predicción es un entero.
