Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/governance.po
Languages: es

source: Scikit-learn governance and decision-making
es: La gestión y toma de decisiones en el ámbito de la ciencia

source: The purpose of this document is to formalize the governance process used by the scikit-learn project, to clarify how decisions are made and how the various elements of our community interact. This document establishes a decision-making structure that takes into account feedback from all members of the community and strives to find consensus, while avoiding any deadlocks.
es: El propósito de este documento es formalizar el proceso de gestión utilizado por el proyecto scikit-learning para aclarar cómo se toman las decisiones y cómo interactúan los distintos elementos de nuestra comunidad. Este documento establece una estructura de toma de decisiones que tiene en cuenta la retroalimentación de todos los miembros de la comunidad y se esfuerza por encontrar consenso, evitando cualquier estancamiento.

source: This is a meritocratic, consensus-based community project. Anyone with an interest in the project can join the community, contribute to the project design and participate in the decision making process. This document describes how that participation takes place and how to set about earning merit within the project community.
es: Se trata de un proyecto comunitario meritocrático y basado en el consenso. Cualquiera que tenga interés en el proyecto puede unirse a la comunidad, contribuir al diseño del proyecto y participar en el proceso de toma de decisiones. En este documento se describe cómo se lleva a cabo esa participación y cómo se puede ganar méritos dentro de la comunidad del proyecto.

source: Roles And Responsibilities
es: Roles y responsabilidades

source: Contributors
es: Colaboradores

source: Contributors are community members who contribute in concrete ways to the project. Anyone can become a contributor, and contributions can take many forms – not only code – as detailed in the :ref:`contributors guide <contributing>`.
es: Los colaboradores son miembros de la comunidad que contribuyen de forma concreta al proyecto. Cualquiera puede convertirse en un colaborador, y las contribuciones pueden ser de distinta manera - no sólo programar - como se detalla en la :ref:`contributors guide <contributing>`.

source: Triage team
es: Equipo de prueba

source: The triage team is composed of community members who have permission on github to label and close issues. :ref:`Their work <bug_triaging>` is crucial to improve the communication in the project and limit the crowding of the issue tracker.
es: El equipo de prueba está compuesto por miembros de la comunidad que tienen permiso en github para etiquetar y cerrar incidencias. :ref:`Their work <bug_triaging>` es crucial para mejorar la comunicación en el proyecto y limitar la distribución del seguimiento de incidencias.

source: Similarly to what has been decided in the `python project <https://devguide.python.org/triaging/#becoming-a-member-of-the-python-triage-team>`_, any contributor may become a member of the scikit-learn triage team, after showing some continuity in participating to scikit-learn development (with pull requests and reviews). Any core developer is welcome to propose a scikit-learn contributor to join the triage team. Other core developers are then consulted: while it is expected that most acceptances will be unanimous, a two-thirds majority is enough. Every new triager will be announced in the mailing list. Triagers are welcome to participate in `monthly core developer meetings <https://github.com/scikit-learn/administrative/tree/master/meeting_notes>`_.
es: De manera similar a lo que se ha decidido en el `python project <https://devguide.python.org/triaging/#becoming-a-member-of-the-python-triage-team>`_, cualquier colaborador puede convertirse en un miembro del equipo de prueba de scikit-learn, después de mostrar cierta continuidad en la participación en el desarrollo de scikit-learn (con pull requests y revisiones). Cualquier desarrollador principal es bienvenido a proponer a un colaborador de scikit-learn para unirse al equipo de prueba. A continuación, se consulta a otros desarrolladores del núcleo: si bien se espera que la mayoría de las aceptaciones sean unánimes, una mayoría de dos tercios es suficiente. Cada nuevo participante será anunciado en la lista de correo y son bienvenidos a participar en `monthly core developer meetings <https://github.com/scikit-learn/administrative/tree/master/meeting_notes>`_.

source: Core developers
es: Desarrolladores principales

source: Core developers are community members who have shown that they are dedicated to the continued development of the project through ongoing engagement with the community. They have shown they can be trusted to maintain scikit-learn with care. Being a core developer allows contributors to more easily carry on with their project related activities by giving them direct access to the project’s repository and is represented as being an organization member on the scikit-learn `GitHub organization <https://github.com/orgs/scikit-learn/people>`_. Core developers are expected to review code contributions, can merge approved pull requests, can cast votes for and against merging a pull-request, and can be involved in deciding major changes to the API.
es: Los desarrolladores principales o centrales son miembros de la comunidad que han demostrado que están dedicados al desarrollo continuo del proyecto a través del compromiso continuo con la comunidad. Han demostrado que se puede confiar en ellos para mantener scikit-learn cuidadosamente. Ser un desarrollador principal permite a los contribuyentes continuar más fácilmente con sus actividades relacionadas con el proyecto, dándoles acceso directo al repositorio del proyecto y se representa como un miembro de scikit-learn `GitHub organization <https://github.com/orgs/scikit-learn/people>`_. Se espera que los desarrolladores principales revisen las contribuciones de código, puedan combinar solicitudes de extracción aprobadas, puede emitir votos a favor y en contra de la fusión de una solicitud "pull", y puede participar en la decisión de cambios importantes en la API.

source: New core developers can be nominated by any existing core developers. Once they have been nominated, there will be a vote by the current core developers. Voting on new core developers is one of the few activities that takes place on the project's private management list. While it is expected that most votes will be unanimous, a two-thirds majority of the cast votes is enough. The vote needs to be open for at least 1 week.
es: Los nuevos desarrolladores principales o centrales pueden ser nominados por cualquier desarrollador principal existente. Una vez que hayan sido nominados, habrá una votación de los desarrolladores centrales actuales. Votar sobre nuevos desarrolladores centrales es una de las pocas actividades que tiene lugar en la lista de administración privada del proyecto. Si bien se espera que la mayoría de los votos sean unánimes, una mayoría de dos tercios de los votos emitidos es suficiente. La votación debe estar abierta al menos durante una semana.

source: Core developers that have not contributed to the project (commits or GitHub comments) in the past 12 months will be asked if they want to become emeritus core developers and recant their commit and voting rights until they become active again. The list of core developers, active and emeritus (with dates at which they became active) is public on the scikit-learn website.
es: A los desarrolladores principales que no han contribuido al proyecto (commits o comentarios de GitHub) en los últimos 12 meses se les preguntará si quieren convertirse en desarrolladores centrales eméritos y revertir sus derechos de compromiso y voto hasta que vuelvan a estar activos. La lista de desarrolladores principales, activos y emérito (con fechas en las que se hicieron activos) es pública en el sitio web de scikit-learn.

source: Technical Committee
es: Comité técnico

source: The Technical Committee (TC) members are core developers who have additional responsibilities to ensure the smooth running of the project. TC members are expected to participate in strategic planning, and approve changes to the governance model. The purpose of the TC is to ensure a smooth progress from the big-picture perspective. Indeed changes that impact the full project require a synthetic analysis and a consensus that is both explicit and informed. In cases that the core developer community (which includes the TC members) fails to reach such a consensus in the required time frame, the TC is the entity to resolve the issue. Membership of the TC is by nomination by a core developer. A nomination will result in discussion which cannot take more than a month and then a vote by the core developers which will stay open for a week. TC membership votes are subject to a two-third majority of all cast votes as well as a simple majority approval of all the current TC members. TC members who do not actively engage with the TC duties are expected to resign.
es: Los miembros del Comité Técnico (CT) son desarrolladores principales que tienen responsabilidades adicionales para asegurar el buen funcionamiento del proyecto. Se espera que los miembros del CT participen en la planificación estratégica y aprueben cambios en el modelo de gestión. El objetivo del CT es asegurar un progreso sin problemas desde la perspectiva del panorama general. De hecho, los cambios que afectan al proyecto completo requieren un análisis sintético y un consenso que sea explícito e informado. En los casos en que la comunidad principal de desarrolladores (que incluye a los miembros de CT) no logra alcanzar tal consenso en el marco de tiempo requerido, el CT es la entidad para resolver el problema. La membresía de la CT es por nominación de un desarrollador central. Una nominación dará lugar a un debate que no puede durar más de un mes y después a una votación de los desarrolladores principales que permanecerá abierta durante una semana. Los votos de membresía de CT están sujetos a una mayoría de dos tercios de todos los votos emitidos así como a una aprobación por mayoría simple de todos los miembros actuales del CT. Los miembros del CT que no se comprometan activamente con las tareas del CT deberán renunciar.

source: The Technical Committee of scikit-learn consists of :user:`Alexandre Gramfort <agramfort>`, :user:`Olivier Grisel <ogrisel>`, :user:`Adrin Jalali <adrinjalali>`, :user:`Andreas Müller <amueller>`, :user:`Joel Nothman <jnothman>`, :user:`Hanmin Qin <qinhanmin2014>`, :user:`Gaël Varoquaux <GaelVaroquaux>`, and :user:`Roman Yurchak <rth>`.
es: El Comité Técnico de scikit-learn consiste en :user:`Alexandre Gramfort <agramfort>`, :user:`Olivier Grisel <ogrisel>`, :user:`Adrin Jalali <adrinjalali>`, :user:`Andreas Muckller <amueller>`, :user:`Joel Nothman <jnothman>`, :user:`Hanmin Qin <qinhanmin2014>`, :user:`Gae.Ul Varoquaux <GaelVaroquaux>`, y :user:`Roman Yurchak <rth>`.

source: Decision Making Process
es: Proceso de toma de decisiones

source: Decisions about the future of the project are made through discussion with all members of the community. All non-sensitive project management discussion takes place on the project contributors’ `mailing list <mailto:scikit-learn@python.org>`_ and the `issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_. Occasionally, sensitive discussion occurs on a private list.
es: Las decisiones sobre el futuro del proyecto se toman a través de discusiones con todos los miembros de la comunidad. Todos los debates no sensibles sobre la gestión del proyecto tienen lugar en los colaboradores del proyecto `lista de correo de los colaboradores del proyecto <mailto:scikit-learn@python.org>`_ y el `issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_. Ocasionalmente, las discusiones sensibles tienen lugar en una lista privada.

source: Scikit-learn uses a "consensus seeking" process for making decisions. The group tries to find a resolution that has no open objections among core developers. At any point during the discussion, any core-developer can call for a vote, which will conclude one month from the call for the vote. Any vote must be backed by a :ref:`SLEP <slep>`. If no option can gather two thirds of the votes cast, the decision is escalated to the TC, which in turn will use consensus seeking with the fallback option of a simple majority vote if no consensus can be found within a month. This is what we hereafter may refer to as “the decision making process”.
es: Scikit-learn utiliza un proceso de "búsqueda de consenso" para la toma de decisiones. El grupo trata de encontrar una resolución que no tenga objeciones abiertas entre los desarrolladores principales. En cualquier momento durante la discusión, cualquier desarrollador central puede pedir una votación, que concluirá un mes después de la convocatoria de votación. Cualquier voto debe estar respaldado por un :ref:`SLEP <slep>`. Si ninguna opción puede reunir dos tercios de los votos emitidos, la decisión es escalada al CT, que, a su vez, utilizará el consenso que busca con la opción de una votación por mayoría simple si no se puede alcanzar un consenso dentro de un mes. Esto es lo que aquí podemos llamar “proceso de toma de decisiones”.

source: Decisions (in addition to adding core developers and TC membership as above) are made according to the following rules:
es: Las decisiones (además de añadir a los desarrolladores del núcleo y a los miembros del CT, como se ha indicado anteriormente) se toman de acuerdo con las siguientes reglas:

source: **Minor Documentation changes**, such as typo fixes, or addition / correction of a sentence, but no change of the scikit-learn.org landing page or the “about” page: Requires +1 by a core developer, no -1 by a core developer (lazy consensus), happens on the issue or pull request page. Core developers are expected to give “reasonable time” to others to give their opinion on the pull request if they’re not confident others would agree.
es: **Cambios menores en la documentación**, como correcciones de errores tipográficos o adición/corrección de una frase, pero ningún cambio en la página de inicio de scikit-learn.org o en la página "about": Requiere +1 por un desarrollador principal, no -1 por un desarrollador principal (consenso vago), sucede en la página de la edición o pull request. Se espera que los desarrolladores principales den un "tiempo razonable" a los demás para dar su opinión sobre el pull request si no están seguros de que los demás estén de acuerdo.

source: **Code changes and major documentation changes** require +1 by two core developers, no -1 by a core developer (lazy consensus), happens on the issue of pull-request page.
es: **Los cambios de código y los cambios importantes en la documentación** requieren +1 por parte de dos desarrolladores principales, no -1 por parte de un desarrollador principal (consenso vago), sucede en el issue de la página de pull-request.

source: **Changes to the API principles and changes to dependencies or supported versions** happen via a :ref:`slep` and follows the decision-making process outlined above.
es: **Cambia los principios de la API y los cambios a las dependencias o versiones soportadas** ocurren a través de un :ref:`slep` y sigue el proceso de toma de decisiones descrito arriba.

source: **Changes to the governance model** use the same decision process outlined above.
es: **Los cambios en el modelo de gestión** utilizan el mismo proceso de decisión descrito anteriormente.

source: If a veto -1 vote is cast on a lazy consensus, the proposer can appeal to the community and core developers and the change can be approved or rejected using the decision making procedure outlined above.
es: Si se vetara -1 voto por un consenso vago, el que lo propone puede apelar a la comunidad y a los desarrolladores principales y el cambio puede ser aprobado o rechazado utilizando el procedimiento de toma de decisiones descrito anteriormente.

source: Enhancement proposals (SLEPs)
es: Propuestas de mejora (SLEPs)

source: For all votes, a proposal must have been made public and discussed before the vote. Such proposal must be a consolidated document, in the form of a ‘Scikit-Learn Enhancement Proposal’ (SLEP), rather than a long discussion on an issue. A SLEP must be submitted as a pull-request to `enhancement proposals <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ using the `SLEP template <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_.
es: Para todas las votaciones, debe haberse hecho pública una propuesta y debatirse antes de la votación. Dicha propuesta debe ser un documento consolidado, en forma de `Scikit-Learn Enhancement Proposal' (SLEP, por sus siglas en inglés), en lugar de una larga discusión sobre una cuestión. Un SLEP debe ser enviado como un pull-request para `enhancement proposals <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ usando el `SLEP template <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_.
