Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/presentations.po
Languages: es

source: External Resources, Videos and Talks
es: Recursos externos, vídeos y charlas

source: For written tutorials, see the :ref:`Tutorial section <tutorial_menu>` of the documentation.
es: Para los tutoriales escritos, consulta la sección :ref:`Tutorial section <tutorial_menu>` de la documentación.

source: New to Scientific Python?
es: ¿Nuevo en Python científico?

source: For those that are still new to the scientific Python ecosystem, we highly recommend the `Python Scientific Lecture Notes <https://www.scipy-lectures.org/>`_. This will help you find your footing a bit and will definitely improve your scikit-learn experience. A basic understanding of NumPy arrays is recommended to make the most of scikit-learn.
es: Para aquellos que todavía son nuevos en el ecosistema científico de Python, recomendamos encarecidamente el `Python Scientific Lecture Notes <https://www.scipy-lectures.org/>`_. Esto le ayudará a encontrar su pie un poco y sin duda mejorará su experiencia scikit-learn. Se recomienda una comprensión básica de las matrices NumPy para sacar el máximo provecho de scikit-learn.

source: External Tutorials
es: Tutoriales Externos

source: There are several online tutorials available which are geared toward specific subject areas:
es: Existen varios tutoriales en línea orientados a temas específicos:

source: An introduction to scikit-learn `Part I <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=107>`_ and `Part II <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=111>`_ at Scipy 2013 by `Gael Varoquaux`_, `Jake Vanderplas`_ and `Olivier Grisel`_. Notebooks on `github <https://github.com/jakevdp/sklearn_scipy2013>`_.
es: Una introducción a scikit-learn `Parte I <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=107>`_ y `Parte II <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=111>`_ en Scipy 2013 por `Gael Varoquaux`_, `Jake Vanderplas`_ y `Olivier Grisel`_. Cuadernos en `github <https://github.com/jakevdp/sklearn_scipy2013>`_.

source: `Introduction to scikit-learn <http://videolectures.net/icml2010_varaquaux_scik/>`_ by `Gael Varoquaux`_ at ICML 2010
es: `Introduction to scikit-learn <http://videolectures.net/icml2010_varaquaux_scik/>`_ por `Gael Varoquaux`_ en el ICML 2010

source: A three minute video from a very early stage of scikit-learn, explaining the basic idea and approach we are following.
es: Un video de tres minutos de una etapa muy temprana de scikit-learn, explicando la idea básica y el enfoque que estamos siguiendo.

source: `Introduction to statistical learning with scikit-learn <https://archive.org/search.php?query=scikit-learn>`_ by `Gael Varoquaux`_ at SciPy 2011
es: `Introduction to statistical learning with scikit-learn <https://archive.org/search.php?query=scikit-learn>`_ por `Gael Varoquaux`_ en SciPy 2011

source: An extensive tutorial, consisting of four sessions of one hour. The tutorial covers the basics of machine learning, many algorithms and how to apply them using scikit-learn. The material corresponding is now in the scikit-learn documentation section :ref:`stat_learn_tut_index`.
es: Un extenso tutorial, que consta de cuatro sesiones de una hora. El tutorial cubre los fundamentos del aprendizaje automático, muchos algoritmos y cómo aplicarlos usando scikit-learn. El material correspondiente está ahora en la sección de documentación de scikit-learn :ref:`stat_learn_tut_index`.

source: `Statistical Learning for Text Classification with scikit-learn and NLTK <https://pyvideo.org/video/417/pycon-2011--statistical-machine-learning-for-text>`_ (and `slides <https://www.slideshare.net/ogrisel/statistical-machine-learning-for-text-classification-with-scikitlearn-and-nltk>`_) by `Olivier Grisel`_ at PyCon 2011
es: `Statistical Learning for Text Classification with scikit-learn and NLTK <https://pyvideo.org/video/417/pycon-2011--statistical-machine-learning-for-text>`_ (y `slides <https://www.slideshare.net/ogrisel/statistical-machine-learning-for-text-classification-with-scikitlearn-and-nltk>`_) por `Olivier Grisel`_ en PyCon 2011

source: Thirty minute introduction to text classification. Explains how to use NLTK and scikit-learn to solve real-world text classification tasks and compares against cloud-based solutions.
es: Introducción de treinta minutos a la clasificación de textos. Explica cómo utilizar NLTK y scikit-learn para resolver tareas de clasificación de textos del mundo real y las compara con soluciones basadas en la nube.

source: `Introduction to Interactive Predictive Analytics in Python with scikit-learn <https://www.youtube.com/watch?v=Zd5dfooZWG4>`_ by `Olivier Grisel`_ at PyCon 2012
es: `Introduction to Interactive Predictive Analytics in Python with scikit-learn <https://www.youtube.com/watch?v=Zd5dfooZWG4>`_ por `Olivier Grisel`_ en PyCon 2012

source: 3-hours long introduction to prediction tasks using scikit-learn.
es: Introducción de 3 horas a las tareas de predicción con scikit-learn.

source: `scikit-learn - Machine Learning in Python <https://newcircle.com/s/post/1152/scikit-learn_machine_learning_in_python>`_ by `Jake Vanderplas`_ at the 2012 PyData workshop at Google
es: `scikit-learn - Machine Learning in Python <https://newcircle.com/s/post/1152/scikit-learn_machine_learning_in_python>`_ por `Jake Vanderplas`_ en el taller PyData 2012 en Google

source: Interactive demonstration of some scikit-learn features. 75 minutes.
es: Demostración interactiva de algunas características de scikit-learn. 75 minutos.

source: `scikit-learn tutorial <https://www.youtube.com/watch?v=cHZONQ2-x7I>`_ by `Jake Vanderplas`_ at PyData NYC 2012
es: `scikit-learn tutorial <https://www.youtube.com/watch?v=cHZONQ2-x7I>`_ por `Jake Vanderplas`_ en PyData NYC 2012

source: Presentation using the online tutorial, 45 minutes.
es: Presentación utilizando el tutorial en línea, 45 minutos.
