Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/related_projects.po
Languages: es

source: `Seaborn <https://stanford.edu/~mwaskom/software/seaborn/>`_ Visualization library based on matplotlib. It provides a high-level interface for drawing attractive statistical graphics.
es: `Seaborn <https://stanford.edu/~mwaskom/software/seaborn/>`_ Biblioteca de visualización basada en matplotlib. Proporciona una interfaz de alto nivel para diseñar atractivos gráficos estadísticos.

source: Recommendation Engine packages
es: Paquetes de motores de recomendación

source: `implicit <https://github.com/benfred/implicit>`_, Library for implicit feedback datasets.
es: `implicit <https://github.com/benfred/implicit>`_, Biblioteca para conjuntos de datos de retroalimentación implícita.

source: `lightfm <https://github.com/lyst/lightfm>`_ A Python/Cython implementation of a hybrid recommender system.
es: `lightfm <https://github.com/lyst/lightfm>`_ Una implementación en Python/Cython de un sistema de recomendación híbrido.

source: `OpenRec <https://github.com/ylongqi/openrec>`_ TensorFlow-based neural-network inspired recommendation algorithms.
es: `OpenRec <https://github.com/ylongqi/openrec>`_ Algoritmos de recomendación inspirados en redes neuronales basados en TensorFlow.

source: `Spotlight <https://github.com/maciejkula/spotlight>`_ Pytorch-based implementation of deep recommender models.
es: `Spotlight <https://github.com/maciejkula/spotlight>`_ Implementación basada en Pytorch de modelos de recomendación profunda.

source: `Surprise Lib <http://surpriselib.com/>`_ Library for explicit feedback datasets.
es: `Surprise Lib <http://surpriselib.com/>`_ Biblioteca para conjuntos de datos de retroalimentación explícita.

source: Domain specific packages
es: Paquetes específicos de dominio

source: `scikit-image <https://scikit-image.org/>`_ Image processing and computer vision in python.
es: `scikit-image <https://scikit-image.org/>`_ Procesamiento de imágenes y visión por computadora en python.

source: `Natural language toolkit (nltk) <https://www.nltk.org/>`_ Natural language processing and some machine learning.
es: `Natural language toolkit (nltk) <https://www.nltk.org/>`_ Procesamiento del lenguaje natural y algo de aprendizaje automático.

source: `gensim <https://radimrehurek.com/gensim/>`_ A library for topic modelling, document indexing and similarity retrieval
es: `gensim <https://radimrehurek.com/gensim/>`_ Una biblioteca para el modelado de temas, la indexación de documentos y la recuperación de similitudes

source: `NiLearn <https://nilearn.github.io/>`_ Machine learning for neuro-imaging.
es: `NiLearn <https://nilearn.github.io/>`_ Aprendizaje automático para la neuroimagen.

source: `AstroML <https://www.astroml.org/>`_ Machine learning for astronomy.
es: `AstroML <https://www.astroml.org/>`_ Aprendizaje automático para la astronomía.

source: `MSMBuilder <http://msmbuilder.org/>`_ Machine learning for protein conformational dynamics time series.
es: `MSMBuilder <http://msmbuilder.org/>`_ Aprendizaje automático para series temporales de dinámica conformacional de proteínas.
