Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/related_projects.po
Languages: es

source: Related Projects
es: Proyectos Relacionados

source: Projects implementing the scikit-learn estimator API are encouraged to use the `scikit-learn-contrib template <https://github.com/scikit-learn-contrib/project-template>`_ which facilitates best practices for testing and documenting estimators. The `scikit-learn-contrib GitHub organisation <https://github.com/scikit-learn-contrib/scikit-learn-contrib>`_ also accepts high-quality contributions of repositories conforming to this template.
es: Se anima a los proyectos que implementan la API del estimador de scikit-learn a utilizar `scikit-learn-contrib template <https://github.com/scikit-learn-contrib/project-template>`_ que facilita las mejores prácticas para probar y documentar los estimadores. La `scikit-learn-contrib GitHub organisation <https://github.com/scikit-learn-contrib/scikit-learn-contrib>`_ también acepta contribuciones de alta calidad de los repositorios que se ajustan a esta plantilla.

source: Below is a list of sister-projects, extensions and domain specific packages.
es: A continuación se muestra una lista de proyectos relacionados, extensiones y paquetes específicos de dominio.

source: Interoperability and framework enhancements
es: Mejoras en la interoperabilidad y el marco de trabajo

source: These tools adapt scikit-learn for use with other technologies or otherwise enhance the functionality of scikit-learn's estimators.
es: Estas herramientas adaptan scikit-learn para su uso con otras tecnologías o mejoran la funcionalidad de los estimadores de scikit-learn.

source: **Data formats**
es: Formatos de datos

source: `Fast svmlight / libsvm file loader <https://github.com/mblondel/svmlight-loader>`_ Fast and memory-efficient svmlight / libsvm file loader for Python.
es: `Fast svmlight / libsvm file loader <https://github.com/mblondel/svmlight-loader>`_ Cargador de archivos svmlight / libsvm rápido y eficiente en memoria para Python.

source: `sklearn_pandas <https://github.com/paulgb/sklearn-pandas/>`_ bridge for scikit-learn pipelines and pandas data frame with dedicated transformers.
es: `sklearn_pandas <https://github.com/paulgb/sklearn-pandas/>`_ puente para pipelines scikit-learn y pandas data frame con transformadores dedicados.

source: `sklearn_xarray <https://github.com/phausamann/sklearn-xarray/>`_ provides compatibility of scikit-learn estimators with xarray data structures.
es: `sklearn_xarray <https://github.com/phausamann/sklearn-xarray/>`_ proporciona compatibilidad de los estimadores de scikit-learn con las estructuras de datos xarray.

source: `auto-sklearn <https://github.com/automl/auto-sklearn/>`_ An automated machine learning toolkit and a drop-in replacement for a scikit-learn estimator
es: `auto-sklearn <https://github.com/automl/auto-sklearn/>`_ Un conjunto de herramientas de aprendizaje automático y un sustituto de un estimador de scikit-learn

source: `autoviml <https://github.com/AutoViML/Auto_ViML/>`_ Automatically Build Multiple Machine Learning Models with a Single Line of Code. Designed as a faster way to use scikit-learn models without having to preprocess data.
es: `autoviml <https://github.com/AutoViML/Auto_ViML/>`_ Construye automáticamente múltiples modelos de aprendizaje automático con una sola línea de código. Diseñado como una forma más rápida de utilizar los modelos de scikit-learn sin tener que preprocesar los datos.

source: `TPOT <https://github.com/rhiever/tpot>`_ An automated machine learning toolkit that optimizes a series of scikit-learn operators to design a machine learning pipeline, including data and feature preprocessors as well as the estimators. Works as a drop-in replacement for a scikit-learn estimator.
es: `TPOT <https://github.com/rhiever/tpot>`_ Un kit de herramientas de aprendizaje automático que optimiza una serie de operadores de scikit-learn para diseñar un pipeline de aprendizaje automático, incluyendo los preprocesadores de datos y características, así como los estimadores. Funciona como un reemplazo de un estimador de scikit-learn.

source: `Featuretools <https://github.com/FeatureLabs/featuretools>`_ A framework to perform automated feature engineering. It can be used for transforming temporal and relational datasets into feature matrices for machine learning.
es: `Featuretools<https://github.com/FeatureLabs/featuretools>`_ Un marco para realizar ingeniería de características automatizada. Puede utilizarse para transformar conjuntos de datos temporales y relacionales en matrices de características para el aprendizaje automático.

source: `Neuraxle <https://github.com/Neuraxio/Neuraxle>`_ A library for building neat pipelines, providing the right abstractions to both ease research, development, and deployment of machine learning applications. Compatible with deep learning frameworks and scikit-learn API, it can stream minibatches, use data checkpoints, build funky pipelines, and serialize models with custom per-step savers.
es: `Neuraxle <https://github.com/Neuraxio/Neuraxle>`_ Una biblioteca para la construcción de pipelines, proporcionando las abstracciones adecuadas para facilitar la investigación, el desarrollo y el despliegue de aplicaciones de aprendizaje automático. Compatible con los marcos de aprendizaje profundo y la API de scikit-learn, puede transmitir minilotes, utilizar puntos de control de datos, construir pipelines complejos y serializar modelos con ahorradores personalizados por paso.

source: **Experimentation frameworks**
es: **Marcos de experimentación**

source: `REP <https://github.com/yandex/REP>`_ Environment for conducting data-driven research in a consistent and reproducible way
es: `REP <https://github.com/yandex/REP>`_ Entorno para realizar investigaciones basadas en datos de forma coherente y reproducible

source: `Scikit-Learn Laboratory <https://skll.readthedocs.io/en/latest/index.html>`_ A command-line wrapper around scikit-learn that makes it easy to run machine learning experiments with multiple learners and large feature sets.
es: `Scikit-Learn Laboratory <https://skll.readthedocs.io/en/latest/index.html>`_ Un envoltorio de línea de comandos alrededor de scikit-learn que facilita la ejecución de experimentos de aprendizaje automático con múltiples aprendices y grandes conjuntos de características.

source: **Model inspection and visualisation**
es: **Inspección y visualización del modelo**

source: `dtreeviz <https://github.com/parrt/dtreeviz/>`_ A python library for decision tree visualization and model interpretation.
es: `dtreeviz <https://github.com/parrt/dtreeviz/>`_ Una biblioteca python para la visualización del árbol de decisiones y la interpretación de modelos.

source: `eli5 <https://github.com/TeamHG-Memex/eli5/>`_ A library for debugging/inspecting machine learning models and explaining their predictions.
es: `eli5 <https://github.com/TeamHG-Memex/eli5/>`_ Una biblioteca para depurar/inspeccionar modelos de aprendizaje automático y explicar sus predicciones.

source: `mlxtend <https://github.com/rasbt/mlxtend>`_ Includes model visualization utilities.
es: `mlxtend <https://github.com/rasbt/mlxtend>`_ Incluye utilidades de visualización de modelos.

source: `yellowbrick <https://github.com/DistrictDataLabs/yellowbrick>`_ A suite of custom matplotlib visualizers for scikit-learn estimators to support visual feature analysis, model selection, evaluation, and diagnostics.
es: `yellowbrick <https://github.com/DistrictDataLabs/yellowbrick>`_ Un conjunto de visualizadores personalizados de matplotlib para estimadores de scikit-learn para apoyar el análisis visual de características, la selección de modelos, la evaluación y el diagnóstico.

source: **Model selection**
es: **Selección del modelo**

source: `scikit-optimize <https://scikit-optimize.github.io/>`_ A library to minimize (very) expensive and noisy black-box functions. It implements several methods for sequential model-based optimization, and includes a replacement for ``GridSearchCV`` or ``RandomizedSearchCV`` to do cross-validated parameter search using any of these strategies.
es: `scikit-optimize <https://scikit-optimize.github.io/>`_ Una biblioteca para minimizar funciones de caja negra (muy) costosas y ruidosas. Implementa varios métodos para la optimización secuencial basada en modelos, e incluye un reemplazo para ``GridSearchCV`` o ``RandomizedSearchCV`` para hacer una búsqueda de parámetros validada en paralelo usando cualquiera de estas estrategias.

source: `sklearn-deap <https://github.com/rsteca/sklearn-deap>`_ Use evolutionary
es: `sklearn-deap <https://github.com/rsteca/sklearn-deap>`_ Uso evolutivo

source: algorithms instead of gridsearch in scikit-learn.
es: algoritmos en lugar de búsqueda exhaustiva en scikit-learn.

source: **Model export for production**
es: **Exportar modelos para producción**

source: `onnxmltools <https://github.com/onnx/onnxmltools>`_ Serializes many Scikit-learn pipelines to `ONNX <https://onnx.ai/>`_ for interchange and prediction.
es: `onnxmltools <https://github.com/onnx/onnxmltools>`_ Serializa muchos pipelines de Scikit-learn a `ONNX <https://onnx.ai/>`_ para su intercambio y predicción.

source: `sklearn2pmml <https://github.com/jpmml/sklearn2pmml>`_ Serialization of a wide variety of scikit-learn estimators and transformers into PMML with the help of `JPMML-SkLearn <https://github.com/jpmml/jpmml-sklearn>`_ library.
es: `sklearn2pmml <https://github.com/jpmml/sklearn2pmml>`_ Serialización de una amplia variedad de estimadores y transformadores de scikit-learn en PMML con la ayuda de la biblioteca `JPMML-SkLearn <https://github.com/jpmml/jpmml-sklearn>`_.

source: `sklearn-porter <https://github.com/nok/sklearn-porter>`_ Transpile trained scikit-learn models to C, Java, Javascript and others.
es: `sklearn-porter <https://github.com/nok/sklearn-porter>`_ Transpila modelos entrenados de scikit-learn a C, Java, Javascript y otros.

source: `treelite <https://treelite.readthedocs.io>`_ Compiles tree-based ensemble models into C code for minimizing prediction latency.
es: `treelite <https://treelite.readthedocs.io>`_ Compila modelos de conjuntos basados en árboles en código C para minimizar la latencia de la predicción.

source: Other estimators and tasks
es: Otros estimadores y tareas

source: Not everything belongs or is mature enough for the central scikit-learn project. The following are projects providing interfaces similar to scikit-learn for additional learning algorithms, infrastructures and tasks.
es: No todo pertenece o está lo suficientemente avanzado para el proyecto central scikit-learn. Los siguientes son proyectos que proporcionan interfaces similares a scikit-learn para algoritmos de aprendizaje, infraestructuras y tareas adicionales.

source: **Structured learning**
es: **Aprendizaje estructurado**

source: `tslearn <https://github.com/tslearn-team/tslearn>`_ A machine learning library for time series that offers tools for pre-processing and feature extraction as well as dedicated models for clustering, classification and regression.
es: `tslearn <https://github.com/tslearn-team/tslearn>`_ Una biblioteca de aprendizaje automático para series temporales que ofrece herramientas para el preprocesamiento y la extracción de características, así como modelos dedicados para la conglomeración, la clasificación y la regresión.

source: `sktime <https://github.com/alan-turing-institute/sktime>`_ A scikit-learn compatible toolbox for machine learning with time series including time series classification/regression and (supervised/panel) forecasting.
es: `sktime <https://github.com/alan-turing-institute/sktime>`_ Una caja de herramientas compatible con scikit-learn para el aprendizaje automático con series temporales, incluyendo la clasificación/regresión de series temporales y la previsión (supervisada/panel).

source: `HMMLearn <https://github.com/hmmlearn/hmmlearn>`_ Implementation of hidden markov models that was previously part of scikit-learn.
es: `HMMLearn <https://github.com/hmmlearn/hmmlearn>`_ Implementación de modelos ocultos de markov que anteriormente formaban parte de scikit-learn.

source: `PyStruct <https://pystruct.github.io>`_ General conditional random fields and structured prediction.
es: `PyStruct <https://pystruct.github.io>`_ Campos aleatorios condicionales generales y predicción estructurada.

source: `pomegranate <https://github.com/jmschrei/pomegranate>`_ Probabilistic modelling for Python, with an emphasis on hidden Markov models.
es: `pomegranate <https://github.com/jmschrei/pomegranate>`_ Modelización probabilística para Python, con énfasis en los modelos de Markov ocultos.

source: `sklearn-crfsuite <https://github.com/TeamHG-Memex/sklearn-crfsuite>`_ Linear-chain conditional random fields (`CRFsuite <http://www.chokkan.org/software/crfsuite/>`_ wrapper with sklearn-like API).
es: `sklearn-crfsuite <https://github.com/TeamHG-Memex/sklearn-crfsuite>`_ Campos aleatorios condicionales de cadena lineal (`CRFsuite <http://www.chokkan.org/software/crfsuite/>`_ wrapper con API tipo sklearn).

source: **Deep neural networks etc.**
es: **Redes neuronales profundas, etc.**

source: `nolearn <https://github.com/dnouri/nolearn>`_ A number of wrappers and abstractions around existing neural network libraries
es: `nolearn <https://github.com/dnouri/nolearn>`_ Una serie de envoltorios y abstracciones alrededor de las bibliotecas de redes neuronales existentes

source: `keras <https://github.com/fchollet/keras>`_ Deep Learning library capable of running on top of either TensorFlow or Theano.
es: `keras <https://github.com/fchollet/keras>`_ Biblioteca de aprendizaje profundo capaz de funcionar sobre TensorFlow o Theano.

source: `lasagne <https://github.com/Lasagne/Lasagne>`_ A lightweight library to build and train neural networks in Theano.
es: `lasagne <https://github.com/Lasagne/Lasagne>`_ Una biblioteca ligera para construir y entrenar redes neuronales en Theano.

source: `skorch <https://github.com/dnouri/skorch>`_ A scikit-learn compatible neural network library that wraps PyTorch.
es: `skorch <https://github.com/dnouri/skorch>`_ Una biblioteca de redes neuronales compatible con scikit-learn que envuelve a PyTorch.

source: **Broad scope**
es: **Amplio alcance**

source: `mlxtend <https://github.com/rasbt/mlxtend>`_ Includes a number of additional estimators as well as model visualization utilities.
es: `mlxtend <https://github.com/rasbt/mlxtend>`_ Incluye una serie de estimadores adicionales así como utilidades de visualización del modelo.

source: `scikit-lego <https://github.com/koaning/scikit-lego>`_ A number of scikit-learn compatible custom transformers, models and metrics, focusing on solving practical industry tasks.
es: `scikit-lego <https://github.com/koaning/scikit-lego>`_ Una serie de transformadores, modelos y métricas personalizados compatibles con scikit-learn, centrados en la resolución de tareas prácticas de la industria.

source: **Other regression and classification**
es: **Otros tipos de regresión y clasificación**

source: `xgboost <https://github.com/dmlc/xgboost>`_ Optimised gradient boosted decision tree library.
es: `xgboost <https://github.com/dmlc/xgboost>`_ Librería optimizada de árboles de decisión con gradiente.

source: `ML-Ensemble <https://mlens.readthedocs.io/>`_ Generalized ensemble learning (stacking, blending, subsemble, deep ensembles, etc.).
es: `ML-Ensemble <https://mlens.readthedocs.io/>`_ Aprendizaje de conjuntos generalizado (apilamiento, mezcla, subconjunto, conjuntos profundos, etc.).

source: `lightning <https://github.com/scikit-learn-contrib/lightning>`_ Fast state-of-the-art linear model solvers (SDCA, AdaGrad, SVRG, SAG, etc...).
es: `lightning <https://github.com/scikit-learn-contrib/lightning>`_ Rápidos solucionadores de modelos lineales de última generación (SDCA, AdaGrad, SVRG, SAG, etc...).

source: `py-earth <https://github.com/scikit-learn-contrib/py-earth>`_ Multivariate adaptive regression splines
es: `py-earth <https://github.com/scikit-learn-contrib/py-earth>`_ Splines de regresión adaptativa multivariante

source: `Kernel Regression <https://github.com/jmetzen/kernel_regression>`_ Implementation of Nadaraya-Watson kernel regression with automatic bandwidth selection
es: `Regresión kernel <https://github.com/jmetzen/kernel_regression>`_ Implementación de la regresión kernel de Nadaraya-Watson con selección automática del ancho de banda

source: `gplearn <https://github.com/trevorstephens/gplearn>`_ Genetic Programming for symbolic regression tasks.
es: `gplearn <https://github.com/trevorstephens/gplearn>`_ Programación genética para tareas de regresión simbólica.

source: `scikit-multilearn <https://github.com/scikit-multilearn/scikit-multilearn>`_ Multi-label classification with focus on label space manipulation.
es: `scikit-multilearn <https://github.com/scikit-multilearn/scikit-multilearn>`_ Clasificación multietiqueta con enfoque en la manipulación del espacio de etiquetas.

source: `seglearn <https://github.com/dmbee/seglearn>`_ Time series and sequence learning using sliding window segmentation.
es: `seglearn <https://github.com/dmbee/seglearn>`_ Aprendizaje de series temporales y secuencias mediante segmentación de ventanas deslizantes.

source: `libOPF <https://github.com/jppbsi/LibOPF>`_ Optimal path forest classifier
es: `libOPF <https://github.com/jppbsi/LibOPF>`_ Clasificador de bosque de rutas óptimas

source: `fastFM <https://github.com/ibayer/fastFM>`_ Fast factorization machine implementation compatible with scikit-learn
es: `fastFM <https://github.com/ibayer/fastFM>`_ Implementación de la máquina de factorización rápida compatible con scikit-learn

source: **Decomposition and clustering**
es: **Descomposición y conglomeración**

source: `lda <https://github.com/lda-project/lda/>`_: Fast implementation of latent Dirichlet allocation in Cython which uses `Gibbs sampling <https://en.wikipedia.org/wiki/Gibbs_sampling>`_ to sample from the true posterior distribution. (scikit-learn's :class:`~sklearn.decomposition.LatentDirichletAllocation` implementation uses `variational inference <https://en.wikipedia.org/wiki/Variational_Bayesian_methods>`_ to sample from a tractable approximation of a topic model's posterior distribution.)
es: `lda <https://github.com/lda-project/lda/>`_: Implementación rápida de la asignación de Dirichlet latente en Cython que utiliza el `Gibbs sampling <https://en.wikipedia.org/wiki/Gibbs_sampling>`_ para tomar muestras de la verdadera distribución posterior. (scikit-learn's :class:`~sklearn.decomposition.LatentDirichletAllocation` implementation uses `variational inference <https://en.wikipedia.org/wiki/Variational_Bayesian_methods>`_ para muestrear desde una aproximación trazable de la distribución posterior de un modelo temático.)

source: `kmodes <https://github.com/nicodv/kmodes>`_ k-modes clustering algorithm for categorical data, and several of its variations.
es: `kmodes <https://github.com/nicodv/kmodes>`_ algoritmo de conglomerados k-modes para datos categóricos, y algunas de sus variaciones.

source: `hdbscan <https://github.com/scikit-learn-contrib/hdbscan>`_ HDBSCAN and Robust Single Linkage clustering algorithms for robust variable density clustering.
es: `hdbscan <https://github.com/scikit-learn-contrib/hdbscan>`_ algoritmos HDBSCAN y Robust Single Linkage clustering para la agrupación robusta de densidad variable.

source: `spherecluster <https://github.com/clara-labs/spherecluster>`_ Spherical K-means and mixture of von Mises Fisher clustering routines for data on the unit hypersphere.
es: `spherecluster <https://github.com/clara-labs/spherecluster>`_ Rutinas de conglomerados K-medias esférica y mezcla de von Mises Fisher para datos en la hiperesfera unitaria.

source: **Pre-processing**
es: **Preprocesamiento**

source: `categorical-encoding <https://github.com/scikit-learn-contrib/categorical-encoding>`_ A library of sklearn compatible categorical variable encoders.
es: `categorical-encoding <https://github.com/scikit-learn-contrib/categorical-encoding>`_ Una biblioteca de codificadores de variables categóricas compatibles con sklearn.

source: `imbalanced-learn <https://github.com/scikit-learn-contrib/imbalanced-learn>`_ Various methods to under- and over-sample datasets.
es: `imbalanced-learn <https://github.com/scikit-learn-contrib/imbalanced-learn>`_ Métodos variados a conjuntos de datos sub-y sobre-muestreo.

source: `Feature-engine <https://github.com/solegalli/feature_engine>`_ A library of sklearn compatible transformers for missing data imputation, categorical encoding, variable transformation, discretization, outlier handling and more. Feature-engine allows the application of preprocessing steps to selected groups of variables and it is fully compatible with the Scikit-learn Pipeline.
es: `Feature-engine <https://github.com/solegalli/feature_engine>`_ Una biblioteca de transformadores compatibles con sklearn para la imputación de datos faltantes, codificación categórica, transformación de variables, discretización, manejo de valores atípicos y más. Feature-engine permite la aplicación de pasos de preprocesamiento a grupos seleccionados de variables y es totalmente compatible con el Scikit-learn Pipeline.

source: **Topological Data Analysis**
es: **Análisis de datos topológicos**

source: `giotto-tda <https://github.com/giotto-ai/giotto-tda>`_ A library for `Topological Data Analysis <https://en.wikipedia.org/wiki/Topological_data_analysis>`_ aiming to provide a scikit-learn compatible API. It offers tools to transform data inputs (point clouds, graphs, time series, images) into forms suitable for computations of topological summaries, and components dedicated to extracting sets of scalar features of topological origin, which can be used alongside other feature extraction methods in scikit-learn.
es: `giotto-tda <https://github.com/giotto-ai/giotto-tda>`_ Una librería para `Topological Data Analysis <https://en.wikipedia.org/wiki/Topological_data_analysis>`_ con el objetivo de proporcionar una API compatible con scikit-learn. Ofrece herramientas para transformar las entradas de datos (nubes de puntos, gráficos, series temporales, imágenes) en formas adecuadas para los cálculos de los resúmenes topológicos, y componentes dedicados a la extracción de conjuntos de características escalares de origen topológico, que se pueden utilizar junto con otros métodos de extracción de características en scikit-learn.

source: Statistical learning with Python
es: Aprendizaje estadístico con Python

source: Other packages useful for data analysis and machine learning.
es: Otros paquetes útiles para el análisis de datos y el aprendizaje automático.

source: `Pandas <https://pandas.pydata.org/>`_ Tools for working with heterogeneous and columnar data, relational queries, time series and basic statistics.
es: `Pandas <https://pandas.pydata.org/>`_ Herramientas para trabajar con datos heterogéneos y en columnas, consultas relacionales, series temporales y estadísticas básicas.

source: `statsmodels <https://www.statsmodels.org>`_ Estimating and analysing statistical models. More focused on statistical tests and less on prediction than scikit-learn.
es: `statsmodels <https://www.statsmodels.org>`_ Estimación y análisis de modelos estadísticos. Más centrado en las pruebas estadísticas y menos en la predicción que scikit-learn.

source: `PyMC <https://pymc-devs.github.io/pymc/>`_ Bayesian statistical models and fitting algorithms.
es: `PyMC <https://pymc-devs.github.io/pymc/>`_ Modelos estadísticos bayesianos y algoritmos de ajuste.

source: `Sacred <https://github.com/IDSIA/Sacred>`_ Tool to help you configure, organize, log and reproduce experiments
es: `Sacred <https://github.com/IDSIA/Sacred>`_ Herramienta para ayudarte a configurar, organizar, registrar y reproducir experimentos
