Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/roadmap.po
Languages: es

source: Roadmap
es: Hoja de ruta

source: Purpose of this document
es: Propósito de este documento

source: This document list general directions that core contributors are interested to see developed in scikit-learn. The fact that an item is listed here is in no way a promise that it will happen, as resources are limited. Rather, it is an indication that help is welcomed on this topic.
es: Este documento enumera las directrices generales que los colaboradores principales están interesados en ver desarrolladas en scikit-learn. El hecho de que un elemento se liste aquí no es de ninguna manera una promesa de que va a suceder, ya que los recursos son limitados. Más bien, es una indicación de que la ayuda es bienvenida en este tema.

source: Statement of purpose: Scikit-learn in 2018
es: Declaración de objetivos: Scikit-learn en 2018

source: Eleven years after the inception of Scikit-learn, much has changed in the world of machine learning. Key changes include:
es: Once años después de la creación de Scikit-learn, mucho ha cambiado en el mundo del aprendizaje automático. Los cambios clave incluyen:

source: Computational tools: The exploitation of GPUs, distributed programming frameworks like Scala/Spark, etc.
es: Herramientas computacionales: La explotación de GPUs, marcos de programación distribuidos como Scala/Spark, etc.

source: High-level Python libraries for experimentation, processing and data management: Jupyter notebook, Cython, Pandas, Dask, Numba...
es: Bibliotecas Python de alto nivel para experimentación, procesamiento y gestión de datos: cuaderno de Jupyter, Cython, Pandas, Dask, Numba...

source: Changes in the focus of machine learning research: artificial intelligence applications (where input structure is key) with deep learning, representation learning, reinforcement learning, domain transfer, etc.
es: Cambios en el enfoque de la investigación en aprendizaje automático: aplicaciones de inteligencia artificial (donde la estructura de entrada es clave) con aprendizaje profundo, aprendizaje de representación, aprendizaje de refuerzo, transferencia de dominio, etc.

source: A more subtle change over the last decade is that, due to changing interests in ML, PhD students in machine learning are more likely to contribute to PyTorch, Dask, etc. than to Scikit-learn, so our contributor pool is very different to a decade ago.
es: Un cambio más sutil en la última década es eso, debido a los intereses cambiantes en ML, Los estudiantes de doctorado en aprendizaje automático son más propensos a contribuir a Pyantch, Dask, etc. que a Scikit-learn, por lo que nuestro fondo de colaboradores es muy diferente al de hace una década.

source: Scikit-learn remains very popular in practice for trying out canonical machine learning techniques, particularly for applications in experimental science and in data science. A lot of what we provide is now very mature. But it can be costly to maintain, and we cannot therefore include arbitrary new implementations. Yet Scikit-learn is also essential in defining an API framework for the development of interoperable machine learning components external to the core library.
es: Scikit-learn sigue siendo muy popular en la práctica para probar las técnicas canónicas de aprendizaje automático, en particular para aplicaciones en la ciencia experimental y en la ciencia de datos. Mucho de lo que proporcionamos está ya muy desarrollado. Pero su mantenimiento puede ser costoso y, por tanto, no podemos incluir nuevas implementaciones arbitrarias. Sin embargo, Scikit-learn también es esencial en la definición de un marco API para el desarrollo de componentes de aprendizaje automático interoperables externos a la biblioteca principal.

source: **Thus our main goals in this era are to**:
es: **Por lo tanto, nuestros principales objetivos en esta ocasión son**:

source: continue maintaining a high-quality, well-documented collection of canonical tools for data processing and machine learning within the current scope (i.e. rectangular data largely invariant to column and row order; predicting targets with simple structure)
es: seguir manteniendo una colección de herramientas canónicas de alta calidad y bien documentadas para el tratamiento de datos y el aprendizaje automático dentro del ámbito actual (es decir, datos rectangulares en gran medida invariables al orden de las columnas y filas; predicción de objetivos con estructura simple)

source: improve the ease for users to develop and publish external components
es: mejorar la facilidad de desarrollo y publicación de componentes externos para los usuarios

source: improve inter-operability with modern data science tools (e.g. Pandas, Dask) and infrastructures (e.g. distributed processing)
es: mejorar la interoperabilidad con herramientas modernas de ciencia de datos (por ejemplo, Pandas, Dask) e infraestructuras (por ejemplo, procesamiento distribuido)

source: Many of the more fine-grained goals can be found under the `API tag <https://github.com/scikit-learn/scikit-learn/issues?q=is%3Aissue+is%3Aopen+sort%3Aupdated-desc+label%3AAPI>`_ on the issue tracker.
es: Muchos de los objetivos más precisos pueden encontrarse en la etiqueta `API <https://github.com/scikit-learn/scikit-learn/issues?q=is%3Aissue+is%3Aopen+sort%3Aupdated-desc+label%3AAPI>`_ en el gestor de incidencias.

source: Architectural / general goals
es: Objetivos arquitectónicos / generales

source: The list is numbered not as an indication of the order of priority, but to make referring to specific points easier. Please add new entries only at the bottom. Note that the crossed out entries are already done, and we try to keep the document up to date as we work on these issues.
es: La lista está numerada no como indicación del orden de prioridad, sino para facilitar la referencia a puntos concretos. Por favor, añada nuevas entradas sólo al final. Tenga en cuenta que las entradas tachadas ya están hechas, y que intentamos mantener el documento actualizado mientras trabajamos en estos temas.

source: Improved handling of Pandas DataFrames
es: Mejora del manejo de Pandas DataFrames

source: document current handling
es: el manejo actual del documento

source: column reordering issue :issue:`7242`
es: reordenamiento de columnas :issue:`7242`

source: avoiding unnecessary conversion to ndarray :issue:`12147`
es: evitar la conversión innecesaria a ndarray :issue:`12147`

source: returning DataFrames from transformers :issue:`5523`
es: devolviendo DataFrames de los transformadores :issue:`5523`

source: getting DataFrames from dataset loaders :issue:`10733`, |ss| :issue:`13902` |se|
es: obtención de DataFrames de cargadores de conjuntos de datos :issue:`10733`, |ss| :issue:`13902` |se|

source: Sparse currently not considered :issue:`12800`
es: Sparse actualmente no se considera :issue:`12800`

source: Improved handling of categorical features
es: Mejorar el manejo de características categóricas

source: Tree-based models should be able to handle both continuous and categorical features :issue:`12866` and :issue:`15550`.
es: Los modelos basados en el árbol deben ser capaces de manejar características continuas y categóricas :issue:`12866` y :issue:`15550`.

source: |ss| In dataset loaders :issue:`13902` |se|
es: |ss| En cargadores de conjuntos de datos :issue:`13902` |se|

source: As generic transformers to be used with ColumnTransforms (e.g. ordinal encoding supervised by correlation with target variable) :issue:`5853`, :issue:`11805`
es: Como transformadores genéricos para ser utilizados con ColumnTransforms (por ejemplo, codificación ordinal supervisada por correlación con la variable de objetivo) :issue:`5853`, :issue:`11805`

source: Handling mixtures of categorical and continuous variables
es: Manejo de mezclas de variables categóricas y continuas

source: Improved handling of missing data
es: Mejora de la gestión de los datos que faltan

source: Making sure meta-estimators are lenient towards missing data, :issue:`15319`
es: Asegurarse de que los meta-estimadores son indulgentes con los datos que faltan, :issue:`15319

source: Non-trivial imputers |ss| :issue:`11977`, :issue:`12852` |se|
es: Importadores no triviales |ss| :issue:`11977`, :issue:`12852` |se|

source: Learners directly handling missing data |ss| :issue:`13911` |se|
es: Los participantes manejan directamente los datos que faltan |ss| :issue:`13911` |se|

source: An amputation sample generator to make parts of a dataset go missing :issue:`6284`
es: Un generador de muestra de amputación para hacer desaparecer partes de un conjunto de datos :issue:`6284

source: More didactic documentation
es: Más documentos didácticos

source: More and more options have been added to scikit-learn. As a result, the documentation is crowded which makes it hard for beginners to get the big picture. Some work could be done in prioritizing the information.
es: Más y más opciones se han añadido a scikit-learn. Como resultado, la documentación está abarrotada, lo que hace que sea difícil para los principiantes obtener una visión general. Se podría trabajar en la priorización de la información.

source: Passing around information that is not (X, y): Sample properties
es: Pasar alrededor de la información que no es (X, y): Propiedades de muestra

source: We need to be able to pass sample weights to scorers in cross validation.
es: Necesitamos poder pasar los pesos de las muestras a los puntuadores en la validación cruzada.

source: We should have standard/generalised ways of passing sample-wise properties around in meta-estimators. :issue:`4497` :issue:`7646`
es: Deberíamos tener formas estándar/generalizadas de pasar las propiedades de la muestra en los meta-estimadores. :issue:`4497` :issue:`7646`

source: Passing around information that is not (X, y): Feature properties
es: Pasar información que no es (X, y): Propiedades de las características

source: Feature names or descriptions should ideally be available to fit for, e.g. . :issue:`6425` :issue:`6424`
es: Lo ideal es que los nombres o descripciones de las características estén disponibles para ajustarse a, por ejemplo. :issue:`6425` :issue:`6424`

source: Per-feature handling (e.g. "is this a nominal / ordinal / English language text?") should also not need to be provided to estimator constructors, ideally, but should be available as metadata alongside X. :issue:`8480`
es: La gestión de cada característica (por ejemplo, "¿se trata de un texto nominal / ordinal / en inglés?") tampoco debería proporcionarse a los constructores de estimadores, idealmente, sino que debería estar disponible como metadatos junto a X. :issue:`8480`

source: Passing around information that is not (X, y): Target information
es: Pasar alrededor de la información que no es (X, y): Propiedades de objetivo

source: We have problems getting the full set of classes to all components when the data is split/sampled. :issue:`6231` :issue:`8100`
es: Tenemos problemas para obtener el conjunto completo de clases en todos los componentes cuando los datos se dividen/muestran. :issue:`6231` :issue:`8100`

source: We have no way to handle a mixture of categorical and continuous targets.
es: No tenemos forma de tratar una mezcla de objetivos categóricos y continuos.

source: Make it easier for external users to write Scikit-learn-compatible components
es: Hacer más fácil para usuarios externos escribir componentes compatibles con Scikit-learn

source: More flexible estimator checks that do not select by estimator name :issue:`6599` :issue:`6715`
es: Comprobaciones de estimadores más flexibles que no seleccionan por nombre de estimador :issue:`6599` :issue:`6715

source: Example of how to develop an estimator or a meta-estimator, :issue:`14582`
es: Ejemplo de cómo desarrollar un estimador o un meta-estimador, :issue:`14582`

source: More self-sufficient running of scikit-learn-contrib or a similar resource
es: Ejecución más autosuficiente de scikit-learn-contrib o un recurso similar

source: Support resampling and sample reduction
es: Soporta el remuestreo y la reducción de la muestra

source: Allow subsampling of majority classes (in a pipeline?) :issue:`3855`
es: Permitir el submuestreo de las clases mayoritarias (¿en una pipeline?) :issue:`3855`

source: Implement random forests with resampling :issue:`8732`
es: Implementar bosques aleatorios con :issue:`8732`

source: Better interfaces for interactive development
es: Mejores interfaces para el desarrollo interactivo

source: |ss| __repr__ |se| and HTML visualisations of estimators |ss| :issue:`6323` |se| and :pr:`14180`.
es: |ss| __repr__ |se| y visualizaciones HTML de estimadores |ss| :issue:`6323` |se| y :pr:`14180`.

source: Include plotting tools, not just as examples. :issue:`9173`
es: Incluir herramientas de gráfico, no sólo como ejemplos. :issue:`9173`

source: Improved tools for model diagnostics and basic inference
es: Herramientas mejoradas para el diagnóstico de modelos e inferencia básica

source: |ss| alternative feature importances implementations, :issue:`13146` |se|
es: |ss| implementaciones alternativas de importación de características, :issue:`13146` |se|

source: better ways to handle validation sets when fitting
es: mejores formas de manejar los conjuntos de validación cuando se ajustan

source: better ways to find thresholds / create decision rules :issue:`8614`
es: mejores formas de encontrar umbrales / crear reglas de decisión :issue:`8614`

source: Better tools for selecting hyperparameters with transductive estimators
es: Mejores herramientas para seleccionar hiperparámetros con estimadores transductivos

source: Grid search and cross validation are not applicable to most clustering tasks. Stability-based selection is more relevant.
es: La búsqueda en cuadrícula y la validación cruzada no son aplicables a la mayoría de las tareas de conglomerados. La selección basada en la estabilidad es más pertinente.

source: Better support for manual and automatic pipeline building
es: Mejor soporte para construcción manual y automática de pipelines

source: Easier way to construct complex pipelines and valid search spaces :issue:`7608` :issue:`5082` :issue:`8243`
es: Una forma más fácil de construir pipelines complejos y espacios de búsqueda válidos :issue:`7608` :issue:`5082` :issue:`8243`

source: provide search ranges for common estimators??
es: ¿proporcionar rangos de búsqueda para los estimadores comunes?

source: Improved tracking of fitting
es: Mejora del seguimiento del ajuste

source: Verbose is not very friendly and should use a standard logging library :issue:`6929`, :issue:`78`
es: Verbose no es muy amigable y debería usar una biblioteca de registro estándar :issue:`6929`, :issue:`78`

source: Callbacks or a similar system would facilitate logging and early stopping
es: Las devoluciones o un sistema similar facilitarían el registro y la parada anticipada

source: Distributed parallelism
es: Paralelismo distribuido

source: Accept data which complies with ``__array_function__``
es: Acepta los datos que cumplen con ``__array_function__``

source: A way forward for more out of core
es: Un paso adelante para sacar más provecho del núcleo

source: Dask enables easy out-of-core computation. While the Dask model probably cannot be adaptable to all machine-learning algorithms, most machine learning is on smaller data than ETL, hence we can maybe adapt to very large scale while supporting only a fraction of the patterns.
es: Dask permite una fácil ejecución fuera del núcleo. Aunque el modelo Dask probablemente no pueda adaptarse a todos los algoritmos de aprendizaje automático, la mayor parte del aprendizaje automático se realiza sobre datos más pequeños que el ETL, por lo que quizá podamos adaptarnos a una escala muy grande mientras soportamos solo una fracción de los patrones.

source: Support for working with pre-trained models
es: Soporte para trabajar con modelos previamente entrenados

source: Estimator "freezing". In particular, right now it's impossible to clone a `CalibratedClassifierCV` with prefit. :issue:`8370`. :issue:`6451`
es: El estimador se "congela". En particular, ahora mismo es imposible clonar un `CalibratedClassifierCV` con prefit. :issue:`8370`. :issue:`6451`

source: Backwards-compatible de/serialization of some estimators
es: Serialización de algunos estimadores compatible con las versiones anteriores

source: Currently serialization (with pickle) breaks across versions. While we may not be able to get around other limitations of pickle re security etc, it would be great to offer cross-version safety from version 1.0. Note: Gael and Olivier think that this can cause heavy maintenance burden and we should manage the trade-offs. A possible alternative is presented in the following point.
es: Actualmente la serialización (con pickle) se interrumpe entre versiones. Aunque no podamos evitar otras limitaciones de pickle en cuanto a seguridad, etc., sería estupendo ofrecer seguridad entre versiones desde la versión 1.0. Nota: Gael y Olivier piensan que esto puede causar una pesada carga de mantenimiento y que deberíamos gestionar las compensaciones. Una posible alternativa se presenta en el siguiente punto.

source: Documentation and tooling for model lifecycle management
es: Documentación y herramientas para la gestión del ciclo de vida del modelo

source: Document good practices for model deployments and lifecycle: before deploying a model: snapshot the code versions (numpy, scipy, scikit-learn, custom code repo), the training script and an alias on how to retrieve historical training data + snapshot a copy of a small validation set + snapshot of the predictions (predicted probabilities for classifiers) on that validation set.
es: Documentar las buenas prácticas para el despliegue y el ciclo de vida del modelo: antes de desplegar un modelo: fijar las versiones del código (numpy, scipy, scikit-learn, repo de código personalizado), el script de entrenamiento y un alias sobre cómo recuperar los datos históricos de entrenamiento + fijar una copia de un pequeño conjunto de validación + fijar las predicciones (probabilidades predichas para los clasificadores) en ese conjunto de validación.

source: Document and tools to make it easy to manage upgrade of scikit-learn versions:
es: Documento y herramientas para facilitar la gestión de la actualización de las versiones de scikit-learn:

source: Try to load the old pickle, if it works, use the validation set prediction snapshot to detect that the serialized model still behave the same;
es: Prueba a cargar el pickle anterior, si funciona, fija la predicción del conjunto de validación para detectar que el modelo serializado sigue comportándose igual;

source: If joblib.load / pickle.load not work, use the versioned control training script + historical training set to retrain the model and use the validation set prediction snapshot to assert that it is possible to recover the previous predictive performance: if this is not the case there is probably a bug in scikit-learn that needs to be reported.
es: Si joblib.load / pickle.load no funcionan, utilice el script de entrenamiento de control de versiones + el conjunto de entrenamiento histórico para volver a entrenar el modelo y fije la predicción del conjunto de validación para afirmar que es posible recuperar la eficiencia de predicción anterior: si no es el caso, probablemente hay un error en scikit-learn que debe ser reportado.

source: Everything in Scikit-learn should probably conform to our API contract. We are still in the process of making decisions on some of these related issues.
es: Todo en Scikit-learn debe probablemente ajustarse a nuestro contrato de API. Todavía estamos tomando decisiones sobre algunas de estas cuestiones relacionadas.

source: `Pipeline <pipeline.Pipeline>` and `FeatureUnion` modify their input parameters in fit. Fixing this requires making sure we have a good grasp of their use cases to make sure all current functionality is maintained. :issue:`8157` :issue:`7382`
es: `Pipeline <pipeline.Pipeline>` y `FeatureUnion` modifican sus parámetros de entrada ajustado. Para solucionarlo es necesario asegurarse de que conocemos bien sus casos de uso para garantizar que se mantiene toda la funcionalidad actual. :issue:`8157` :issue:`7382`

source: (Optional) Improve scikit-learn common tests suite to make sure that (at least for frequently used) models have stable predictions across-versions (to be discussed);
es: (Opcional) Mejorar el conjunto de tests comunes de scikit-learn para asegurarse de que (al menos para los modelos de uso frecuente) tienen predicciones estables a través de las versiones (para ser discutido);

source: Extend documentation to mention how to deploy models in Python-free environments for instance `ONNX <https://github.com/onnx/onnxmltools>`_. and use the above best practices to assess predictive consistency between scikit-learn and ONNX prediction functions on validation set.
es: Ampliar la documentación para mencionar cómo desplegar los modelos en entornos sin Python, por ejemplo `ONNX <https://github.com/onnx/onnxmltools>`_. y utilizar las mejores prácticas anteriores para evaluar la consistencia predictiva entre las funciones de predicción de scikit-learn y ONNX en el conjunto de validación.

source: Document good practices to detect temporal distribution drift for deployed model and good practices for re-training on fresh data without causing catastrophic predictive performance regressions.
es: Documentar las buenas prácticas para detectar la derivación de la distribución temporal para el modelo desplegado y las buenas prácticas para el reentrenamiento en datos actuales sin causar regresiones catastróficas en el rendimiento predictivo.

source: Subpackage-specific goals
es: Objetivos específicos de los subpaquetes

source: |ss| a stacking implementation, :issue:`11047` |se|
es: |ss| una implementación de apilamiento, :issue:`11047` |se|

source: kmeans variants for non-Euclidean distances, if we can show these have benefits beyond hierarchical clustering.
es: variantes de kmeans para distancias no euclidianas, si podemos demostrar que éstas tienen beneficios más allá de conglomeración jerárquica.

source: |ss| multi-metric scoring is slow :issue:`9326` |se|
es: |ss| la puntuación multimétrica es lenta :issue:`9326` |se|

source: perhaps we want to be able to get back more than multiple metrics
es: tal vez queremos ser capaces de recuperar más de múltiples métricas

source: the handling of random states in CV splitters is a poor design and contradicts the validation of similar parameters in estimators, :issue:`15177`
es: el manejo de los estados aleatorios en los separadores de validación cruzada es un diseño pobre y contradice la validación de parámetros similares en los estimadores, :issue:`15177`

source: exploit warm-starting and path algorithms so the benefits of `EstimatorCV` objects can be accessed via `GridSearchCV` and used in Pipelines. :issue:`1626`
es: explotar los algoritmos de warm-starting y path para que se pueda acceder a las ventajas de los objetos `EstimatorCV` a través de `GridSearchCV` y utilizarlos en Pipelines. :issue:`1626

source: Cross-validation should be able to be replaced by OOB estimates whenever a cross-validation iterator is used.
es: La validación cruzada debería poder ser sustituida por estimaciones OOB siempre que se utilice un iterador de validación cruzada.

source: Redundant computations in pipelines should be avoided (related to point above) cf `daskml <https://dask-ml.readthedocs.io/en/latest/hyper-parameter-search.html#avoid-repeated-work>`_
es: Deben evitarse los cálculos redundantes en las pipelines (relacionado con el punto anterior) cf `daskml <https://dask-ml.readthedocs.io/en/latest/hyper-parameter-search.html#avoid-repeated-work>`_
