Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/roadmap.po
Languages: es

source: |ss| Ability to substitute a custom/approximate/precomputed nearest neighbors implementation for ours in all/most contexts that nearest neighbors are used for learning. :issue:`10463` |se|
es: |ss| Posibilidad de sustituir una implementación de vecinos más cercanos personalizada/aproximada/precalculada por la nuestra en todos/la mayoría de los contextos en los que se utilizan los vecinos más cercanos para el aprendizaje. :issue:`10463` |se|

source: Performance issues with `Pipeline.memory`
es: Problemas de rendimiento con `Pipeline.memory`

source: see "Everything in Scikit-learn should conform to our API contract" above
es: ver "Todo en Scikit-learn debe ajustarse a nuestro contrato de API" arriba
