Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/covariance/plot_robust_vs_empirical_covariance.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_covariance_plot_robust_vs_empirical_covariance.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_covariance_plot_robust_vs_empirical_covariance.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Robust vs Empirical covariance estimate
es_es: Estimación de la covarianza robusta frente a la empírica

source: The usual covariance maximum likelihood estimate is very sensitive to the presence of outliers in the data set. In such a case, it would be better to use a robust estimator of covariance to guarantee that the estimation is resistant to "erroneous" observations in the data set. [1]_, [2]_
es_es: La estimación habitual de la covarianza por máxima verosimilitud es muy sensible a la presencia de valores atípicos en el conjunto de datos. En tal caso, sería mejor utilizar un estimador robusto de la covarianza para garantizar que la estimación es resistente a las observaciones "erróneas" en el conjunto de datos. [1]_, [2]_

source: Minimum Covariance Determinant Estimator
es_es: Estimador del determinante mínimo de la covarianza

source: The Minimum Covariance Determinant estimator is a robust, high-breakdown point (i.e. it can be used to estimate the covariance matrix of highly contaminated datasets, up to :math:`\frac{n_\text{samples} - n_\text{features}-1}{2}` outliers) estimator of covariance. The idea is to find :math:`\frac{n_\text{samples} + n_\text{features}+1}{2}` observations whose empirical covariance has the smallest determinant, yielding a "pure" subset of observations from which to compute standards estimates of location and covariance. After a correction step aiming at compensating the fact that the estimates were learned from only a portion of the initial data, we end up with robust estimates of the data set location and covariance.
es_es: El estimador del Determinante Mínimo de la Covarianza es un estimador de la covarianza robusto y de alto punto de ruptura (es decir, puede utilizarse para estimar la matriz de covarianza de conjuntos de datos muy contaminados, hasta :math:`\frac{n_\text{samples} - n_\text{features}-1}{2}` los valores atípicos). La idea es encontrar :math:`\frac{n_\text{samples} + n_\text{features}+1}{2}` observaciones cuya covarianza empírica tiene el menor determinante, dando lugar a un subconjunto "puro" de observaciones a partir del cual calcular las estimaciones estándar de ubicación y covarianza. Después de un paso de corrección destinado a compensar el hecho de que las estimaciones se aprendieron a partir de sólo una parte de los datos iniciales, terminamos con estimaciones robustas de la ubicación y la covarianza del conjunto de datos.

source: The Minimum Covariance Determinant estimator (MCD) has been introduced by P.J.Rousseuw in [3]_.
es_es: El estimador del Determinante de Covarianza Mínimo (MCD) ha sido introducido por P.J.Rousseuw en [3]_.

source: Evaluation
es_es: Evaluación

source: In this example, we compare the estimation errors that are made when using various types of location and covariance estimates on contaminated Gaussian distributed data sets:
es_es: En este ejemplo, comparamos los errores de estimación que se cometen al utilizar varios tipos de estimaciones de localización y covarianza en conjuntos de datos distribuidos gaussianos contaminados:

source: The mean and the empirical covariance of the full dataset, which break down as soon as there are outliers in the data set
es_es: La media y la covarianza empírica del conjunto de datos, que se rompen en cuanto hay valores atípicos en el conjunto de datos

source: The robust MCD, that has a low error provided :math:`n_\text{samples} > 5n_\text{features}`
es_es: El MCD robusto, que tiene un bajo error siempre que :math:`n_\text{samples} > 5n_\text{features}`

source: The mean and the empirical covariance of the observations that are known to be good ones. This can be considered as a "perfect" MCD estimation, so one can trust our implementation by comparing to this case.
es_es: La media y la covarianza empírica de las observaciones que se sabe que son buenas. Esto puede considerarse como una estimación "perfecta" del MCD, por lo que se puede confiar en nuestra aplicación comparándola con este caso.

source: References
es_es: Referencias

source: **Total running time of the script:** ( 0 minutes 4.590 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 4.590 segundos)

source: :download:`Download Python source code: plot_robust_vs_empirical_covariance.py <plot_robust_vs_empirical_covariance.py>`
es_es: :download:`Descargar el código fuente de Python: plot_robust_vs_empirical_covariance.py <plot_robust_vs_empirical_covariance.py>`

source: :download:`Download Jupyter notebook: plot_robust_vs_empirical_covariance.ipynb <plot_robust_vs_empirical_covariance.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_robust_vs_empirical_covariance.ipynb <plot_robust_vs_empirical_covariance.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
