Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/covariance/plot_covariance_estimation.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_covariance_plot_covariance_estimation.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_covariance_plot_covariance_estimation.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Shrinkage covariance estimation: LedoitWolf vs OAS and max-likelihood
es_es: Estimación de la covarianza de la contracción: LedoitWolf vs OAS y max-likelihood

source: When working with covariance estimation, the usual approach is to use a maximum likelihood estimator, such as the :class:`~sklearn.covariance.EmpiricalCovariance`. It is unbiased, i.e. it converges to the true (population) covariance when given many observations. However, it can also be beneficial to regularize it, in order to reduce its variance; this, in turn, introduces some bias. This example illustrates the simple regularization used in :ref:`shrunk_covariance` estimators. In particular, it focuses on how to set the amount of regularization, i.e. how to choose the bias-variance trade-off.
es_es: Cuando se trabaja con la estimación de la covarianza, el enfoque habitual es utilizar un estimador de máxima verosimilitud, como el :class:`~sklearn.covariance.EmpiricalCovariance`. Es insesgado, es decir, converge a la verdadera covarianza (de la población) cuando se dan muchas observaciones. Sin embargo, también puede ser beneficioso regularizarla, para reducir su varianza; esto, a su vez, introduce algún sesgo. Este ejemplo ilustra la regularización simple utilizada en los estimadores de :ref:`shrunk_covariance`. En particular, se centra en cómo establecer la cantidad de regularización, es decir, cómo elegir el equilibrio entre sesgo y varianza.

source: Here we compare 3 approaches:
es_es: Aquí comparamos 3 enfoques:

source: Setting the parameter by cross-validating the likelihood on three folds according to a grid of potential shrinkage parameters.
es_es: Ajuste del parámetro mediante la validación cruzada de la verosimilitud en tres pliegues según una cuadrícula de posibles parámetros de contracción.

source: A close formula proposed by Ledoit and Wolf to compute the asymptotically optimal regularization parameter (minimizing a MSE criterion), yielding the :class:`~sklearn.covariance.LedoitWolf` covariance estimate.
es_es: Una fórmula cercana propuesta por Ledoit y Wolf para calcular el parámetro de regularización asintóticamente óptimo (minimizando un criterio MSE), produciendo la estimación de covarianza :class:`~sklearn.covariance.LedoitWolf`.

source: An improvement of the Ledoit-Wolf shrinkage, the :class:`~sklearn.covariance.OAS`, proposed by Chen et al. Its convergence is significantly better under the assumption that the data are Gaussian, in particular for small samples.
es_es: Una mejora de la contracción de Ledoit-Wolf, el :class:`~sklearn.covariance.OAS`, propuesto por Chen et al. Su convergencia es significativamente mejor bajo el supuesto de que los datos son gaussianos, en particular para muestras pequeñas.

source: To quantify estimation error, we plot the likelihood of unseen data for different values of the shrinkage parameter. We also show the choices by cross-validation, or with the LedoitWolf and OAS estimates.
es_es: Para cuantificar el error de estimación, graficamos la verosimilitud de los datos no vistos para diferentes valores del parámetro de contracción. También mostramos las opciones por validación cruzada, o con las estimaciones de LedoitWolf y OAS.

source: Note that the maximum likelihood estimate corresponds to no shrinkage, and thus performs poorly. The Ledoit-Wolf estimate performs really well, as it is close to the optimal and is computational not costly. In this example, the OAS estimate is a bit further away. Interestingly, both approaches outperform cross-validation, which is significantly most computationally costly.
es_es: Obsérvese que la estimación de máxima verosimilitud corresponde a la ausencia de contracción, por lo que su rendimiento es escaso. La estimación de Ledoit-Wolf funciona muy bien, ya que se acerca al óptimo y no es costosa computacionalmente. En este ejemplo, la estimación de OAS está un poco más lejos. Curiosamente, ambos enfoques superan a la validación cruzada, que es significativamente más costosa computacionalmente.

source: **Total running time of the script:** ( 0 minutes 0.961 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.961 segundos)

source: :download:`Download Python source code: plot_covariance_estimation.py <plot_covariance_estimation.py>`
es_es: :download:`Descargar el código fuente de Python: plot_covariance_estimation.py <plot_covariance_estimation.py>`

source: :download:`Download Jupyter notebook: plot_covariance_estimation.ipynb <plot_covariance_estimation.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_covariance_estimation.ipynb <plot_covariance_estimation.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
