Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/covariance/plot_sparse_cov.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_covariance_plot_sparse_cov.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_covariance_plot_sparse_cov.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Sparse inverse covariance estimation
es_es: Estimación de la covarianza inversa dispersa

source: Using the GraphicalLasso estimator to learn a covariance and sparse precision from a small number of samples.
es_es: Uso del estimador GraphicalLasso para aprender una covarianza y una precisión dispersa a partir de un pequeño número de muestras.

source: To estimate a probabilistic model (e.g. a Gaussian model), estimating the precision matrix, that is the inverse covariance matrix, is as important as estimating the covariance matrix. Indeed a Gaussian model is parametrized by the precision matrix.
es_es: Para estimar un modelo probabilístico (por ejemplo, un modelo gaussiano), la estimación de la matriz de precisión, es decir, la matriz de covarianza inversa, es tan importante como la estimación de la matriz de covarianza. De hecho, un modelo gaussiano está parametrizado por la matriz de precisión.

source: To be in favorable recovery conditions, we sample the data from a model with a sparse inverse covariance matrix. In addition, we ensure that the data is not too much correlated (limiting the largest coefficient of the precision matrix) and that there a no small coefficients in the precision matrix that cannot be recovered. In addition, with a small number of observations, it is easier to recover a correlation matrix rather than a covariance, thus we scale the time series.
es_es: Para estar en condiciones favorables de recuperación, muestreamos los datos de un modelo con una matriz de covarianza inversa dispersa. Además, nos aseguramos de que los datos no estén demasiado correlacionados (limitando el mayor coeficiente de la matriz de precisión) y de que no haya coeficientes pequeños en la matriz de precisión que no puedan recuperarse. Además, con un número reducido de observaciones, es más fácil recuperar una matriz de correlación que de covarianza, por lo que escalamos las series de tiempo.

source: Here, the number of samples is slightly larger than the number of dimensions, thus the empirical covariance is still invertible. However, as the observations are strongly correlated, the empirical covariance matrix is ill-conditioned and as a result its inverse --the empirical precision matrix-- is very far from the ground truth.
es_es: En este caso, el número de muestras es ligeramente mayor que el número de dimensiones, por lo que la covarianza empírica sigue siendo invertible. Sin embargo, como las observaciones están fuertemente correlacionadas, la matriz de covarianza empírica está mal condicionada y, en consecuencia, su inversa --la matriz de precisión empírica-- está muy alejada de la verdad fundamental.

source: If we use l2 shrinkage, as with the Ledoit-Wolf estimator, as the number of samples is small, we need to shrink a lot. As a result, the Ledoit-Wolf precision is fairly close to the ground truth precision, that is not far from being diagonal, but the off-diagonal structure is lost.
es_es: Si utilizamos la contracción l2, como con el estimador de Ledoit-Wolf, como el número de muestras es pequeño, tenemos que encoger mucho. Como resultado, la precisión de Ledoit-Wolf se aproxima bastante a la precisión de la verdad fundamental, que no está lejos de ser diagonal, pero se pierde la estructura no diagonal.

source: The l1-penalized estimator can recover part of this off-diagonal structure. It learns a sparse precision. It is not able to recover the exact sparsity pattern: it detects too many non-zero coefficients. However, the highest non-zero coefficients of the l1 estimated correspond to the non-zero coefficients in the ground truth. Finally, the coefficients of the l1 precision estimate are biased toward zero: because of the penalty, they are all smaller than the corresponding ground truth value, as can be seen on the figure.
es_es: El estimador l1-penalizado puede recuperar parte de esta estructura no diagonal. Aprende una precisión dispersa. No es capaz de recuperar el patrón de sparsity exacto: detecta demasiados coeficientes no nulos. Sin embargo, los coeficientes no nulos más altos de l1 estimados corresponden a los coeficientes distinto de cero de la verdad fundamental. Por último, los coeficientes de la estimación de precisión de l1 están sesgados hacia el cero: debido a la penalización, todos son más pequeños que el valor correspondiente de la verdad fundamental, como se puede ver en la figura.

source: Note that, the color range of the precision matrices is tweaked to improve readability of the figure. The full range of values of the empirical precision is not displayed.
es_es: Tenga en cuenta que, el rango de colores de las matrices de precisión se ha ajustado para mejorar la legibilidad de la figura. No se muestra todo el rango de valores de la precisión empírica.

source: The alpha parameter of the GraphicalLasso setting the sparsity of the model is set by internal cross-validation in the GraphicalLassoCV. As can be seen on figure 2, the grid to compute the cross-validation score is iteratively refined in the neighborhood of the maximum.
es_es: El parámetro alfa del GraphicalLasso que establece la dispersión del modelo se fija mediante la validación cruzada interna en el GraphicalLassoCV. Como se puede ver en la figura 2, la cuadrícula para calcular la puntuación de validación cruzada se refina iterativamente en el vecindario del máximo.

source: **Total running time of the script:** ( 0 minutes 1.250 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.250 segundos)

source: :download:`Download Python source code: plot_sparse_cov.py <plot_sparse_cov.py>`
es_es: :download:`Descargar el código fuente de Python: plot_sparse_cov.py <plot_sparse_cov.py>`

source: :download:`Download Jupyter notebook: plot_sparse_cov.ipynb <plot_sparse_cov.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_sparse_cov.ipynb <plot_sparse_cov.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
