Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/manifold/plot_t_sne_perplexity.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_manifold_plot_t_sne_perplexity.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_manifold_plot_t_sne_perplexity.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: t-SNE: The effect of various perplexity values on the shape
es_es: t-SNE: El efecto de varios valores de perplejidad en la forma

source: An illustration of t-SNE on the two concentric circles and the S-curve datasets for different perplexity values.
es_es: Una ilustración de t-SNE en los dos círculos concentrados y los conjuntos de datos de curvas S para diferentes valores de perplejidad.

source: We observe a tendency towards clearer shapes as the perplexity value increases.
es_es: Observamos una tendencia hacia formas más claras a medida que aumenta el valor de perplejidad.

source: The size, the distance and the shape of clusters may vary upon initialization, perplexity values and does not always convey a meaning.
es_es: El tamaño, la distancia y la forma de los clusters pueden variar según la inicialización, los valores de perplejidad y no siempre transmite un significado.

source: As shown below, t-SNE for higher perplexities finds meaningful topology of two concentric circles, however the size and the distance of the circles varies slightly from the original. Contrary to the two circles dataset, the shapes visually diverge from S-curve topology on the S-curve dataset even for larger perplexity values.
es_es: Como se muestra a continuación, t-SNE para perplexidades más altas encuentra una topología significativa de dos círculos concéntricos, sin embargo, el tamaño y la distancia de los círculos varía ligeramente del original. Contrario al conjunto de datos de los dos círculos, las formas divergen visualmente de la topología de la curva S en el conjunto de datos de la curva S, incluso para mayores valores de perplejidad.

source: For further details, "How to Use t-SNE Effectively" https://distill.pub/2016/misread-tsne/ provides a good discussion of the effects of various parameters, as well as interactive plots to explore those effects.
es_es: `"Como usar t-EEV efectivamente" <https://distill.pub/2016/misread-tsne/>`_ proporciona una buena discusión de los efectos de los diferentes parámetros, así como gráficos interactivos para explorar los efectos de diferentes parámetros.

source: **Total running time of the script:** ( 2 minutes 14.437 seconds)
es_es: **Tiempo total de ejecución del script:** (2 minutos 14.437 segundos)

source: :download:`Download Python source code: plot_t_sne_perplexity.py <plot_t_sne_perplexity.py>`
es_es: :download:`Descargar código fuente de Python: plot_t_sne_perplexity.py <plot_t_sne_perplexity.py>`

source: :download:`Download Jupyter notebook: plot_t_sne_perplexity.ipynb <plot_t_sne_perplexity.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_t_sne_perplexity.ipynb <plot_t_sne_perplexity.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
