Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/manifold/plot_lle_digits.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_manifold_plot_lle_digits.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_manifold_plot_lle_digits.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Manifold learning on handwritten digits: Locally Linear Embedding, Isomap...
es_es: Aprendizaje múltiple sobre dígitos manuscritos: Incrustación local lineal, Isomap...

source: An illustration of various embeddings on the digits dataset.
es_es: Una ilustración de varias incrustaciones en el conjunto de datos de dígitos.

source: The RandomTreesEmbedding, from the :mod:`sklearn.ensemble` module, is not technically a manifold embedding method, as it learn a high-dimensional representation on which we apply a dimensionality reduction method. However, it is often useful to cast a dataset into a representation in which the classes are linearly-separable.
es_es: El RandomTreesEmbedding, del módulo :mod:`sklearn.ensemble`, no es técnicamente un método de incrustación múltiple, ya que aprende una representación de alta dimensión sobre la que aplicamos un método de reducción de la dimensionalidad. Sin embargo, a menudo es útil convertir un conjunto de datos en una representación en la que las clases son linealmente separables.

source: t-SNE will be initialized with the embedding that is generated by PCA in this example, which is not the default setting. It ensures global stability of the embedding, i.e., the embedding does not depend on random initialization.
es_es: t-SNE se inicializará con la incrustación generada por PCA en este ejemplo, que no es la configuración por defecto. Garantiza la estabilidad global de la incrustación, es decir, la incrustación no depende de una inicialización aleatoria.

source: Linear Discriminant Analysis, from the :mod:`sklearn.discriminant_analysis` module, and Neighborhood Components Analysis, from the :mod:`sklearn.neighbors` module, are supervised dimensionality reduction method, i.e. they make use of the provided labels, contrary to other methods.
es_es: El Análisis Discriminante Lineal, del módulo :mod:`sklearn.discriminant_analysis`, y el Análisis de Componentes de Vecindad, del módulo :mod:`sklearn.neighbors`, son métodos de reducción de dimensionalidad supervisados, es decir, hacen uso de las etiquetas proporcionadas, al contrario que otros métodos.

source: **Total running time of the script:** ( 1 minutes 22.451 seconds)
es_es: **Tiempo total de ejecución del script:** (1 minutos 22.451 segundos)

source: :download:`Download Python source code: plot_lle_digits.py <plot_lle_digits.py>`
es_es: :download:`Descarga el código fuente de Python: plot_lle_digits.py <plot_lle_digits.py>`

source: :download:`Download Jupyter notebook: plot_lle_digits.ipynb <plot_lle_digits.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_lle_digits.ipynb <plot_lle_digits.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
