Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/manifold/plot_compare_methods.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_manifold_plot_compare_methods.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_manifold_plot_compare_methods.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparison of Manifold Learning methods
es_es: Comparación de los métodos de Aprendizaje Múltiple

source: An illustration of dimensionality reduction on the S-curve dataset with various manifold learning methods.
es_es: Una ilustración de la reducción de la dimensionalidad en el conjunto de datos de la curva S con varios métodos de aprendizaje múltiple.

source: For a discussion and comparison of these algorithms, see the :ref:`manifold module page <manifold>`
es_es: Para una discusión y comparación de estos algoritmos, ver la página del módulo :ref:`manifold <manifold>`

source: For a similar example, where the methods are applied to a sphere dataset, see :ref:`sphx_glr_auto_examples_manifold_plot_manifold_sphere.py`
es_es: Para un ejemplo similar, donde los métodos se aplican a un conjunto de datos de esfera, ver :ref:`sphx_glr_auto_examples_manifold_plot_manifold_sphere.py`

source: Note that the purpose of the MDS is to find a low-dimensional representation of the data (here 2D) in which the distances respect well the distances in the original high-dimensional space, unlike other manifold-learning algorithms, it does not seeks an isotropic representation of the data in the low-dimensional space.
es_es: Ten en cuenta que el propósito del MDS es encontrar una representación de baja dimensión de los datos (aquí 2D) en la que las distancias respeten bien las distancias en el espacio original de alta dimensión, a diferencia de otros algoritmos de aprendizaje múltiple, no busca una representación isotrópica de los datos en el espacio de baja dimensión.

source: **Total running time of the script:** ( 0 minutes 32.474 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 32.474 segundos)

source: :download:`Download Python source code: plot_compare_methods.py <plot_compare_methods.py>`
es_es: :download:`Descargar el código fuente de Python: plot_compare_methods.py <plot_compare_methods.py>`

source: :download:`Download Jupyter notebook: plot_compare_methods.ipynb <plot_compare_methods.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_compare_reduction.ipynb <plot_compare_methods.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
