Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/multioutput/plot_classifier_chain_yeast.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_multioutput_plot_classifier_chain_yeast.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_multioutput_plot_classifier_chain_yeast.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Classifier Chain
es_es: Cadenas de Clasificadores

source: Example of using classifier chain on a multilabel dataset.
es_es: Ejemplo de uso de cadenas de clasificadores en un conjunto de datos multietiqueta.

source: For this example we will use the `yeast <https://www.openml.org/d/40597>`_ dataset which contains 2417 datapoints each with 103 features and 14 possible labels. Each data point has at least one label. As a baseline we first train a logistic regression classifier for each of the 14 labels. To evaluate the performance of these classifiers we predict on a held-out test set and calculate the :ref:`jaccard score <jaccard_similarity_score>` for each sample.
es_es: Para este ejemplo utilizaremos el conjunto de datos `yeast <https://www.openml.org/d/40597>`_ que contiene 2417 puntos de datos, cada uno con 103 características y 14 etiquetas posibles. Cada punto de datos tiene al menos una etiqueta. Como línea de base, primero entrenamos un clasificador de regresión logística para cada una de las 14 etiquetas. Para evaluar el rendimiento de estos clasificadores, predecimos en un conjunto de pruebas retenido y calculamos la :ref:`puntuación jaccard <jaccard_similarity_score>` para cada muestra.

source: Next we create 10 classifier chains. Each classifier chain contains a logistic regression model for each of the 14 labels. The models in each chain are ordered randomly. In addition to the 103 features in the dataset, each model gets the predictions of the preceding models in the chain as features (note that by default at training time each model gets the true labels as features). These additional features allow each chain to exploit correlations among the classes. The Jaccard similarity score for each chain tends to be greater than that of the set independent logistic models.
es_es: A continuación, creamos 10 cadenas de clasificadores. Cada cadena de clasificadores contiene un modelo de regresión logística para cada una de las 14 etiquetas. Los modelos de cada cadena se ordenan aleatoriamente. Además de las 103 características del conjunto de datos, cada modelo recibe las predicciones de los modelos anteriores de la cadena como características (ten en cuenta que, por defecto, en el momento del entrenamiento cada modelo recibe las etiquetas verdaderas como características). Estas características adicionales permiten a cada cadena explotar las correlaciones entre las clases. La puntuación de similitud de Jaccard para cada cadena tiende a ser mayor que la del conjunto de modelos logísticos independientes.

source: Because the models in each chain are arranged randomly there is significant variation in performance among the chains. Presumably there is an optimal ordering of the classes in a chain that will yield the best performance. However we do not know that ordering a priori. Instead we can construct an voting ensemble of classifier chains by averaging the binary predictions of the chains and apply a threshold of 0.5. The Jaccard similarity score of the ensemble is greater than that of the independent models and tends to exceed the score of each chain in the ensemble (although this is not guaranteed with randomly ordered chains).
es_es: Dado que los modelos de cada cadena se ordenan aleatoriamente, hay una variación significativa en el rendimiento entre las cadenas. Es de suponer que existe un orden óptimo de las clases en una cadena que producirá el mejor rendimiento. Sin embargo, no conocemos ese orden a priori. En su lugar, podemos construir un conjunto —ensemble— de votación de cadenas de clasificadores promediando las predicciones binarias de las cadenas y aplicando un umbral de 0.5. La puntuación de similitud de Jaccard del conjunto es mayor que la de los modelos independientes y tiende a superar la puntuación de cada cadena del conjunto —ensemble— (aunque esto no está garantizado con cadenas ordenadas aleatoriamente).

source: **Total running time of the script:** ( 0 minutes 6.883 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 6.883 segundos)

source: :download:`Download Python source code: plot_classifier_chain_yeast.py <plot_classifier_chain_yeast.py>`
es_es: :download:`Descargar el código fuente de Python: plot_classifier_chain_yeast.py <plot_classifier_chain_yeast.py>`

source: :download:`Download Jupyter notebook: plot_classifier_chain_yeast.ipynb <plot_classifier_chain_yeast.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_classifier_chain_yeast.ipynb <plot_classifier_chain_yeast.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
