Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/bug_triaging.po
Languages: es_es

source: Bug triaging and issue curation
es_es: Evaluación de errores y curación de problemas

source: The `issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_ is important to the communication in the project: it helps developers identify major projects to work on, as well as to discuss priorities. For this reason, it is important to curate it, adding labels to issues and closing issues that are not necessary.
es_es: El `rastreador de incidencias <https://github.com/scikit-learn/scikit-learn/issues>`_ es importante para la comunicación en el proyecto: ayuda a los desarrolladores a identificar los principales proyectos en los que trabajar, así como a discutir las prioridades. Por esta razón, es importante conservarlo, añadiendo etiquetas a las incidencias y cerrando las incidencias que no son necesarias.

source: Working on issues to improve them
es_es: Trabajar en las incidencias (issues) para mejorarlas

source: Improving issues increases their chances of being successfully resolved. Guidelines on submitting good issues can be found :ref:`here <filing_bugs>`. A third party can give useful feedback or even add comments on the issue. The following actions are typically useful:
es_es: La mejora de las incidencias aumenta las posibilidades de que se resuelvan con éxito. Las directrices para presentar buenas incidencias pueden encontrarse :ref:`aquí <filing_bugs>`. Un tercero puede dar una opinión útil o incluso añadir comentarios sobre la incidencia. Las siguientes acciones suelen ser útiles:

source: documenting issues that are missing elements to reproduce the problem such as code samples
es_es: documentar las incidencias en las que faltan elementos para reproducir el problema, como ejemplos de código

source: suggesting better use of code formatting
es_es: sugerir un mejor uso del formato del código

source: suggesting to reformulate the title and description to make them more explicit about the problem to be solved
es_es: sugerir que se reformulen el título y la descripción para que sean más explícitos en cuanto al problema que hay que resolver

source: linking to related issues or discussions while briefly describing how they are related, for instance "See also #xyz for a similar attempt at this" or "See also #xyz where the same thing happened in SomeEstimator" provides context and helps the discussion.
es_es: enlazar con incidencias o discusiones relacionadas mientras se describe brevemente cómo están relacionadas, por ejemplo "Ver también #xyz para un intento similar de esto" o "Ver también #xyz donde ocurrió lo mismo en SomeEstimator" proporciona contexto y ayuda a la discusión.

source: Fruitful discussions
es_es: Discusiones fructíferas

source: Online discussions may be harder than it seems at first glance, in particular given that a person new to open-source may have a very different understanding of the process than a seasoned maintainer.
es_es: Las discusiones en línea pueden ser más difíciles de lo que parece a primera vista, sobre todo teniendo en cuenta que una persona nueva en el mundo del código abierto puede tener una comprensión muy diferente del proceso que un mantenedor experimentado.

source: Overall, it is useful to stay positive and assume good will. `The following article <http://gael-varoquaux.info/programming/technical-discussions-are-hard-a-few-tips.html>`_ explores how to lead online discussions in the context of open source.
es_es: En general, es útil mantenerse positivo y asumir la buena voluntad. `El siguiente artículo <http://gael-varoquaux.info/programming/technical-discussions-are-hard-a-few-tips.html>`_ explora cómo dirigir los debates en línea en el contexto del código abierto.

source: Working on PRs to help review
es_es: Trabajar en los PR para ayudar a la revisión

source: Reviewing code is also encouraged. Contributors and users are welcome to participate to the review process following our :ref:`review guidelines <code_review>`.
es_es: También se fomenta la revisión del código. Los colaboradores y usuarios son bienvenidos a participar en el proceso de revisión siguiendo nuestras :ref:`directrices de revisión <code_review>`.

source: Triaging operations for members of the core and triage teams
es_es: Operaciones de triaje para los miembros de los equipos centrales y de triaje

source: In addition to the above, members of the core team and the triage team can do the following important tasks:
es_es: Además de lo anterior, los miembros del equipo central y del equipo de triaje pueden realizar las siguientes tareas importantes:

source: Update :ref:`labels for issues and PRs <issue_tracker_tags>`: see the list of the `available github labels <https://github.com/scikit-learn/scikit-learn/labels>`_.
es_es: Actualizar :ref:`etiquetas para temas y los PR <issue_tracker_tags>`: ver la lista de las `etiquetas disponibles en github <https://github.com/scikit-learn/scikit-learn/labels>`_.

source: :ref:`Determine if a PR must be relabeled as stalled <stalled_pull_request>` or needs help (this is typically very important in the context of sprints, where the risk is to create many unfinished PRs)
es_es: :ref:`Determinar si un PR debe ser reetiquetado como estancado (stalled) <stalled_pull_request>` o si necesita ayuda (esto suele ser muy importante en el contexto de los sprints, donde el riesgo es crear muchos PR inconclusos)

source: Triage issues:
es_es: Incidencias de triaje:

source: **close usage questions** and politely point the reporter to use Stack Overflow instead.
es_es: **cierra las preguntas de uso** e indica amablemente al reportero que utilice Stack Overflow en su lugar.

source: **close duplicate issues**, after checking that they are indeed duplicate. Ideally, the original submitter moves the discussion to the older, duplicate issue
es_es: **cierra las incidencias duplicadas**, después de comprobar que efectivamente son duplicados. Lo ideal es que el remitente original traslade la discusión a la incidencia duplicada más antigua

source: **close issues that cannot be replicated**, after leaving time (at least a week) to add extra information
es_es: **cierra las incidencias que no se pueden replicar**, después de dejar tiempo (al menos una semana) para añadir información adicional

source: :ref:`Saved replies <saved_replies>` are useful to gain time and yet be welcoming and polite when triaging.
es_es: :ref:`Las respuestas guardadas <saved_replies>` son útiles para ganar tiempo y a la vez ser acogedor y educado a la hora de triar.

source: See the github description for `roles in the organization <https://docs.github.com/en/github/setting-up-and-managing-organizations-and-teams/repository-permission-levels-for-an-organization>`_.
es_es: Consulta la descripción de github para conocer los `roles en la organización <https://docs.github.com/en/github/setting-up-and-managing-organizations-and-teams/repository-permission-levels-for-an-organization>`_.

source: Closing issues: a tough call
es_es: Incidencias de cierre: una decisión difícil

source: When uncertain on whether an issue should be closed or not, it is best to strive for consensus with the original poster, and possibly to seek relevant expertise. However, when the issue is a usage question, or when it has been considered as unclear for many years it should be closed.
es_es: En caso de duda sobre si una incidencia debe cerrarse o no, lo mejor es tratar de llegar a un consenso con el autor original y, posiblemente, buscar los conocimientos técnicos pertinentes. Sin embargo, cuando la incidencia es una cuestión de uso, o cuando se considera poco clara desde hace muchos años, debe cerrarse.

source: A typical workflow for triaging issues
es_es: Un flujo de trabajo típico para el triaje de incidencias

source: The following workflow [1]_ is a good way to approach issue triaging:
es_es: El siguiente flujo de trabajo [1]_ es una buena manera de abordar el triaje de incidencias:

source: Thank the reporter for opening an issue
es_es: Agradece al reportero que haya abierto una incidencia

source: The issue tracker is many people’s first interaction with the scikit-learn project itself, beyond just using the library. As such, we want it to be a welcoming, pleasant experience.
es_es: El gestor de incidencias (issue tracker) es la primera interacción de muchas personas con el proyecto scikit-learn, más allá del simple uso de la biblioteca. Como tal, queremos que sea una experiencia acogedora y agradable.

source: Is this a usage question? If so close it with a polite message (:ref:`here is an example <saved_replies>`).
es_es: ¿Es una pregunta de uso? Si es así, ciérrala con un mensaje de cortesía (:ref:`aquí tienes un ejemplo <saved_replies>`).

source: Is the necessary information provided?
es_es: ¿Se proporciona la información necesaria?

source: If crucial information (like the version of scikit-learn used), is missing feel free to ask for that and label the issue with "Needs info".
es_es: Si falta información crucial (como la versión de scikit-learn utilizada), no dudes en pedirla y etiquetar la incidencia con "Needs info".

source: Is this a duplicate issue?
es_es: ¿Se trata de una incidencia duplicada?

source: We have many open issues. If a new issue seems to be a duplicate, point to the original issue. If it is a clear duplicate, or consensus is that it is redundant, close it. Make sure to still thank the reporter, and encourage them to chime in on the original issue, and perhaps try to fix it.
es_es: Tenemos muchas incidencias abiertas. Si una nueva incidencia parece ser un duplicado, señala la incidencia original. Si es un claro duplicado, o el consenso es que es redundante, ciérralo. Asegúrate de dar las gracias al reportero y anímale a que intervenga en la incidencia original y, tal vez, a que intente solucionarla.

source: If the new issue provides relevant information, such as a better or slightly different example, add it to the original issue as a comment or an edit to the original post.
es_es: Si la nueva incidencia proporciona información relevante, como un ejemplo mejor o ligeramente diferente, añádela a la incidencia original como un comentario o una edición al post original.

source: Make sure that the title accurately reflects the issue. If you have the necessary permissions edit it yourself if it's not clear.
es_es: Asegúrate de que el título refleja correctamente la incidencia. Si tienes los permisos necesarios, edítalo tú mismo si no está claro.

source: Is the issue minimal and reproducible?
es_es: ¿La incidencia o problema es mínimo y reproducible?

source: For bug reports, we ask that the reporter provide a minimal reproducible example. See `this useful post <https://matthewrocklin.com/blog/work/2018/02/28/minimal-bug-reports>`_ by Matthew Rocklin for a good explanation. If the example is not reproducible, or if it's clearly not minimal, feel free to ask the reporter if they can provide and example or simplify the provided one. Do acknowledge that writing minimal reproducible examples is hard work. If the reporter is struggling, you can try to write one yourself.
es_es: Para los informes de errores, pedimos que el informante proporcione un ejemplo mínimo reproducible. Mira `este útil post <https://matthewrocklin.com/blog/work/2018/02/28/minimal-bug-reports>`_ de Matthew Rocklin para una buena explicación. Si el ejemplo no es reproducible o si claramente no es mínimo, no dudes en preguntar al reportero si puede proporcionar un ejemplo o simplificar el proporcionado. Reconoce que escribir ejemplos mínimos reproducibles es un trabajo duro. Si el reportero tiene problemas, puedes intentar escribir uno tú mismo.

source: If a reproducible example is provided, but you see a simplification, add your simpler reproducible example.
es_es: Si se proporciona un ejemplo reproducible, pero ves una simplificación, añade tu ejemplo reproducible más sencillo.

source: Add the relevant labels, such as "Documentation" when the issue is about documentation, "Bug" if it is clearly a bug, "Enhancement" if it is an enhancement request, ...
es_es: Añade las etiquetas pertinentes, como "Documentation" cuando la incidencia se refiere a la documentación, "Bug" si se trata claramente de un error, "Enhancement" si se trata de una solicitud de mejora, ...

source: If the issue is clearly defined and the fix seems relatively straightforward, label the issue as “Good first issue”.
es_es: Si la incidencia está claramente definida y la solución parece relativamente sencilla, etiqueta la incidencia como "Good first issue" (buen primer problema).

source: An additional useful step can be to tag the corresponding module e.g. `sklearn.linear_models` when relevant.
es_es: Un paso adicional útil puede ser etiquetar el módulo correspondiente, por ejemplo, `sklearn.linear_models` cuando sea relevante.

source: Adapted from the pandas project `maintainers guide <https://dev.pandas.io/docs/development/maintaining.html>`_
es_es: Adaptado del proyecto pandas `maintainers guide <https://dev.pandas.io/docs/development/maintaining.html>`_
