Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/contributing.po
Languages: es_es

source: A great way to start contributing to scikit-learn is to pick an item from the list of `good first issues <https://github.com/scikit-learn/scikit-learn/labels/good%20first%20issue>`_ in the issue tracker. Resolving these issues allow you to start contributing to the project without much prior knowledge. If you have already contributed to scikit-learn, you should look at Easy issues instead.
es_es: Una gran manera de empezar a contribuir a scikit-learn es elegir un elemento de la lista de `buenas primeras incidencias(good first issues) <https://github.com/scikit-learn/scikit-learn/labels/good%20first%20issue>`_ en el rastreador de incidencias. La resolución de estas incidencias te permite comenzar a contribuir al proyecto sin mucho conocimiento previo. Si ya has contribuido a scikit-learn, debes mirar las incidencias fáciles en su lugar.

source: Easy tag
es_es: Etiqueta easy

source: If you have already contributed to scikit-learn, another great way to contribute to scikit-learn is to pick an item from the list of `Easy issues <https://github.com/scikit-learn/scikit-learn/labels/Easy>`_ in the issue tracker. Your assistance in this area will be greatly appreciated by the more experienced developers as it helps free up their time to concentrate on other issues.
es_es: Si ya has contribuido a scikit-learn, otra gran manera de contribuir a scikit-learn es elegir un elemento de la lista de `Incidencias fáciles <https://github.com/scikit-learn/scikit-learn/labels/Easy>`_ en el rastreador de incidencias. Tu ayuda en esta área será muy apreciada por los desarrolladores más experimentados, ya que ayuda a liberar su tiempo para concentrarse en otras cuestiones.

source: help wanted tag
es_es: Etiqueta help wanted

source: We often use the help wanted tag to mark issues regardless of difficulty. Additionally, we use the help wanted tag to mark Pull Requests which have been abandoned by their original contributor and are available for someone to pick up where the original contributor left off. The list of issues with the help wanted tag can be found `here <https://github.com/scikit-learn/scikit-learn/labels/help%20wanted>`_.
es_es: A menudo utilizamos la etiqueta help wanted(se necesita ayuda) para marcar incidencias independientemente de su dificultad. Además, utilizamos la etiqueta help wanted para marcar los Pull Requests que han sido abandonados por su colaborador original y están disponibles para que alguien las retome donde el colaborador original las dejó. La lista de incidencias con la etiqueta help wanted se puede encontrar `aquí <https://github.com/scikit-learn/scikit-learn/labels/help%20wanted>`_.

source: Note that not all issues which need contributors will have this tag.
es_es: Ten en cuenta que no todas las incidencias que necesitan colaboradores tendrán esta etiqueta.

source: Documentation
es_es: Documentación

source: We are glad to accept any sort of documentation: function docstrings, reStructuredText documents (like this one), tutorials, etc. reStructuredText documents live in the source code repository under the ``doc/`` directory.
es_es: Estamos encantados de aceptar cualquier tipo de documentación: cadenas de documentación de funciones, documentos reStructuredText (como éste), tutoriales, etc. Los documentos reStructuredText se encuentran en el repositorio de código fuente bajo el directorio ``doc/``.

source: You can edit the documentation using any text editor, and then generate the HTML output by typing ``make`` from the ``doc/`` directory. Alternatively, ``make html`` may be used to generate the documentation **with** the example gallery (which takes quite some time). The resulting HTML files will be placed in ``_build/html/stable`` and are viewable in a web browser.
es_es: Puedes editar la documentación usando cualquier editor de texto, y luego generar la salida HTML escribiendo ``make`` desde el directorio ``doc/``. Alternativamente, se puede utilizar ``make html`` para generar la documentación **con** la galería de ejemplos (lo que lleva bastante tiempo). Los archivos HTML resultantes se colocarán en ``build/html/stable`` y se podrán ver en un navegador web.

source: Building the documentation
es_es: Construyendo la documentación

source: First, make sure you have :ref:`properly installed <install_bleeding_edge>` the development version.
es_es: En primer lugar, asegúrate de tener :ref:`properly installed <install_bleeding_edge>` la versión de desarrollo.

source: Building the documentation requires installing some additional packages:
es_es: La construcción de la documentación requiere la instalación de algunos paquetes adicionales:

source: To build the documentation, you need to be in the ``doc`` folder:
es_es: Para construir la documentación, es necesario estar en la carpeta ``doc``:

source: In the vast majority of cases, you only need to generate the full web site, without the example gallery:
es_es: En la gran mayoría de los casos, sólo es necesario generar el sitio web completo, sin la galería de ejemplos:

source: The documentation will be generated in the ``_build/html/stable`` directory. To also generate the example gallery you can use:
es_es: La documentación se generará en el directorio ``build/html/stable``. Para generar también la galería de ejemplos puedes utilizar:

source: This will run all the examples, which takes a while. If you only want to generate a few examples, you can use:
es_es: Esto ejecutará todos los ejemplos, lo que lleva algo de tiempo. Si sólo quieres generar unos pocos ejemplos, puedes utilizar:

source: This is particularly useful if you are modifying a few examples.
es_es: Esto es especialmente útil si se modifican algunos ejemplos.

source: Set the environment variable `NO_MATHJAX=1` if you intend to view the documentation in an offline setting.
es_es: Establece la variable de entorno `NO_MATHJAX=1` si pretendes ver la documentación en un entorno sin conexión.

source: To build the PDF manual, run:
es_es: Para construir el manual en PDF, ejecuta:

source: **Sphinx version**
es_es: **Versión de Sphinx**

source: While we do our best to have the documentation build under as many versions of Sphinx as possible, the different versions tend to behave slightly differently. To get the best results, you should use the same version as the one we used on CircleCI. Look at this `github search <https://github.com/search?utf8=%E2%9C%93&q=sphinx+repo%3Ascikit-learn%2Fscikit-learn+extension%3Ash+path%3Abuild_tools%2Fcircle&type=Code>`_ to know the exact version.
es_es: Aunque hacemos todo lo posible para que la documentación se construya bajo tantas versiones de Sphinx como sea posible, las diferentes versiones tienden a comportarse de forma ligeramente diferente. Para obtener los mejores resultados, debes utilizar la misma versión que la que utilizamos en CircleCI. Mira esta `búsqueda en github <https://github.com/search?utf8=%E2%9C%93&q=sphinx+repo%3Ascikit-learn%2Fscikit-learn+extension%3Ash+path%3Abuild_tools%2Fcircle&type=Code>`_ para conocer la versión exacta.

source: Guidelines for writing documentation
es_es: Pautas para la redacción de la documentación

source: It is important to keep a good compromise between mathematical and algorithmic details, and give intuition to the reader on what the algorithm does.
es_es: Es importante mantener un buen compromiso entre los detalles matemáticos y los algorítmicos, y dar la intuición al lector sobre lo que hace el algoritmo.

source: Basically, to elaborate on the above, it is best to always start with a small paragraph with a hand-waving explanation of what the method does to the data. Then, it is very helpful to point out why the feature is useful and when it should be used - the latter also including "big O" (:math:`O\left(g\left(n\right)\right)`) complexities of the algorithm, as opposed to just *rules of thumb*, as the latter can be very machine-dependent. If those complexities are not available, then rules of thumb may be provided instead.
es_es: Básicamente, para desarrollar lo anterior, lo mejor es empezar siempre con un pequeño párrafo con una explicación a mano de lo que el método hace con los datos. A continuación, es muy útil señalar por qué la característica es útil y cuándo debe utilizarse - esto último también incluye las complejidades "big O" (:math:`O\left(g\left(n\right)\right)`) del algoritmo, en lugar de sólo *reglas empíricas*, ya que estas últimas pueden ser muy dependientes de la máquina. Si esas complejidades no están disponibles, entonces se pueden proporcionar reglas empíricas en su lugar.

source: Secondly, a generated figure from an example (as mentioned in the previous paragraph) should then be included to further provide some intuition.
es_es: En segundo lugar, debería incluirse una figura generada a partir de un ejemplo (como se menciona en el párrafo anterior) para proporcionar una mayor intuición.

source: Next, one or two small code examples to show its use can be added.
es_es: A continuación, se pueden añadir uno o dos pequeños ejemplos de código para mostrar su uso.

source: Next, any math and equations, followed by references, can be added to further the documentation. Not starting the documentation with the maths makes it more friendly towards users that are just interested in what the feature will do, as opposed to how it works "under the hood".
es_es: Luego, se pueden añadir cualquier matemática y ecuaciones, seguidas de las referencias, para ampliar la documentación. El hecho de no empezar la documentación con las matemáticas hace que sea más fácil para los usuarios que sólo se interesan por lo que hace la función, en lugar de cómo funciona "bajo el capó".

source: Finally, follow the formatting rules below to make it consistently good:
es_es: Por último, sigue las reglas de formato que se indican a continuación para que sea consistente:

source: Add "See Also" in docstrings for related classes/functions.
es_es: Añade "Ver también"(See Also) en las cadenas de documentación para las clases/funciones relacionadas.

source: "See Also" in docstrings should be one line per reference, with a colon and an explanation, for example::
es_es: Los "See Also" en las cadenas de documentación deben ser de una línea por referencia, con dos puntos y una explicación, por ejemplo::

source: When documenting the parameters and attributes, here is a list of some well-formatted examples::
es_es: A la hora de documentar los parámetros y atributos, he aquí una lista de algunos ejemplos bien formateados::

source: In general have the following in mind:
es_es: En general, ten en cuenta lo siguiente:

source: Use Python basic types. (``bool`` instead of ``boolean``)
es_es: Utiliza los tipos básicos de Python. (``bool`` en lugar de ``boolean``)

source: Use parenthesis for defining shapes: ``array-like of shape (n_samples,)`` or ``array-like of shape (n_samples, n_features)``
es_es: Utiliza paréntesis para definir las formas: ``array-like of shape (n_samples,)`` o ``array-like of shape (n_samples, n_features)``

source: For strings with multiple options, use brackets: ``input: {'log', 'squared', 'multinomial'}``
es_es: Para cadenas con múltiples opciones, utiliza llaves: ``input: {'log', 'squared', 'multinomial'}``

source: 1D or 2D data can be a subset of ``{array-like, ndarray, sparse matrix, dataframe}``. Note that ``array-like`` can also be a ``list``, while ``ndarray`` is explicitly only a ``numpy.ndarray``.
es_es: Los datos 1D o 2D pueden ser un subconjunto de ``{array-like, ndarray, sparse matrix, dataframe}``. Nótese que ``array-like`` también puede ser una ``list``, mientras que ``ndarray`` es explícitamente sólo un ``numpy.ndarray``.

source: Specify ``dataframe`` when "frame-like" features are being used, such as the column names.
es_es: Especifica ``dataframe`` cuando se utilicen características "frame-like", como los nombres de las columnas.

source: When specifying the data type of a list, use ``of`` as a delimiter: ``list of int``. When the parameter supports arrays giving details about the shape and/or data type and a list of such arrays, you can use one of ``array-like of shape (n_samples,) or list of such arrays``.
es_es: Cuando se especifica el tipo de datos de una lista, se utiliza ``de`` como delimitador: ``list de int``. Cuando el parámetro admite arreglos que dan detalles sobre la forma y/o el tipo de datos y una lista de dichos arreglos, puedes utilizar uno de los siguientes: ``array-like de forma (n_samples,) o list de tales arrays``.

source: When specifying the dtype of an ndarray, use e.g. ``dtype=np.int32`` after defining the shape: ``ndarray of shape (n_samples,), dtype=np.int32``. You can specify multiple dtype as a set: ``array-like of shape (n_samples,), dtype={np.float64, np.float32}``. If one wants to mention arbitrary precision, use `integral` and `floating` rather than the Python dtype `int` and `float`. When both `int` and `floating` are supported, there is no need to specify the dtype.
es_es: Al especificar el dtype de un ndarray, utiliza, por ejemplo, ``dtype=np.int32`` después de definir la forma: ``ndarray de forma (n_muestras,), dtype=np.int32``. Puedes especificar múltiples dtype como un conjunto: ``array-like de forma (n_muestras,), dtype={np.float64, np.float32}``. Si quieres mencionar una precisión arbitraria, tienes que utilizar `integral` y `floating` en lugar de los dtype de Python `int` y `float`. Cuando se soportan tanto `int` como `floating`, no es necesario especificar el dtype.

source: When the default is ``None``, ``None`` only needs to be specified at the end with ``default=None``. Be sure to include in the docstring, what it means for the parameter or attribute to be ``None``.
es_es: Cuando el valor por defecto es ``None``, ``None`` sólo necesita ser especificado al final con ``default=None``. Asegúrate de incluir en la cadena de documentación lo que significa que el parámetro o atributo sea ``None``.

source: For unwritten formatting rules, try to follow existing good works:
es_es: Para las reglas de formato no escritas, intenta seguir las buenas obras existentes:

source: For "References" in docstrings, see the Silhouette Coefficient (:func:`sklearn.metrics.silhouette_score`).
es_es: Para "Referencias" en cadenas de documentación, véase el Coeficiente de Silueta (:func:`sklearn.metrics.silhouette_score`).

source: When editing reStructuredText (``.rst``) files, try to keep line length under 80 characters when possible (exceptions include links and tables).
es_es: Cuando edites archivos reStructuredText (``.rst``), intenta mantener la longitud de las líneas por debajo de los 80 caracteres siempre que sea posible (las excepciones son los enlaces y las tablas).

source: Do not modify sphinx labels as this would break existing cross references and external links pointing to specific sections in the scikit-learn documentation.
es_es: No modifiques las etiquetas de sphinx ya que esto rompería las referencias cruzadas existentes y los enlaces externos que apuntan a secciones específicas en la documentación de scikit-learn.

source: Before submitting your pull request check if your modifications have introduced new sphinx warnings and try to fix them.
es_es: Antes de enviar tu pull request comprueba si tus modificaciones han introducido nuevas advertencias de sphinx e intenta solucionarlas.

source: Generated documentation on CircleCI
es_es: Documentación generada sobre CircleCI

source: When you change the documentation in a pull request, CircleCI automatically builds it. To view the documentation generated by CircleCI, simply go at the bottom of your PR page and look for the "ci/circleci: doc artifact" link.
es_es: Cuando cambias la documentación en un pull request, CircleCI la construye automáticamente. Para ver la documentación generada por CircleCI, simplemente dirígete al final de tu página de PR y busca el enlace "ci/circleci: doc artifact".

source: Testing and improving test coverage
es_es: Pruebas y mejora de la cobertura de las pruebas

source: High-quality `unit testing <https://en.wikipedia.org/wiki/Unit_testing>`_ is a corner-stone of the scikit-learn development process. For this purpose, we use the `pytest <https://docs.pytest.org>`_ package. The tests are functions appropriately named, located in `tests` subdirectories, that check the validity of the algorithms and the different options of the code.
es_es: Las `pruebas unitarias <https://en.wikipedia.org/wiki/Unit_testing>`_ de alta calidad son la piedra angular del proceso de desarrollo de scikit-learn. Para ello, utilizamos el paquete `pytest <https://docs.pytest.org>`_. Las pruebas son funciones con un nombre apropiado, ubicadas en los subdirectorios `tests`, que comprueban la validez de los algoritmos y las diferentes opciones del código.

source: Running `pytest` in a folder will run all the tests of the corresponding subpackages. For a more detailed `pytest` workflow, please refer to the :ref:`pr_checklist`.
es_es: Al ejecutar `pytest` en una carpeta se ejecutarán todas las pruebas de los subpaquetes correspondientes. Para un flujo de trabajo más detallado de `pytest`, consulta la :ref:`pr_checklist`.

source: We expect code coverage of new features to be at least around 90%.
es_es: Esperamos que la cobertura del código de las nuevas funcionalidades sea de al menos un 90%.

source: Writing matplotlib related tests
es_es: Escribir pruebas relacionadas con matplotlib

source: Test fixtures ensure that a set of tests will be executing with the appropriate initialization and cleanup. The scikit-learn test suite implements a fixture which can be used with ``matplotlib``.
es_es: Los elementos(fixtures) de prueba garantizan que un conjunto de pruebas se ejecute con la inicialización y la limpieza adecuadas. La suite de pruebas de scikit-learn implementa un elemento que puede ser utilizado con `` matplotlib ''.

source: The ``pyplot`` fixture should be used when a test function is dealing with ``matplotlib``. ``matplotlib`` is a soft dependency and is not required. This fixture is in charge of skipping the tests if ``matplotlib`` is not installed. In addition, figures created during the tests will be automatically closed once the test function has been executed.
es_es: El elemento ``pyplot`` debe ser utilizado cuando una función de prueba está tratando con ``matplotlib``. ``matplotlib`` es una dependencia blanda y no es necesaria. Este elemento se encarga de saltar las pruebas si ``matplotlib`` no está instalado. Además, las figuras creadas durante las pruebas se cerrarán automáticamente una vez ejecutada la función de prueba.

source: To use this fixture in a test function, one needs to pass it as an argument::
es_es: Para utilizar este elemento en una función de prueba, hay que pasarlo como argumento::

source: Workflow to improve test coverage
es_es: Flujo de trabajo para mejorar la cobertura de las pruebas

source: To test code coverage, you need to install the `coverage <https://pypi.org/project/coverage/>`_ package in addition to pytest.
es_es: Para probar la cobertura del código, es necesario instalar el paquete `coverage <https://pypi.org/project/coverage/>`_ además de pytest.

source: Run 'make test-coverage'. The output lists for each file the line
es_es: Ejecuta 'make test-coverage'. La salida lista para cada archivo los números de línea

source: numbers that are not tested.
es_es: que no están probados.

source: Find a low hanging fruit, looking at which lines are not tested,
es_es: Encuentra tareas fáciles de hacer, mirando las líneas que no se han probado,

source: write or adapt a test specifically for these lines.
es_es: escribe o adapta una prueba específicamente para estas líneas.

source: Loop.
es_es: Bucle.

source: Monitoring performance
es_es: Monitorización del rendimiento

source: *This section is heavily inspired from the* `pandas documentation <https://pandas.pydata.org/docs/development/contributing.html#running-the-performance-test-suite>`_.
es_es: *Esta sección está muy inspirada en la* `documentación de Pandas <https://pandas.pydata.org/docs/development/contributing.html#running-the-performance-test-suite>`_.

source: When proposing changes to the existing code base, it's important to make sure that they don't introduce performance regressions. Scikit-learn uses `asv benchmarks <https://github.com/airspeed-velocity/asv>`_ to monitor the performance of a selection of common estimators and functions. The benchmark suite can be found in the `scikit-learn/asv_benchmarks` directory.
es_es: Cuando se proponen cambios en la base de código existente, es importante asegurarse de que no introducen regresiones en el rendimiento. Scikit-learn utiliza `Pruebas de rendimiento asv<https://github.com/airspeed-velocity/asv>`_ para controlar el rendimiento de una selección de estimadores y funciones comunes. La suite de pruebas de rendimiento(benchmarks) se puede encontrar en el directorio `scikit-learn/asv_benchmarks`.

source: To use all features of asv, you will need either `conda` or `virtualenv`. For more details please check the `asv installation webpage <https://asv.readthedocs.io/en/latest/installing.html>`_.
es_es: Para utilizar todas las características de asv, necesitarás `conda` o `virtualenv`. Para más detalles, consulta la `página web de instalación de asv <https://asv.readthedocs.io/en/latest/installing.html>`_.

source: First of all you need to install the development version of asv:
es_es: En primer lugar, es necesario instalar la versión de desarrollo de asv:

source: and change your directory to `asv_benchmarks/`:
es_es: y cambia tu directorio a `asv_benchmarks/`:

source: The benchmark suite is configured to run against your local clone of scikit-learn. Make sure it is up to date:
es_es: La suite de pruebas de rendimiento está configurada para ejecutarse contra tu clon local de scikit-learn. Asegúrate de que está actualizado:

source: In the benchmark suite, the benchmarks are organized following the same structure as scikit-learn. For example, you can compare the performance of a specific estimator between upstream/main and the branch you are working on:
es_es: En la suite de pruebas de rendimiento, estas pruebas están organizadas siguiendo la misma estructura que scikit-learn. Por ejemplo, puedes comparar el rendimiento de un estimador específico entre upstream/main y la rama en la que estás trabajando:

source: The command uses conda by default for creating the benchmark environments. If you want to use virtualenv instead, use the `-E` flag:
es_es: El comando utiliza conda por defecto para crear los entornos de pruebas de rendimiento. Si quieres usar virtualenv en su lugar, utiliza la opción `-E`:

source: You can also specify a whole module to benchmark:
es_es: También puedes especificar un módulo completo para las pruebas de rendimiento:

source: You can replace `HEAD` by any local branch. By default it will only report the benchmarks that have change by at least 10%. You can control this ratio with the `-f` flag.
es_es: Puedes sustituir `HEAD` por cualquier rama local. Por defecto, sólo informará de las pruebas de rendimiento que hayan cambiado al menos un 10%. Puedes controlar esta proporción con la opción`-f`.

source: To run the full benchmark suite, simply remove the `-b` flag :
es_es: Para ejecutar la suite completa de pruebas de rendimiento, basta con eliminar la opción `-b`:

source: However this can take up to two hours. The `-b` flag also accepts a regular expression for a more complex subset of benchmarks to run.
es_es: Sin embargo, esto puede llevar hasta dos horas. La opción `-b` también acepta una expresión regular para ejecutar un subconjunto más complejo de pruebas de rendimiento.
