Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/contributing.po
Languages: es_es

source: Contributing
es_es: Contribuyendo

source: This project is a community effort, and everyone is welcome to contribute.
es_es: Este proyecto es un esfuerzo comunitario, y todos son bienvenidos a contribuir.

source: The project is hosted on https://github.com/scikit-learn/scikit-learn
es_es: El proyecto está alojado en https://github.com/scikit-learn/scikit-learn

source: The decision making process and governance structure of scikit-learn is laid out in the governance document: :ref:`governance`.
es_es: El proceso de toma de decisiones y la estructura de gobernanza de scikit-learn se exponen en el documento de gobernanza: :ref:`governance`.

source: Scikit-learn is somewhat :ref:`selective <selectiveness>` when it comes to adding new algorithms, and the best way to contribute and to help the project is to start working on known issues. See :ref:`new_contributors` to get started.
es_es: Scikit-learn es un poco :ref:`selective <selectiveness>` cuando se trata de añadir nuevos algoritmos, y la mejor manera de contribuir y ayudar al proyecto es empezar a trabajar en las incidencias(issues) conocidas. Véase :ref:`new_contributors` para empezar.

source: **Our community, our values**
es_es: **Nuestra comunidad, nuestros valores**

source: We are a community based on openness and friendly, didactic, discussions.
es_es: Somos una comunidad basada en la apertura y los debates amistosos y didácticos.

source: We aspire to treat everybody equally, and value their contributions. We are particularly seeking people from underrepresented backgrounds in Open Source Software and scikit-learn in particular to participate and contribute their expertise and experience.
es_es: Aspiramos a tratar a todos por igual y a valorar sus contribuciones. Buscamos especialmente a personas con poca representación en el software de código abierto y en scikit-learn en particular para que participen y aporten sus conocimientos y experiencia.

source: Decisions are made based on technical merit and consensus.
es_es: Las decisiones se toman basándose en el mérito técnico y el consenso.

source: Code is not the only way to help the project. Reviewing pull requests, answering questions to help others on mailing lists or issues, organizing and teaching tutorials, working on the website, improving the documentation, are all priceless contributions.
es_es: El código no es la única forma de ayudar al proyecto. Revisar pull requests, responder a preguntas para ayudar a otros en las listas de correo o en las incidencias, organizar y enseñar tutoriales, trabajar en el sitio web, mejorar la documentación, son todas contribuciones que no tienen precio.

source: We abide by the principles of openness, respect, and consideration of others of the Python Software Foundation: https://www.python.org/psf/codeofconduct/
es_es: Nos atenemos a los principios de apertura, respeto y consideración de los demás de la Python Software Foundation: https://www.python.org/psf/codeofconduct/

source: In case you experience issues using this package, do not hesitate to submit a ticket to the `GitHub issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_. You are also welcome to post feature requests or pull requests.
es_es: En caso de que experimentes alguna incidencia al utilizar este paquete, no dudes en enviar un ticket al `Rastreador de problemas de GitHub <https://github.com/scikit-learn/scikit-learn/issues>`_. También puedes enviar solicitudes de funcionalidad o pull requests.

source: Ways to contribute
es_es: Formas de contribuir

source: There are many ways to contribute to scikit-learn, with the most common ones being contribution of code or documentation to the project. Improving the documentation is no less important than improving the library itself. If you find a typo in the documentation, or have made improvements, do not hesitate to send an email to the mailing list or preferably submit a GitHub pull request. Full documentation can be found under the doc/ directory.
es_es: Hay muchas maneras de contribuir a scikit-learn, siendo las más comunes la contribución de código o a la documentación del proyecto. Mejorar la documentación no es menos importante que mejorar la propia biblioteca. Si encuentras un error en la documentación, o has hecho mejoras, no dudes en enviar un correo electrónico a la lista de correo o, preferiblemente, envía una solicitud de extracción de GitHub. La documentación completa se encuentra en el directorio doc/.

source: But there are many other ways to help. In particular helping to :ref:`improve, triage, and investigate issues <bug_triaging>` and :ref:`reviewing other developers' pull requests <code_review>` are very valuable contributions that decrease the burden on the project maintainers.
es_es: Pero hay muchas otras formas de ayudar. En particular, ayudar a :ref:`improve, triage, and investigate issues <bug_triaging>` y :ref:`reviewing other developers' pull requests <code_review>` son contribuciones muy valiosas que disminuyen la carga de los mantenedores del proyecto.

source: Another way to contribute is to report issues you're facing, and give a "thumbs up" on issues that others reported and that are relevant to you. It also helps us if you spread the word: reference the project from your blog and articles, link to it from your website, or simply star to say "I use it":
es_es: Otra forma de contribuir es informar de las incidencias a las que te enfrentas, y dar un "pulgar arriba" a las incidencias que otros informaron y que son relevantes para ti. También nos ayuda que corras la voz: haz referencia al proyecto desde tu blog y artículos, enlaza con él desde tu sitio web, o simplemente destaca para decir "yo lo uso":

source: In case a contribution/issue involves changes to the API principles or changes to dependencies or supported versions, it must be backed by a :ref:`slep`, where a SLEP must be submitted as a pull-request to `enhancement proposals <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ using the `SLEP template <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_ and follows the decision-making process outlined in :ref:`governance`.
es_es: En el caso de que una contribución/incidencia implique cambios en los principios de la API o cambios en las dependencias o en las versiones soportadas, debe estar respaldada por un :ref:`slep`, donde un SLEP debe ser enviado como un pull request a `propuestas de mejora <https://scikit-learn-enhancement-proposals.readthedocs.io>`_ utilizando la plantilla `SLEP <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep_template.html>`_ y sigue el proceso de toma de decisiones descrito en :ref:`governance`.

source: Contributing to related projects
es_es: Contribuyendo a proyectos relacionados

source: Scikit-learn thrives in an ecosystem of several related projects, which also may have relevant issues to work on, including smaller projects such as:
es_es: Scikit-learn prospera en un ecosistema de varios proyectos relacionados, que también pueden tener incidencias relevantes en los que trabajar, incluyendo proyectos más pequeños como:

source: and larger projects:
es_es: y proyectos más grandes:

source: and so on.
es_es: y así sucesivamente.

source: Look for issues marked "help wanted" or similar. Helping these projects may help Scikit-learn too. See also :ref:`related_projects`.
es_es: Busca incidencias marcadas como "se necesita ayuda"("help wanted") o similares. Ayudar a estos proyectos puede ayudar a Scikit-learn también. Ver también :ref:`related_projects`.

source: Submitting a bug report or a feature request
es_es: Enviar un informe de errores o una solicitud de funcionalidad(feature request)

source: We use GitHub issues to track all bugs and feature requests; feel free to open an issue if you have found a bug or wish to see a feature implemented.
es_es: Utilizamos las incidencias(issues) de GitHub para hacer un seguimiento de todos los errores y solicitudes de funcionalidades; no dudes en abrir una incidencia si has encontrado un error o deseas que se implemente una funcionalidad.

source: In case you experience issues using this package, do not hesitate to submit a ticket to the `Bug Tracker <https://github.com/scikit-learn/scikit-learn/issues>`_. You are also welcome to post feature requests or pull requests.
es_es: En caso de que experimentes incidencias al utilizar este paquete, no dudes en enviar un ticket al `Rastreador de errores <https://github.com/scikit-learn/scikit-learn/issues>`_. También puedes enviar solicitudes de funcionalidad o pull requests.

source: It is recommended to check that your issue complies with the following rules before submitting:
es_es: Se recomienda comprobar que tu incidencia se ajusta a las siguientes normas antes de presentarlo:

source: Verify that your issue is not being currently addressed by other `issues <https://github.com/scikit-learn/scikit-learn/issues?q=>`_ or `pull requests <https://github.com/scikit-learn/scikit-learn/pulls?q=>`_.
es_es: Comprueba que tu incidencia(issue) no está siendo tratada por otros `issues <https://github.com/scikit-learn/scikit-learn/issues?q=>`_ o `pull requests <https://github.com/scikit-learn/scikit-learn/pulls?q=>`_.

source: If you are submitting an algorithm or feature request, please verify that the algorithm fulfills our `new algorithm requirements <http://scikit-learn.org/stable/faq.html#what-are-the-inclusion-criteria-for-new-algorithms>`_.
es_es: Si estás enviando una solicitud de algoritmo o funcionalidad, por favor verifica que el algoritmo cumple con nuestros `nuevos requisitos del algoritmo <http://scikit-learn.org/stable/faq.html#what-are-the-inclusion-criteria-for-new-algorithms>`_.

source: If you are submitting a bug report, we strongly encourage you to follow the guidelines in :ref:`filing_bugs`.
es_es: Si estás enviando un informe de errores, te recomendamos encarecidamente que sigas las directrices de :ref:`filing_bugs`.

source: How to make a good bug report
es_es: Cómo hacer un buen informe de errores

source: When you submit an issue to `Github <https://github.com/scikit-learn/scikit-learn/issues>`__, please do your best to follow these guidelines! This will make it a lot easier to provide you with good feedback:
es_es: Cuando envíes una incidencia a `Github <https://github.com/scikit-learn/scikit-learn/issues>`__, ¡haz lo posible por seguir estas directrices! Esto hará que sea mucho más fácil proporcionarte una buena retroalimentación:

source: The ideal bug report contains a **short reproducible code snippet**, this way anyone can try to reproduce the bug easily (see `this <https://stackoverflow.com/help/mcve>`_ for more details). If your snippet is longer than around 50 lines, please link to a `gist <https://gist.github.com>`_ or a github repo.
es_es: El informe de error ideal contiene un **corto fragmento de código reproducible**, de esta manera cualquiera puede intentar reproducir el error fácilmente (ver `esto <https://stackoverflow.com/help/mcve>`_ para más detalles). Si tu fragmento es más largo que unas 50 líneas, por favor, enlaza con un `gist <https://gist.github.com>`_ o un repo de github.

source: If not feasible to include a reproducible snippet, please be specific about what **estimators and/or functions are involved and the shape of the data**.
es_es: Si no es posible incluir un fragmento reproducible, por favor, especifica qué **estimadores y/o funciones están involucrados y la forma de los datos**.

source: If an exception is raised, please **provide the full traceback**.
es_es: Si se lanza una excepción, por favor **proporciona el rastreo(traceback) completo**.

source: Please include your **operating system type and version number**, as well as your **Python, scikit-learn, numpy, and scipy versions**. This information can be found by running the following code snippet::
es_es: Por favor, incluye tu **tipo de sistema operativo y número de versión**, así como tus **versiones de Python, scikit-learn, numpy y scipy**. Esta información se puede encontrar ejecutando el siguiente fragmento de código::

source: This utility function is only available in scikit-learn v0.20+. For previous versions, one has to explicitly run::
es_es: Esta función de utilidad sólo está disponible en scikit-learn v0.20+. Para versiones anteriores, hay que ejecutar explícitamente::

source: Please ensure all **code snippets and error messages are formatted in appropriate code blocks**. See `Creating and highlighting code blocks <https://help.github.com/articles/creating-and-highlighting-code-blocks>`_ for more details.
es_es: Por favor, asegúrate de que todos los **fragmentos de código y mensajes de error están formateados en bloques de código apropiados**. Consulta `Creación y resaltado de bloques de código <https://help.github.com/articles/creating-and-highlighting-code-blocks>`_ para obtener más detalles.

source: If you want to help curate issues, read :ref:`the following <bug_triaging>`.
es_es: Si quieres ayudar a curar los issues, lee :ref:`the following <bug_triaging>`.

source: Contributing code
es_es: Contribución de código

source: To avoid duplicating work, it is highly advised that you search through the `issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_ and the `PR list <https://github.com/scikit-learn/scikit-learn/pulls>`_. If in doubt about duplicated work, or if you want to work on a non-trivial feature, it's recommended to first open an issue in the `issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_ to get some feedbacks from core developers.
es_es: Para evitar la duplicación de trabajo, se recomienda encarecidamente que busques en el `rastreador de incidencias <https://github.com/scikit-learn/scikit-learn/issues>`_ y en la `PR list <https://github.com/scikit-learn/scikit-learn/pulls>`_. Si tienes dudas sobre la duplicación de trabajo, o si quieres trabajar en una funcionalidad no trivial, se recomienda abrir primero una incidencia en el `rastreador de incidencias <https://github.com/scikit-learn/scikit-learn/issues>`_ para obtener algunos comentarios de los desarrolladores principales.

source: One easy way to find an issue to work on is by applying the "help wanted" label in your search. This lists all the issues that have been unclaimed so far. In order to claim an issue for yourself, please comment exactly ``take`` on it for the CI to automatically assign the issue to you.
es_es: Una forma fácil de encontrar una incidencia en la que trabajar es aplicar la etiqueta "se busca ayuda"("help wanted") en tu búsqueda. En ella se enumeran todas las incidencias que no han sido reclamadas hasta el momento. Para reclamar un incidencia para ti, comenta exactamente ``take`` en ella para que el CI te asigne automáticamente la incidencia.

source: Video resources
es_es: Recursos de video

source: These videos are step-by-step introductions on how to contribute to scikit-learn, and are a great companion to the following text guidelines. Please make sure to still check our guidelines below, since they describe our latest up-to-date workflow.
es_es: Estos videos son introducciones paso a paso sobre cómo contribuir a scikit-learn, y son un gran complemento a las siguientes pautas de texto. Por favor, asegúrate de seguir revisando nuestras directrices a continuación, ya que describen nuestro último flujo de trabajo actualizado.

source: Crash Course in Contributing to Scikit-Learn & Open Source Projects: `Video <https://youtu.be/5OL8XoMMOfA>`__, `Transcript <https://github.com/data-umbrella/event-transcripts/blob/main/2020/05-andreas-mueller-contributing.md>`__
es_es: Curso intensivo de contribución a proyectos de Scikit-Learn y de código abierto: `Video <https://youtu.be/5OL8XoMMOfA>`__, `Traducción <https://github.com/data-umbrella/event-transcripts/blob/main/2020/05-andreas-mueller-contributing.md>`__

source: Example of Submitting a Pull Request to scikit-learn: `Video <https://youtu.be/PU1WyDPGePI>`__, `Transcript <https://github.com/data-umbrella/event-transcripts/blob/main/2020/06-reshama-shaikh-sklearn-pr.md>`__
es_es: Ejemplo de envío de un Pull Request a scikit-learn: `Video <https://youtu.be/PU1WyDPGePI>`__, `Traducción <https://github.com/data-umbrella/event-transcripts/blob/main/2020/06-reshama-shaikh-sklearn-pr.md>`__

source: Sprint-specific instructions and practical tips: `Video <https://youtu.be/p_2Uw2BxdhA>`__, `Transcript <https://github.com/data-umbrella/data-umbrella-scikit-learn-sprint/blob/master/3_transcript_ACM_video_vol2.md>`__
es_es: Instrucciones específicas para el sprint y consejos prácticos: `Video <https://youtu.be/p_2Uw2BxdhA>`__, `Traducción <https://github.com/data-umbrella/data-umbrella-scikit-learn-sprint/blob/master/3_transcript_ACM_video_vol2.md>`__

source: How to contribute
es_es: Cómo contribuir

source: The preferred way to contribute to scikit-learn is to fork the `main repository <https://github.com/scikit-learn/scikit-learn/>`__ on GitHub, then submit a "pull request" (PR).
es_es: La forma preferida de contribuir a scikit-learn es hacer un fork del `repositorio principal <https://github.com/scikit-learn/scikit-learn/>`__ en GitHub, y luego enviar un "pull request" (PR).

source: In the first few steps, we explain how to locally install scikit-learn, and how to set up your git repository:
es_es: En los primeros pasos, explicamos cómo instalar localmente scikit-learn, y cómo configurar tu repositorio git:

source: `Create an account <https://github.com/join>`_ on GitHub if you do not already have one.
es_es: `Crea una cuenta <https://github.com/join>`_ en GitHub si aún no tienes una.

source: Fork the `project repository <https://github.com/scikit-learn/scikit-learn>`__: click on the 'Fork' button near the top of the page. This creates a copy of the code under your account on the GitHub user account. For more details on how to fork a repository see `this guide <https://help.github.com/articles/fork-a-repo/>`_.
es_es: Haz un fork del `repositorio del proyecto <https://github.com/scikit-learn/scikit-learn>`__: haz clic en el botón 'Fork' cerca de la parte superior de la página. Esto crea una copia del código bajo tu cuenta en la cuenta de usuario de GitHub. Para más detalles sobre cómo bifurcar(fork) un repositorio véase `esta guía <https://help.github.com/articles/fork-a-repo/>`_.

source: Clone your fork of the scikit-learn repo from your GitHub account to your local disk:
es_es: Clona tu fork del repo de scikit-learn desde tu cuenta de GitHub a tu disco local:

source: Install the development dependencies:
es_es: Instala las dependencias de desarrollo:

source: Install scikit-learn in editable mode:
es_es: Instala scikit-learn en modo editable:

source: If you receive errors in building scikit-learn, see the :ref:`install_bleeding_edge` section.
es_es: Si recibes errores en la construcción de scikit-learn, consulta la sección :ref:`install_bleeding_edge`.

source: Add the ``upstream`` remote. This saves a reference to the main scikit-learn repository, which you can use to keep your repository synchronized with the latest changes:
es_es: Añade el remoto ``upstream``. Esto guarda una referencia al repositorio principal de scikit-learn, que puedes utilizar para mantener tu repositorio sincronizado con los últimos cambios:

source: You should now have a working installation of scikit-learn, and your git repository properly configured. The next steps now describe the process of modifying code and submitting a PR:
es_es: Ahora deberías tener una instalación de scikit-learn que funcione, y tu repositorio git correctamente configurado. Los siguientes pasos describen el proceso de modificación del código y el envío de un PR:

source: Synchronize your main branch with the upstream main branch:
es_es: Sincroniza tu rama principal con la rama principal ascendente(upstream):

source: Create a feature branch to hold your development changes:
es_es: Crea una rama de funcionalidad(feature) para mantener tus cambios de desarrollo:

source: and start making changes. Always use a feature branch. It's good practice to never work on the ``main`` branch!
es_es: y empieza a hacer cambios. Utiliza siempre una rama de funcionalidad. ¡Es una buena práctica no trabajar nunca en la rama ``main``!

source: (**Optional**) Install `pre-commit <https://pre-commit.com/#install>`_ to run code style checks before each commit:
es_es: (**Opcional**) Instala `pre-commit <https://pre-commit.com/#install>`_ para ejecutar comprobaciones de estilo de código antes de cada confirmación:

source: pre-commit checks can be disabled for a particular commit with `git commit -n`.
es_es: Las comprobaciones pre-commit pueden desactivarse para un commit particular con `git commit -n`.

source: Develop the feature on your feature branch on your computer, using Git to do the version control. When you're done editing, add changed files using ``git add`` and then ``git commit``:
es_es: Desarrolla la funcionalidad en tu rama de funcionalidad(feature) en tu ordenador, utilizando Git para hacer el control de versiones. Cuando termines de editar, añade los archivos modificados utilizando ``git add`` y luego ``git commit``:

source: to record your changes in Git, then push the changes to your GitHub account with:
es_es: para registrar tus cambios en Git, y luego subir(push) los cambios a tu cuenta de GitHub con:

source: Follow `these <https://help.github.com/articles/creating-a-pull-request-from-a-fork>`_ instructions to create a pull request from your fork. This will send an email to the committers. You may want to consider sending an email to the mailing list for more visibility.
es_es: Sigue `estas <https://help.github.com/articles/creating-a-pull-request-from-a-fork>`_ instrucciones para crear un pull request desde tu fork. Esto enviará un correo electrónico a los confirmantes. Puedes considerar enviar un correo electrónico a la lista de correo para tener más visibilidad.

source: If you are modifying a Cython module, you have to re-compile after modifications and before testing them:
es_es: Si estás modificando un módulo de Cython, tienes que volver a compilar después de las modificaciones y antes de probarlas:

source: Use the ``--no-build-isolation`` flag to avoid compiling the whole project each time, only the files you have modified.
es_es: Utiliza la opción ``--no-build-isolation`` para evitar compilar todo el proyecto cada vez, sólo los archivos que has modificado.

source: It is often helpful to keep your local feature branch synchronized with the latest changes of the main scikit-learn repository:
es_es: A menudo es útil mantener su rama local de funcionalidad sincronizada con los últimos cambios del repositorio principal de scikit-learn:

source: Subsequently, you might need to solve the conflicts. You can refer to the `Git documentation related to resolving merge conflict using the command line <https://help.github.com/articles/resolving-a-merge-conflict-using-the-command-line/>`_.
es_es: Posteriormente, es posible que tengas que resolver los conflictos. Puedes consultar la `documentación de Git relacionada con la resolución de conflictos de fusión utilizando la línea de comandos <https://help.github.com/articles/resolving-a-merge-conflict-using-the-command-line/>`_.

source: Learning git:
es_es: Aprendiendo git:

source: The `Git documentation <https://git-scm.com/documentation>`_ and http://try.github.io are excellent resources to get started with git, and understanding all of the commands shown here.
es_es: La `Documentación de Git <https://git-scm.com/documentation>`_ y http://try.github.io son excelentes recursos para iniciarse en git, y entender todos los comandos que se muestran aquí.

source: Pull request checklist
es_es: Lista de comprobación de pull request
