Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/contributing.po
Languages: es_es

source: Before a PR can be merged, it needs to be approved by two core developers. Please prefix the title of your pull request with ``[MRG]`` if the contribution is complete and should be subjected to a detailed review. An incomplete contribution -- where you expect to do more work before receiving a full review -- should be prefixed ``[WIP]`` (to indicate a work in progress) and changed to ``[MRG]`` when it matures. WIPs may be useful to: indicate you are working on something to avoid duplicated work, request broad review of functionality or API, or seek collaborators. WIPs often benefit from the inclusion of a `task list <https://github.com/blog/1375-task-lists-in-gfm-issues-pulls-comments>`_ in the PR description.
es_es: Antes de fusionar un PR, debe ser aprobado por dos desarrolladores centrales. Por favor, anteponga al título de su pull request el prefijo ``[MRG]`` si la contribución está completa y debe ser sometida a una revisión detallada. Una contribución incompleta -en la que se espera hacer más trabajo antes de recibir una revisión completa- debe llevar el prefijo ``[WIP]`` (para indicar que es un trabajo en curso) y cambiarlo por ``[MRG]`` cuando madure. Los WIPs pueden ser útiles para: indicar que se está trabajando en algo para evitar la duplicación de trabajo, solicitar una revisión amplia de la funcionalidad o la API, o buscar colaboradores. Los WIPs suelen beneficiarse de la inclusión de una `lista de tareas <https://github.com/blog/1375-task-lists-in-gfm-issues-pulls-comments>`_ en la descripción del PR.

source: In order to ease the reviewing process, we recommend that your contribution complies with the following rules before marking a PR as ``[MRG]``. The **bolded** ones are especially important:
es_es: Para facilitar el proceso de revisión, recomendamos que tu contribución cumpla con las siguientes reglas antes de marcar un PR como ``[MRG]``. Las **en negrita** son especialmente importantes:

source: **Give your pull request a helpful title** that summarises what your contribution does. This title will often become the commit message once merged so it should summarise your contribution for posterity. In some cases "Fix <ISSUE TITLE>" is enough. "Fix #<ISSUE NUMBER>" is never a good title.
es_es: **Ponle a tu pull request un título útil** que resuma lo que hace tu contribución. Este título a menudo se convertirá en el mensaje de confirmación una vez fusionado, por lo que debe resumir tu contribución para la posteridad. En algunos casos, "Fix <ISSUE TITLE>" es suficiente. "Fix #<ISSUE NUMBER>" nunca es un buen título.

source: **Make sure your code passes the tests**. The whole test suite can be run with `pytest`, but it is usually not recommended since it takes a long time. It is often enough to only run the test related to your changes: for example, if you changed something in `sklearn/linear_model/logistic.py`, running the following commands will usually be enough:
es_es: **Asegúrate de que tu código pasa las pruebas**. Se puede ejecutar toda la suite de pruebas con `pytest`, pero normalmente no se recomienda porque lleva mucho tiempo. A menudo es suficiente con ejecutar sólo las pruebas relacionadas con tus cambios: por ejemplo, si has cambiado algo en `sklearn/linear_model/logistic.py`, ejecutar los siguientes comandos suele ser suficiente:

source: `pytest sklearn/linear_model/logistic.py` to make sure the doctest examples are correct
es_es: `pytest sklearn/linear_model/logistic.py` para asegurarte de que los ejemplos de doctest son correctos

source: `pytest sklearn/linear_model/tests/test_logistic.py` to run the tests specific to the file
es_es: `pytest sklearn/linear_model/tests/test_logistic.py` para ejecutar las pruebas específicas del archivo

source: `pytest sklearn/linear_model` to test the whole :mod:`~sklearn.linear_model` module
es_es: `pytest sklearn/linear_model` para probar todo el módulo :mod:`~sklearn.linear_model`

source: `pytest doc/modules/linear_model.rst` to make sure the user guide examples are correct.
es_es: `pytest doc/modules/linear_model.rst` para asegurarte de que los ejemplos de la guía del usuario son correctos.

source: `pytest sklearn/tests/test_common.py -k LogisticRegression` to run all our estimator checks (specifically for `LogisticRegression`, if that's the estimator you changed).
es_es: `pytest sklearn/tests/test_common.py -k LogisticRegression` para ejecutar todas las comprobaciones de nuestros estimadores (específicamente para `LogisticRegression`, si es el estimador que has cambiado).

source: There may be other failing tests, but they will be caught by the CI so you don't need to run the whole test suite locally. For guidelines on how to use ``pytest`` efficiently, see the :ref:`pytest_tips`.
es_es: Puede haber otras pruebas que fallen, pero serán capturadas por el CI, por lo que no es necesario ejecutar toda la suite de pruebas localmente. Para obtener directrices sobre cómo utilizar ``pytest`` de manera eficiente, consulta la :ref:`pytest_tips`.

source: **Make sure your code is properly commented and documented**, and **make sure the documentation renders properly**. To build the documentation, please refer to our :ref:`contribute_documentation` guidelines. The CI will also build the docs: please refer to :ref:`generated_doc_CI`.
es_es: **Asegúrate de que tu código está correctamente comentado y documentado**, y **asegúrate de que la documentación se muestra correctamente**. Para construir la documentación, por favor consulta nuestra guía :ref:`contribute_documentation`. El CI también construirá la documentación: por favor, consulta :ref:`generated_doc_CI`.

source: **Tests are necessary for enhancements to be accepted**. Bug-fixes or new features should be provided with `non-regression tests <https://en.wikipedia.org/wiki/Non-regression_testing>`_. These tests verify the correct behavior of the fix or feature. In this manner, further modifications on the code base are granted to be consistent with the desired behavior. In the case of bug fixes, at the time of the PR, the non-regression tests should fail for the code base in the main branch and pass for the PR code.
es_es: **Las pruebas son necesarias para que se acepten las mejoras**. Las correcciones de errores o nuevas funcionalidades deben proporcionarse con las `pruebas de no regresión <https://en.wikipedia.org/wiki/Non-regression_testing>`_. Estas pruebas verifican el comportamiento correcto de la corrección o funcionalidad. De esta manera, se otorgan modificaciones adicionales en el código base para que sean coherentes con el comportamiento deseado. En el caso de las correcciones de errores, en el momento del PR, las pruebas de no regresión deben fallar para el código base en la rama principal y pasar para el código PR.

source: **Make sure that your PR does not add PEP8 violations**. To check the code that you changed, you can run the following command (see :ref:`above <upstream>` to set up the upstream remote):
es_es: **Asegúrate de que tu PR no añade violaciones de PEP8**. Para comprobar el código que has cambiado, puedes ejecutar el siguiente comando (ver :ref:`above <upstream>` para configurar el remoto upstream):

source: or `make flake8-diff` which should work on unix-like system.
es_es: o `make flake8-diff` que debería funcionar en sistemas tipo unix.

source: Follow the :ref:`coding-guidelines`.
es_es: Sigue las :ref:`coding-guidelines`.

source: When applicable, use the validation tools and scripts in the ``sklearn.utils`` submodule. A list of utility routines available for developers can be found in the :ref:`developers-utils` page.
es_es: Cuando sea aplicable, utiliza las herramientas y scripts de validación del submódulo ``sklearn.utils``. En la página :ref:`developers-utils` se puede encontrar una lista de rutinas de utilidad disponibles para los desarrolladores.

source: Often pull requests resolve one or more other issues (or pull requests). If merging your pull request means that some other issues/PRs should be closed, you should `use keywords to create link to them <https://github.com/blog/1506-closing-issues-via-pull-requests/>`_ (e.g., ``Fixes #1234``; multiple issues/PRs are allowed as long as each one is preceded by a keyword). Upon merging, those issues/PRs will automatically be closed by GitHub. If your pull request is simply related to some other issues/PRs, create a link to them without using the keywords (e.g., ``See also #1234``).
es_es: A menudo los pull requests resuelven una o más incidencias (o pull requests). Si la fusión de tu pull request significa que algunas otras incidencias/PRs deben ser cerradas, debe `utilizar palabras clave para crear un enlace a ellas <https://github.com/blog/1506-closing-issues-via-pull-requests/>`_ (por ejemplo, ``Fixes #1234``; se permiten múltiples incidencias/PRs siempre que cada una esté precedida por una palabra clave). Una vez fusionadas, esas incidencias/PRs serán cerradas automáticamente por GitHub. Si tu pull request está simplemente relacionada con otras incidencias/PRs, crea un enlace a ellas sin utilizar las palabras clave (por ejemplo, ``See also #1234``).

source: PRs should often substantiate the change, through benchmarks of performance and efficiency (see :ref:`monitoring_performances`) or through examples of usage. Examples also illustrate the features and intricacies of the library to users. Have a look at other examples in the `examples/ <https://github.com/scikit-learn/scikit-learn/tree/main/examples>`_ directory for reference. Examples should demonstrate why the new functionality is useful in practice and, if possible, compare it to other methods available in scikit-learn.
es_es: Los PRs deben justificar a menudo el cambio, a través de pruebas de rendimiento y eficiencia (ver :ref:`monitoring_performances`) o a través de ejemplos de uso. Los ejemplos también ilustran las características y complejidades de la biblioteca a los usuarios. Echa un vistazo a otros ejemplos en el directorio `examples/ <https://github.com/scikit-learn/scikit-learn/tree/main/examples>`_ como referencia. Los ejemplos deben demostrar por qué la nueva funcionalidad es útil en la práctica y, si es posible, compararla con otros métodos disponibles en scikit-learn.

source: New features often need to be illustrated with narrative documentation in the user guide, with small code snippets. If relevant, please also add references in the literature, with PDF links when possible.
es_es: A menudo, las nuevas funcionalidades deben ilustrarse con documentación narrativa en la guía del usuario, con pequeños fragmentos de código. Si es pertinente, añade también referencias en la literatura, con enlaces a PDF cuando sea posible.

source: The user guide should also include expected time and space complexity of the algorithm and scalability, e.g. "this algorithm can scale to a large number of samples > 100000, but does not scale in dimensionality: n_features is expected to be lower than 100".
es_es: La guía del usuario también debería incluir la complejidad temporal y espacial esperada del algoritmo y la escalabilidad, por ejemplo, "este algoritmo puede escalar a un gran número de muestras > 100000, pero no escala en dimensionalidad: se espera que n_features sea inferior a 100".

source: You can also check our :ref:`code_review` to get an idea of what reviewers will expect.
es_es: También puedes consultar nuestra :ref:`code_review` para hacerte una idea de lo que esperan los revisores.

source: You can check for common programming errors with the following tools:
es_es: Puedes comprobar los errores de programación más comunes con las siguientes herramientas:

source: Code with a good unittest coverage (at least 80%, better 100%), check with:
es_es: Código con una buena cobertura de pruebas unitarias(unitest) (al menos el 80%, mejor el 100%), comprobar con:

source: see also :ref:`testing_coverage`
es_es: ver también :ref:`testing_coverage`

source: Run static analysis with `mypy`:
es_es: Ejecuta el análisis estático con `mypy`:

source: must not produce new errors in your pull request. Using `# type: ignore` annotation can be a workaround for a few cases that are not supported by mypy, in particular,
es_es: no debe producir nuevos errores en tu pull request. El uso de la anotación `# type: ignore` puede ser una solución para algunos casos que no son soportados por mypy, en particular,

source: when importing C or Cython modules
es_es: al importar módulos C o Cython

source: on properties with decorators
es_es: en propiedades con decoradores

source: Bonus points for contributions that include a performance analysis with a benchmark script and profiling output (see :ref:`monitoring_performances`).
es_es: Puntos extra para las contribuciones que incluyan un análisis de rendimiento con un script de pruebas de rendimiento y la salida de perfiles (ver :ref:`monitoring_performances`).

source: Also check out the :ref:`performance-howto` guide for more details on profiling and Cython optimizations.
es_es: Consulta también la guía :ref:`performance-howto` para obtener más detalles sobre la creación de perfiles y las optimizaciones de Cython.

source: The current state of the scikit-learn code base is not compliant with all of those guidelines, but we expect that enforcing those constraints on all new contributions will get the overall code base quality in the right direction.
es_es: El estado actual de la base de código de scikit-learn no cumple con todas esas directrices, pero esperamos que la aplicación de esas restricciones en todas las nuevas contribuciones hará que la calidad general de la base de código vaya en la dirección correcta.

source: For two very well documented and more detailed guides on development workflow, please pay a visit to the `Scipy Development Workflow <https://docs.scipy.org/doc/numpy/dev/gitwash/development_workflow.html>`_ - and the `Astropy Workflow for Developers <https://astropy.readthedocs.io/en/latest/development/workflow/development_workflow.html>`_ sections.
es_es: Para dos guías muy bien documentadas y más detalladas sobre el flujo de trabajo de desarrollo, por favor visita las secciones `Flujo de trabajo de desarrollo de Scipy <https://docs.scipy.org/doc/numpy/dev/gitwash/development_workflow.html>`_ y `Flujo de trabajo de Astropy para desarrolladores <https://astropy.readthedocs.io/en/latest/development/workflow/development_workflow.html>`_.

source: Continuous Integration (CI)
es_es: Integración continua (CI)

source: Azure pipelines are used for testing scikit-learn on Linux, Mac and Windows, with different dependencies and settings.
es_es: Los pipelines de Azure se utilizan para probar scikit-learn en Linux, Mac y Windows, con diferentes dependencias y configuraciones.

source: CircleCI is used to build the docs for viewing, for linting with flake8, and for testing with PyPy on Linux
es_es: CircleCI se utiliza para construir los documentos para su visualización, para linting con flake8, y para las pruebas con PyPy en Linux

source: Please note that if one of the following markers appear in the latest commit message, the following actions are taken.
es_es: Ten en cuenta que si uno de los siguientes marcadores aparece en el último mensaje de confirmación, se toman las siguientes acciones.

source: Commit Message Marker
es_es: Marcador de mensaje de confirmación

source: Action Taken by CI
es_es: Medidas adoptadas por CI

source: CI is skipped completely
es_es: La CI se salta por completo

source: CD is run (wheels and source distribution are built)
es_es: Se ejecuta el CD (se construyen los wheels y la distribución fuente)

source: Azure pipeline skips linting
es_es: Azure pipeline se salta el linting

source: Add a Travis build with our dependencies (numpy, scipy, etc ...) development builds
es_es: Agrega una compilación de Travis con nuestras compilaciones de dependencias desarrollo (numpy, scipy, etc.)

source: Add a Travis build with the Intel C compiler (ICC)
es_es: Añade una compilación Travis con el compilador Intel C (ICC)

source: Add a Travis build for the ARM64 / aarch64 little endian architecture
es_es: Añade una compilación Travis para la arquitectura ARM64 / aarch64 little endian

source: Docs are not built
es_es: Los documentos no se construyen

source: Docs built, but excludes example gallery plots
es_es: Se crean los documentos, pero se excluyen los gráficos de la galería de ejemplo

source: Docs built including example gallery plots (very long)
es_es: Documentos creados que incluyen gráficos de galería de ejemplo (muy largos)

source: Note that, by default, the documentation is built but only the examples that are directly modified by the pull request are executed.
es_es: Ten en cuenta que, por defecto, se construye la documentación, pero sólo se ejecutan los ejemplos que son modificados directamente por el pull request.

source: Stalled pull requests
es_es: Pull requests estancados(stalled)

source: As contributing a feature can be a lengthy process, some pull requests appear inactive but unfinished. In such a case, taking them over is a great service for the project.
es_es: Como contribuir con una funcionalidad puede ser un proceso largo, algunos pull requests aparecen inactivos pero sin terminar. En tal caso, hacerse cargo de ellos es un gran servicio para el proyecto.

source: A good etiquette to take over is:
es_es: Una buena etiqueta para hacerse cargo es:

source: **Determine if a PR is stalled**
es_es: **Determina si un PR está estancado**

source: A pull request may have the label "stalled" or "help wanted" if we have already identified it as a candidate for other contributors.
es_es: Un pull request puede tener la etiqueta "stalled" o "help wanted" si ya lo hemos identificado como candidato para otros colaboradores.

source: To decide whether an inactive PR is stalled, ask the contributor if she/he plans to continue working on the PR in the near future. Failure to respond within 2 weeks with an activity that moves the PR forward suggests that the PR is stalled and will result in tagging that PR with "help wanted".
es_es: Para decidir si un PR inactivo está estancado, pregunta al colaborador si tiene previsto seguir trabajando en el PR en un futuro próximo. Si no se responde en un plazo de 2 semanas con una actividad que haga avanzar el PR, se sugiere que el PR está estancado y se etiquetará ese PR con "help wanted".

source: Note that if a PR has received earlier comments on the contribution that have had no reply in a month, it is safe to assume that the PR is stalled and to shorten the wait time to one day.
es_es: Ten en cuenta que si un PR ha recibido comentarios anteriores sobre la contribución que no han tenido respuesta en un mes, es seguro asumir que el PR está estancado y acortar el tiempo de espera a un día.

source: After a sprint, follow-up for un-merged PRs opened during sprint will be communicated to participants at the sprint, and those PRs will be tagged "sprint". PRs tagged with "sprint" can be reassigned or declared stalled by sprint leaders.
es_es: Después de un sprint, el seguimiento de los PRs no fusionados abiertos durante el sprint se comunicará a los participantes en el sprint, y esos PRs serán etiquetados como "sprint". Los PRs etiquetados con "sprint" pueden ser reasignados o declarados estancados por los líderes del sprint.

source: **Taking over a stalled PR**: To take over a PR, it is important to comment on the stalled PR that you are taking over and to link from the new PR to the old one. The new PR should be created by pulling from the old one.
es_es: **Toma el control de un PR estancado**: Para tomar un PR, es importante comentar el PR estancado que se está tomando y enlazar desde el nuevo PR al antiguo. El nuevo PR debe crearse a partir del anterior.

source: Stalled and Unclaimed Issues
es_es: Incidencias estancadas y no reclamadas

source: Generally speaking, issues which are up for grabs will have a `"help wanted" <https://github.com/scikit-learn/scikit-learn/labels/help%20wanted>`_. tag. However, not all issues which need contributors will have this tag, as the "help wanted" tag is not always up-to-date with the state of the issue. Contributors can find issues which are still up for grabs using the following guidelines:
es_es: Por lo general, las incidencias(issues) que están disponibles tendrán una etiqueta de `"help wanted" <https://github.com/scikit-learn/scikit-learn/labels/help%20wanted>`_. Sin embargo, no todas las incidencias que necesitan colaboradores tendrán esta etiqueta, ya que la etiqueta "help wanted" no siempre está actualizada con el estado de la incidencia. Los colaboradores pueden encontrar las incidencias que aún están disponibles siguiendo las siguientes directrices:

source: First, to **determine if an issue is claimed**:
es_es: En primer lugar, **determinar si se reclama una incidencia**:

source: Check for linked pull requests
es_es: Comprueba los pull requests vinculados

source: Check the conversation to see if anyone has said that they're working on creating a pull request
es_es: Comprueba la conversación para ver si alguien ha dicho que está trabajando en la creación de un pull request

source: If a contributor comments on an issue to say they are working on it, a pull request is expected within 2 weeks (new contributor) or 4 weeks (contributor or core dev), unless an larger time frame is explicitly given. Beyond that time, another contributor can take the issue and make a pull request for it. We encourage contributors to comment directly on the stalled or unclaimed issue to let community members know that they will be working on it.
es_es: Si un colaborador comenta una incidencia para decir que está trabajando en ella, se espera un pull request en un plazo de 2 semanas (nuevo colaborador) o 4 semanas (colaborador o desarrollador central), a menos que se indique explícitamente un plazo mayor. Más allá de ese plazo, otro colaborador puede tomar la incidencia y hacer un pull request para ella. Animamos a los colaboradores a que comenten directamente la incidencia estancada o no reclamada para que los miembros de la comunidad sepan que van a trabajar en ella.

source: If the issue is linked to a :ref:`stalled pull request <stalled_pull_request>`, we recommend that contributors follow the procedure described in the :ref:`stalled_pull_request` section rather than working directly on the issue.
es_es: Si la incidencia está vinculada a una :ref:`stalled pull request <stalled_pull_request>`, recomendamos que los colaboradores sigan el procedimiento descrito en la sección :ref:`stalled_pull_request` en lugar de trabajar directamente en la incidencia.

source: Issues for New Contributors
es_es: Incidencias para los nuevos colaboradores

source: New contributors should look for the following tags when looking for issues. We strongly recommend that new contributors tackle "easy" issues first: this helps the contributor become familiar with the contribution workflow, and for the core devs to become acquainted with the contributor; besides which, we frequently underestimate how easy an issue is to solve!
es_es: Los nuevos colaboradores deben buscar las siguientes etiquetas cuando busquen incidencias. Recomendamos encarecidamente que los nuevos colaboradores se ocupen primero de las incidencias "fáciles"("easy"): esto ayuda a que el colaborador se familiarice con el flujo de trabajo de las contribuciones, y a que los desarrolladores centrales se familiaricen con el colaborador; además, ¡a menudo subestimamos lo fácil que es resolver una incidencia!

source: good first issue tag
es_es: etiqueta good first issue
