Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/contributing.po
Languages: es_es

source: To run the benchmarks without comparing to another branch, use the `run` command:
es_es: Para ejecutar las pruebas de rendimiento sin comparar con otra rama, utiliza el comando `run`:

source: You can also run the benchmark suite using the version of scikit-learn already installed in your current Python environment:
es_es: También puedes ejecutar la suite de pruebas de rendimiento utilizando la versión de scikit-learn ya instalada en tu entorno actual de Python:

source: It's particulary useful when you installed scikit-learn in editable mode to avoid creating a new environment each time you run the benchmarks. By default the results are not saved when using an existing installation. To save the results you must specify a commit hash:
es_es: Es particularmente útil cuando se instala scikit-learn en modo editable para evitar la creación de un nuevo entorno cada vez que se ejecutan las pruebas de rendimiento. Por defecto, los resultados no se guardan cuando se utiliza una instalación existente. Para guardar los resultados debes especificar un hash de confirmación:

source: Benchmarks are saved and organized by machine, environment and commit. To see the list of all saved benchmarks:
es_es: Las pruebas de rendimiento se guardan y organizan por máquina, entorno y confirmación(commit). Para ver la lista de todas las pruebas de rendimiento guardadas:

source: and to see the report of a specific run:
es_es: y para ver el informe de una ejecución específica:

source: When running benchmarks for a pull request you're working on please report the results on github.
es_es: Cuando ejecutes las pruebas de rendimiento para un pull request en el que estés trabajando, por favor, informa de los resultados en github.

source: The benchmark suite supports additional configurable options which can be set in the `benchmarks/config.json` configuration file. For example, the benchmarks can run for a provided list of values for the `n_jobs` parameter.
es_es: La suite de pruebas de rendimiento soporta opciones configurables adicionales que pueden establecerse en el archivo de configuración `benchmarks/config.json`. Por ejemplo, las pruebas de rendimiento pueden ejecutarse para una lista de valores proporcionada para el parámetro `n_jobs`.

source: More information on how to write a benchmark and how to use asv can be found in the `asv documentation <https://asv.readthedocs.io/en/latest/index.html>`_.
es_es: Más información sobre cómo escribir una prueba de rendimiento y cómo utilizar asv, puedes encontrarla en la `documentación de asv <https://asv.readthedocs.io/en/latest/index.html>`_.

source: Issue Tracker Tags
es_es: Etiquetas del rastreador de incidencias

source: All issues and pull requests on the `GitHub issue tracker <https://github.com/scikit-learn/scikit-learn/issues>`_ should have (at least) one of the following tags:
es_es: Todas las incidencias(issues) y pull requests en el `Rastreador de incidencias en GitHub <https://github.com/scikit-learn/scikit-learn/issues>`_ deben tener (al menos) una de las siguientes etiquetas:

source: Bug / Crash
es_es: Bug / Crash (Error/fallo)

source: Something is happening that clearly shouldn't happen. Wrong results as well as unexpected errors from estimators go here.
es_es: Está ocurriendo algo que claramente no debería ocurrir. Los resultados erróneos así como los errores inesperados de los estimadores van aquí.

source: Cleanup / Enhancement
es_es: Cleanup / Enhancement (Limpieza / Mejora)

source: Improving performance, usability, consistency.
es_es: Mejorar el rendimiento, la usabilidad y la coherencia.

source: Missing, incorrect or sub-standard documentations and examples.
es_es: Documentación y ejemplos que faltan, son incorrectos o están por debajo del estándar.

source: New Feature
es_es: New Feature (Nueva funcionalidad)

source: Feature requests and pull requests implementing a new feature.
es_es: Solicitudes de funcionalidad y pull requests que implementan una nueva funcionalidad.

source: There are four other tags to help new contributors:
es_es: Hay otras cuatro etiquetas para ayudar a los nuevos colaboradores:

source: good first issue
es_es: good first issue (buena primera incidencia)

source: This issue is ideal for a first contribution to scikit-learn. Ask for help if the formulation is unclear. If you have already contributed to scikit-learn, look at Easy issues instead.
es_es: Esta incidencia es ideal para una primera contribución a scikit-learn. Pide ayuda si la formulación no es clara. Si ya has contribuido a scikit-learn, mira en su lugar las incidencias Easy(fácil).

source: Easy
es_es: Easy (fácil)

source: This issue can be tackled without much prior experience.
es_es: Esta incidencia puede abordarse sin mucha experiencia previa.

source: Moderate
es_es: Moderate (moderado)

source: Might need some knowledge of machine learning or the package, but is still approachable for someone new to the project.
es_es: Puede que se necesiten algunos conocimientos de aprendizaje automático o del paquete, pero sigue siendo accesible para alguien nuevo en el proyecto.

source: help wanted
es_es: help wanted (se necesita ayuda)

source: This tag marks an issue which currently lacks a contributor or a PR that needs another contributor to take over the work. These issues can range in difficulty, and may not be approachable for new contributors. Note that not all issues which need contributors will have this tag.
es_es: Esta etiqueta marca una incidencia que actualmente carece de un colaborador o un PR que necesita que otro colaborador se haga cargo del trabajo. Estas incidencias pueden variar en dificultad, y pueden no ser accesibles para los nuevos colaboradores. Ten en cuenta que no todas las incidencias que necesitan colaboradores tendrán esta etiqueta.

source: Maintaining backwards compatibility
es_es: Mantener la compatibilidad con versiones anteriores

source: Deprecation
es_es: Obsolescencia

source: If any publicly accessible method, function, attribute or parameter is renamed, we still support the old one for two releases and issue a deprecation warning when it is called/passed/accessed. E.g., if the function ``zero_one`` is renamed to ``zero_one_loss``, we add the decorator ``deprecated`` (from ``sklearn.utils``) to ``zero_one`` and call ``zero_one_loss`` from that function::
es_es: Si cualquier método, función, atributo o parámetro de acceso público es renombrado, seguimos soportando el antiguo durante dos versiones y emitimos una advertencia de obsolescencia cuando es llamado/pasado/accesado. Por ejemplo, si la función ``zero_one`` es renombrada a ``zero_one_loss``, añadimos el decorador ``deprecated`` (de ``sklearn.utils``) a ``zero_one`` y llamamos a ``zero_one_loss`` desde esa función::

source: If an attribute is to be deprecated, use the decorator ``deprecated`` on a property. Please note that the ``property`` decorator should be placed before the ``deprecated`` decorator for the docstrings to be rendered properly. E.g., renaming an attribute ``labels_`` to ``classes_`` can be done as::
es_es: Si un atributo va a ser obsoleto, utiliza el decorador ``deprecated`` en uno property. Ten en cuenta que el decorador ``property`` debe colocarse antes del decorador ``deprecated`` para que las cadenas de documentación se muestren correctamente. Por ejemplo, cambiar el nombre de un atributo ``labels_`` a ``classes_`` puede hacerse como::

source: If a parameter has to be deprecated, a ``FutureWarning`` warning must be raised too. In the following example, k is deprecated and renamed to n_clusters::
es_es: Si un parámetro tiene que quedar obsoleto, una advertencia ``FutureWarning`` debe ser levantada también. En el siguiente ejemplo, k está obsoleto y se ha renombrado a n_clusters::

source: When the change is in a class, we validate and raise warning in ``fit``::
es_es: Cuando el cambio es en una clase, validamos y levantamos la advertencia en ``fit``::

source: As in these examples, the warning message should always give both the version in which the deprecation happened and the version in which the old behavior will be removed. If the deprecation happened in version 0.x-dev, the message should say deprecation occurred in version 0.x and the removal will be in 0.(x+2), so that users will have enough time to adapt their code to the new behaviour. For example, if the deprecation happened in version 0.18-dev, the message should say it happened in version 0.18 and the old behavior will be removed in version 0.20.
es_es: Como en estos ejemplos, el mensaje de advertencia debería indicar siempre tanto la versión en la que se produjo la obsolescencia como la versión en la que se eliminará el antiguo comportamiento. Si la obsolescencia ocurrió en la versión 0.x-dev, el mensaje debería decir que la obsolescencia ocurrió en la versión 0.x y que la eliminación será en 0.(x+2), para que los usuarios tengan tiempo suficiente para adaptar su código al nuevo comportamiento. Por ejemplo, si la obsolescencia se produjo en la versión 0.18-dev, el mensaje debería decir que se produjo en la versión 0.18 y que el antiguo comportamiento se eliminará en la versión 0.20.

source: In addition, a deprecation note should be added in the docstring, recalling the same information as the deprecation warning as explained above. Use the ``.. deprecated::`` directive::
es_es: Además, debe añadirse una nota de obsolescencia en la cadena de documentación, recordando la misma información que la advertencia de obsolescencia explicada anteriormente. Utiliza la directiva ``.. deprecated::``::

source: What's more, a deprecation requires a test which ensures that the warning is raised in relevant cases but not in other cases. The warning should be caught in all other tests (using e.g., ``@pytest.mark.filterwarnings``), and there should be no warning in the examples.
es_es: Además, una obsolescencia requiere una prueba que garantice que la advertencia se produzca en los casos pertinentes, pero no en los demás. La advertencia debe capturarse en todas las demás pruebas (utilizando, por ejemplo, ``@pytest.mark.filterwarnings``), y no debe haber ninguna advertencia en los ejemplos.

source: Change the default value of a parameter
es_es: Cambiar el valor por defecto de un parámetro

source: If the default value of a parameter needs to be changed, please replace the default value with a specific value (e.g., ``warn``) and raise ``FutureWarning`` when users are using the default value. In the following example, we change the default value of ``n_clusters`` from 5 to 10 (current version is 0.20)::
es_es: Si es necesario cambiar el valor por defecto de un parámetro, sustituye el valor por defecto por un valor específico (por ejemplo, ``warn``) y lance ``FutureWarning`` cuando los usuarios utilicen el valor por defecto. En el siguiente ejemplo, cambiamos el valor por defecto de ``n_clusters`` de 5 a 10 (la versión actual es 0.20)::

source: Similar to deprecations, the warning message should always give both the version in which the change happened and the version in which the old behavior will be removed. The docstring needs to be updated accordingly. We need a test which ensures that the warning is raised in relevant cases but not in other cases. The warning should be caught in all other tests (using e.g., ``@pytest.mark.filterwarnings``), and there should be no warning in the examples.
es_es: Como en el caso de las obsolescencias, el mensaje de advertencia debe indicar siempre la versión en la que se ha producido el cambio y la versión en la que se eliminará el antiguo comportamiento. En consecuencia, la cadena de documentación debe actualizarse. Necesitamos una prueba para garantizar que la advertencia se produce en los casos pertinentes, pero no en otros casos. La advertencia debe ser capturada en todas las demás pruebas (usando, por ejemplo, ``@pytest.mark.filterwarnings``), y no debe haber ninguna advertencia en los ejemplos.

source: Code Review Guidelines
es_es: Pautas para la revisión del código

source: Reviewing code contributed to the project as PRs is a crucial component of scikit-learn development. We encourage anyone to start reviewing code of other developers. The code review process is often highly educational for everybody involved. This is particularly appropriate if it is a feature you would like to use, and so can respond critically about whether the PR meets your needs. While each pull request needs to be signed off by two core developers, you can speed up this process by providing your feedback.
es_es: La revisión del código aportado al proyecto como PRs es un componente crucial del desarrollo de scikit-learn. Animamos a cualquiera a empezar a revisar el código de otros desarrolladores. El proceso de revisión de código es a menudo muy educativo para todos los involucrados. Esto es particularmente apropiado si se trata de una característica que te gustaría utilizar, y así puedes responder críticamente sobre si el PR satisface tus necesidades. Aunque cada pull request debe ser aprobado por dos desarrolladores principales, puedes acelerar este proceso aportando tus comentarios.

source: Here are a few important aspects that need to be covered in any code review, from high-level questions to a more detailed check-list.
es_es: He aquí algunos aspectos importantes que deben cubrirse en cualquier revisión de código, desde preguntas de alto nivel hasta una lista de comprobación más detallada.

source: Do we want this in the library? Is it likely to be used? Do you, as a scikit-learn user, like the change and intend to use it? Is it in the scope of scikit-learn? Will the cost of maintaining a new feature be worth its benefits?
es_es: ¿Lo queremos en la biblioteca? ¿Es probable que se utilice? ¿A usted, como usuario de scikit-learn, le gusta el cambio y tiene la intención de utilizarlo? ¿Está dentro del alcance de scikit-learn? ¿Valdrá la pena el coste de mantenimiento de una nueva característica?

source: Is the code consistent with the API of scikit-learn? Are public functions/classes/parameters well named and intuitively designed?
es_es: ¿Es el código coherente con la API de scikit-learn? ¿Las funciones/clases/parámetros públicos están bien nombrados y diseñados intuitivamente?

source: Are all public functions/classes and their parameters, return types, and stored attributes named according to scikit-learn conventions and documented clearly?
es_es: ¿Están todas las funciones/clases públicas y sus parámetros, tipos de retorno y atributos almacenados nombrados de acuerdo con las convenciones de scikit-learn y documentados claramente?

source: Is any new functionality described in the user-guide and illustrated with examples?
es_es: ¿Se describen las nuevas funcionalidades en la guía del usuario y se ilustran con ejemplos?

source: Is every public function/class tested? Are a reasonable set of parameters, their values, value types, and combinations tested? Do the tests validate that the code is correct, i.e. doing what the documentation says it does? If the change is a bug-fix, is a non-regression test included? Look at `this <https://jeffknupp.com/blog/2013/12/09/improve-your-python-understanding-unit-testing>`__ to get started with testing in Python.
es_es: ¿Se prueban todas las funciones/clases públicas? ¿Se prueba un conjunto razonable de parámetros, sus valores, tipos de valores y combinaciones? ¿Las pruebas validan que el código es correcto, es decir, que hace lo que dice la documentación? Si el cambio es una corrección de errores, ¿se incluye una prueba de no regresión? Mira `esto <https://jeffknupp.com/blog/2013/12/09/improve-your-python-understanding-unit-testing>`__ para empezar con las pruebas en Python.

source: Do the tests pass in the continuous integration build? If appropriate, help the contributor understand why tests failed.
es_es: ¿Pasan las pruebas en la compilación de integración continua? Si procede, ayuda al colaborador a entender por qué han fallado las pruebas.
