Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/develop.po
Languages: es_es

source: Developing scikit-learn estimators
es_es: Desarrollando estimadores de scikit-learn

source: Whether you are proposing an estimator for inclusion in scikit-learn, developing a separate package compatible with scikit-learn, or implementing custom components for your own projects, this chapter details how to develop objects that safely interact with scikit-learn Pipelines and model selection tools.
es_es: Ya sea que estes proponiendo un estimador para su inclusión en scikit-learn, desarrollando un paquete separado compatible con scikit-learn, o implementando componentes personalizados para tus propios proyectos, este capítulo detalla cómo desarrollar objetos que interactúan de forma segura con los Pipelines de scikit-learn y las herramientas de selección de modelos.

source: APIs of scikit-learn objects
es_es: APIs de objetos de scikit-learn

source: To have a uniform API, we try to have a common basic API for all the objects. In addition, to avoid the proliferation of framework code, we try to adopt simple conventions and limit to a minimum the number of methods an object must implement.
es_es: Para tener una API uniforme, intentamos tener una API básica común para todos los objetos. Además, para evitar la proliferación de código del framework, intentamos adoptar convenciones sencillas y limitar al mínimo el número de métodos que debe implementar un objeto.

source: Elements of the scikit-learn API are described more definitively in the :ref:`glossary`.
es_es: Los elementos de la API de scikit-learn se describen de forma más definitiva en el :ref:`glosary`.

source: Different objects
es_es: Objetos diferentes

source: The main objects in scikit-learn are (one class can implement multiple interfaces):
es_es: Los objetos principales en scikit-learn son (una clase puede implementar múltiples interfaces):

source: Estimator
es_es: Estimador

source: The base object, implements a ``fit`` method to learn from data, either::
es_es: El objeto base, implementa un método ``fit`` para aprender de los datos, o bien::

source: or::
es_es: o::

source: For supervised learning, or some unsupervised problems, implements::
es_es: Para el aprendizaje supervisado, o algunos problemas no supervisados, implementa::

source: Classification algorithms usually also offer a way to quantify certainty of a prediction, either using ``decision_function`` or ``predict_proba``::
es_es: Los algoritmos de clasificación generalmente también ofrecen una manera de cuantificar la certidumbre de una predicción, ya sea usando ``decision_function`` o ``predict_proba``::

source: Transformer
es_es: Transformador

source: For filtering or modifying the data, in a supervised or unsupervised way, implements::
es_es: Para filtrar o modificar los datos, de forma supervisada o no supervisada, implementa::

source: When fitting and transforming can be performed much more efficiently together than separately, implements::
es_es: Cuando se ajusta y transforma se puede realizar de forma mucho más eficiente juntos que por separado, implementa::

source: Model
es_es: Modelo

source: A model that can give a `goodness of fit <https://en.wikipedia.org/wiki/Goodness_of_fit>`_ measure or a likelihood of unseen data, implements (higher is better)::
es_es: Un modelo que puede dar una medida de `bondad de ajuste <https://es.wikipedia.org/wiki/Bondad_de_ajuste>`_ o una probabilidad de los datos no vistos, implementa (mayor es mejor)::

source: Estimators
es_es: Estimadores

source: The API has one predominant object: the estimator. An estimator is an object that fits a model based on some training data and is capable of inferring some properties on new data. It can be, for instance, a classifier or a regressor. All estimators implement the fit method::
es_es: La API tiene un objeto predominante: el estimador. Un estimador es un objeto que se ajusta a un modelo basado en algunos datos de capacitación y es capaz de inferir algunas propiedades sobre nuevos datos. Puede ser, por ejemplo, un clasificador o un regresor. Todos los estimadores implementan el método de ajuste::

source: All built-in estimators also have a ``set_params`` method, which sets data-independent parameters (overriding previous parameter values passed to ``__init__``).
es_es: Todos los estimadores incorporados también tienen un método ``set_params``, que establece parámetros independientes de los datos (anulando los valores de los parámetros anteriores pasados a ``__init__``).

source: All estimators in the main scikit-learn codebase should inherit from ``sklearn.base.BaseEstimator``.
es_es: Todos los estimadores en el código base principal de scikit-learn deben heredar de ``sklearn.base.BaseEstimator``.

source: Instantiation
es_es: Instanciación

source: This concerns the creation of an object. The object's ``__init__`` method might accept constants as arguments that determine the estimator's behavior (like the C constant in SVMs). It should not, however, take the actual training data as an argument, as this is left to the ``fit()`` method::
es_es: Se trata de la creación de un objeto. El método ``__init__`` del objeto puede aceptar constantes como argumentos que determinen el comportamiento del estimador (como la constante C en los SVM). Sin embargo, no debería tomar los datos de entrenamiento como argumento, ya que esto se deja al método ``fit()``::

source: The arguments accepted by ``__init__`` should all be keyword arguments with a default value. In other words, a user should be able to instantiate an estimator without passing any arguments to it. The arguments should all correspond to hyperparameters describing the model or the optimisation problem the estimator tries to solve. These initial arguments (or parameters) are always remembered by the estimator. Also note that they should not be documented under the "Attributes" section, but rather under the "Parameters" section for that estimator.
es_es: Los argumentos aceptados por ``__init__`` deberían ser todos argumentos de palabra clave con un valor por defecto. En otras palabras, un usuario debe ser capaz de instanciar un estimador sin pasarle ningún argumento. Todos los argumentos deberían corresponder a hiperparámetros que describan el modelo o el problema de optimización que el estimador intenta resolver. Estos argumentos (o parámetros) iniciales son siempre recordados por el estimador. También hay que tener en cuenta que no deben documentarse en la sección "Atributos", sino en la sección "Parámetros" de ese estimador.

source: In addition, **every keyword argument accepted by** ``__init__`` **should correspond to an attribute on the instance**. Scikit-learn relies on this to find the relevant attributes to set on an estimator when doing model selection.
es_es: Además, **cada argumento de palabra clave aceptado por** ``__init__`` debe corresponder a un atributo en la instancia**. Scikit-learn se basa en esto para encontrar los atributos relevantes para establecer en un estimador al hacer la selección del modelo.

source: To summarize, an ``__init__`` should look like::
es_es: Para resumir, un ``__init__`` debería parecer así::

source: There should be no logic, not even input validation, and the parameters should not be changed. The corresponding logic should be put where the parameters are used, typically in ``fit``. The following is wrong::
es_es: No debería haber lógica, ni siquiera validación de entrada, y los parámetros no deberían cambiarse. La lógica correspondiente debería ponerse donde se utilizan los parámetros, normalmente en ``fit``. Lo siguiente es incorrecto::

source: The reason for postponing the validation is that the same validation would have to be performed in ``set_params``, which is used in algorithms like ``GridSearchCV``.
es_es: La razón para posponer la validación es que la misma validación tendría que realizarse en ``set_params``, que se utiliza en algoritmos como ``GridSearchCV``.

source: Fitting
es_es: Ajuste

source: The next thing you will probably want to do is to estimate some parameters in the model. This is implemented in the ``fit()`` method.
es_es: Lo siguiente que probablemente querras hacer es estimar algunos parámetros en el modelo. Esto está implementado en el método ``fit()``.

source: The ``fit()`` method takes the training data as arguments, which can be one array in the case of unsupervised learning, or two arrays in the case of supervised learning.
es_es: El método ``fit()`` toma los datos de entrenamiento como argumentos, que puede ser una matriz en el caso de aprendizaje no supervisado, o dos matrices en el caso de aprendizaje supervisado.

source: Note that the model is fitted using ``X`` and ``y``, but the object holds no reference to ``X`` and ``y``. There are, however, some exceptions to this, as in the case of precomputed kernels where this data must be stored for use by the predict method.
es_es: Ten en cuenta que el modelo se ajusta usando ``X`` y ``y``, pero el objeto no contiene ninguna referencia a ``X`` y ``y``. Sin embargo, hay algunas excepciones a esto. como en el caso de los núcleos precomputados donde estos datos deben ser almacenados para su uso por el método predeterminado.

source: Parameters
es_es: Parámetros

source: array-like of shape (n_samples, n_features)
es_es: array-like de forma (n_samples, n_features)

source: array-like of shape (n_samples,)
es_es: array-like de forma (n_samples,)

source: optional data-dependent parameters
es_es: parámetros opcionales dependientes de datos

source: ``X.shape[0]`` should be the same as ``y.shape[0]``. If this requisite is not met, an exception of type ``ValueError`` should be raised.
es_es: ``X.shape[0]`` debe ser el mismo que ``y.shape[0]``. Si no se cumple este requisito, se lanzará una excepción de tipo ``ValueError``.

source: ``y`` might be ignored in the case of unsupervised learning. However, to make it possible to use the estimator as part of a pipeline that can mix both supervised and unsupervised transformers, even unsupervised estimators need to accept a ``y=None`` keyword argument in the second position that is just ignored by the estimator. For the same reason, ``fit_predict``, ``fit_transform``, ``score`` and ``partial_fit`` methods need to accept a ``y`` argument in the second place if they are implemented.
es_es: ``y`` podría ignorarse en el caso del aprendizaje no supervisado. Sin embargo, para hacer posible el uso del estimador como parte de una cadena que puede mezclar transformadores supervisados y no supervisados, incluso los estimadores no supervisados necesitan aceptar un argumento de palabra clave ``y=None`` en la segunda posición que es simplemente ignorado por el estimador. Por la misma razón, los métodos ``fit_predict``, ``fit_transform``, ``score`` y ``partial_fit`` necesitan aceptar un argumento ``y`` en la segunda posición si se implementan.

source: The method should return the object (``self``). This pattern is useful to be able to implement quick one liners in an IPython session such as::
es_es: El método debe devolver el objeto (``self``). Este patrón es útil para poder implementar one liners rápidos en una sesión de IPython como::

source: Depending on the nature of the algorithm, ``fit`` can sometimes also accept additional keywords arguments. However, any parameter that can have a value assigned prior to having access to the data should be an ``__init__`` keyword argument. **fit parameters should be restricted to directly data dependent variables**. For instance a Gram matrix or an affinity matrix which are precomputed from the data matrix ``X`` are data dependent. A tolerance stopping criterion ``tol`` is not directly data dependent (although the optimal value according to some scoring function probably is).
es_es: Dependiendo de la naturaleza del algoritmo, ``fit`` a veces también puede aceptar argumentos de palabras clave adicionales. Sin embargo, cualquier parámetro al que se le pueda asignar un valor antes de tener acceso a los datos debería ser un argumento de palabra clave ``__init__``. **Los parámetros de fit deben restringirse a las variables directamente dependientes de los datos**. Por ejemplo, una matriz de Gram o una matriz de afinidad que se calculan previamente a partir de la matriz de datos ``X`` son dependientes de los datos. Un criterio de parada de tolerancia ``tol`` no depende directamente de los datos (aunque el valor óptimo según alguna función de puntuación probablemente lo sea).

source: When ``fit`` is called, any previous call to ``fit`` should be ignored. In general, calling ``estimator.fit(X1)`` and then ``estimator.fit(X2)`` should be the same as only calling ``estimator.fit(X2)``. However, this may not be true in practice when ``fit`` depends on some random process, see :term:`random_state`. Another exception to this rule is when the hyper-parameter ``warm_start`` is set to ``True`` for estimators that support it. ``warm_start=True`` means that the previous state of the trainable parameters of the estimator are reused instead of using the default initialization strategy.
es_es: Cuando se llama a ``fit``, cualquier llamada anterior a ``fit`` debe ser ignorada. En general, llamar a ``estimator.fit(X1)`` y luego a ``estimator.fit(X2)`` debería ser lo mismo que llamar sólo a ``estimator.fit(X2)``. Sin embargo, esto puede no ser cierto en la práctica cuando ``fit`` depende de algún proceso aleatorio, véase :term:`random_state``. Otra excepción a esta regla es cuando el hiperparámetro ``inicio de calentamiento`` se establece en ``Verdadero`` para los estimadores que lo admiten. El parámetro ``warm_start=True`` significa que se reutiliza el estado anterior de los parámetros entrenables del estimador en lugar de utilizar la estrategia de inicialización por defecto.

source: Estimated Attributes
es_es: Atributos estimados

source: Attributes that have been estimated from the data must always have a name ending with trailing underscore, for example the coefficients of some regression estimator would be stored in a ``coef_`` attribute after ``fit`` has been called.
es_es: Los atributos que se han estimado a partir de los datos deben tener siempre un nombre que termine con subrayado final, por ejemplo, los coeficientes de algún estimador de regresión se almacenarían en un atributo ``coef_`` después de que se haya llamado ``fit``.

source: The estimated attributes are expected to be overridden when you call ``fit`` a second time.
es_es: Se espera que los atributos estimados se anulen cuando llame a ``fit`` una segunda vez.

source: Optional Arguments
es_es: Argumentos opcionales

source: In iterative algorithms, the number of iterations should be specified by an integer called ``n_iter``.
es_es: En algoritmos iterativos, el número de iteraciones debe ser especificado por un entero llamado ``n_iter``.

source: Pairwise Attributes
es_es: Atributos en pareja

source: An estimator that accepts ``X`` of shape ``(n_samples, n_samples)`` and defines a :term:`_pairwise` property equal to ``True`` allows for cross-validation of the dataset, e.g. when ``X`` is a precomputed kernel matrix. Specifically, the :term:`_pairwise` property is used by ``utils.metaestimators._safe_split`` to slice rows and columns.
es_es: Un estimador que acepta ``X`` de la forma ``(n_samples, n_samples)`` y define una propiedad :term:`_pairwise` igual a ``True`` permite la validación cruzada del conjunto de datos, por ejemplo, cuando ``X`` es una matriz del núcleo precalculada. Específicamente, la propiedad :term:`_pairwise` es usada por ``utils.metaestimators._safe_split`` para cortar filas y columnas.

source: The _pairwise attribute is deprecated in 0.24. From 1.1 (renaming of 0.26) onward, the `pairwise` estimator tag should be used instead.
es_es: El atributo _pairwise queda obsoleto en 0.24. A partir de la versión 1.1 (cambio de nombre de la versión 0.26), se utilizará la etiqueta del estimador `pairwise`.

source: Universal attributes
es_es: Atributos universales

source: Estimators that expect tabular input should set a `n_features_in_` attribute at `fit` time to indicate the number of features that the estimator expects for subsequent calls to `predict` or `transform`. See `SLEP010 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep010/proposal.html>`_ for details.
es_es: Los estimadores que esperan una entrada tabular deben establecer un atributo `n_features_in_` en el momento de `fit` para indicar el número de características que el estimador espera para las siguientes llamadas a `predict` o `transform`. Ver `SLEP010 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep010/proposal.html>`_ para más detalles.

source: Rolling your own estimator
es_es: Rodando tu propio estimador

source: If you want to implement a new estimator that is scikit-learn-compatible, whether it is just for you or for contributing it to scikit-learn, there are several internals of scikit-learn that you should be aware of in addition to the scikit-learn API outlined above. You can check whether your estimator adheres to the scikit-learn interface and standards by running :func:`~sklearn.utils.estimator_checks.check_estimator` on an instance. The :func:`~sklearn.utils.estimator_checks.parametrize_with_checks` pytest decorator can also be used (see its docstring for details and possible interactions with `pytest`)::
es_es: Si quieres implementar un nuevo estimador que sea compatible con scikit-learn, ya sea sólo para ti o para contribuir a scikit-learn, hay varios aspectos internos de scikit-learn que debes conocer además de la API de scikit-learn descrita anteriormente. Puede comprobar si tu estimador se adhiere a la interfaz y las normas de scikit-learn ejecutando :func:`~sklearn.utils.estimator_checks.check_estimator` en una instancia. El decorador :func:`~sklearn.utils.estimator_checks.parametrize_with_checks` pytest también se puede utilizar (ver su docstring para más detalles y posibles interacciones con `pytest`)::

source: The main motivation to make a class compatible to the scikit-learn estimator interface might be that you want to use it together with model evaluation and selection tools such as :class:`model_selection.GridSearchCV` and :class:`pipeline.Pipeline`.
es_es: La motivación principal para hacer que una clase sea compatible con la interfaz de estimadores de scikit-learn puede ser que quieras usarla junto con la evaluación del modelo y herramientas de selección como :class:`model_selection. ridSearchCV` y :class:`pipeline.Pipeline`.

source: Before detailing the required interface below, we describe two ways to achieve the correct interface more easily.
es_es: Antes de detallar la interfaz requerida a continuación, describimos dos maneras de lograr la interfaz correcta más fácilmente.

source: We provide a `project template <https://github.com/scikit-learn-contrib/project-template/>`_ which helps in the creation of Python packages containing scikit-learn compatible estimators. It provides:
es_es: Proveemos una `plantilla de proyecto <https://github.com/scikit-learn-contrib/project-template/>`_ que ayuda en la creación de paquetes Python que contengan estimadores compatibles con scikit-learn. Provee:

source: an initial git repository with Python package directory structure
es_es: un repositorio git inicial con estructura de directorio de paquetes Python

source: a template of a scikit-learn estimator
es_es: una plantilla de un estimador de scikit-learn

source: an initial test suite including use of ``check_estimator``
es_es: una suite de pruebas inicial incluyendo el uso de ``check_estimator``

source: directory structures and scripts to compile documentation and example galleries
es_es: estructuras de directorios y scripts para compilar documentación y galerías de ejemplo

source: scripts to manage continuous integration (testing on Linux and Windows)
es_es: scripts para gestionar la integración continua (pruebas en Linux y Windows)

source: instructions from getting started to publishing on `PyPi <https://pypi.org/>`_
es_es: instrucciones para empezar a publicar en `PyPi <https://pypi.org/>`_

source: ``BaseEstimator`` and mixins:
es_es: ``BaseEstimator`` y mezclas:

source: We tend to use "duck typing", so building an estimator which follows the API suffices for compatibility, without needing to inherit from or even import any scikit-learn classes.
es_es: Tendemos a utilizar la "duck typing", por lo que la compilación de un estimador que sigue la API es suficiente para la compatibilidad, sin necesidad de heredar o incluso importar cualquier clase de scikit-learn.

source: However, if a dependency on scikit-learn is acceptable in your code, you can prevent a lot of boilerplate code by deriving a class from ``BaseEstimator`` and optionally the mixin classes in ``sklearn.base``. For example, below is a custom classifier, with more examples included in the scikit-learn-contrib `project template <https://github.com/scikit-learn-contrib/project-template/blob/master/skltemplate/_template.py>`__.
es_es: Sin embargo, si una dependencia de scikit-learn es aceptable en su código, puedes evitar un montón de código boilerplate derivando una clase de ``BaseEstimator`` y opcionalmente las clases mezcladas en ``sklearn.base``. Por ejemplo, a continuación se muestra un clasificador personalizado, con más ejemplos incluidos en scikit-learn-contrib en su `plantilla del proyecto <https://github.com/scikit-learn-contrib/project-template/blob/master/skltemplate/_template.py>`__.

source: get_params and set_params
es_es: get_params y set_params

source: All scikit-learn estimators have ``get_params`` and ``set_params`` functions. The ``get_params`` function takes no arguments and returns a dict of the ``__init__`` parameters of the estimator, together with their values.
es_es: Todas las estimaciones de scikit-learn tienen las funciones ``get_params`` y ``set_params``. La función ``get_params`` no toma argumentos y devuelve un diccionario (dict) de los parámetros ``__init__`` del estimador, junto con sus valores.

source: It must take one keyword argument, ``deep``, which receives a boolean value that determines whether the method should return the parameters of sub-estimators (for most estimators, this can be ignored). The default value for ``deep`` should be `True`. For instance considering the following estimator::
es_es: Debe tomar un argumento de palabra clave, ``deep``, que recibe un valor booleano que determina si el método debe devolver los parámetros de subestimadores (para la mayoría de los estimadores, esto puede ser ignorado). El valor por defecto para ``deep`` debe ser `True`. Por ejemplo considerando el siguiente estimador::

source: The parameter `deep` will control whether or not the parameters of the `subsestimator` should be reported. Thus when `deep=True`, the output will be::
es_es: El parámetro `deep` controlará si los parámetros del `subsestimator` deben ser reportados. Así que cuando `deep=True`, la salida será::

source: Often, the `subestimator` has a name (as e.g. named steps in a :class:`~sklearn.pipeline.Pipeline` object), in which case the key should become `<name>__C`, `<name>__class_weight`, etc.
es_es: A menudo, el `subestimador` tiene un nombre (como, por ejemplo, los pasos nombrados en un objeto :class:`~sklearn.pipeline.Pipeline`), en cuyo caso la clave debería convertirse en `<nombre>__C`, `<nombre>__class_weight`, etc.

source: While when `deep=False`, the output will be::
es_es: Mientras que cuando `deep=False`, la salida será::
