Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/develop.po
Languages: es_es

source: Uniformly formatted code makes it easier to share code ownership. The scikit-learn project tries to closely follow the official Python guidelines detailed in `PEP8 <https://www.python.org/dev/peps/pep-0008>`_ that detail how code should be formatted and indented. Please read it and follow it.
es_es: Un código con formato uniforme hace más fácil compartir la propiedad del código. El proyecto scikit-learn trata de seguir de cerca las directrices oficiales de Python detalladas en `PEP8 <https://www.python.org/dev/peps/pep-0008>`_ que detallan cómo el código debe ser formateado y sangrado. Por favor, léalo y sígalo.

source: In addition, we add the following guidelines:
es_es: Además, añadimos las siguientes directrices:

source: Use underscores to separate words in non class names: ``n_samples`` rather than ``nsamples``.
es_es: Usa guiones bajos para separar palabras en nombres no de clase: ``n_samples`` en lugar de ``nsamples``.

source: Avoid multiple statements on one line. Prefer a line return after a control flow statement (``if``/``for``).
es_es: Evita múltiples sentencias en una línea. Prefiere un retorno de línea después de una sentencia de flujo de control (``if``/``for``).

source: Use relative imports for references inside scikit-learn.
es_es: Utiliza las importaciones relativas para las referencias dentro de scikit-learn.

source: Unit tests are an exception to the previous rule; they should use absolute imports, exactly as client code would. A corollary is that, if ``sklearn.foo`` exports a class or function that is implemented in ``sklearn.foo.bar.baz``, the test should import it from ``sklearn.foo``.
es_es: Las pruebas unitarias son una excepción a la regla anterior; deben usar importaciones absolutas, exactamente como lo haría el código del cliente. Un corolario es que, si ``sklearn.foo`` exporta una clase o función que está implementada en ``sklearn.foo.bar.baz``, la prueba debe importarla de ``sklearn.foo``.

source: **Please don't use** ``import *`` **in any case**. It is considered harmful by the `official Python recommendations <https://docs.python.org/3.1/howto/doanddont.html#at-module-level>`_. It makes the code harder to read as the origin of symbols is no longer explicitly referenced, but most important, it prevents using a static analysis tool like `pyflakes <https://divmod.readthedocs.io/en/latest/products/pyflakes.html>`_ to automatically find bugs in scikit-learn.
es_es: **Por favor, no utilices** ``import *`` **en ningún caso**. Se considera perjudicial según las recomendaciones oficiales de Python <https://docs.python.org/3.1/howto/doanddont.html#at-module-level>`_. Hace que el código sea más difícil de leer ya que el origen de los símbolos ya no está explícitamente referenciado, pero lo más importante es que impide el uso de una herramienta de análisis estático como `pyflakes <https://divmod.readthedocs.io/en/latest/products/pyflakes.html>`_ para encontrar automáticamente errores en scikit-learn.

source: Use the `numpy docstring standard <https://numpydoc.readthedocs.io/en/latest/format.html#numpydoc-docstring-guide>`_ in all your docstrings.
es_es: Usa el `numpy docstring standard <https://numpydoc.readthedocs.io/en/latest/format.html#numpydoc-docstring-guide>`_ en todos tus docstrings.

source: A good example of code that we like can be found `here <https://gist.github.com/nateGeorge/5455d2c57fb33c1ae04706f2dc4fee01>`_.
es_es: Un buen ejemplo de código que nos gusta se puede encontrar `aquí <https://gist.github.com/nateGeorge/5455d2c57fb33c1ae04706f2dc4fee01>`_.

source: Input validation
es_es: Validación de entrada

source: The module :mod:`sklearn.utils` contains various functions for doing input validation and conversion. Sometimes, ``np.asarray`` suffices for validation; do *not* use ``np.asanyarray`` or ``np.atleast_2d``, since those let NumPy's ``np.matrix`` through, which has a different API (e.g., ``*`` means dot product on ``np.matrix``, but Hadamard product on ``np.ndarray``).
es_es: El módulo :mod:`sklearn.utils` contiene varias funciones para hacer validación y conversión de entrada. A veces, ``np.asarray`` contiene para la validación; *no* utilices ``np.asanyarray`` o ``np. tleast_2d``, ya que esos permiten ``np.matrix`` de NumPy, que tiene una API diferente (por ejemplo, ``*`` significa producto de punto en ``np.matrix``, pero producto de Hadamard en ``np.ndarray``).

source: In other cases, be sure to call :func:`check_array` on any array-like argument passed to a scikit-learn API function. The exact parameters to use depends mainly on whether and which ``scipy.sparse`` matrices must be accepted.
es_es: En otros casos, asegúrate de llamar a :func:`check_array` en cualquier argumento similar a un arreglo pasado a una función API de scikit-learn. Los parámetros exactos a utilizar dependen principalmente de si se deben aceptar las matrices ``scipy.sparse`` y de cuáles.

source: For more information, refer to the :ref:`developers-utils` page.
es_es: Para obtener más información, consulta la página :ref:`developers-utils`.

source: Random Numbers
es_es: Números aleatorios

source: If your code depends on a random number generator, do not use ``numpy.random.random()`` or similar routines. To ensure repeatability in error checking, the routine should accept a keyword ``random_state`` and use this to construct a ``numpy.random.RandomState`` object. See :func:`sklearn.utils.check_random_state` in :ref:`developers-utils`.
es_es: Si su código depende de un generador de números aleatorios, no utilices ``numpy.random.random()`` o rutinas similares. Para asegurar la repetibilidad en la comprobación de errores, la rutina debería aceptar una palabra clave ``random_state`` y usarla para construir un objeto ``numpy.random.RandomState``. Ver :func:`sklearn.utils.check_random_state` en :ref:`developers-utils`.

source: Here's a simple example of code using some of the above guidelines::
es_es: Aquí hay un ejemplo simple de código usando algunas de las directrices anteriores::

source: If you use randomness in an estimator instead of a freestanding function, some additional guidelines apply.
es_es: Si utiliza la aleatoriedad en un estimador en lugar de una función independiente, se aplican algunas directrices adicionales.

source: First off, the estimator should take a ``random_state`` argument to its ``__init__`` with a default value of ``None``. It should store that argument's value, **unmodified**, in an attribute ``random_state``. ``fit`` can call ``check_random_state`` on that attribute to get an actual random number generator. If, for some reason, randomness is needed after ``fit``, the RNG should be stored in an attribute ``random_state_``. The following example should make this clear::
es_es: En primer lugar, el estimador debe tomar un argumento ``estado_aleatorio`` en su ``__init__`` con un valor por defecto de ``None``. Debería almacenar el valor de ese argumento, **sin modificar**, en un atributo ``random_state``. ``fit`` puede llamar a ``check_random_state`` en ese atributo para obtener un generador de números aleatorios real. Si, por alguna razón, la aleatoriedad es necesaria después de ``fit``, el RNG debe ser almacenado en un atributo ``random_state_``. El siguiente ejemplo debería aclarar esto::

source: The reason for this setup is reproducibility: when an estimator is ``fit`` twice to the same data, it should produce an identical model both times, hence the validation in ``fit``, not ``__init__``.
es_es: La razón de esta configuración es la reproducibilidad: cuando un estimador es ``ajustado`` dos veces a los mismos datos, debería producir un modelo idéntico ambas veces, de ahí la validación en ``fit``, no ``__init__``.
