Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/develop.po
Languages: es_es

source: The ``set_params`` on the other hand takes as input a dict of the form ``'parameter': value`` and sets the parameter of the estimator using this dict. Return value must be estimator itself.
es_es: Por otro lado, ``set_params`` toma como entrada un diccionario (dict) de la forma ``'parameter': value`` y establece el parámetro del estimador utilizando este diccionario. El valor de retorno debe ser el propio estimador.

source: While the ``get_params`` mechanism is not essential (see :ref:`cloning` below), the ``set_params`` function is necessary as it is used to set parameters during grid searches.
es_es: Mientras que el mecanismo ``get_params`` no es esencial (ver :ref:`cloning` a continuación), la función ``set_params`` es necesaria ya que se usa para establecer parámetros durante las búsquedas en cuadrícula.

source: The easiest way to implement these functions, and to get a sensible ``__repr__`` method, is to inherit from ``sklearn.base.BaseEstimator``. If you do not want to make your code dependent on scikit-learn, the easiest way to implement the interface is::
es_es: La forma más fácil de implementar estas funciones, y de obtener un método ``__repr__`` sensato, es heredar de ``sklearn.base.BaseEstimator``. Si no quieres hacer que tu código dependa de scikit-learn, la forma más fácil de implementar la interfaz es::

source: Parameters and init
es_es: Parámetros e init

source: As :class:`model_selection.GridSearchCV` uses ``set_params`` to apply parameter setting to estimators, it is essential that calling ``set_params`` has the same effect as setting parameters using the ``__init__`` method. The easiest and recommended way to accomplish this is to **not do any parameter validation in** ``__init__``. All logic behind estimator parameters, like translating string arguments into functions, should be done in ``fit``.
es_es: Como :class:`model_selection.GridSearchCV` utiliza ``set_params`` para aplicar la configuración de parámetros a los estimadores, es esencial que llamar a ``set_params`` tenga el mismo efecto que la configuración de parámetros utilizando el método ``__init__``. La forma más fácil y recomendada para lograr esto es **no hacer ninguna validación de parámetros en** ``__init__``. Toda la lógica detrás de los parámetros del estimador, como la traducción de argumentos de cadena en funciones, debe hacerse en ``fit``.

source: Also it is expected that parameters with trailing ``_`` are **not to be set inside the** ``__init__`` **method**. All and only the public attributes set by fit have a trailing ``_``. As a result the existence of parameters with trailing ``_`` is used to check if the estimator has been fitted.
es_es: También se espera que los parámetros con la terminación ``_`` **no se establezcan dentro del método** ``init__``. Todos y sólo los atributos públicos espablecidos por ajuste fit tienen una terminación ``_``. Como resultado, la existencia de los parámetros con el final ``_`` se utiliza para comprobar si el estimador ha sido ajustado.

source: Cloning
es_es: Clonado

source: For use with the :mod:`model_selection` module, an estimator must support the ``base.clone`` function to replicate an estimator. This can be done by providing a ``get_params`` method. If ``get_params`` is present, then ``clone(estimator)`` will be an instance of ``type(estimator)`` on which ``set_params`` has been called with clones of the result of ``estimator.get_params()``.
es_es: Para su uso con el módulo :mod:`model_selection`, un estimador debe soportar la ``base.clone`` para replicar un estimador. Esto puede hacerse proporcionando un método ``get_params``. Si ``get_params`` está presente, entonces ``clone(estimator)`` será una instancia de ``type(estimator)`` en la que ``set_params`` ha sido llamado con clones del resultado de ``estimator.get_params()``.

source: Objects that do not provide this method will be deep-copied (using the Python standard function ``copy.deepcopy``) if ``safe=False`` is passed to ``clone``.
es_es: Los objetos que no proporcionan este método serán copiados profundamente (usando la función estándar de Python ``copy.deepcopy``) si ``safe=False`` es pasado a ``clone``.

source: Pipeline compatibility
es_es: Compatibilidad con pipeline

source: For an estimator to be usable together with ``pipeline.Pipeline`` in any but the last step, it needs to provide a ``fit`` or ``fit_transform`` function. To be able to evaluate the pipeline on any data but the training set, it also needs to provide a ``transform`` function. There are no special requirements for the last step in a pipeline, except that it has a ``fit`` function. All ``fit`` and ``fit_transform`` functions must take arguments ``X, y``, even if y is not used. Similarly, for ``score`` to be usable, the last step of the pipeline needs to have a ``score`` function that accepts an optional ``y``.
es_es: Para que un estimador pueda utilizarse junto con ``pipeline.Pipeline`` en cualquier paso, excepto en el último, debe proporcionar una función ``fit`` o ``fit_transform``. Para poder evaluar el pipeline en cualquier dato que no sea el conjunto de entrenamiento, también necesita proporcionar una función ``transform``. No hay requisitos especiales para el último paso de un pipeline, excepto que tiene una función ``fit``. Todas las funciones ``fit`` y ``fit_transform`` deben tomar argumentos ``X, y``, incluso si no se utiliza y. Del mismo modo, para que ``score`` sea utilizable, el último paso del pipeline debe tener una función ``score`` que acepte un ``y`` opcional.

source: Estimator types
es_es: Tipos de estimador

source: Some common functionality depends on the kind of estimator passed. For example, cross-validation in :class:`model_selection.GridSearchCV` and :func:`model_selection.cross_val_score` defaults to being stratified when used on a classifier, but not otherwise. Similarly, scorers for average precision that take a continuous prediction need to call ``decision_function`` for classifiers, but ``predict`` for regressors. This distinction between classifiers and regressors is implemented using the ``_estimator_type`` attribute, which takes a string value. It should be ``"classifier"`` for classifiers and ``"regressor"`` for regressors and ``"clusterer"`` for clustering methods, to work as expected. Inheriting from ``ClassifierMixin``, ``RegressorMixin`` or ``ClusterMixin`` will set the attribute automatically. When a meta-estimator needs to distinguish among estimator types, instead of checking ``_estimator_type`` directly, helpers like :func:`base.is_classifier` should be used.
es_es: Algunas funcionalidades comunes dependen de la clase de estimador que se pase. Por ejemplo, la validación cruzada en :class:`model_selection.GridSearchCV` y :func:`model_selection.cross_val_score` está por defecto estratificada cuando se utiliza en un clasificador, pero no en otro caso. Del mismo modo, los calificadores de precisión media que toman una predicción continua necesitan llamar a ``decision_function`` para los clasificadores, pero a ``predict`` para los regresores. Esta distinción entre clasificadores y regresores se implementa mediante el atributo ``_estimator_type``, que toma un valor de cadena. Debe ser ``classifier`` para los clasificadores y ``regresor`` para los regresores y ``clusterer`` para los métodos de clustering, para que funcione como se espera. Al heredar de ``ClassifierMixin``, ``RegressorMixin`` o ``ClusterMixin`` se establecerá el atributo automáticamente. Cuando un meta-estimador necesita distinguir entre tipos de estimadores, en lugar de comprobar ``_estimator_type`` directamente, se deben utilizar ayudantes como :func:`base.is_classifier``.

source: Specific models
es_es: Modelos específicos

source: Classifiers should accept ``y`` (target) arguments to ``fit`` that are sequences (lists, arrays) of either strings or integers. They should not assume that the class labels are a contiguous range of integers; instead, they should store a list of classes in a ``classes_`` attribute or property. The order of class labels in this attribute should match the order in which ``predict_proba``, ``predict_log_proba`` and ``decision_function`` return their values. The easiest way to achieve this is to put::
es_es: Los clasificadores deben aceptar argumentos ``y`` (objetivo) para ``fit`` que son secuencias (listas, arreglos) de cadenas o enteros. No deben asumir que las etiquetas de clase son un rango contiguo de enteros; en su lugar, deben almacenar una lista de clases en un atributo o propiedad ``classes_``. El orden de las etiquetas de clase en este atributo debe coincidir con el orden en que ``predict_proba``, ``predict_log_proba`` y ``decision_function`` devuelven sus valores. La forma más sencilla de conseguirlo es poner::

source: in ``fit``. This returns a new ``y`` that contains class indexes, rather than labels, in the range [0, ``n_classes``).
es_es: en ``fit``. Esto devuelve un nuevo ``y`` que contiene índices de clase, en lugar de etiquetas, en el rango [0, ``n_classes``).

source: A classifier's ``predict`` method should return arrays containing class labels from ``classes_``. In a classifier that implements ``decision_function``, this can be achieved with::
es_es: El método ``predict`` de un clasificador debe devolver arreglos que contengan etiquetas de clase de ``classes_``. En un clasificador que implementa ``decision_function``, esto se puede lograr con::

source: In linear models, coefficients are stored in an array called ``coef_``, and the independent term is stored in ``intercept_``. ``sklearn.linear_model._base`` contains a few base classes and mixins that implement common linear model patterns.
es_es: En modelos lineales, los coeficientes se almacenan en un arreglo llamado ``coef_``, y el término independiente se almacena en ``intercept_``. ``sklearn.linear_model._base`` contiene algunas clases base y mezclas que implementan patrones de modelo lineal comunes.

source: The :mod:`sklearn.utils.multiclass` module contains useful functions for working with multiclass and multilabel problems.
es_es: El módulo :mod:`sklearn.utils.multiclass` contiene funciones útiles para trabajar con problemas multiclase y multietiqueta.

source: Estimator Tags
es_es: Etiquetas de Estimador

source: The estimator tags are experimental and the API is subject to change.
es_es: Las etiquetas de estimación son experimentales y la API está sujeta a cambios.

source: Scikit-learn introduced estimator tags in version 0.21. These are annotations of estimators that allow programmatic inspection of their capabilities, such as sparse matrix support, supported output types and supported methods. The estimator tags are a dictionary returned by the method ``_get_tags()``. These tags are used in the common checks run by the :func:`~sklearn.utils.estimator_checks.check_estimator` function and the :func:`~sklearn.utils.estimator_checks.parametrize_with_checks` decorator. Tags determine which checks to run and what input data is appropriate. Tags can depend on estimator parameters or even system architecture and can in general only be determined at runtime.
es_es: Scikit-learn introdujo etiquetas de estimadores en la versión 0.21. Son anotaciones de los estimadores que permiten la inspección programática de sus capacidades, como el soporte de matrices dispersas, los tipos de salida y los métodos soportados. Las etiquetas del estimador son un diccionario devuelto por el método ``_get_tags()``. Estas etiquetas se utilizan en las comprobaciones comunes ejecutadas por la función :func:`~sklearn.utils.estimator_checks.check_estimator` y el decorador :func:`~sklearn.utils.estimator_checks.parametrize_with_checks`. Las etiquetas determinan qué comprobaciones deben realizarse y qué datos de entrada son apropiados. Las etiquetas pueden depender de los parámetros del estimador o incluso de la arquitectura del sistema y, en general, sólo pueden determinarse en tiempo de ejecución.

source: The current set of estimator tags are:
es_es: El conjunto actual de etiquetas de estimación son:

source: whether the estimator supports data with missing values encoded as np.NaN
es_es: si el estimador soporta datos con valores faltantes codificados como np.NaN

source: whether estimator supports binary classification but lacks multi-class classification support.
es_es: si el estimador soporta la clasificación binaria pero carece de soporte de clasificación multiclase.

source: whether the estimator supports multilabel output
es_es: si el estimador soporta salida multietiqueta

source: whether a regressor supports multi-target outputs or a classifier supports multi-class multi-output.
es_es: si un regresor admite salidas multiobjetivo o un clasificador admite multiples salidas multiclase.

source: whether estimator supports only multi-output classification or regression.
es_es: si el estimador soporta sólo clasificación de salida múltiple o regresión.

source: whether the estimator skips input-validation. This is only meant for stateless and dummy transformers!
es_es: si el estimador se salta la validación de entrada. Esto sólo está pensado para los transformadores sin estado y ficticios!

source: whether the estimator is not deterministic given a fixed ``random_state``
es_es: si el estimador no es determinista dado un ``random_state`` fijo

source: pairwise (default=False)
es_es: por pares (default=False)

source: This boolean attribute indicates whether the data (`X`) :term:`fit` and similar methods consists of pairwise measures over samples rather than a feature representation for each sample. It is usually `True` where an estimator has a `metric` or `affinity` or `kernel` parameter with value 'precomputed'. Its primary purpose is that when a :term:`meta-estimator` extracts a sub-sample of data intended for a pairwise estimator, the data needs to be indexed on both axes, while other data is indexed only on the first axis.
es_es: Este atributo booleano indica si los datos (`X`) :term:`fit` y métodos similares consisten en medidas de pares sobre muestras en lugar de una representación de características para cada muestra. Suele ser `True` cuando un estimador tiene un parámetro `métric` o de `affinity` o `kernel` con valor `precomputed`. Su propósito principal es que cuando un :term:`meta-estimator` extrae una submuestra de datos destinada a un estimador por pares, los datos necesitan ser indexados en ambos ejes, mientras que otros datos son indexados sólo en el primer eje.

source: applies only on transformers. It corresponds to the data types which will be preserved such that `X_trans.dtype` is the same as `X.dtype` after calling `transformer.transform(X)`. If this list is empty, then the transformer is not expected to preserve the data type. The first value in the list is considered as the default data type, corresponding to the data type of the output when the input data type is not going to be preserved.
es_es: se aplica sólo a los transformadores. Corresponde a los tipos de datos que se conservarán de forma que `X_trans.dtype` sea el mismo que `X.dtype` después de llamar a `transformer.transform(X)`. Si esta lista está vacía, no se espera que el transformador conserve el tipo de datos. El primer valor de la lista se considera el tipo de datos por defecto, correspondiente al tipo de datos de la salida cuando no se va a preservar el tipo de datos de entrada.

source: whether the estimator fails to provide a "reasonable" test-set score, which currently for regression is an R2 of 0.5 on a subset of the boston housing dataset, and for classification an accuracy of 0.83 on ``make_blobs(n_samples=300, random_state=0)``. These datasets and values are based on current estimators in sklearn and might be replaced by something more systematic.
es_es: si el estimador no proporciona una puntuación "razonable" del conjunto de pruebas, que actualmente para la regresión es un R2 de 0,5 en un subconjunto del conjunto de datos de viviendas de Boston, y para la clasificación una precisión de 0,83 en ``make_blobs(n_samples=300, random_state=0)``. Estos conjuntos de datos y valores se basan en los estimadores actuales de sklearn y podrían ser sustituidos por algo más sistemático.

source: whether the estimator requires to be fitted before calling one of `transform`, `predict`, `predict_proba`, or `decision_function`.
es_es: si el estimador requiere ser ajustado antes de llamar a una de las funciones `transform`, `predict`, `predict_proba`, o `decision_function`.

source: whether the estimator requires positive X.
es_es: si el estimador requiere una X positiva.

source: whether the estimator requires y to be passed to `fit`, `fit_predict` or `fit_transform` methods. The tag is True for estimators inheriting from `~sklearn.base.RegressorMixin` and `~sklearn.base.ClassifierMixin`.
es_es: si el estimador requiere que se pase y a los métodos `fit`, `fit_predict` o `fit_transform`. La etiqueta es True para los estimadores que heredan de `~sklearn.base.RegressorMixin` y `~sklearn.base.ClassifierMixin`.

source: whether the estimator requires a positive y (only applicable for regression).
es_es: si el estimador requiere una y positiva (sólo aplicable para la regresión).

source: whether to skip common tests entirely. Don't use this unless you have a *very good* reason.
es_es: si omitir por completo las pruebas comunes. No utilice esto a menos que tenga una *muy buena*.

source: dictionary ``{check_name: reason}`` of common checks that will be marked as `XFAIL` for pytest, when using :func:`~sklearn.utils.estimator_checks.parametrize_with_checks`. These checks will be simply ignored and not run by :func:`~sklearn.utils.estimator_checks.check_estimator`, but a `SkipTestWarning` will be raised. Don't use this unless there is a *very good* reason for your estimator not to pass the check. Also note that the usage of this tag is highly subject to change because we are trying to make it more flexible: be prepared for breaking changes in the future.
es_es: diccionario ``{check_name: reason}`` de comprobaciones comunes que se marcarán como `XFAIL` para pytest, cuando se utilice :func:`~sklearn.utils.estimator_checks.parametrize_with_checks`. Estas comprobaciones serán simplemente ignoradas y no serán ejecutadas por :func:`~sklearn.utils.estimator_checks.check_estimator`, pero se lanzará un `SkipTestWarning`. No utilices esto a menos que haya una *muy buena* razón para que su estimador no pase la comprobación. También ten en cuenta que el uso de esta etiqueta está muy sujeto a cambios porque estamos tratando de hacerla más flexible: prepárate para cambios de última hora en el futuro.

source: whether the estimator needs access to data for fitting. Even though an estimator is stateless, it might still need a call to ``fit`` for initialization.
es_es: si el estimador necesita acceso a los datos para ajuste. Aunque un estimador no tiene estado, podría necesitar una llamada a ``fit`` para la inicialización.

source: Supported input types for X as list of strings. Tests are currently only run if '2darray' is contained in the list, signifying that the estimator takes continuous 2d numpy arrays as input. The default value is ['2darray']. Other possible types are ``'string'``, ``'sparse'``, ``'categorical'``, ``dict``, ``'1dlabels'`` and ``'2dlabels'``. The goal is that in the future the supported input type will determine the data used during testing, in particular for ``'string'``, ``'sparse'`` and ``'categorical'`` data. For now, the test for sparse data do not make use of the ``'sparse'`` tag.
es_es: Tipos de entrada soportados para X como lista de cadenas. Actualmente las pruebas sólo se ejecutan si '2darray' está contenido en la lista, lo que significa que el estimador toma arreglos numpy continuos 2d como entrada. El valor por defecto es ['2darray']. Otros tipos posibles son ``'string'``, ``'sparse'``, ``'categorical'``, ``dict``, ``'1dlabels'`` y ``'2dlabels'``. El objetivo es que en el futuro el tipo de entrada soportado determine los datos utilizados durante la prueba, en particular para los datos``'string'``, ``'sparse'`` y ``'categorical'``. Por ahora, las pruebas para datos dispersos no hacen uso de la etiqueta ``'sparse'``.

source: It is unlikely that the default values for each tag will suit the needs of your specific estimator. Additional tags can be created or default tags can be overridden by defining a `_more_tags()` method which returns a dict with the desired overridden tags or new tags. For example::
es_es: Es poco probable que los valores por defecto de cada etiqueta se ajusten a las necesidades de su estimador específico. Etiquetas adicionales pueden ser creadas o por defecto pueden ser sobreescritas definiendo un método `_more_tags()` que devuelve un diccionario (dict) con las etiquetas sobreescritas o nuevas etiquetas. Por ejemplo::

source: Any tag that is not in `_more_tags()` will just fall-back to the default values documented above.
es_es: Cualquier etiqueta que no esté en `_more_tags()` simplemente volverá a los valores por defecto documentados arriba.

source: Even if it is not recommended, it is possible to override the method `_get_tags()`. Note however that **all tags must be present in the dict**. If any of the keys documented above is not present in the output of `_get_tags()`, an error will occur.
es_es: Incluso si no se recomienda, es posible sobreescribir el método `_get_tags()`. Sin embargo, ten en cuenta que **todas las etiquetas deben estar presentes en el diccionario**. Si alguna de las claves documentadas arriba no está presente en la salida de `_get_tags()`, ocurrirá un error.

source: In addition to the tags, estimators also need to declare any non-optional parameters to ``__init__`` in the ``_required_parameters`` class attribute, which is a list or tuple. If ``_required_parameters`` is only ``["estimator"]`` or ``["base_estimator"]``, then the estimator will be instantiated with an instance of ``LinearDiscriminantAnalysis`` (or ``RidgeRegression`` if the estimator is a regressor) in the tests. The choice of these two models is somewhat idiosyncratic but both should provide robust closed-form solutions.
es_es: Además de las etiquetas, los estimadores también necesitan declarar cualquier parámetro no opcional a ``__init__`` en el atributo de clase ``_required_parameters``, que es una lista o tupla. Si ``_required_parameters`` es sólo ``["estimator"]`` o ``["base_estimator"]``, el estimador se instanciará con una instancia de ``LinearDiscriminantAnalysis`` (o ``RidgeRegression`` si el estimador es un regresor) en las pruebas. La elección de estos dos modelos es algo idiosincrática, pero ambos deberían proporcionar soluciones robustas de forma cerrada.

source: Coding guidelines
es_es: Directrices de codificación

source: The following are some guidelines on how new code should be written for inclusion in scikit-learn, and which may be appropriate to adopt in external projects. Of course, there are special cases and there will be exceptions to these rules. However, following these rules when submitting new code makes the review easier so new code can be integrated in less time.
es_es: A continuación se presentan algunas directrices sobre cómo debe escribirse el nuevo código para su inclusión en scikit-learn, y que puede ser apropiado adoptar en proyectos externos. Por supuesto, hay casos especiales y habrá excepciones a estas reglas. Sin embargo, seguir estas reglas cuando se presenta un nuevo código facilita la revisión, por lo que el nuevo código puede ser integrado en menos tiempo.
