Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/maintainer.po
Languages: es_es

source: The definition of what gets run in the Cron job is done in the .travis.yml config file, exactly the same way as the other Travis jobs. We use a ``if: type = cron`` filter in order for the build to be run only in Cron jobs.
es_es: La definición de lo que se ejecuta en el trabajo Cron se hace en el archivo de configuración .travis.yml, exactamente de la misma manera que los otros trabajos de Travis. Usamos un filtro ``if: type = cron`` para que la compilación se ejecute sólo en trabajos Cron.

source: The branch targeted by the Cron job and the frequency of the Cron job is set via the web UI at https://www.travis-ci.org/scikit-learn/scikit-learn/settings.
es_es: La rama dirigida por el trabajo de Cron y la frecuencia del trabajo de Cron se establece a través de la interfaz web en https://www.travis-ci.org/scikit-learn/scikit-learn/setting.

source: Experimental features
es_es: Características experimentales

source: The :mod:`sklearn.experimental` module was introduced in 0.21 and contains experimental features / estimators that are subject to change without deprecation cycle.
es_es: El módulo :mod:`sklearn.experimental` fue introducido en 0.21 y contiene características experimentales / estimadores que están sujetos a cambios sin ciclo de desaprobación.

source: To create an experimental module, you can just copy and modify the content of `enable_hist_gradient_boosting.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/enable_hist_gradient_boosting.py>`_, or `enable_iterative_imputer.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/enable_iterative_imputer.py>`_.
es_es: Para crear un módulo experimental, solo puedes copiar y modificar el contenido de `enable_Chan_gradient_boosting.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/enable_hist_gradient_boosting.py>`_, o `enable_iterative_imputer.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/enable_iterative_imputer.py>`_.

source: Note that the public import path must be to a public subpackage (like ``sklearn/ensemble`` or ``sklearn/impute``), not just a ``.py`` module. Also, the (private) experimental features that are imported must be in a submodule/subpackage of the public subpackage, e.g. ``sklearn/ensemble/_hist_gradient_boosting/`` or ``sklearn/impute/_iterative.py``. This is needed so that pickles still work in the future when the features aren't experimental anymore.
es_es: Ten en cuenta que la ruta de importación pública debe ser un subpaquete público (como ``sklearn/ensemble`` o ``sklearn/impute``), no sólo un módulo ``.py``. Además, las características experimentales (privadas) que se importan deben estar en un submódulo/subpaquete del subpaquete público, por ejemplo ``sklearn/ensemble/_hist_gradient_boosting/`` o ``sklearn/impute/_iterative.py``. Esto es necesario para que los pickles sigan funcionando en el futuro cuando las características ya no sean experimentales.

source: To avoid type checker (e.g. mypy) errors a direct import of experimental estimators should be done in the parent module, protected by the ``if typing.TYPE_CHECKING`` check. See `sklearn/ensemble/__init__.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/ensemble/__init__.py>`_, or `sklearn/impute/__init__.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/impute/__init__.py>`_ for an example.
es_es: Para evitar los errores del verificador de tipos (por ejemplo, mypy) se debe hacer una importación directa de los estimadores experimentales en el módulo padre, protegida por la comprobación ``if typing.TYPE_CHECKING``. Ver `sklearn/ensemble/__init__.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/ensemble/__init__.py>`_, o `sklearn/impute/__init__.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/impute/__init__.py>`_ para un ejemplo.

source: Please also write basic tests following those in `test_enable_hist_gradient_boosting.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/tests/test_enable_hist_gradient_boosting.py>`_.
es_es: Por favor, escribe también pruebas básicas siguiendo las de `test_enable_hist_gradient_boosting.py <https://github.com/scikit-learn/scikit-learn/blob/main/sklearn/experimental/tests/test_enable_hist_gradient_boosting.py>`_.

source: Make sure every user-facing code you write explicitly mentions that the feature is experimental, and add a ``# noqa`` comment to avoid pep8-related warnings::
es_es: Asegúrate de que cada código de usuario que escriba menciones explícitamente que la característica es experimental, y agrega un comentario ``# noqa`` para evitar advertencias relacionadas con pep8::

source: For the docs to render properly, please also import ``enable_my_experimental_feature`` in ``doc/conf.py``, else sphinx won't be able to import the corresponding modules. Note that using ``from sklearn.experimental import *`` **does not work**.
es_es: Para que los documentos se muestren correctamente, por favor importa también ``enable_my_experimental_feature`` en ``doc/conf.py``, de lo contrario sphinx no podrá importar los módulos correspondientes. Ten en cuenta que el uso de ``from sklearn.experimental import *`` **no funciona**.

source: Note that some experimental classes / functions are not included in the :mod:`sklearn.experimental` module: ``sklearn.datasets.fetch_openml``.
es_es: Ten en cuenta que algunas clases / funciones experimentales no están incluidas en el módulo :mod:`sklearn.experimental`: ``sklearn.datasets.fetch_openml``.
