Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/maintainer.po
Languages: es_es

source: Maintainer / core-developer information
es_es: Información sobre el mantenedor/desarrollador del núcleo

source: Releasing
es_es: Lanzamiento de versiones

source: This section is about preparing a major release, incrementing the minor version, or a bug fix release incrementing the patch version. Our convention is that we release one or more release candidates (0.RRrcN) before releasing the final distributions. We follow the `PEP101 <https://www.python.org/dev/peps/pep-0101/>`_ to indicate release candidates, post, and minor releases.
es_es: Esta sección trata de preparar una versión mayor, incrementar la versión menor, o una versión de corrección de errores incrementando la versión del parche. Nuestra convención es que lanzamos uno o más candidatos a la versión (0.RRrcN) antes de lanzar las distribuciones finales. Seguimos el `PEP101 <https://www.python.org/dev/peps/pep-0101/>`_ para indicar los candidatos de lanzamiento, mensajes y versiones menores.

source: Before a release
es_es: Antes de una versión

source: Update authors table:
es_es: Actualizar tabla de autores:

source: and commit. This is only needed if the authors have changed since the last release. This step is sometimes done independent of the release. This updates the maintainer list and is not the contributor list for the release.
es_es: y hacer commit. Esto sólo es necesario si los autores han cambiado desde la última versión. Este paso a veces se hace independientemente de la versión. Esto actualiza la lista de mantenedores y no es la lista de colaboradores de la versión.

source: Confirm any blockers tagged for the milestone are resolved, and that other issues tagged for the milestone can be postponed.
es_es: Confirma que los bloqueos marcados para el hito se han resuelto y que otros asuntos marcados para el hito pueden posponerse.

source: Ensure the change log and commits correspond (within reason!), and that the change log is reasonably well curated. Some tools for these tasks include:
es_es: Asegura que el registro de cambios y los commits se corresponden (¡dentro de lo razonable!), y que el registro de cambios está razonablemente bien curado. Algunas herramientas para estas tareas son:

source: ``maint_tools/sort_whats_new.py`` can put what's new entries into sections. It's not perfect, and requires manual checking of the changes. If the whats new list is well curated, it may not be necessary.
es_es: ``maint_tools/sort_whats_new.py`` puede poner las entradas nuevas en secciones. No es perfecto, y requiere una comprobación manual de los cambios. Si la lista de novedades está bien curada, puede no ser necesario.

source: The ``maint_tools/whats_missing.sh`` script may be used to identify pull requests that were merged but likely missing from What's New.
es_es: El script ``maint_tools/whats_missing.sh`` puede ser usado para identificar solicitudes de pull que fueron fusionadas, pero probablemente faltan de What's New.

source: Make sure the deprecations, FIXME and TODOs tagged for the release have been taken care of.
es_es: Asegúrate de que las depreciaciones, FIXME y TODOs etiquetados para la versión han sido atendidos.

source: **Permissions**
es_es: **Permisos**

source: The release manager requires a set of permissions on top of the usual permissions given to maintainers, which includes:
es_es: El gestor de lanzamiento requiere un conjunto de permisos además de los permisos habituales otorgados a los mantenedores, los cuales incluyen:

source: *maintainer* role on ``scikit-learn`` projects on ``pypi.org`` and ``test.pypi.org``, separately.
es_es: Rol de *maintainer* en los proyectos ``scikit-learn`` en ``pypi.org`` y ``test.pypi.org``, por separado.

source: become a member of the *scikit-learn* team on conda-forge by editing the ``recipe/meta.yaml`` file on ``https://github.com/conda-forge/scikit-learn-feedstock``
es_es: hazte miembro del equipo *scikit-learn* en conda-forge editando el archivo ``recipe/meta.yaml`` en ``https://github.com/conda-forge/scikit-learn-feedstock``

source: Preparing a release PR
es_es: Preparando un PR de lanzamiento

source: Major version release
es_es: Lanzamiento de la versión principal

source: Prior to branching please do not forget to prepare a Release Highlights page as a runnable example and check that its HTML rendering looks correct. These release highlights should be linked from the ``doc/whats_new/v0.99.rst`` file for the new version of scikit-learn.
es_es: Antes de bifurcarse, por favor, no olvides preparar una página de aspectos destacados de la versión como un ejemplo ejecutable y comprueba que su renderización HTML parezca correcta. Estos aspectos destacados de la versión deben ser enlazados desde el archivo ``doc/whats_new/v0.99.rst`` para la nueva versión de scikit-learn.

source: Releasing the first RC of e.g. version `0.99.0` involves creating the release branch `0.99.X` directly on the main repo, where `X` really is the letter X, **not a placeholder**. The development for the major and minor releases of `0.99` should **also** happen under `0.99.X`. Each release (rc, major, or minor) is a tag under that branch.
es_es: Publicar la primera RC de, por ejemplo, la versión `0.99.0` implica crear la rama de lanzamiento `0.99.X` directamente en el repositorio principal, donde `X` es realmente la letra X, **no un marcador de posición**. El desarrollo de las versiones mayores y menores de `0.99` debería **también** ocurrir bajo `0.99.X`. Cada versión (rc, mayor o menor) es una etiqueta bajo esa rama.

source: This is done only once, as the major and minor releases happen on the same branch:
es_es: Esto se hace sólo una vez, ya que las versiones principales y menores ocurren en la misma rama:

source: Again, `X` is literal here, and `99` is replaced by the release number. The branches are called ``0.19.X``, ``0.20.X``, etc.
es_es: De nuevo, `X` es literal aquí, y `99` es reemplazado por el número de lanzamiento. Las ramas se llaman ``0.19.X``, ``0.20.X``, etc.

source: In terms of including changes, the first RC ideally counts as a *feature freeze*. Each coming release candidate and the final release afterwards will include only minor documentation changes and bug fixes. Any major enhancement or feature should be excluded.
es_es: En cuanto a la inclusión de cambios, la primera RC cuenta idealmente como una *congelación de características*. Cada versión candidata y la versión final posterior incluirán únicamente cambios menores en la documentación y correcciones de errores. Cualquier mejora o característica importante debe ser excluida.

source: Then you can prepare a local branch for the release itself, for instance: ``release-0.99.0rc1``, push it to your github fork and open a PR **to the** `scikit-learn/0.99.X` **branch**. Copy the :ref:`release_checklist` templates in the description of the Pull Request to track progress.
es_es: A continuación, puedes preparar una rama local para el lanzamiento en sí, por ejemplo: ``release-0.99.0rc1``, hacer push a tu fork de github y abrir un puul request a la **rama** `scikit-learn/0.99.X`. Copia las plantillas :ref:`release_checklist` en la descripción del Pull Request para seguir el progreso.

source: This PR will be used to push commits related to the release as explained in :ref:`making_a_release`.
es_es: Esta PR se utilizará para hacer push a commits relacionados con la versión, como se explica en :ref:`making_a_release`.

source: You can also create a second PR from main and targeting main to increment the ``__version__`` variable in `sklearn/__init__.py` to increment the dev version. This means while we're in the release candidate period, the latest stable is two versions behind the main branch, instead of one. In this PR targeting main you should also include a new file for the matching version under the ``doc/whats_new/`` folder so PRs that target the next version can contribute their changelog entries to this file in parallel to the release process.
es_es: También puedes crear un segundo PR desde main y apuntar a main para incrementar la variable ``__versión__`` en `sklearn/__init__.py` para incrementar la versión dev. Esto significa que mientras estemos en el periodo de lanzamiento de la versión candidata, la última estable está dos versiones por detrás de la rama principal, en lugar de una. En este PR dirigido a la rama principal, también deberías incluir un nuevo archivo para la versión correspondiente en la carpeta ``doc/whats_new/`` para que los PRs dirigidos a la siguiente versión puedan contribuir con sus entradas de registro de cambios a este archivo en paralelo al proceso de lanzamiento.

source: Minor version release
es_es: Lanzamiento de una versión menor

source: The minor releases should include bug fixes and some relevant documentation changes only. Any PR resulting in a behavior change which is not a bug fix should be excluded.
es_es: Las versiones menores deben incluir únicamente correcciones de errores y algunos cambios relevantes en la documentación. Cualquier PR que resulte en un cambio de comportamiento que no sea una corrección de errores debe ser excluido.

source: First, create a branch, **on your own fork** (to release e.g. `0.99.3`):
es_es: Primero, crea una rama, **en tu propio fork** (para lanzar por ejemplo, `0.99.3`):

source: Then, create a PR **to the** `scikit-learn/0.99.X` **branch** (not to main!) with all the desired changes:
es_es: A continuación, crea un pull request **en la rama** `scikit-learn/0.99.X` (¡no en main!) con todos los cambios deseados:

source: Copy the :ref:`release_checklist` templates in the description of the Pull Request to track progress.
es_es: Copia las plantillas :ref:`release_checklist` en la descripción de la Pull Request para seguir el progreso.

source: Do not forget to add a commit updating ``sklearn.__version__``.
es_es: No olvides añadir un commit actualizando ``sklearn.__version__``.

source: It's nice to have a copy of the ``git rebase -i`` log in the PR to help others understand what's included.
es_es: Es bueno tener una copia del registro ``git rebase -i`` en el PR para ayudar a otros a entender lo que está incluido.

source: Making a release
es_es: Haciendo un lanzamiento

source: Ensure that you have checked out the branch of the release PR as explained in :ref:`preparing_a_release_pr` above.
es_es: Asegúrate de que has comprobado la rama de la versión PR como se explica en :ref:`preparing_a_release_pr` más arriba.

source: Update docs. Note that this is for the final release, not necessarily for the RC releases. These changes should be made in main and cherry-picked into the release branch, only before the final release.
es_es: Actualizar la documentación. Ten en cuenta que esto es para la versión final, no necesariamente para las versiones RC. Estos cambios deben ser realizados en la rama principal y llevados a la rama de lanzamiento, sólo antes de la versión final.

source: Edit the ``doc/whats_new/v0.99.rst`` file to add release title and list of contributors. You can retrieve the list of contributor names with:
es_es: Edita el archivo ``doc/whats_new/v0.99.rst`` para añadir el título de la liberación y la lista de colaboradores. Puedes recuperar la lista de nombres de colaboradores con:

source: For major releases, link the release highlights example from the ``doc/whats_new/v0.99.rst`` file.
es_es: Para versiones principales, enlaza el ejemplo de la versión destacada del archivo ``doc/whats_new/v0.99.rst``.

source: Update the release date in ``whats_new.rst``
es_es: Actualiza la fecha de lanzamiento en ``whats_new.rst``

source: Edit the ``doc/templates/index.html`` to change the 'News' entry of the front page (with the release month as well).
es_es: Edita el ``doc/templates/index.html`` para cambiar la entrada 'Noticias' de la página principal (con el mes de lanzamiento también).

source: On the branch for releasing, update the version number in ``sklearn/__init__.py``, the ``__version__``.
es_es: En la rama de lanzamiento, actualiza el número de versión en ``sklearn/__init__.py``, el ``__version__``.

source: For major releases, please add a 0 at the end: `0.99.0` instead of `0.99`.
es_es: Para versiones principales, por favor añade un 0 al final: `0.99.0` en lugar de `0.99`.

source: For the first release candidate, use the `rc1` suffix on the expected final release number: `0.99.0rc1`.
es_es: Para la primera versión candidata, utiliza el sufijo `rc1` en el número esperado de la versión final: `0.99.0rc1`.

source: Trigger the wheel builder with the ``[cd build]`` commit marker using the command:
es_es: Activa el compilador de wheel con el marcador de commit ``[cd build]`` usando el comando:

source: The wheel building workflow is managed by GitHub Actions and the results be browsed at: https://github.com/scikit-learn/scikit-learn/actions?query=workflow%3A%22Wheel+builder%22
es_es: El flujo de trabajo de compilación de wheels es administrado por GitHub Actions y los resultados se revisan en: https://github.com/scikit-learn/scikit-learn/actions?query=workflow%3A%22wheel+builder%22

source: Before building the wheels, make sure that the ``pyproject.toml`` file is up to date and using the oldest version of ``numpy`` for each Python version to avoid `ABI <https://en.wikipedia.org/wiki/Application_binary_interface>`_ incompatibility issues. Moreover, a new line have to be included in the ``pyproject.toml`` file for each new supported version of Python.
es_es: Antes de compilar los wheels, asegúrate de que el archivo``pyproject.toml`` está actualizado y utiliza la versión más antigua de ``numpy`` para cada versión de Python para evitar `IBA <https://es.wikipedia.org/wiki/Interfaz_binaria_de_aplicaciones>`_ problemas de incompatibilidad. Además, hay que incluir una nueva línea en el archivo ``pyproject.toml`` para cada nueva versión soportada de Python.

source: The acronym CD in `[cd build]` stands for `Continuous Delivery <https://en.wikipedia.org/wiki/Continuous_delivery>`_ and refers to the automation used to generate the release artifacts (binary and source packages). This can be seen as an extension to CI which stands for `Continuous Integration <https://en.wikipedia.org/wiki/Continuous_integration>`_. The CD workflow on GitHub Actions is also used to automatically create nightly builds and publish packages for the developement branch of scikit-learn. See :ref:`install_nightly_builds`.
es_es: El acrónimo CD en `[cd build]` significa `Entrega Continua <https://es.wikipedia.org/wiki/Entrega_continua>`_ y se refiere a la automatización utilizada para generar los artefactos de liberación (binarios y paquetes fuentes). Esto puede ser visto como una extensión de CI que significa `Integración continua <https://es.wikipedia.org/wiki/Integraci%C3%B3n_continua>`_. El flujo de trabajo de GitHub Actions también se utiliza para crear automáticamente compilaciones nocturnas y publicar paquetes para la rama de desarrollo de scikit-learn. Ver :ref:`install_nightly_builds`.

source: Once all the CD jobs have completed successfully in the PR, merge it, again with the `[cd build]` marker in the commit message. This time the results will be uploaded to the staging area.
es_es: Una vez que todos los trabajos de CD se hayan completado con éxito en el PR, fusiónalo, de nuevo con el marcador `[cd build]` en el mensaje de confirmación. Esta vez los resultados se subirán a la zona de preparación.

source: You should then be able to upload the generated artifacts (.tar.gz and .whl files) to https://test.pypi.org using the "Run workflow" form for the following GitHub Actions workflow:
es_es: A continuación, deberías poder subir los artefactos generados (archivos .tar.gz y .whl) a https://test.pypi.org utilizando el formulario "Ejecutar flujo de trabajo" para el siguiente flujo de trabajo de GitHub Actions:

source: If this went fine, you can proceed with tagging. Proceed with caution. Ideally, tags should be created when you're almost certain that the release is ready, since adding a tag to the main repo can trigger certain automated processes.
es_es: Si esto salió bien, puede continuar con el etiquetado. Procede con precaución. Idealmente, las etiquetas deben crearse cuando esté casi seguro de que la versión está lista, ya que añadir una etiqueta al repositorio principal puede desencadenar ciertos procesos automatizados.

source: Create the tag and push it (if it's an RC, it can be ``0.xx.0rc1`` for instance):
es_es: Crea la etiqueta y haz push (si es un RC, puede ser ``0.xx.0rc1`` por ejemplo):

source: Trigger the GitHub Actions workflow again but this time to upload the artifacts to the real https://pypi.org (replace "testpypi" by "pypi" in the "Run workflow" form).
es_es: Activa de nuevo el flujo de trabajo de GitHub Actions, pero esta vez para subir los artefactos al verdadero https://pypi.org (reemplazar "testpypi" por "pypi" en el formulario "Ejecutar flujo de trabajo").

source: Alternatively, it's possible to collect locally the generated binary wheel packages and source tarball and upload them all to PyPI by running the following commands in the scikit-learn source folder (checked out at the release tag):
es_es: Alternativamente, es posible recoger localmente los paquetes binarios generados de wheel y el tarball fuente y subirlos todos a PyPI ejecutando los siguientes comandos en la carpeta de la fuente de scikit-learn (comprobada en la etiqueta de lanzamiento):

source: This command will download all the binary packages accumulated in the `staging area on the anaconda.org hosting service <https://anaconda.org/scikit-learn-wheels-staging/scikit-learn/files>`_ and put them in your local `./dist` folder.
es_es: Este comando descargará todos los paquetes binarios acumulados en el área de `staging` en el servicio de alojamiento de anaconda.org <https://anaconda.org/scikit-learn-wheels-staging/scikit-learn/files>`_ y los pondrá en su carpeta local `./dist`.

source: Check the content of the `./dist` folder: it should contain all the wheels along with the source tarball ("scikit-learn-RRR.tar.gz").
es_es: Comprueba el contenido de la carpeta `./dist`: debe contener todos los wheel junto con el tarball fuente ("scikit-learn-RRR.tar.gz").

source: Make sure that you do not have developer versions or older versions of the scikit-learn package in that folder.
es_es: Asegúrate de que no tienes versiones del desarrollador o versiones antiguas del paquete scikit-learn en esa carpeta.

source: Before uploading to pypi, you can test upload to test.pypi.org:
es_es: Antes de subir a pypi, puedes probar la subida a test.pypi.org:

source: Upload everything at once to https://pypi.org:
es_es: Subir todo a la vez a https://pypi.org:

source: For major/minor (not bug-fix release), update the symlink for ``stable`` and the ``latestStable`` variable in https://github.com/scikit-learn/scikit-learn.github.io:
es_es: Para la versión principal/menor (no versiones de corrección de errores), actualiza el symlink para ``stable`` y la variable ``latestStable`` en https://github.com/scikit-learn/scikit-learn.github.io:

source: Release checklist
es_es: Lista de verificación de lanzamiento

source: The following GitHub checklist might be helpful in a release PR::
es_es: La siguiente lista de verificación de GitHub puede ser útil en una versión PR::

source: Merging Pull Requests
es_es: Fusión de Pull Requests

source: Individual commits are squashed when a Pull Request (PR) is merged on Github. Before merging,
es_es: Los commits individuales se aplastan cuando se fusiona un Pull Request (PR) en Github. Antes de la fusión,

source: the resulting commit title can be edited if necessary. Note that this will rename the PR title by default.
es_es: el título del commit resultante puede ser editado si es necesario. Ten en cuenta que esto cambiará el nombre del título del PR por defecto.

source: the detailed description, containing the titles of all the commits, can be edited or deleted.
es_es: la descripción detallada, que contiene los títulos de todos los commits, puede ser editada o eliminada.

source: for PRs with multiple code contributors care must be taken to keep the `Co-authored-by: name <name@example.com>` tags in the detailed description. This will mark the PR as having `multiple co-authors <https://help.github.com/en/github/committing-changes-to-your-project/creating-a-commit-with-multiple-authors>`_. Whether code contributions are significanly enough to merit co-authorship is left to the maintainer's discretion, same as for the "what's new" entry.
es_es: para los PRs con múltiples colaboradores de código se debe tener cuidado de mantener las etiquetas `Co-autor por: nombre <name@example.com>` en la descripción detallada. Esto marcará que el PR tiene `múltiples coautores <https://help.github.com/en/github/committing-changes-to-your-project/creating-a-commit-with-multiple-authors>`_. Si las contribuciones de código son lo suficientemente significativas como para merecer la coautoría se deja a la discreción del mantenedor, al igual que para la entrada "what's new".

source: The scikit-learn.org web site
es_es: El sitio web scikit-learn.org

source: The scikit-learn web site (http://scikit-learn.org) is hosted at GitHub, but should rarely be updated manually by pushing to the https://github.com/scikit-learn/scikit-learn.github.io repository. Most updates can be made by pushing to master (for /dev) or a release branch like 0.99.X, from which Circle CI builds and uploads the documentation automatically.
es_es: El sitio web de scikit-learn (http://scikit-learn.org) está alojado en GitHub, pero rara vez debe ser actualizado manualmente empujando al repositorio https://github.com/scikit-learn/scikit-learn.github.io. La mayoría de las actualizaciones se pueden hacer subiendo a master (para /dev) o una rama de lanzamiento como 0.99.X, desde la cual Circle CI compila y sube la documentación automáticamente.

source: Travis Cron jobs
es_es: Trabajos de Travis Cron

source: From `<https://docs.travis-ci.com/user/cron-jobs>`_: Travis CI cron jobs work similarly to the cron utility, they run builds at regular scheduled intervals independently of whether any commits were pushed to the repository. Cron jobs always fetch the most recent commit on a particular branch and build the project at that state. Cron jobs can run daily, weekly or monthly, which in practice means up to an hour after the selected time span, and you cannot set them to run at a specific time.
es_es: De `<https://docs.travis-ci.com/user/cron-jobs>`_: Los trabajos cron de Travis CI funcionan de forma similar a la utilidad cron, ejecutan compilaciones a intervalos regulares programados independientemente de si se ha enviado alguna confirmación al repositorio. Los trabajos cron siempre obtienen la confirmación más reciente en una rama particular y construyen el proyecto en ese estado. Las tareas Cron pueden ejecutarse diariamente, semanalmente o mensualmente, lo que en la práctica significa hasta una hora después del intervalo de tiempo seleccionado, y no se puede establecer que se ejecuten a una hora específica.

source: For scikit-learn, Cron jobs are used for builds that we do not want to run in each PR. As an example the build with the dev versions of numpy and scipy is run as a Cron job. Most of the time when this numpy-dev build fail, it is related to a numpy change and not a scikit-learn one, so it would not make sense to blame the PR author for the Travis failure.
es_es: Para scikit-learn, los trabajos Cron se utilizan para las compilaciones que no queremos ejecutar en cada PR. Por ejemplo, la compilación con las versiones dev de numpy y scipy se ejecuta como un trabajo Cron. La mayoría de las veces, cuando esta compilación de numpy-dev falla, está relacionada con un cambio en numpy y no en scikit-learn, por lo que no tendría sentido culpar al autor del PR por la falla de Travis.
