Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/performance.po
Languages: es_es

source: How to optimize for speed
es_es: Cómo optimizar para velocidad

source: The following gives some practical guidelines to help you write efficient code for the scikit-learn project.
es_es: A continuación se ofrecen algunas directrices prácticas para ayudarte a escribir un código eficiente para el proyecto scikit-learn.

source: While it is always useful to profile your code so as to **check performance assumptions**, it is also highly recommended to **review the literature** to ensure that the implemented algorithm is the state of the art for the task before investing into costly implementation optimization.
es_es: Aunque siempre es útil perfilar tu código para **comprobar los supuestos de rendimiento**, también es muy recomendable **revisar la literatura** para asegurarse de que el algoritmo implementado es el más avanzado para la tarea antes de invertir en una costosa optimización de la implementación.

source: Times and times, hours of efforts invested in optimizing complicated implementation details have been rendered irrelevant by the subsequent discovery of simple **algorithmic tricks**, or by using another algorithm altogether that is better suited to the problem.
es_es: Una y otra vez, las horas de esfuerzo invertidas en la optimización de complicados detalles de implementación se han vuelto irrelevantes por el posterior descubrimiento de simples **trucos algorítmicos**, o por el uso de otro algoritmo que sea más adecuado para el problema.

source: The section :ref:`warm-restarts` gives an example of such a trick.
es_es: La sección :ref:`warm-restarts` ofrece un ejemplo de este tipo de trucos.

source: Python, Cython or C/C++?
es_es: ¿Python, Cython o C/C++?

source: In general, the scikit-learn project emphasizes the **readability** of the source code to make it easy for the project users to dive into the source code so as to understand how the algorithm behaves on their data but also for ease of maintainability (by the developers).
es_es: En general, el proyecto scikit-learn enfatiza la **legibilidad** del código fuente para facilitar a los usuarios del proyecto la inmersión en el código fuente para entender cómo se comporta el algoritmo en sus datos, pero también para facilitar el mantenimiento (por parte de los desarrolladores).

source: When implementing a new algorithm is thus recommended to **start implementing it in Python using Numpy and Scipy** by taking care of avoiding looping code using the vectorized idioms of those libraries. In practice this means trying to **replace any nested for loops by calls to equivalent Numpy array methods**. The goal is to avoid the CPU wasting time in the Python interpreter rather than crunching numbers to fit your statistical model. It's generally a good idea to consider NumPy and SciPy performance tips: https://scipy.github.io/old-wiki/pages/PerformanceTips
es_es: Cuando se implementa un nuevo algoritmo se recomienda **empezar a implementarlo en Python usando Numpy y Scipy** teniendo cuidado de evitar el código de bucles usando los modismos vectorizados de esas bibliotecas. En la práctica esto significa intentar **reemplazar cualquier bucle for anidado por llamadas a métodos de arreglos Numpy equivalentes**. El objetivo es evitar que la CPU pierda tiempo en el intérprete de Python en lugar de hacer cálculos para ajustar tu modelo estadístico. En general, es una buena idea tener en cuenta los tips de rendimiento de NumPy y SciPy: https://scipy.github.io/old-wiki/pages/PerformanceTips

source: Sometimes however an algorithm cannot be expressed efficiently in simple vectorized Numpy code. In this case, the recommended strategy is the following:
es_es: Sin embargo, a veces un algoritmo no puede ser expresado eficientemente en un simple código Numpy vectorizado. En este caso, la estrategia recomendada es la siguiente:

source: **Profile** the Python implementation to find the main bottleneck and isolate it in a **dedicated module level function**. This function will be reimplemented as a compiled extension module.
es_es: **Perfila** la implementación en Python para encontrar el principal cuello de botella y aislarlo en una **función dedicada a nivel de módulo**. Esta función se reimplementará como un módulo de extensión compilado.

source: If there exists a well maintained BSD or MIT **C/C++** implementation of the same algorithm that is not too big, you can write a **Cython wrapper** for it and include a copy of the source code of the library in the scikit-learn source tree: this strategy is used for the classes :class:`svm.LinearSVC`, :class:`svm.SVC` and :class:`linear_model.LogisticRegression` (wrappers for liblinear and libsvm).
es_es: Si existe una implementación BSD o MIT **C/C++** bien mantenida del mismo algoritmo que no sea demasiado grande, puedes escribir un **envoltorio (wrapper) de Cython** para él e incluir una copia del código fuente de la biblioteca en el árbol fuente de scikit-learn: esta estrategia se utiliza para las clases :class:`svm.LinearSVC`, :class:`svm.SVC` y :class:`linear_model.LogisticRegression` (envoltorios para liblinear y libsvm).

source: Otherwise, write an optimized version of your Python function using **Cython** directly. This strategy is used for the :class:`linear_model.ElasticNet` and :class:`linear_model.SGDClassifier` classes for instance.
es_es: De lo contrario, escribe una versión optimizada de tu función de Python usando **Cython** directamente. Esta estrategia se utiliza para las clases :class:`linear_model.ElasticNet` y :class:`linear_model.SGDClassifier` por ejemplo.

source: **Move the Python version of the function in the tests** and use it to check that the results of the compiled extension are consistent with the gold standard, easy to debug Python version.
es_es: **Cambia la versión de Python de la función en las pruebas** y úsala para comprobar que los resultados de la extensión compilada sean consistentes con la versión de Python gold standard y fácil de depurar.

source: Once the code is optimized (not simple bottleneck spottable by profiling), check whether it is possible to have **coarse grained parallelism** that is amenable to **multi-processing** by using the ``joblib.Parallel`` class.
es_es: Una vez que el código está optimizado (no es un simple cuello de botella detectable mediante el perfilado), comprueba si es posible tener un **paralelismo de grano grueso** que sea susceptible de **multiprocesamiento** utilizando la clase ``joblib.Parallel``.

source: When using Cython, use either
es_es: Al utilizar Cython, usar cualquiera

source: to generate C files. You are responsible for adding .c/.cpp extensions along with build parameters in each submodule ``setup.py``.
es_es: para generar archivos C. Eres responsable de añadir las extensiones .c/.cpp junto con los parámetros de compilación en cada submódulo ``setup.py``.

source: C/C++ generated files are embedded in distributed stable packages. The goal is to make it possible to install scikit-learn stable version on any machine with Python, Numpy, Scipy and C/C++ compiler.
es_es: Los archivos generados en C/C++ están embebidos en los paquetes estables distribuidos. El objetivo es hacer posible la instalación de la versión estable de scikit-learn en cualquier máquina con Python, Numpy, Scipy y compilador C/C++.

source: Profiling Python code
es_es: Perfilar el código Python

source: In order to profile Python code we recommend to write a script that loads and prepare you data and then use the IPython integrated profiler for interactively exploring the relevant part for the code.
es_es: Para perfilar el código Python recomendamos escribir un script que cargue y prepare tus datos y luego utilizar el perfilador integrado de IPython para explorar interactivamente la parte relevante para el código.

source: Suppose we want to profile the Non Negative Matrix Factorization module of scikit-learn. Let us setup a new IPython session and load the digits dataset and as in the :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py` example::
es_es: Supongamos que queremos perfilar el módulo de Factorización Matricial No Negativa (Non Negative Matrix Factorization) de scikit-learn. Vamos a configurar una nueva sesión de IPython y cargar el conjunto de datos de dígitos y como en el ejemplo :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py`::

source: Before starting the profiling session and engaging in tentative optimization iterations, it is important to measure the total execution time of the function we want to optimize without any kind of profiler overhead and save it somewhere for later reference::
es_es: Antes de iniciar la sesión de perfilado y realizar iteraciones de optimización tentativas, es importante medir el tiempo total de ejecución de la función que queremos optimizar sin ningún tipo de sobrecarga del perfilador y guardarlo en algún lugar para su posterior consulta::

source: To have a look at the overall performance profile using the ``%prun`` magic command::
es_es: Para ver el perfil de rendimiento general utilizando el comando magic ``%prun``::

source: The ``tottime`` column is the most interesting: it gives to total time spent executing the code of a given function ignoring the time spent in executing the sub-functions. The real total time (local code + sub-function calls) is given by the ``cumtime`` column.
es_es: La columna ``tottime`` es la más interesante: da el tiempo total de ejecución del código de una función determinada, ignorando el tiempo de ejecución de las subfunciones. El tiempo total real (código local + llamadas a subfunciones) viene dado por la columna ``cumtime``.

source: Note the use of the ``-l nmf.py`` that restricts the output to lines that contains the "nmf.py" string. This is useful to have a quick look at the hotspot of the nmf Python module it-self ignoring anything else.
es_es: Ten en cuenta el uso de ``-l nmf.py`` que restringe la salida a las líneas que contienen la cadena "nmf.py". Esto es útil para echar un vistazo rápido al punto de acceso del módulo de Python nmf en sí mismo, ignorando cualquier otra cosa.

source: Here is the beginning of the output of the same command without the ``-l nmf.py`` filter::
es_es: Aquí está el principio de la salida del mismo comando sin el filtro ``-l nmf.py``::

source: The above results show that the execution is largely dominated by dot products operations (delegated to blas). Hence there is probably no huge gain to expect by rewriting this code in Cython or C/C++: in this case out of the 1.7s total execution time, almost 0.7s are spent in compiled code we can consider optimal. By rewriting the rest of the Python code and assuming we could achieve a 1000% boost on this portion (which is highly unlikely given the shallowness of the Python loops), we would not gain more than a 2.4x speed-up globally.
es_es: Los resultados anteriores muestran que la ejecución está dominada en gran medida por las operaciones de productos punto (delegadas a blas). Por lo tanto, probablemente no se puede esperar una gran ganancia reescribiendo este código en Cython o C/C++: en este caso, de los 1.7s de tiempo total de ejecución, se gastan casi 0.7s en código compilado que podemos considerar óptimo. Reescribiendo el resto del código Python y suponiendo que pudiéramos lograr un aumento del 1000% en esta porción (lo que es muy improbable dada la poca profundidad de los bucles de Python), no ganaríamos más de una velocidad global 2.4 veces superior.

source: Hence major improvements can only be achieved by **algorithmic improvements** in this particular example (e.g. trying to find operation that are both costly and useless to avoid computing then rather than trying to optimize their implementation).
es_es: Por lo tanto, las mejoras importantes sólo pueden lograrse mediante **mejoras algorítmicas** en este ejemplo en particular (por ejemplo, tratando de encontrar operaciones que sean a la vez costosas e inútiles para evitar su cálculo entonces, en lugar de tratar de optimizar su implementación).

source: It is however still interesting to check what's happening inside the ``_nls_subproblem`` function which is the hotspot if we only consider Python code: it takes around 100% of the accumulated time of the module. In order to better understand the profile of this specific function, let us install ``line_profiler`` and wire it to IPython:
es_es: Sin embargo, sigue siendo interesante comprobar lo que ocurre dentro de la función ``_nls_subproblem``, que es el punto de acceso si sólo tenemos en cuenta el código de Python: requiere alrededor del 100% del tiempo acumulado del módulo. Para entender mejor el perfil de esta función específica, instalemos ``line_profiler`` y conectémoslo a IPython:

source: **Under IPython 0.13+**, first create a configuration profile:
es_es: **En IPython 0.13+**, primero crea un perfil de configuración:

source: Then register the line_profiler extension in ``~/.ipython/profile_default/ipython_config.py``::
es_es: Luego registra la extensión line_profiler en ``~/.ipython/profile_default/ipython_config.py``::

source: This will register the ``%lprun`` magic command in the IPython terminal application and the other frontends such as qtconsole and notebook.
es_es: Esto registrará el comando magic ``%lprun`` en la aplicación de terminal de IPython y en los otros frontends como qtconsole y notebook.

source: Now restart IPython and let us use this new toy::
es_es: Ahora reinicia IPython y usemos este nuevo juguete::

source: By looking at the top values of the ``% Time`` column it is really easy to pin-point the most expensive expressions that would deserve additional care.
es_es: Si se observan los valores más altos de la columna ``% Time`` es realmente fácil señalar las expresiones más costosas que merecerían atención adicional.

source: Memory usage profiling
es_es: Perfilar el uso de memoria

source: You can analyze in detail the memory usage of any Python code with the help of `memory_profiler <https://pypi.org/project/memory_profiler/>`_. First, install the latest version:
es_es: Puedes analizar en detalle el uso de memoria de cualquier código Python con la ayuda de `memory_profiler <https://pypi.org/project/memory_profiler/>`_. Primero, instala la última versión:

source: Then, setup the magics in a manner similar to ``line_profiler``.
es_es: Luego, configura los magics de forma similar a ``line_profiler``.

source: **Under IPython 0.11+**, first create a configuration profile:
es_es: **En IPython 0.11+**, primero crea un perfil de configuración:

source: Then register the extension in ``~/.ipython/profile_default/ipython_config.py`` alongside the line profiler::
es_es: Luego registra la extensión en ``~/.ipython/profile_default/ipython_config.py`` junto al perfilador de línea::

source: This will register the ``%memit`` and ``%mprun`` magic commands in the IPython terminal application and the other frontends such as qtconsole and notebook.
es_es: Esto registrará los comandos magic ``%memit`` y ``%mprun`` en la aplicación de terminal de IPython y en los otros frontends como qtconsole y notebook.

source: ``%mprun`` is useful to examine, line-by-line, the memory usage of key functions in your program. It is very similar to ``%lprun``, discussed in the previous section. For example, from the ``memory_profiler`` ``examples`` directory::
es_es: ``%mprun`` es útil para examinar, línea por línea, el uso de memoria de las funciones clave de tu programa. Es muy similar a ``%lprun``, discutido en la sección anterior. Por ejemplo, desde el directorio ``examples`` de ``memory_profiler``::

source: Another useful magic that ``memory_profiler`` defines is ``%memit``, which is analogous to ``%timeit``. It can be used as follows::
es_es: Otro magic útil que define ``memory_profiler`` es ``%memit``, que es análogo a ``%timeit``. Se puede utilizar de la siguiente manera::

source: For more details, see the docstrings of the magics, using ``%memit?`` and ``%mprun?``.
es_es: Para más detalles, consulta las cadenas de documentación de los magics, utilizando ``%memit?`` y ``%mprun?``.

source: Performance tips for the Cython developer
es_es: Tips de rendimiento para el desarrollador Cython

source: If profiling of the Python code reveals that the Python interpreter overhead is larger by one order of magnitude or more than the cost of the actual numerical computation (e.g. ``for`` loops over vector components, nested evaluation of conditional expression, scalar arithmetic...), it is probably adequate to extract the hotspot portion of the code as a standalone function in a ``.pyx`` file, add static type declarations and then use Cython to generate a C program suitable to be compiled as a Python extension module.
es_es: Si el perfilado del código Python revela que la sobrecarga del intérprete Python es mayor en un orden de magnitud o más que el coste del cálculo numérico real (por ejemplo, bucles ``for`` sobre componentes vectoriales, evaluación anidada de expresiones condicionales, aritmética escalar...), probablemente sea adecuado extraer la parte hotspot del código como una función independiente en un archivo ``.pyx``, añadir declaraciones de tipos estáticos y luego utilizar Cython para generar un programa en C adecuado para ser compilado como un módulo de extensión Python.

source: The official documentation available at http://docs.cython.org/ contains a tutorial and reference guide for developing such a module. In the following we will just highlight a couple of tricks that we found important in practice on the existing cython codebase in the scikit-learn project.
es_es: La documentación oficial disponible en http://docs.cython.org/ contiene un tutorial y un manual de referencia para desarrollar dicho módulo. A continuación sólo destacaremos un par de trucos que hemos encontrado importantes en la práctica en el código base de cython existente en el proyecto scikit-learn.

source: TODO: html report, type declarations, bound checks, division by zero checks, memory alignment, direct blas calls...
es_es: TODO: informe html, declaraciones de tipo, comprobaciones de límites, comprobaciones de división por cero, alineación de memoria, llamadas directas a blas...

source: Using OpenMP
es_es: Utilizando OpenMP

source: Since scikit-learn can be built without OpenMP, it's necessary to protect each direct call to OpenMP. This can be done using the following syntax::
es_es: Como scikit-learn puede ser construido sin OpenMP, es necesario proteger cada llamada directa a OpenMP. Esto se puede hacer usando la siguiente sintaxis::

source: Protecting the parallel loop, ``prange``, is already done by cython.
es_es: La protección del bucle paralelo, ``prange``, ya la hace cython.

source: Profiling compiled extensions
es_es: Perfilar las extensiones compiladas

source: When working with compiled extensions (written in C/C++ with a wrapper or directly as Cython extension), the default Python profiler is useless: we need a dedicated tool to introspect what's happening inside the compiled extension it-self.
es_es: Cuando se trabaja con extensiones compiladas (escritas en C/C++ con un wrapper o directamente como extensión de Cython), el perfilador de Python predeterminado es inútil: necesitamos una herramienta dedicada para introspeccionar lo que está sucediendo dentro de la propia extensión compilada.

source: Using yep and gperftools
es_es: Utilizando yep y gperftools

source: Easy profiling without special compilation options use yep:
es_es: El perfilado fácil sin opciones especiales de compilación utiliza yep:

source: Using gprof
es_es: Utilizando gprof

source: In order to profile compiled Python extensions one could use ``gprof`` after having recompiled the project with ``gcc -pg`` and using the ``python-dbg`` variant of the interpreter on debian / ubuntu: however this approach requires to also have ``numpy`` and ``scipy`` recompiled with ``-pg`` which is rather complicated to get working.
es_es: Para perfilar las extensiones de Python compiladas se puede utilizar ``gprof`` después de haber recompilado el proyecto con ``gcc -pg`` y utilizando la variante ``python-dbg`` del intérprete en debian / ubuntu: sin embargo, este enfoque requiere tener también ``numpy`` y ``scipy`` recompilados con ``-pg``, lo que es bastante complicado de conseguir.

source: Fortunately there exist two alternative profilers that don't require you to recompile everything.
es_es: Afortunadamente, existen dos perfiladores alternativos que no requieren que se recompile todo.

source: Using valgrind / callgrind / kcachegrind
es_es: Utilizando valgrind / callgrind / kcachegrind

source: ``yep`` can be used to create a profiling report. ``kcachegrind`` provides a graphical environment to visualize this report:
es_es: Se puede utilizar ``yep`` para crear un informe de perfilado. ``kcachegrind`` proporciona un entorno gráfico para visualizar este informe:

source: ``yep`` can be executed with the argument ``--lines`` or ``-l`` to compile a profiling report 'line by line'.
es_es: ``yep`` puede ser ejecutado con el argumento ``--lines`` o ``-l`` para compilar un informe de perfilado 'línea por línea'.

source: Multi-core parallelism using ``joblib.Parallel``
es_es: Paralelismo multinúcleo utilizando ``joblib.Parallel``

source: See `joblib documentation <https://joblib.readthedocs.io>`_
es_es: Ver `documentación joblib <https://joblib.readthedocs.io>`_

source: A simple algorithmic trick: warm restarts
es_es: Un simple truco algorítmico: reinicios en caliente

source: See the glossary entry for `warm_start <http://scikit-learn.org/dev/glossary.html#term-warm-start>`_
es_es: Ver la entrada del glosario para `warm_start <http://scikit-learn.org/dev/glossary.html#term-warm-start>`_
