Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/plotting.po
Languages: es_es

source: Developing with the Plotting API
es_es: Desarrollo con la API Plotting

source: Scikit-learn defines a simple API for creating visualizations for machine learning. The key features of this API is to run calculations once and to have the flexibility to adjust the visualizations after the fact. This section is intended for developers who wish to develop or maintain plotting tools. For usage, users should refer to the :ref`User Guide <visualizations>`.
es_es: Scikit-learn define una API sencilla para crear visualizaciones para el aprendizaje automático. Las características clave de esta API son ejecutar los cálculos una vez y tener la flexibilidad de ajustar las visualizaciones después del hecho. Esta sección está destinada a los desarrolladores que deseen desarrollar o mantener herramientas de trazado. Para su uso, los usuarios deben consultar el :ref:`Manual de Usuario <visualizations>`.

source: Plotting API Overview
es_es: Visión general de la API Plotting

source: This logic is encapsulated into a display object where the computed data is stored and the plotting is done in a `plot` method. The display object's `__init__` method contains only the data needed to create the visualization. The `plot` method takes in parameters that only have to do with visualization, such as a matplotlib axes. The `plot` method will store the matplotlib artists as attributes allowing for style adjustments through the display object. A `plot_*` helper function accepts parameters to do the computation and the parameters used for plotting. After the helper function creates the display object with the computed values, it calls the display's plot method. Note that the `plot` method defines attributes related to matplotlib, such as the line artist. This allows for customizations after calling the `plot` method.
es_es: Esta lógica se encapsula en un objeto de visualización donde se almacenan los datos calculados y el trazado se realiza en un método `plot`. El método `__init__` del objeto de visualización contiene sólo los datos necesarios para crear la visualización. El método `plot` toma parámetros que sólo tienen que ver con la visualización, como los ejes de matplotlib. El método `plot` almacenará los artistas de matplotlib como atributos que permiten ajustes de estilo a través del objeto de visualización. Una función de ayuda (helper) `plot_*` acepta parámetros para hacer el cálculo y los parámetros utilizados para el trazado. Después de que la función de ayuda crea el objeto de visualización con los valores calculados, invoca al método plot de la visualización. Ten en cuenta que el método `plot` define atributos relacionados con matplotlib, como el artista de la línea. Esto permite personalizaciones después de invocar al método `plot`.

source: For example, the `RocCurveDisplay` defines the following methods and attributes::
es_es: Por ejemplo, `RocCurveDisplay` define los siguientes métodos y atributos::

source: Read more in :ref:`sphx_glr_auto_examples_miscellaneous_plot_roc_curve_visualization_api.py` and the :ref:`User Guide <visualizations>`.
es_es: Lee más en :ref:`sphx_glr_auto_examples_miscellaneous_plot_partial_dependence_visualization_api.py` y en el :ref:`Manual de Usuario <visualizations>`.

source: Plotting with Multiple Axes
es_es: Graficar con Múltiples Ejes

source: Some of the plotting tools like :func:`~sklearn.inspection.plot_partial_dependence` and :class:`~sklearn.inspection.PartialDependenceDisplay` support plottong on multiple axes. Two different scenarios are supported:
es_es: Algunas de las herramientas de graficación como :func:`~sklearn.inspection.plot_partial_dependence` y :class:`~sklearn.inspection.PartialDependenceDisplay` admiten el trazado en múltiples ejes. Se admiten dos escenarios diferentes:

source: 1. If a list of axes is passed in, `plot` will check if the number of axes is consistent with the number of axes it expects and then draws on those axes. 2. If a single axes is passed in, that axes defines a space for multiple axes to be placed. In this case, we suggest using matplotlib's `~matplotlib.gridspec.GridSpecFromSubplotSpec` to split up the space::
es_es: Primero, si se pasa una lista de ejes, `plot` comprobará si el número de ejes es coherente con el número de ejes que espera y entonces dibujará en esos ejes. Segundo, si se pasa un solo eje, ese eje define un espacio para colocar varios ejes. En este caso, te sugerimos que utilices la función `~matplotlib.gridspec.GridSpecFromSubplotSpec` de matplotlib para dividir el espacio::

source: By default, the `ax` keyword in `plot` is `None`. In this case, the single axes is created and the gridspec api is used to create the regions to plot in.
es_es: Por defecto, la palabra clave `ax` en `plot` es `None`. En este caso, se crea el eje único y se utiliza la api gridspec para crear las regiones a trazar.

source: See for example, :func:`~sklearn.inspection.plot_partial_dependence` which plots multiple lines and contours using this API. The axes defining the bounding box is saved in a `bounding_ax_` attribute. The individual axes created are stored in an `axes_` ndarray, corresponding to the axes position on the grid. Positions that are not used are set to `None`. Furthermore, the matplotlib Artists are stored in `lines_` and `contours_` where the key is the position on the grid. When a list of axes is passed in, the `axes_`, `lines_`, and `contours_` is a 1d ndarray corresponding to the list of axes passed in.
es_es: Mira por ejemplo, :func:`~sklearn.inspection.plot_partial_dependence` que traza múltiples líneas y contornos utilizando esta API. Los ejes que definen la caja delimitadora se guardan en un atributo `bounding_ax_`. Los ejes individuales creados se guardan en un ndarray `axes_` , correspondiente a la posición de los ejes en la cuadrícula. Las posiciones que no se utilizan se establecen en `None`. Además, los Artistas de matplotlib se almacenan en `lines_` y `contours_` donde la clave es la posición en la cuadrícula. Cuando se pasa una lista de ejes, el `axes_`, `lines_` y `contours_` es un ndarray 1d correspondiente a la lista de ejes pasados.
