Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/tips.po
Languages: es_es

source: Developers' Tips and Tricks
es_es: Consejos y Trucos de los Desarrolladores

source: Productivity and sanity-preserving tips
es_es: Consejos para preservar la productividad y la cordura

source: In this section we gather some useful advice and tools that may increase your quality-of-life when reviewing pull requests, running unit tests, and so forth. Some of these tricks consist of userscripts that require a browser extension such as `TamperMonkey`_ or `GreaseMonkey`_; to set up userscripts you must have one of these extensions installed, enabled and running. We provide userscripts as GitHub gists; to install them, click on the "Raw" button on the gist page.
es_es: En esta sección recogemos algunos consejos y herramientas útiles que pueden aumentar tu calidad de vida a la hora de revisar pull requests, ejecutar pruebas unitarias, etc. Algunos de estos trucos consisten en userscripts que requieren una extensión del navegador como `TamperMonkey`_ o `GreaseMonkey`_; para configurar los userscripts debes tener una de estas extensiones instalada, habilitada y funcionando. Proporcionamos los userscripts como gists de GitHub; para instalarlos, haz clic en el botón "Raw" de la página del gist.

source: Folding and unfolding outdated diffs on pull requests
es_es: Pliegue y despliegue de diffs obsoletos en pull requests

source: GitHub hides discussions on PRs when the corresponding lines of code have been changed in the mean while. This `userscript <https://raw.githubusercontent.com/lesteve/userscripts/master/github-expand-all.user.js>`__ provides a shortcut (Control-Alt-P at the time of writing but look at the code to be sure) to unfold all such hidden discussions at once, so you can catch up.
es_es: GitHub oculta las discusiones en los PR cuando las líneas de código correspondientes han sido cambiadas mientras tanto. Este `userscript <https://raw.githubusercontent.com/lesteve/userscripts/master/github-expand-all.user.js>`__ proporciona un atajo (Control-Alt-P en el momento de escribir esto, pero mira el código para estar seguro) para desplegar todas esas discusiones ocultas a la vez, para que puedas ponerte al día.

source: Checking out pull requests as remote-tracking branches
es_es: Comprobación de pull requests como ramas de seguimiento remoto

source: In your local fork, add to your ``.git/config``, under the ``[remote "upstream"]`` heading, the line::
es_es: En tu fork local, añade a tu ``.git/config``, bajo el encabezado ``[remote "upstream"]``, la línea::

source: You may then use ``git checkout pr/PR_NUMBER`` to navigate to the code of the pull-request with the given number. (`Read more in this gist. <https://gist.github.com/piscisaureus/3342247>`_)
es_es: A continuación, puedes utilizar ``git checkout pr/PR_NUMBER`` para navegar hasta el código del pull-request con el número dado. (`Lee más en este gist. <https://gist.github.com/piscisaureus/3342247>`_)

source: Display code coverage in pull requests
es_es: Mostrar la cobertura del código en los pull requests

source: To overlay the code coverage reports generated by the CodeCov continuous integration, consider `this browser extension <https://github.com/codecov/browser-extension>`_. The coverage of each line will be displayed as a color background behind the line number.
es_es: Para superponer los informes de cobertura de código generados por la integración continua de CodeCov, considere `esta extensión del navegador <https://github.com/codecov/browser-extension>`_. La cobertura de cada línea se mostrará como un fondo de color detrás del número de línea.

source: Useful pytest aliases and flags
es_es: Alias e indicadores útiles de pytest

source: The full test suite takes fairly long to run. For faster iterations, it is possibly to select a subset of tests using pytest selectors. In particular, one can run a `single test based on its node ID <https://docs.pytest.org/en/latest/example/markers.html#selecting-tests-based-on-their-node-id>`_:
es_es: El conjunto de pruebas completo tarda bastante en ejecutarse. Para iteraciones más rápidas, es posible seleccionar un subconjunto de pruebas utilizando selectores de pytest. En particular, se puede ejecutar una `sola prueba basada en su ID de nodo <https://docs.pytest.org/en/latest/example/markers.html#selecting-tests-based-on-their-node-id>`_:

source: or use the `-k pytest parameter <https://docs.pytest.org/en/latest/example/markers.html#using-k-expr-to-select-tests-based-on-their-name>`_ to select tests based on their name. For instance,:
es_es: o utilizar el `parámetro -k pytest <https://docs.pytest.org/en/latest/example/markers.html#using-k-expr-to-select-tests-based-on-their-name>`_ para seleccionar las pruebas en función de su nombre. Por ejemplo:

source: will run all :term:`common tests` for the ``LogisticRegression`` estimator.
es_es: ejecutará todos los :term:`tests comunes` para el estimador ``LogisticRegression``.

source: When a unit test fails, the following tricks can make debugging easier:
es_es: Cuando una prueba unitaria falla, los siguientes trucos pueden facilitar la depuración:

source: The command line argument ``pytest -l`` instructs pytest to print the local variables when a failure occurs.
es_es: El argumento de la línea de comandos ``pytest -l`` indica a pytest que imprima las variables locales cuando se produce un fallo.

source: The argument ``pytest --pdb`` drops into the Python debugger on failure. To instead drop into the rich IPython debugger ``ipdb``, you may set up a shell alias to:
es_es: El argumento ``pytest --pdb`` pasa al depurador de Python en caso de fallo. En cambio, para entrar en el depurador enriquecido de IPython ``ipdb``, puedes configurar un alias de shell para:

source: Other `pytest` options that may become useful include:
es_es: Otras opciones de `pytest` que pueden resultar útiles son:

source: ``-x`` which exits on the first failed test
es_es: ``-x`` que sale en la primera prueba fallida

source: ``--lf`` to rerun the tests that failed on the previous run
es_es: ``--lf`` para volver a ejecutar las pruebas que fallaron en la ejecución anterior

source: ``--ff`` to rerun all previous tests, running the ones that failed first
es_es: ``--ff`` para volver a ejecutar todas las pruebas anteriores, ejecutando las que fallaron primero

source: ``-s`` so that pytest does not capture the output of ``print()`` statements
es_es: ``-s`` para que pytest no capture la salida de las declaraciones ``print()``

source: ``--tb=short`` or ``--tb=line`` to control the length of the logs
es_es: ``--tb=short`` o ``--tb=line`` para controlar la longitud de los registros

source: ``--runxfail`` also run tests marked as a known failure (XFAIL) and report errors.
es_es: ``--runxfail`` también ejecuta las pruebas marcadas como fallo conocido (XFAIL) y reporta los errores.

source: Since our continuous integration tests will error if ``FutureWarning`` isn't properly caught, it is also recommended to run ``pytest`` along with the ``-Werror::FutureWarning`` flag.
es_es: Dado que nuestras pruebas de integración continua darán un error si ``FutureWarning`` no se captura correctamente, también se recomienda ejecutar ``pytest`` junto con el indicador ``-Werror::FutureWarning``.

source: Standard replies for reviewing
es_es: Respuestas estándar para la revisión

source: It may be helpful to store some of these in GitHub's `saved replies <https://github.com/settings/replies/>`_ for reviewing:
es_es: Puede ser útil almacenar algunas de ellas en las `respuestas guardadas <https://github.com/settings/replies/>`_ de GitHub para revisarlas:

source: Issue: Usage questions
es_es: Incidencia: Preguntas sobre el uso

source: Issue: You're welcome to update the docs
es_es: Incidencia: Puedes actualizar los documentos

source: Issue: Self-contained example for bug
es_es: Incidencia: Ejemplo autocontenido para el error

source: Issue: Software versions
es_es: Incidencia: Versiones de software

source: Issue: Code blocks
es_es: Incidencia: Bloques de código

source: Issue/Comment: Linking to code
es_es: Incidencias/comentarios: Vinculación con el código

source: Issue/Comment: Linking to comments
es_es: Incidencias/Comentarios: Vinculación con los comentarios

source: PR-NEW: Better description and title
es_es: PR-NEW: Mejor descripción y título

source: PR-NEW: Fix #
es_es: PR-NUEVO: Corrección #

source: PR-NEW or Issue: Maintenance cost
es_es: PR-NUEVO o Incidencia: Coste de mantenimiento

source: PR-WIP: What's needed before merge?
es_es: PR-WIP: ¿Qué se necesita antes de la fusión (merge)?

source: PR-WIP: Regression test needed
es_es: PR-WIP: Se necesita una prueba de regresión

source: PR-MRG: Patience
es_es: PR-MRG: Paciencia

source: PR-MRG: Add to what's new
es_es: PR-MRG: Añadir a las novedades

source: PR: Don't change unrelated
es_es: PR: No cambies lo que no está relacionado

source: Debugging memory errors in Cython with valgrind
es_es: Depuración de errores de memoria en Cython con valgrind

source: While python/numpy's built-in memory management is relatively robust, it can lead to performance penalties for some routines. For this reason, much of the high-performance code in scikit-learn in written in cython. This performance gain comes with a tradeoff, however: it is very easy for memory bugs to crop up in cython code, especially in situations where that code relies heavily on pointer arithmetic.
es_es: Aunque la gestión de la memoria incorporada en python/numpy es relativamente robusta, puede llevar a penalizaciones en el rendimiento de algunas rutinas. Por esta razón, gran parte del código de alto rendimiento en scikit-learn está escrito en cython. Sin embargo, esta ganancia de rendimiento viene con una compensación: es muy fácil que surjan errores de memoria en el código de cython, especialmente en situaciones en las que ese código depende en gran medida de la aritmética de punteros.

source: Memory errors can manifest themselves a number of ways. The easiest ones to debug are often segmentation faults and related glibc errors. Uninitialized variables can lead to unexpected behavior that is difficult to track down. A very useful tool when debugging these sorts of errors is valgrind_.
es_es: Los errores de memoria pueden manifestarse de varias maneras. Los más fáciles de depurar suelen ser los fallos de segmentación y los errores glibc relacionados. Las variables no inicializadas pueden conducir a un comportamiento inesperado que es difícil de rastrear. Una herramienta muy útil para depurar este tipo de errores es valgrind_.

source: Valgrind is a command-line tool that can trace memory errors in a variety of code. Follow these steps:
es_es: Valgrind es una herramienta de línea de comandos que puede rastrear errores de memoria en una variedad de código. Sigue estos pasos:

source: Install `valgrind`_ on your system.
es_es: Instala `valgrind`_ en tu sistema.

source: Download the python valgrind suppression file: `valgrind-python.supp`_.
es_es: Descarga el archivo de supresión de valgrind de python: `valgrind-python.supp`_.

source: Follow the directions in the `README.valgrind`_ file to customize your python suppressions. If you don't, you will have spurious output coming related to the python interpreter instead of your own code.
es_es: Sigue las instrucciones del archivo `README.valgrind`_ para personalizar tus supresiones de python. Si no lo haces, tendrás salidas espurias relacionadas con el intérprete de python en lugar de tu propio código.

source: Run valgrind as follows:
es_es: Ejecuta valgrind de la siguiente manera:

source: The result will be a list of all the memory-related errors, which reference lines in the C-code generated by cython from your .pyx file. If you examine the referenced lines in the .c file, you will see comments which indicate the corresponding location in your .pyx source file. Hopefully the output will give you clues as to the source of your memory error.
es_es: El resultado será una lista de todos los errores relacionados con la memoria, que hacen referencia a líneas en el código C generado por cython desde su archivo .pyx. Si examinas las líneas referenciadas en el archivo .c, verás comentarios que indican la ubicación correspondiente en tu archivo fuente .pyx. Con suerte, la salida te dará pistas sobre el origen de tu error de memoria.

source: For more information on valgrind and the array of options it has, see the tutorials and documentation on the `valgrind web site <http://valgrind.org>`_.
es_es: Para más información sobre valgrind y el arreglo de opciones que tiene, consulta los tutoriales y la documentación en el `sitio web de valgrind <http://valgrind.org>`_.

source: Building and testing for the ARM64 platform on a x86_64 machine
es_es: Construcción y pruebas para la plataforma ARM64 en una máquina x86_64

source: ARM-based machines are a popular target for mobile, edge or other low-energy deployments (including in the cloud, for instance on Scaleway or AWS Graviton).
es_es: Las máquinas basadas en ARM son un objetivo popular para las implementaciones móviles, de arista u otras de bajo consumo de energía (incluso en la nube, por ejemplo en Scaleway o AWS Graviton).

source: Here are instructions to setup a local dev environment to reproduce ARM-specific bugs or test failures on a x86_64 host laptop or workstation. This is based on QEMU user mode emulation using docker for convenience (see https://github.com/multiarch/qemu-user-static).
es_es: Aquí tienes las instrucciones para configurar un entorno de desarrollo local para reproducir errores específicos de ARM o fallos de prueba en una computadora portátil o estación de trabajo host x86_64. Esto se basa en la emulación del modo de usuario de QEMU que utiliza docker para mayor comodidad (consulta https://github.com/multiarch/qemu-user-static).

source: The following instructions are illustrated for ARM64 but they also apply to ppc64le, after changing the Docker image and Miniforge paths appropriately.
es_es: Las siguientes instrucciones se ilustran para ARM64 pero también se aplican a ppc64le, después de cambiar la imagen Docker y las rutas de Miniforge apropiadamente.

source: Prepare a folder on the host filesystem and download the necessary tools and source code:
es_es: Prepara una carpeta en el sistema de archivos del host y descarga las herramientas y el código fuente necesarios:

source: Use docker to install QEMU user mode and run an ARM64v8 container with access to your shared folder under the `/io` mount point:
es_es: Utiliza docker para instalar el modo de usuario QEMU y ejecutar un contenedor ARM64v8 con acceso a tu carpeta compartida bajo el punto de montaje `/io`:

source: In the container, install miniforge3 for the ARM64 (a.k.a. aarch64) architecture:
es_es: En el contenedor, instala miniforge3 para la arquitectura ARM64 (también conocida como aarch64):

source: Whenever you restart a new container, you will need to reinit the conda env previously installed under `/io/miniforge3`:
es_es: Cada vez que reinicies un nuevo contenedor, tendrás que reiniciar el env de conda previamente instalado en `/io/miniforge3`:

source: as the `/root` home folder is part of the ephemeral docker container. Every file or directory stored under `/io` is persistent on the other hand.
es_es: ya que la carpeta de inicio `/root` forma parte del contenedor docker efímero. Por otro lado, cada archivo o directorio almacenado en `/io` es persistente.

source: You can then build scikit-learn as usual (you will need to install compiler tools and dependencies using apt or conda as usual). Building scikit-learn takes a lot of time because of the emulation layer, however it needs to be done only once if you put the scikit-learn folder under the `/io` mount point.
es_es: A continuación, puedes construir scikit-learn como de costumbre (tendrás que instalar las herramientas de compilación y las dependencias utilizando apt o conda como de costumbre). La construcción de scikit-learn lleva mucho tiempo debido a la capa de emulación, sin embargo, sólo es necesario hacerlo una vez si se pone la carpeta de scikit-learn bajo el punto de montaje `/io`.

source: Then use pytest to run only the tests of the module you are interested in debugging.
es_es: Luego utiliza pytest para ejecutar sólo las pruebas del módulo que te interesa depurar.
