Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/developers/utilities.po
Languages: es_es

source: Utilities for Developers
es_es: Utilidades para Desarrolladores

source: Scikit-learn contains a number of utilities to help with development. These are located in :mod:`sklearn.utils`, and include tools in a number of categories. All the following functions and classes are in the module :mod:`sklearn.utils`.
es_es: Scikit-learn contiene una serie de utilidades para ayudar al desarrollo. Éstas se encuentran en :mod:`sklearn.utils`, e incluyen herramientas en varias categorías. Todas las siguientes funciones y clases están en el módulo :mod:`sklearn.utils`.

source: These utilities are meant to be used internally within the scikit-learn package. They are not guaranteed to be stable between versions of scikit-learn. Backports, in particular, will be removed as the scikit-learn dependencies evolve.
es_es: Estas utilidades están destinadas a ser utilizadas internamente dentro del paquete scikit-learn. No se garantiza que sean estables entre versiones de scikit-learn. Los backports, en particular, se eliminarán a medida que las dependencias de scikit-learn evolucionen.

source: Validation Tools
es_es: Herramientas de Validación

source: These are tools used to check and validate input. When you write a function which accepts arrays, matrices, or sparse matrices as arguments, the following should be used when applicable.
es_es: Se trata de herramientas utilizadas para comprobar y validar la entrada. Cuando se escribe una función que acepta arreglos, matrices o matrices dispersas como argumentos, se debe utilizar lo siguiente cuando sea aplicable.

source: :func:`assert_all_finite`: Throw an error if array contains NaNs or Infs.
es_es: :func:`assert_all_finite`: Lanza un error si el arreglo contiene NaNs o Infs.

source: :func:`as_float_array`: convert input to an array of floats. If a sparse matrix is passed, a sparse matrix will be returned.
es_es: :func:`as_float_array`: convierte la entrada en un arreglo de números de punto flotante (float). Si se pasa una matriz dispersa, se devolverá una matriz dispersa.

source: :func:`check_array`: check that input is a 2D array, raise error on sparse matrices. Allowed sparse matrix formats can be given optionally, as well as allowing 1D or N-dimensional arrays. Calls :func:`assert_all_finite` by default.
es_es: :func:`check_array`: comprueba que la entrada es un arreglo 2D, genera un error en matrices dispersas. Los formatos de matrices dispersas permitidos pueden darse opcionalmente, así como permitir arreglos 1D o N-dimensionales. Invoca :func:`assert_all_finite` por defecto.

source: :func:`check_X_y`: check that X and y have consistent length, calls check_array on X, and column_or_1d on y. For multilabel classification or multitarget regression, specify multi_output=True, in which case check_array will be called on y.
es_es: :func:`check_X_y`: comprueba que X e y tienen una longitud consistente, invoca a check_array en X y a column_or_1d en y. Para la clasificación multietiqueta o la regresión multiobjetivo, especifica multi_output=True, en cuyo caso se invocará a check_array en y.

source: :func:`indexable`: check that all input arrays have consistent length and can be sliced or indexed using safe_index. This is used to validate input for cross-validation.
es_es: :func:`indexable`: comprueba que todos los arreglos de entrada tienen una longitud consistente y pueden ser divididos o indexados mediante safe_index. Esto se utiliza para validar la entrada para la validación cruzada.

source: :func:`validation.check_memory` checks that input is ``joblib.Memory``-like, which means that it can be converted into a ``sklearn.utils.Memory`` instance (typically a str denoting the ``cachedir``) or has the same interface.
es_es: :func:`validation.check_memory` comprueba que la entrada es ``joblib.Memory``, lo que significa que puede convertirse en una instancia de ``sklearn.utils.Memory`` (normalmente una cadena (str) que denota el ``cachedir``) o tiene la misma interfaz.

source: If your code relies on a random number generator, it should never use functions like ``numpy.random.random`` or ``numpy.random.normal``. This approach can lead to repeatability issues in unit tests. Instead, a ``numpy.random.RandomState`` object should be used, which is built from a ``random_state`` argument passed to the class or function. The function :func:`check_random_state`, below, can then be used to create a random number generator object.
es_es: Si tu código depende de un generador de números aleatorios, nunca deberías utilizar funciones como ``numpy.random.random`` o ``numpy. random.normal``. Este enfoque puede conducir a problemas de repetibilidad en las pruebas unitarias. En su lugar, debes utilizar un objeto ``numpy.random.RandomState``, que se construye a partir de un argumento ``random_state`` pasado a la clase o función. La función :func:`check_random_state`, a continuación, se puede utilizar para crear un objeto generador de números aleatorio.

source: :func:`check_random_state`: create a ``np.random.RandomState`` object from a parameter ``random_state``.
es_es: :func:`check_random_state`: crea un objeto ``np.random.RandomState`` a partir de un parámetro ``random_state``.

source: If ``random_state`` is ``None`` or ``np.random``, then a randomly-initialized ``RandomState`` object is returned.
es_es: Si ``random_state`` es ``None `` o ``np.random``, se devuelve un objeto ``RandomState`` inicializado aleatoriamente.

source: If ``random_state`` is an integer, then it is used to seed a new ``RandomState`` object.
es_es: Si ``random_state`` es un número entero, se utiliza para sembrar un nuevo objeto ``RandomState``.

source: If ``random_state`` is a ``RandomState`` object, then it is passed through.
es_es: Si ``random_state`` es un objeto ``RandomState``, entonces se pasa por él.

source: For example::
es_es: Por ejemplo::

source: When developing your own scikit-learn compatible estimator, the following helpers are available.
es_es: Cuando desarrolles tu propio estimador compatible con scikit-learn, los siguientes ayudantes (helpers) están disponibles.

source: :func:`validation.check_is_fitted`: check that the estimator has been fitted before calling ``transform``, ``predict``, or similar methods. This helper allows to raise a standardized error message across estimator.
es_es: :func:`validation.check_is_fitted`: comprueba que el estimador ha sido ajustado antes de invocar los métodos ``transform``, ``predict`` o similares. Este ayudante (helper) permite lanzar un mensaje de error estandarizado a través del estimador.

source: :func:`validation.has_fit_parameter`: check that a given parameter is supported in the ``fit`` method of a given estimator.
es_es: :func:`validation.has_fit_parameter`: comprueba que un parámetro dado es compatible con el método ``fit`` de un estimador dado.

source: Efficient Linear Algebra & Array Operations
es_es: Álgebra Lineal Eficiente y Operaciones de Arreglos

source: :func:`extmath.randomized_range_finder`: construct an orthonormal matrix whose range approximates the range of the input. This is used in :func:`extmath.randomized_svd`, below.
es_es: :func:`extmath.randomized_range_finder`: construye una matriz ortonormal cuyo rango se aproxima al rango de la entrada. Se utiliza en :func:`extmath.randomized_svd`, a continuación.

source: :func:`extmath.randomized_svd`: compute the k-truncated randomized SVD. This algorithm finds the exact truncated singular values decomposition using randomization to speed up the computations. It is particularly fast on large matrices on which you wish to extract only a small number of components.
es_es: :func:`extmath.randomized_svd`: calcula la SVD aleatoria k-truncada. Este algoritmo encuentra la descomposición en valores singulares exacta truncada utilizando la aleatorización para acelerar los cálculos. Es particularmente rápido en matrices grandes en las que se desea extraer sólo un pequeño número de componentes.

source: :func:`arrayfuncs.cholesky_delete`: (used in :func:`~sklearn.linear_model.lars_path`) Remove an item from a cholesky factorization.
es_es: :func:`arrayfuncs.cholesky_delete`: (utilizado en :func:`~sklearn.linear_model.lars_path`) Elimina un elemento de una factorización de Cholesky.

source: :func:`arrayfuncs.min_pos`: (used in ``sklearn.linear_model.least_angle``) Find the minimum of the positive values within an array.
es_es: :func:`arrayfuncs.min_pos`: (utilizado en ``sklearn.linear_model.least_angle``) Encuentra el mínimo de los valores positivos dentro de un arreglo.

source: :func:`extmath.fast_logdet`: efficiently compute the log of the determinant of a matrix.
es_es: :func:`extmath.fast_logdet`: calcula eficientemente el logaritmo del determinante de una matriz.

source: :func:`extmath.density`: efficiently compute the density of a sparse vector
es_es: :func:`extmath.density`: calcula de manera eficiente la densidad de un vector disperso

source: :func:`extmath.safe_sparse_dot`: dot product which will correctly handle ``scipy.sparse`` inputs. If the inputs are dense, it is equivalent to ``numpy.dot``.
es_es: :func:`extmath.safe_sparse_dot`: producto punto que manejará correctamente las entradas ``scipy.sparse``. Si las entradas son densas, es equivalente a ``numpy.dot``.

source: :func:`extmath.weighted_mode`: an extension of ``scipy.stats.mode`` which allows each item to have a real-valued weight.
es_es: :func:`extmath.weighted_mode`: una extensión de ``scipy.stats.mode`` que permite que cada elemento tenga una ponderación de valor real.

source: :func:`resample`: Resample arrays or sparse matrices in a consistent way. used in :func:`shuffle`, below.
es_es: :func:`resample`: Remuestrea arreglos o matrices dispersas de forma consistente. Se utiliza en :func:`shuffle`, a continuación.

source: :func:`shuffle`: Shuffle arrays or sparse matrices in a consistent way. Used in :func:`~sklearn.cluster.k_means`.
es_es: :func:`shuffle`: Revuelve arreglos o matrices dispersas de forma consistente. Se utiliza en :func:`~sklearn.conglomerado.k_means`.

source: Efficient Random Sampling
es_es: Muestreo Aleatorio Eficiente

source: :func:`random.sample_without_replacement`: implements efficient algorithms for sampling ``n_samples`` integers from a population of size ``n_population`` without replacement.
es_es: :func:`random.sample_without_replacement`: implementa algoritmos eficientes para el muestreo de ``n_samples`` enteros de una población de tamaño ``n_population`` sin reemplazo.

source: Efficient Routines for Sparse Matrices
es_es: Rutinas Eficientes para Matrices Dispersas

source: The ``sklearn.utils.sparsefuncs`` cython module hosts compiled extensions to efficiently process ``scipy.sparse`` data.
es_es: El módulo de Cython ``sklearn.utils.sparsefuncs`` alberga extensiones compiladas para procesar eficientemente los datos de ``scipy.sparse``.

source: :func:`sparsefuncs.mean_variance_axis`: compute the means and variances along a specified axis of a CSR matrix. Used for normalizing the tolerance stopping criterion in :class:`~sklearn.cluster.KMeans`.
es_es: :func:`sparsefuncs.mean_variance_axis`: calcula las medias y varianzas a lo largo de un eje especificado de una matriz CSR. Se utiliza para normalizar el criterio de parada de la tolerancia en :class:`~sklearn.cluster.KMeans`.

source: :func:`sparsefuncs_fast.inplace_csr_row_normalize_l1` and :func:`sparsefuncs_fast.inplace_csr_row_normalize_l2`: can be used to normalize individual sparse samples to unit L1 or L2 norm as done in :class:`~sklearn.preprocessing.Normalizer`.
es_es: :func:`sparsefuncs_fast.inplace_csr_row_normalize_l1` y :func:`sparsefuncs_fast.inplace_csr_row_normalize_l2`: se pueden utilizar para normalizar muestras dispersas individuales a la norma unitaria L1 o L2 como se hace en :class:`~sklearn.preprocessing.Normalizer`.

source: :func:`sparsefuncs.inplace_csr_column_scale`: can be used to multiply the columns of a CSR matrix by a constant scale (one scale per column). Used for scaling features to unit standard deviation in :class:`~sklearn.preprocessing.StandardScaler`.
es_es: :func:`sparsefuncs.inplace_csr_column_scale`: puede utilizarse para multiplicar las columnas de una matriz CSR por una escala constante (una escala por columna). Se utiliza para escalar características a la desviación estándar unitaria en :class:`~sklearn.preprocessing.StandardScaler`.

source: Graph Routines
es_es: Rutinas gráficas

source: :func:`graph.single_source_shortest_path_length`: (not currently used in scikit-learn) Return the shortest path from a single source to all connected nodes on a graph. Code is adapted from `networkx <https://networkx.github.io/>`_. If this is ever needed again, it would be far faster to use a single iteration of Dijkstra's algorithm from ``graph_shortest_path``.
es_es: :func:`graph.single_source_shortest_path_length`: (no se utiliza actualmente en scikit-learn) Devuelve el camino más corto desde una sola fuente a todos los nodos conectados en un grafo. El código está adaptado de `networkx <https://networkx.github.io/>`_. Si alguna vez se necesita de nuevo, sería mucho más rápido utilizar una sola iteración del algoritmo de Dijkstra de ``graph_shortest_path``.

source: :func:`graph_shortest_path.graph_shortest_path`: (used in :class:`~sklearn.manifold.Isomap`) Return the shortest path between all pairs of connected points on a directed or undirected graph. Both the Floyd-Warshall algorithm and Dijkstra's algorithm are available. The algorithm is most efficient when the connectivity matrix is a ``scipy.sparse.csr_matrix``.
es_es: :func:`graph_shortest_path.graph_shortest_path`: (utilizado en :class:`~sklearn.manifold.Isomap`) Devuelve el camino más corto entre todos los pares de puntos conectados en un grafo dirigido o no dirigido. Están disponibles tanto el algoritmo de Floyd-Warshall como el de Dijkstra. El algoritmo es más eficiente cuando la matriz de conectividad es una ``scipy.sparse.csr_matrix``.

source: Testing Functions
es_es: Funciones de prueba

source: :func:`all_estimators` : returns a list of all estimators in scikit-learn to test for consistent behavior and interfaces.
es_es: :func:`all_estimators` : devuelve una lista de todos los estimadores en scikit-learn para comprobar el comportamiento y las interfaces consistentes.

source: Multiclass and multilabel utility function
es_es: Función de utilidad multiclase y multietiqueta

source: :func:`multiclass.is_multilabel`: Helper function to check if the task is a multi-label classification one.
es_es: :func:`multiclass.is_multilabel`: Función de ayuda (helper) para comprobar si la tarea es de clasificación multietiqueta.

source: :func:`multiclass.unique_labels`: Helper function to extract an ordered array of unique labels from different formats of target.
es_es: :func:`multiclass.unique_labels`: Función de ayuda (helper) para extraer un arreglo ordenado de etiquetas únicas de diferentes formatos de objetivo.

source: Helper Functions
es_es: Funciones de Ayuda (Helper)

source: :class:`gen_even_slices`: generator to create ``n``-packs of slices going up to ``n``. Used in :func:`~sklearn.decomposition.dict_learning` and :func:`~sklearn.cluster.k_means`.
es_es: :class:`gen_even_slices`: generador para crear ``n``-paquetes de divisiones que llegan hasta ``n``. Utilizado en :func:`~sklearn.decomposition.dict_learning` y :func:`~sklearn.conglomerado.k_means`.

source: :func:`safe_mask`: Helper function to convert a mask to the format expected by the numpy array or scipy sparse matrix on which to use it (sparse matrices support integer indices only while numpy arrays support both boolean masks and integer indices).
es_es: :func:`safe_mask`: Función de ayuda (helper) para convertir una máscara al formato esperado por el arreglo numpy o la matriz dispersa scipy en la que se va a utilizar (las matrices dispersas sólo admiten índices enteros mientras que los arreglos numpy admiten tanto máscaras booleanas como índices enteros).

source: :func:`safe_sqr`: Helper function for unified squaring (``**2``) of array-likes, matrices and sparse matrices.
es_es: :func:`safe_sqr`: Función de ayuda (helper) para la cuadratura unificada (``**2``) de array-likes, matrices y matrices dispersas.

source: Hash Functions
es_es: Funciones Hash

source: :func:`murmurhash3_32` provides a python wrapper for the ``MurmurHash3_x86_32`` C++ non cryptographic hash function. This hash function is suitable for implementing lookup tables, Bloom filters, Count Min Sketch, feature hashing and implicitly defined sparse random projections::
es_es: :func:`murmurhash3_32` proporciona un envoltorio de python para la función hash no criptográfica de C++ `MurmurHash3_x86_32`. Esta función hash es adecuada para implementar tablas de búsqueda, filtros Bloom, Count Min Sketch, hash de características y proyecciones aleatorias dispersas definidas implícitamente::

source: The ``sklearn.utils.murmurhash`` module can also be "cimported" from other cython modules so as to benefit from the high performance of MurmurHash while skipping the overhead of the Python interpreter.
es_es: El módulo ``sklearn.utils.murmurhash`` también puede ser "cimported" desde otros módulos de cython para beneficiarse del alto rendimiento de MurmurHash mientras se omite la sobrecarga del intérprete de Python.

source: Warnings and Exceptions
es_es: Advertencias y Excepciones

source: :class:`deprecated`: Decorator to mark a function or class as deprecated.
es_es: :class:`deprecated`: Decorador para marcar una función o clase como obsoleta.

source: :class:`~sklearn.exceptions.ConvergenceWarning`: Custom warning to catch convergence problems. Used in ``sklearn.covariance.graphical_lasso``.
es_es: :class:`~sklearn.exceptions.ConvergenceWarning`: Advertencia personalizada para detectar problemas de convergencia. Utilizado en ``sklearn.covariance.graphical_lasso``.
