Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/tutorial/text_analytics/working_with_text_data.po
Languages: es_es

source: Working With Text Data
es_es: Trabajar con datos de texto

source: The goal of this guide is to explore some of the main ``scikit-learn`` tools on a single practical task: analyzing a collection of text documents (newsgroups posts) on twenty different topics.
es_es: El objetivo de esta guía es explorar algunas de las principales herramientas de ``scikit-learn`` en una única tarea práctica: analizar una colección de documentos de texto (posts de grupos de noticias) sobre veinte temas diferentes.

source: In this section we will see how to:
es_es: En esta sección veremos cómo:

source: load the file contents and the categories
es_es: cargar el contenido del archivo y las categorías

source: extract feature vectors suitable for machine learning
es_es: extraer vectores de características adecuados para el aprendizaje automático

source: train a linear model to perform categorization
es_es: entrenar un modelo lineal para realizar la categorización

source: use a grid search strategy to find a good configuration of both the feature extraction components and the classifier
es_es: utilizar una estrategia de búsqueda exhaustiva para encontrar una buena configuración tanto de los componentes de extracción de características como del clasificador

source: Tutorial setup
es_es: Configuración del tutorial

source: To get started with this tutorial, you must first install *scikit-learn* and all of its required dependencies.
es_es: Para empezar con este tutorial, primero debes instalar *scikit-learn* y todas sus dependencias necesarias.

source: Please refer to the :ref:`installation instructions <installation-instructions>` page for more information and for system-specific instructions.
es_es: Consulte la página :ref:`instrucciones de instalación <installation-instructions>` para obtener más información y conocer las instrucciones específicas del sistema.

source: The source of this tutorial can be found within your scikit-learn folder::
es_es: La fuente de este tutorial se puede encontrar dentro de su carpeta scikit-learn::

source: The source can also be found `on Github <https://github.com/scikit-learn/scikit-learn/tree/main/doc/tutorial/text_analytics>`_.
es_es: El código fuente también se puede encontrar `en Github <https://github.com/scikit-learn/scikit-learn/tree/main/doc/tutorial/text_analytics>`_.

source: The tutorial folder should contain the following sub-folders:
es_es: La carpeta del tutorial debe contener las siguientes subcarpetas:

source: ``*.rst files`` - the source of the tutorial document written with sphinx
es_es: ``*.rst files`` - la fuente del documento tutorial escrito con sphinx

source: ``data`` - folder to put the datasets used during the tutorial
es_es: ``data`` - carpeta para poner los conjuntos de datos utilizados durante el tutorial

source: ``skeletons`` - sample incomplete scripts for the exercises
es_es: ``skeletons`` -muestra de script incompletos para los ejercicios

source: ``solutions`` - solutions of the exercises
es_es: ``solutions`` - soluciones de los ejercicios

source: You can already copy the skeletons into a new folder somewhere on your hard-drive named ``sklearn_tut_workspace`` where you will edit your own files for the exercises while keeping the original skeletons intact:
es_es: Ya puedes copiar los esqueletos en una nueva carpeta en algún lugar de tu disco duro llamada ``sklearn_tut_workspace`` donde editarás tus propios archivos para los ejercicios manteniendo los esqueletos (skeletons) originales intactos:

source: Machine learning algorithms need data. Go to each ``$TUTORIAL_HOME/data`` sub-folder and run the ``fetch_data.py`` script from there (after having read them first).
es_es: Los algoritmos de aprendizaje automático necesitan datos. Ve a cada subcarpeta ``$TUTORIAL_HOME/data`` y ejecuta el script ``fetch_data.py`` desde allí (después de haberlos leído primero).

source: For instance:
es_es: Por ejemplo:

source: Loading the 20 newsgroups dataset
es_es: Carga del conjunto de datos de 20 grupos de noticias

source: The dataset is called "Twenty Newsgroups". Here is the official description, quoted from the `website <http://people.csail.mit.edu/jrennie/20Newsgroups/>`_:
es_es: El conjunto de datos se llama "Twenty Newsgroups". Aquí está la descripción oficial, citada del `sitio web <http://people.csail.mit.edu/jrennie/20Newsgroups/>`_:

source: The 20 Newsgroups data set is a collection of approximately 20,000 newsgroup documents, partitioned (nearly) evenly across 20 different newsgroups. To the best of our knowledge, it was originally collected by Ken Lang, probably for his paper "Newsweeder: Learning to filter netnews," though he does not explicitly mention this collection. The 20 newsgroups collection has become a popular data set for experiments in text applications of machine learning techniques, such as text classification and text clustering.
es_es: El conjunto de datos 20 Newsgroups es una colección de aproximadamente 20.000 documentos de grupos de noticias, repartidos (casi) uniformemente entre 20 grupos de noticias diferentes. Por lo que sabemos, fue recopilado originalmente por Ken Lang, probablemente para su artículo "Newsweeder: Learning to filter netnews", aunque no menciona explícitamente esta colección. La colección de 20 grupos de noticias se ha convertido en un popular conjunto de datos para experimentos en aplicaciones de texto de técnicas de aprendizaje automático, como la clasificación y la agrupación de textos.

source: In the following we will use the built-in dataset loader for 20 newsgroups from scikit-learn. Alternatively, it is possible to download the dataset manually from the website and use the :func:`sklearn.datasets.load_files` function by pointing it to the ``20news-bydate-train`` sub-folder of the uncompressed archive folder.
es_es: A continuación utilizaremos el cargador de conjuntos de datos incorporado para 20 grupos de noticias de scikit-learn. Alternativamente, es posible descargar el conjunto de datos manualmente desde el sitio web y utilizar la función :func:`sklearn.datasets.load_files` apuntando a la subcarpeta ``20news-bydate-train`` de la carpeta de archivos sin comprimir.

source: In order to get faster execution times for this first example we will work on a partial dataset with only 4 categories out of the 20 available in the dataset::
es_es: Para conseguir tiempos de ejecución más rápidos para este primer ejemplo trabajaremos sobre un conjunto de datos parcial con sólo 4 categorías de las 20 disponibles en el conjunto de datos::

source: We can now load the list of files matching those categories as follows::
es_es: Ahora podemos cargar la lista de archivos de correspondencia con esas categorías de la siguiente manera::

source: The returned dataset is a ``scikit-learn`` "bunch": a simple holder object with fields that can be both accessed as python ``dict`` keys or ``object`` attributes for convenience, for instance the ``target_names`` holds the list of the requested category names::
es_es: El conjunto de datos devuelto es un "bunch" de ``scikit-learn``: un simple objeto titular con campos a los que se puede acceder como claves ``dict`` de python o como atributos ``object`` para mayor comodidad, por ejemplo el ``target_names`` contiene la lista de los nombres de las categorías solicitadas::

source: The files themselves are loaded in memory in the ``data`` attribute. For reference the filenames are also available::
es_es: Los propios archivos se cargan en la memoria en el atributo ``data``. Como referencia, los nombres de los archivos también están disponibles::

source: Let's print the first lines of the first loaded file::
es_es: Imprimamos las primeras líneas del primer archivo cargado::

source: Supervised learning algorithms will require a category label for each document in the training set. In this case the category is the name of the newsgroup which also happens to be the name of the folder holding the individual documents.
es_es: Los algoritmos de aprendizaje supervisado requieren una etiqueta de categoría para cada documento del conjunto de entrenamiento. En este caso, la categoría es el nombre del grupo de noticias, que también es el nombre de la carpeta que contiene los documentos individuales.

source: For speed and space efficiency reasons ``scikit-learn`` loads the target attribute as an array of integers that corresponds to the index of the category name in the ``target_names`` list. The category integer id of each sample is stored in the ``target`` attribute::
es_es: Por razones de velocidad y eficiencia de espacio ``scikit-learn`` carga el atributo target como un arreglo de enteros que corresponde al índice del nombre de la categoría en la lista ``target_names``. El identificador de categoría de cada muestra se almacena en el atributo ``target``::

source: It is possible to get back the category names as follows::
es_es: Es posible recuperar los nombres de las categorías de la siguiente manera::

source: You might have noticed that the samples were shuffled randomly when we called ``fetch_20newsgroups(..., shuffle=True, random_state=42)``: this is useful if you wish to select only a subset of samples to quickly train a model and get a first idea of the results before re-training on the complete dataset later.
es_es: Habrás notado que las muestras se barajan aleatoriamente cuando llamamos a ``fetch_20newsgroups(..., shuffle=True, random_state=42)``: esto es útil si quieres seleccionar sólo un subconjunto de muestras para entrenar rápidamente un modelo y tener una primera idea de los resultados antes de volver a entrenar en el conjunto de datos completo más tarde.

source: Extracting features from text files
es_es: Extracción de características de archivos de texto

source: In order to perform machine learning on text documents, we first need to turn the text content into numerical feature vectors.
es_es: Para llevar a cabo el aprendizaje automático de documentos de texto, primero tenemos que convertir el contenido del texto en vectores de características numéricas.

source: Bags of words
es_es: Empaquetado de palabras

source: The most intuitive way to do so is to use a bags of words representation:
es_es: La forma más intuitiva de hacerlo es utilizar una representación de empaquetado de palabras:

source: Assign a fixed integer id to each word occurring in any document of the training set (for instance by building a dictionary from words to integer indices).
es_es: Asigne un identificador entero fijo a cada palabra que aparezca en cualquier documento del conjunto de entrenamiento (por ejemplo, construyendo un diccionario de palabras con índices enteros).

source: For each document ``#i``, count the number of occurrences of each word ``w`` and store it in ``X[i, j]`` as the value of feature ``#j`` where ``j`` is the index of word ``w`` in the dictionary.
es_es: Para cada documento ``#i``, se cuenta el número de apariciones de cada palabra ``w`` y se almacena en ``X[i, j]`` como valor de la característica ``#j`` donde ``j`` es el índice de la palabra ``w`` en el diccionario.

source: The bags of words representation implies that ``n_features`` is the number of distinct words in the corpus: this number is typically larger than 100,000.
es_es: La representación de empaquetado de palabras implica que ``n_features`` es el número de palabras distintas en el corpus: este número suele ser superior a 100.000.

source: If ``n_samples == 10000``, storing ``X`` as a NumPy array of type float32 would require 10000 x 100000 x 4 bytes = **4GB in RAM** which is barely manageable on today's computers.
es_es: Si ``n_samples == 10000``, almacenar ``X`` como un arreglo de NumPy de tipo float32 requeriría 10000 x 100000 x 4 bytes = **4GB en RAM** que es apenas manejable en las computadoras actuales.

source: Fortunately, **most values in X will be zeros** since for a given document less than a few thousand distinct words will be used. For this reason we say that bags of words are typically **high-dimensional sparse datasets**. We can save a lot of memory by only storing the non-zero parts of the feature vectors in memory.
es_es: Afortunadamente, **la mayoría de los valores de X serán ceros**, ya que para un documento determinado se utilizarán menos de unos pocos miles de palabras distintas. Por eso decimos que los empaquetado de palabras son típicamente **conjuntos de datos dispersos de alta dimensión**. Podemos ahorrar mucha memoria almacenando sólo las partes distintas de cero de los vectores de características en la memoria.

source: ``scipy.sparse`` matrices are data structures that do exactly this, and ``scikit-learn`` has built-in support for these structures.
es_es: Las matrices ``scipy.sparse`` son estructuras de datos que hacen exactamente esto, y ``scikit-learn`` tiene soporte incorporado para estas estructuras.

source: Tokenizing text with ``scikit-learn``
es_es: Tokenización de texto con ``scikit-learn``

source: Text preprocessing, tokenizing and filtering of stopwords are all included in :class:`CountVectorizer`, which builds a dictionary of features and transforms documents to feature vectors::
es_es: El preprocesamiento de texto, la tokenización y el filtrado de palabras de parada están incluidos en :class:`CountVectorizer`, que construye un diccionario de características y transforma los documentos en vectores de características::

source: :class:`CountVectorizer` supports counts of N-grams of words or consecutive characters. Once fitted, the vectorizer has built a dictionary of feature indices::
es_es: :class:`CountVectorizer` soporta recuentos de N-gramas de palabras o caracteres consecutivos. Una vez ajustado, el vectorizador ha construido un diccionario de índices de características::

source: The index value of a word in the vocabulary is linked to its frequency in the whole training corpus.
es_es: El valor del índice de una palabra en el vocabulario está vinculado a su frecuencia en todo el corpus de entrenamiento.

source: From occurrences to frequencies
es_es: De ocurrencias a frecuencias

source: Occurrence count is a good start but there is an issue: longer documents will have higher average count values than shorter documents, even though they might talk about the same topics.
es_es: El recuento de ocurrencias es un buen comienzo, pero hay un problema: los documentos más largos tendrán valores de recuento medio más altos que los documentos más cortos, aunque hablen de los mismos temas.

source: To avoid these potential discrepancies it suffices to divide the number of occurrences of each word in a document by the total number of words in the document: these new features are called ``tf`` for Term Frequencies.
es_es: Para evitar estas posibles discrepancias, basta con dividir el número de apariciones de cada palabra en un documento entre el número total de palabras del mismo: estas nuevas características se denominan ``tf`` para las frecuencias de términos.

source: Another refinement on top of tf is to downscale weights for words that occur in many documents in the corpus and are therefore less informative than those that occur only in a smaller portion of the corpus.
es_es: Otro refinamiento sobre tf consiste en reducir las ponderaciones de las palabras que aparecen en muchos documentos del corpus y que, por tanto, son menos informativas que las que sólo aparecen en una parte más pequeña del corpus.

source: This downscaling is called `tf–idf`_ for "Term Frequency times Inverse Document Frequency".
es_es: Esta reducción de escala se denomina `tf-idf`_ por "Term Frequency times Inverse Document Frequency".

source: Both **tf** and **tf–idf** can be computed as follows using :class:`TfidfTransformer`::
es_es: Tanto **tf** como **tf-idf** pueden calcularse de la siguiente manera utilizando :class:`TfidfTransformer`::

source: In the above example-code, we firstly use the ``fit(..)`` method to fit our estimator to the data and secondly the ``transform(..)`` method to transform our count-matrix to a tf-idf representation. These two steps can be combined to achieve the same end result faster by skipping redundant processing. This is done through using the ``fit_transform(..)`` method as shown below, and as mentioned in the note in the previous section::
es_es: En el código de ejemplo anterior, primero utilizamos el método ``fit(..)`` para ajustar nuestro estimador a los datos y, en segundo lugar, el método ``transform(..)`` para transformar nuestra matriz de recuento a una representación tf-idf. Estos dos pasos pueden combinarse para lograr el mismo resultado final más rápidamente, omitiendo el procesamiento redundante. Esto se hace utilizando el método ``fit_transform(..)`` como se muestra a continuación, y como se menciona en la nota de la sección anterior::

source: Training a classifier
es_es: Entrenar un clasificador

source: Now that we have our features, we can train a classifier to try to predict the category of a post. Let's start with a :ref:`naïve Bayes <naive_bayes>` classifier, which provides a nice baseline for this task. ``scikit-learn`` includes several variants of this classifier; the one most suitable for word counts is the multinomial variant::
es_es: Ahora que tenemos nuestras características, podemos entrenar un clasificador para intentar predecir la categoría de un post. Empecemos con un clasificador :ref:`naive Bayes <naive_bayes>`, que proporciona una buena línea de base para esta tarea. ``scikit-learn`` incluye varias variantes de este clasificador; la más adecuada para el recuento de palabras es la variante multinomial::

source: To try to predict the outcome on a new document we need to extract the features using almost the same feature extracting chain as before. The difference is that we call ``transform`` instead of ``fit_transform`` on the transformers, since they have already been fit to the training set::
es_es: Para intentar predecir el resultado en un nuevo documento necesitamos extraer las características utilizando casi la misma cadena de extracción de características que antes. La diferencia es que llamamos a ``transform`` en lugar de ``fit_transform`` a los transformadores, ya que estos ya han sido ajustados al conjunto de entrenamiento::

source: Building a pipeline
es_es: Construir un pipeline

source: In order to make the vectorizer => transformer => classifier easier to work with, ``scikit-learn`` provides a :class:`~sklearn.pipeline.Pipeline` class that behaves like a compound classifier::
es_es: Para facilitar el trabajo del vectorizador => transformador => clasificador, ``scikit-learn`` proporciona una clase :class:`~sklearn.pipeline.Pipeline` que se comporta como un clasificador compuesto::

source: The names ``vect``, ``tfidf`` and ``clf`` (classifier) are arbitrary. We will use them to perform grid search for suitable hyperparameters below. We can now train the model with a single command::
es_es: Los nombres ``vect``, ``tfidf`` y ``clf`` (clasificador) son arbitrarios. Los utilizaremos para realizar la búsqueda exhaustiva de hiperparámetros adecuados más adelante. Ahora podemos entrenar el modelo con un solo comando::

source: Evaluation of the performance on the test set
es_es: Evaluación del rendimiento en el conjunto de pruebas

source: Evaluating the predictive accuracy of the model is equally easy::
es_es: Evaluar la precisión predictiva del modelo es igualmente fácil::

source: We achieved 83.5% accuracy. Let's see if we can do better with a linear :ref:`support vector machine (SVM) <svm>`, which is widely regarded as one of the best text classification algorithms (although it's also a bit slower than naïve Bayes). We can change the learner by simply plugging a different classifier object into our pipeline::
es_es: Hemos conseguido un 83,5% de precisión. Vamos a ver si podemos hacerlo mejor con una :ref:`máquina de vectores de soporte (SVM) <svm>`, que es ampliamente considerado como uno de los mejores algoritmos de clasificación de texto (aunque también es un poco más lento que el Bayes ingenuo). Podemos cambiar el algoritmos de aprendizaje simplemente introduciendo un objeto clasificador diferente en nuestro pipeline::
