Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/applications/plot_outlier_detection_wine.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_applications_plot_outlier_detection_wine.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_applications_plot_outlier_detection_wine.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en su navegador a través de Binder

source: Outlier detection on a real data set
es_es: Detección de valores atípicos en un conjunto de datos reales

source: This example illustrates the need for robust covariance estimation on a real data set. It is useful both for outlier detection and for a better understanding of the data structure.
es_es: Este ejemplo ilustra la necesidad de una estimación robusta de la covarianza en un conjunto de datos reales. Es útil tanto para la detección de valores atípicos como para una mejor comprensión de la estructura de los datos.

source: We selected two sets of two variables from the Boston housing data set as an illustration of what kind of analysis can be done with several outlier detection tools. For the purpose of visualization, we are working with two-dimensional examples, but one should be aware that things are not so trivial in high-dimension, as it will be pointed out.
es_es: Seleccionamos dos conjuntos de dos variables del conjunto de datos de viviendas de Boston como ilustración del tipo de análisis que puede realizarse con varias herramientas de detección de valores atípicos. A efectos de visualización, trabajamos con ejemplos bidimensionales, pero hay que tener en cuenta que las cosas no son tan triviales en alta dimensión, como se señalará.

source: In both examples below, the main result is that the empirical covariance estimate, as a non-robust one, is highly influenced by the heterogeneous structure of the observations. Although the robust covariance estimate is able to focus on the main mode of the data distribution, it sticks to the assumption that the data should be Gaussian distributed, yielding some biased estimation of the data structure, but yet accurate to some extent. The One-Class SVM does not assume any parametric form of the data distribution and can therefore model the complex shape of the data much better.
es_es: En ambos ejemplos, el resultado principal es que la estimación empírica de la covarianza, como no robusta, está muy influenciada por la estructura heterogénea de las observaciones. Aunque la estimación robusta de la covarianza es capaz de centrarse en la modalidad principal de la distribución de los datos, se ciñe a la suposición de que los datos deben tener una distribución gaussiana, lo que da lugar a una estimación algo sesgada de la estructura de los datos, aunque precisa hasta cierto punto. La SVM de una clase no asume ninguna forma paramétrica de la distribución de los datos y, por lo tanto, puede modelar la forma compleja de los datos mucho mejor.

source: First example
es_es: Primer ejemplo

source: The first example illustrates how the Minimum Covariance Determinant robust estimator can help concentrate on a relevant cluster when outlying points exist. Here the empirical covariance estimation is skewed by points outside of the main cluster. Of course, some screening tools would have pointed out the presence of two clusters (Support Vector Machines, Gaussian Mixture Models, univariate outlier detection, ...). But had it been a high-dimensional example, none of these could be applied that easily.
es_es: El primer ejemplo ilustra cómo el estimador robusto del Determinante de Covarianza Mínimo puede ayudar a concentrarse en un conglomerado relevante cuando existen puntos periféricos. En este caso, la estimación de la covarianza empírica está sesgada por puntos fuera del clúster principal. Por supuesto, algunas herramientas de cribado habrían señalado la presencia de dos conglomerados (Máquinas de vectores de Soporte, modelos de mezclas gaussianas, detección de valores atípicos univariantes, ...). Pero si se tratara de un ejemplo de alta dimensión, ninguna de ellas podría aplicarse tan fácilmente.

source: Second example
es_es: Segundo ejemplo

source: The second example shows the ability of the Minimum Covariance Determinant robust estimator of covariance to concentrate on the main mode of the data distribution: the location seems to be well estimated, although the covariance is hard to estimate due to the banana-shaped distribution. Anyway, we can get rid of some outlying observations. The One-Class SVM is able to capture the real data structure, but the difficulty is to adjust its kernel bandwidth parameter so as to obtain a good compromise between the shape of the data scatter matrix and the risk of over-fitting the data.
es_es: El segundo ejemplo muestra la capacidad del estimador robusto del Determinante Mínimo de la Covarianza para concentrarse en el modo principal de la distribución de los datos: la localización parece estar bien estimada, aunque la covarianza es difícil de estimar debido a la distribución en forma de plátano. De todos modos, podemos deshacernos de algunas observaciones periféricas. La SVM de una clase es capaz de capturar la estructura real de los datos, pero la dificultad estriba en ajustar su parámetro de ancho de banda del núcleo para obtener un buen compromiso entre la forma de la matriz de dispersión de los datos y el riesgo de sobreajuste de los datos.

source: **Total running time of the script:** ( 0 minutes 1.780 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.780 segundos)

source: :download:`Download Python source code: plot_outlier_detection_wine.py <plot_outlier_detection_wine.py>`
es_es: :download:`Descargar el código fuente de Python: plot_outlier_delettion_wine.py <plot_outlier_detection_wine.py>`

source: :download:`Download Jupyter notebook: plot_outlier_detection_wine.ipynb <plot_outlier_detection_wine.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_outlier_delettion_wine.ipynb <plot_outlier_detection_wine.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
