Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/applications/plot_species_distribution_modeling.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_applications_plot_species_distribution_modeling.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_applications_plot_species_distribution_modeling.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Species distribution modeling
es_es: Modelización de la distribución de las especies

source: Modeling species' geographic distributions is an important problem in conservation biology. In this example we model the geographic distribution of two south american mammals given past observations and 14 environmental variables. Since we have only positive examples (there are no unsuccessful observations), we cast this problem as a density estimation problem and use the :class:`~sklearn.svm.OneClassSVM` as our modeling tool. The dataset is provided by Phillips et. al. (2006). If available, the example uses `basemap <https://matplotlib.org/basemap/>`_ to plot the coast lines and national boundaries of South America.
es_es: La modelización de las distribuciones geográficas de las especies es un problema importante en la biología de la conservación. En este ejemplo modelamos la distribución geográfica de dos mamíferos sudamericanos a partir de observaciones pasadas y 14 variables ambientales. Como sólo tenemos ejemplos positivos (no hay observaciones fallidas), planteamos este problema como un problema de estimación de la densidad y utilizamos el :class:`~sklearn.svm.OneClassSVM` como nuestra herramienta de modelización. El conjunto de datos lo proporcionan Phillips et. al. (2006). Si está disponible, el ejemplo utiliza `basemap <https://matplotlib.org/basemap/>`_ para trazar las líneas de costa y las fronteras nacionales de Sudamérica.

source: The two species are:
es_es: Las dos especies son:

source: `"Bradypus variegatus" <http://www.iucnredlist.org/details/3038/0>`_ , the Brown-throated Sloth.
es_es: `"Bradypus variegatus" <http://www.iucnredlist.org/details/3038/0>`_ , el perezoso de garganta marrón.

source: `"Microryzomys minutus" <http://www.iucnredlist.org/details/13408/0>`_ , also known as the Forest Small Rice Rat, a rodent that lives in Peru, Colombia, Ecuador, Peru, and Venezuela.
es_es: `"Microryzomys minutus" <http://www.iucnredlist.org/details/13408/0>`_ , también conocida como Rata Arrocera del Bosque, un roedor que vive en Perú, Colombia, Ecuador, Perú y Venezuela.

source: References
es_es: Referencias

source: **Total running time of the script:** ( 1 minutes 4.749 seconds)
es_es: **Tiempo total de ejecución del script:** (1 minutos 4.749 segundos)

source: :download:`Download Python source code: plot_species_distribution_modeling.py <plot_species_distribution_modeling.py>`
es_es: :download:`Descargar el código fuente de Python: plot_species_distribution_modeling.py <plot_species_distribution_modeling.py>`

source: :download:`Download Jupyter notebook: plot_species_distribution_modeling.ipynb <plot_species_distribution_modeling.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_species_distribution_modeling.py <plot_species_distribution_modeling.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
