Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/applications/plot_model_complexity_influence.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_applications_plot_model_complexity_influence.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_applications_plot_model_complexity_influence.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en su navegador a través de Binder

source: Model Complexity Influence
es_es: Influencia de la complejidad del modelo

source: Demonstrate how model complexity influences both prediction accuracy and computational performance.
es_es: Demostrar cómo la complejidad del modelo influye tanto en la exactitud de la predicción como en el rendimiento computacional.

source: We will be using two datasets:
es_es: Utilizaremos dos conjuntos de datos:

source: :ref:`diabetes_dataset` for regression. This dataset consists of 10 measurements taken from diabetes patients. The task is to predict disease progression;
es_es: :ref:`diabetes_dataset` para la regresión. Este conjunto de datos consta de 10 mediciones realizadas a pacientes con diabetes. La tarea consiste en predecir la progresión de la enfermedad;

source: :ref:`20newsgroups_dataset` for classification. This dataset consists of newsgroup posts. The task is to predict on which topic (out of 20 topics) the post is written about.
es_es: :ref:`20newsgroups_dataset` para la clasificación. Este conjunto de datos se compone de mensajes de grupos de noticias. La tarea consiste en predecir sobre qué tema (de entre 20 temas) está escrito el mensaje.

source: We will model the complexity influence on three different estimators:
es_es: Vamos a modelar la influencia de la complejidad en tres estimadores diferentes:

source: :class:`~sklearn.linear_model.SGDClassifier` (for classification data) which implements stochastic gradient descent learning;
es_es: :class:`~sklearn.linear_model.SGDClassifier` (para datos de clasificación) que implementa el aprendizaje por descenso de gradiente estocástico;

source: :class:`~sklearn.svm.NuSVR` (for regression data) which implements Nu support vector regression;
es_es: :class:`~sklearn.svm.NuSVR` (para datos de regresión) que implementa la regresión de vectores de soporte Nu;

source: :class:`~sklearn.ensemble.GradientBoostingRegressor` (for regression data) which builds an additive model in a forward stage-wise fashion.
es_es: :class:`~sklearn.ensemble.GradientBoostingRegressor` (para datos de regresión) que construye un modelo aditivo de forma progresiva por etapas.

source: We make the model complexity vary through the choice of relevant model parameters in each of our selected models. Next, we will measure the influence on both computational performance (latency) and predictive power (MSE or Hamming Loss).
es_es: Hacemos variar la complejidad del modelo mediante la elección de los parámetros relevantes del modelo en cada uno de nuestros modelos seleccionados. A continuación, mediremos la influencia tanto en el rendimiento computacional (latencia) como en la capacidad de predicción (MSE o pérdida de Hamming).

source: Load the data
es_es: Cargar los datos

source: First we load both datasets.
es_es: Primero cargamos ambos conjuntos de datos.

source: We are using :func:`~sklearn.datasets.fetch_20newsgroups_vectorized` to download 20 newsgroups dataset. It returns ready-to-use features.
es_es: Utilizamos :func:`~sklearn.datasets.fetch_20newsgroups_vectorized` para descargar el conjunto de datos de 20 grupos de noticias. Devuelve características listas para usar.

source: ``X`` of the 20 newsgroups dataset is a sparse matrix while ``X`` of diabetes dataset is a numpy array.
es_es: La "X" del conjunto de datos de los 20 grupos de noticias es una matriz dispersa, mientras que la "X" del conjunto de datos de la diabetes es una matriz numpy.

source: Benchmark influence
es_es: Influencia de la referencia

source: Next, we can calculate the influence of the parameters on the given estimator. In each round, we will set the estimator with the new value of ``changing_param`` and we will be collecting the prediction times, prediction performance and complexities to see how those changes affect the estimator. We will calculate the complexity using ``complexity_computer`` passed as a parameter.
es_es: A continuación, podemos calcular la influencia de los parámetros en el estimador dado. En cada ronda, pondremos el estimador con el nuevo valor de ``changing_param`` e iremos recogiendo los tiempos de predicción, el rendimiento de la predicción y las complejidades para ver cómo afectan esos cambios al estimador. Calcularemos la complejidad utilizando ``complexity_computer`` pasado como parámetro.

source: Choose parameters
es_es: Seleccionar parámetros

source: We choose the parameters for each of our estimators by making a dictionary with all the necessary values. ``changing_param`` is the name of the parameter which will vary in each estimator. Complexity will be defined by the ``complexity_label`` and calculated using `complexity_computer`. Also note that depending on the estimator type we are passing different data.
es_es: Elegimos los parámetros para cada uno de nuestros estimadores haciendo un diccionario con todos los valores necesarios. ``param_cambiante`` es el nombre del parámetro que variará en cada estimador. La complejidad se definirá con la etiqueta ``complexity_label`` y se calculará con `complexity_computer`. También hay que tener en cuenta que dependiendo del tipo de estimador estamos pasando datos diferentes.

source: Run the code and plot the results
es_es: Ejecutar el código y graficar los resultados

source: We defined all the functions required to run our benchmark. Now, we will loop over the different configurations that we defined previously. Subsequently, we can analyze the plots obtained from the benchmark: Relaxing the `L1` penalty in the SGD classifier reduces the prediction error but leads to an increase in the training time. We can draw a similar analysis regarding the training time which increases with the number of support vectors with a Nu-SVR. However, we observed that there is an optimal number of support vectors which reduces the prediction error. Indeed, too few support vectors lead to an under-fitted model while too many support vectors lead to an over-fitted model. The exact same conclusion can be drawn for the gradient-boosting model. The only the difference with the Nu-SVR is that having too many trees in the ensemble is not as detrimental.
es_es: Hemos definido todas las funciones necesarias para ejecutar nuestro benchmark. Ahora, haremos un bucle sobre las diferentes configuraciones que hemos definido anteriormente. A continuación, podemos analizar los gráficos obtenidos en la prueba comparativa: La relajación de la penalización `L1` en el clasificador SGD reduce el error de predicción pero conduce a un aumento del tiempo de entrenamiento. Podemos extraer un análisis similar en relación con el tiempo de entrenamiento, que aumenta con el número de vectores de soporte con un Nu-SVR. Sin embargo, observamos que existe un número óptimo de vectores de soporte que reduce el error de predicción. De hecho, muy pocos vectores de soporte conducen a un modelo infraajustado, mientras que demasiados vectores de soporte conducen a un modelo sobreajustado. Se puede llegar a la misma conclusión para el modelo de gradiente-boosting. La única diferencia con el Nu-SVR es que tener demasiados árboles en el conjunto no es tan perjudicial.

source: Conclusion
es_es: Conclusión

source: As a conclusion, we can deduce the following insights:
es_es: Como conclusión, podemos deducir las siguientes ideas:

source: a model which is more complex (or expressive) will require a larger training time;
es_es: un modelo más complejo (o expresivo) requerirá un mayor tiempo de entrenamiento;

source: a more complex model does not guarantee to reduce the prediction error.
es_es: un modelo más complejo no garantiza la reducción del error de predicción.

source: These aspects are related to model generalization and avoiding model under-fitting or over-fitting.
es_es: Estos aspectos están relacionados con la generalización del modelo y con evitar el infra o sobreajuste del mismo.

source: **Total running time of the script:** ( 0 minutes 41.995 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 41.995 segundos)

source: :download:`Download Python source code: plot_model_complexity_influence.py <plot_model_complexity_influence.py>`
es_es: :download:`Descargar código fuente de Python: plot_model_complexity_influence.py <plot_model_complexity_influence.py>`

source: :download:`Download Jupyter notebook: plot_model_complexity_influence.ipynb <plot_model_complexity_influence.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_model_complexity_influence.ipynb <plot_model_complexity_influence.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
