Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/applications/plot_stock_market.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_applications_plot_stock_market.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_applications_plot_stock_market.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Visualizing the stock market structure
es_es: Visualización de la estructura bursátil

source: This example employs several unsupervised learning techniques to extract the stock market structure from variations in historical quotes.
es_es: Este ejemplo emplea varias técnicas de aprendizaje no supervisado para extraer la estructura del mercado de valores a partir de las variaciones en las cotizaciones históricas.

source: The quantity that we use is the daily variation in quote price: quotes that are linked tend to cofluctuate during a day.
es_es: La cantidad que utilizamos es la variación diaria del precio de las cotizaciones: las cotizaciones que están vinculadas tienden a cofluir durante un día.

source: Learning a graph structure
es_es: Aprendizaje de la estructura del grafo

source: We use sparse inverse covariance estimation to find which quotes are correlated conditionally on the others. Specifically, sparse inverse covariance gives us a graph, that is a list of connection. For each symbol, the symbols that it is connected too are those useful to explain its fluctuations.
es_es: Utilizamos la estimación de la covarianza inversa dispersa para encontrar qué cotizaciones están correlacionadas condicionalmente con las demás. En concreto, la covarianza inversa dispersa nos da un gráfico, que es una lista de conexión. Para cada símbolo, los símbolos con los que está conectado son los que sirven para explicar sus fluctuaciones.

source: Clustering
es_es: Análisis de conglomerados

source: We use clustering to group together quotes that behave similarly. Here, amongst the :ref:`various clustering techniques <clustering>` available in the scikit-learn, we use :ref:`affinity_propagation` as it does not enforce equal-size clusters, and it can choose automatically the number of clusters from the data.
es_es: Utilizamos el clustering para agrupar las cotizaciones que se comportan de forma similar. Aquí, entre las :ref:`varias técnicas de clustering <clustering>` disponibles en scikit-learn, utilizamos :ref:`affinity_propagation` ya que no impone clusters de igual tamaño, y puede elegir automáticamente el número de clusters a partir de los datos.

source: Note that this gives us a different indication than the graph, as the graph reflects conditional relations between variables, while the clustering reflects marginal properties: variables clustered together can be considered as having a similar impact at the level of the full stock market.
es_es: Observa que esto nos da una indicación diferente a la del gráfico, ya que el gráfico refleja las relaciones condicionales entre las variables, mientras que la agrupación refleja las propiedades marginales: se puede considerar que las variables agrupadas tienen un impacto similar a nivel de toda la bolsa.

source: Embedding in 2D space
es_es: Incrustación en el espacio 2D

source: For visualization purposes, we need to lay out the different symbols on a 2D canvas. For this we use :ref:`manifold` techniques to retrieve 2D embedding.
es_es: Para la visualización, necesitamos disponer los diferentes símbolos en un lienzo 2D. Para ello, utilizamos técnicas de :ref:`manifold` para recuperar la incrustación en 2D.

source: Visualization
es_es: Visualización

source: The output of the 3 models are combined in a 2D graph where nodes represents the stocks and edges the:
es_es: Los resultados de los 3 modelos se combinan en un gráfico 2D en el que los nodos representan las poblaciones y las aristas las:

source: cluster labels are used to define the color of the nodes
es_es: las etiquetas de los clusters se utilizan para definir el color de los nodos

source: the sparse covariance model is used to display the strength of the edges
es_es: el modelo de covarianza dispersa se utiliza para mostrar la fuerza de los bordes

source: the 2D embedding is used to position the nodes in the plan
es_es: la incrustación 2D se utiliza para posicionar los nodos en el plano

source: This example has a fair amount of visualization-related code, as visualization is crucial here to display the graph. One of the challenge is to position the labels minimizing overlap. For this we use an heuristic based on the direction of the nearest neighbor along each axis.
es_es: Este ejemplo tiene una buena cantidad de código relacionado con la visualización, ya que la visualización es crucial aquí para mostrar el gráfico. Uno de los retos es posicionar las etiquetas minimizando el solapamiento. Para ello utilizamos una heurística basada en la dirección del vecino más cercano a lo largo de cada eje.

source: **Total running time of the script:** ( 0 minutes 48.962 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 48.962 segundos)

source: :download:`Download Python source code: plot_stock_market.py <plot_stock_market.py>`
es_es: :download:`Descarga el código fuente de Python: plot_stock_market.py <plot_stock_market.py>`

source: :download:`Download Jupyter notebook: plot_stock_market.ipynb <plot_stock_market.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_stock_market.ipynb <plot_stock_market.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
