Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/applications/wikipedia_principal_eigenvector.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_applications_wikipedia_principal_eigenvector.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_applications_wikipedia_principal_eigenvector.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en su navegador a través de Binder

source: Wikipedia principal eigenvector
es_es: Autovector principal de Wikipedia

source: A classical way to assert the relative importance of vertices in a graph is to compute the principal eigenvector of the adjacency matrix so as to assign to each vertex the values of the components of the first eigenvector as a centrality score:
es_es: Una forma clásica de afirmar la importancia relativa de los vértices de un grafo es calcular el vector propio principal de la matriz de adyacencia para asignar a cada vértice los valores de los componentes del primer autovector como puntuación de centralidad:

source: On the graph of webpages and links those values are called the PageRank scores by Google.
es_es: En el gráfico de páginas web y enlaces, estos valores se denominan puntuaciones PageRank por Google.

source: The goal of this example is to analyze the graph of links inside wikipedia articles to rank articles by relative importance according to this eigenvector centrality.
es_es: El objetivo de este ejemplo es analizar el gráfico de enlaces dentro de los artículos de la wikipedia para clasificar los artículos por su importancia relativa según este eigenvector de centralidad.

source: The traditional way to compute the principal eigenvector is to use the power iteration method:
es_es: La forma tradicional de calcular el vector propio principal es utilizar el método de iteración de potencia:

source: Here the computation is achieved thanks to Martinsson's Randomized SVD algorithm implemented in scikit-learn.
es_es: Aquí el cálculo se consigue gracias al algoritmo SVD aleatorio de Martinsson implementado en scikit-learn.

source: The graph data is fetched from the DBpedia dumps. DBpedia is an extraction of the latent structured data of the Wikipedia content.
es_es: Los datos del gráfico se obtienen de los volcados de la DBpedia. DBpedia es una extracción de los datos estructurados latentes del contenido de Wikipedia.

source: **Total running time of the script:** ( 0 minutes 0.000 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.000 segundos)

source: :download:`Download Python source code: wikipedia_principal_eigenvector.py <wikipedia_principal_eigenvector.py>`
es_es: :download:`Descargar código fuente de Python: wikipedia_principal_eigenvector.py <wikipedia_principal_eigenvector.py>`

source: :download:`Download Jupyter notebook: wikipedia_principal_eigenvector.ipynb <wikipedia_principal_eigenvector.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: wikipedia_principal_eigenvector.ipynb <wikipedia_principal_eigenvector.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
