Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.16.po
Languages: es_es

source: Version 0.16.1
es_es: Versión 0.16.1

source: **April 14, 2015**
es_es: **14 de abril de 2015**

source: Changelog
es_es: Registro de cambios

source: Bug fixes
es_es: Corrección de errores

source: Allow input data larger than ``block_size`` in :class:`covariance.LedoitWolf` by `Andreas Müller`_.
es_es: Permitir datos de entrada más grandes que ``block_size`` en :class:`covariance.LedoitWolf` por `Andreas Mucker`_.

source: Fix a bug in :class:`isotonic.IsotonicRegression` deduplication that caused unstable result in :class:`calibration.CalibratedClassifierCV` by `Jan Hendrik Metzen`_.
es_es: Corregir un error en la deduplicación :class:`isotonic.IsotonicRegression` que causó un resultado inestable en :class:`calibration.CalibratedClassifierCV` por `Jan Hendrik Metzen`_.

source: Fix sorting of labels in func:`preprocessing.label_binarize` by Michael Heilman.
es_es: Arreglar la clasificación de etiquetas en la función: `preprocessing.label_binarize` por Michael Heilman.

source: Fix several stability and convergence issues in :class:`cross_decomposition.CCA` and :class:`cross_decomposition.PLSCanonical` by `Andreas Müller`_
es_es: Corregir varios problemas de estabilidad y convergencia en :class:`cross_decomposition.CCA` y :class:`cross_decomposition.PLSCanonical` por `Andreas Müller`_

source: Fix a bug in :class:`cluster.KMeans` when ``precompute_distances=False`` on fortran-ordered data.
es_es: Corregir un error en :class:`cluster.KTechns` cuando ``precompute_distances=False`` en datos ordenados por fortran.

source: Fix a speed regression in :class:`ensemble.RandomForestClassifier`'s ``predict`` and ``predict_proba`` by `Andreas Müller`_.
es_es: Corregir una regresión de velocidad en :class:`ensemble.``predict`` y ``predict_proba`` de RandomForestClassifier`` por `Andreas Mucker`_.

source: Fix a regression where ``utils.shuffle`` converted lists and dataframes to arrays, by `Olivier Grisel`_
es_es: Arreglar una regresión donde ``utils.shuffle`` convirtió listas y marcos de datos en arreglos, por `Olivier Grisel`_

source: Version 0.16
es_es: Versión 0.16

source: **March 26, 2015**
es_es: **26 de Marzo de 2015**

source: Highlights
es_es: Destacados

source: Scalable approximate nearest neighbors search with Locality-sensitive hashing forests in :class:`neighbors.LSHForest`.
es_es: Búsqueda de vecinos más cercanos aproximada escalable con bosques de hashing sensibles a la localidad en :class:`neighbors.LSHForest`.

source: Improved error messages and better validation when using malformed input data.
es_es: Mejorados los mensajes de error y la validación al usar datos de entrada mal formados.

source: More robust integration with pandas dataframes.
es_es: Integración más robusta con los marcos de datos de pandas.

source: New features
es_es: Nuevas características

source: The new :class:`neighbors.LSHForest` implements locality-sensitive hashing for approximate nearest neighbors search. By :user:`Maheshakya Wijewardena<maheshakya>`.
es_es: El nuevo :class:`neighbors.LSHForest` implementa el hashing sensible a la localización para la búsqueda aproximada de vecinos más cercanos. De :user:`Maheshakya Wijewardena<maheshakya>`.

source: Added :class:`svm.LinearSVR`. This class uses the liblinear implementation of Support Vector Regression which is much faster for large sample sizes than :class:`svm.SVR` with linear kernel. By `Fabian Pedregosa`_ and Qiang Luo.
es_es: Añadido :class:`svm.LinearSVR`. Esta clase utiliza la implementación liblineal de Regresión con Vectores de Soporte que es mucho más rápida para grandes tamaños de muestra que :class:`svm. VR` con núcleo lineal. Por `Fabian Pedregosa`_ y Qiang Luo.

source: Incremental fit for :class:`GaussianNB <naive_bayes.GaussianNB>`.
es_es: Ajuste incremental para :class:`GaussianNB <naive_bayes.GaussianNB>`.

source: Added ``sample_weight`` support to :class:`dummy.DummyClassifier` and :class:`dummy.DummyRegressor`. By `Arnaud Joly`_.
es_es: Añadido soporte ``sample_weight`` a :class:`dummy.DummyClassifier` y :class:`dummy.DummyRegressor`. Por `Arnaud Joly`_.

source: Added the :func:`metrics.label_ranking_average_precision_score` metrics. By `Arnaud Joly`_.
es_es: Se añadieron las métricas :func:`metrics.label_ranking_average_precision_score`. Por `Arnaud Joly`_.

source: Add the :func:`metrics.coverage_error` metrics. By `Arnaud Joly`_.
es_es: Añade las métricas :func:`metrics.coverage_error`. Por `Arnaud Joly`_.

source: Added :class:`linear_model.LogisticRegressionCV`. By `Manoj Kumar`_, `Fabian Pedregosa`_, `Gael Varoquaux`_ and `Alexandre Gramfort`_.
es_es: Añadido :class:`linear_model.LogisticRegressionCV`. Por `Manoj Kumar`_, `Fabian Pedregosa`_, `Gael Varoquaux`_ y `Alexandre Gramfort`_.

source: Added ``warm_start`` constructor parameter to make it possible for any trained forest model to grow additional trees incrementally. By :user:`Laurent Direr<ldirer>`.
es_es: Se añadió el parámetro del constructor ``warm_start`` para hacer posible que cualquier modelo forestal entrenado crezca árboles adicionales incrementalmente. Por :user:`Laurent Direr<ldirer>`.

source: Added ``sample_weight`` support to :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor`. By `Peter Prettenhofer`_.
es_es: Añadido soporte para ``sample_weight`` a :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor`. Por `Peter Prettenhofer`_.

source: Added :class:`decomposition.IncrementalPCA`, an implementation of the PCA algorithm that supports out-of-core learning with a ``partial_fit`` method. By `Kyle Kastner`_.
es_es: Se añadió :class:`descomposition.IncrementalPCA`, una implementación del algoritmo PCA que soporta el aprendizaje fuera del núcleo con un método ``partial_fit``. Por `Kyle Kastner`_.

source: Averaged SGD for :class:`SGDClassifier <linear_model.SGDClassifier>` and :class:`SGDRegressor <linear_model.SGDRegressor>` By :user:`Danny Sullivan <dsullivan7>`.
es_es: SGD promedio para :class:`SGDClassifier <linear_model.SGDClassifier>` y :class:`SGDRegressor <linear_model.SGDRegressor>` Por :user:`Danny Sullivan <dsullivan7>`.

source: Added :func:`cross_val_predict <cross_validation.cross_val_predict>` function which computes cross-validated estimates. By `Luis Pedro Coelho`_
es_es: Se añadió la función :func:`cross_val_predict <cross_validation.cross_val_predict>` que calcula estimaciones por validación cruzada. Por `Luis Pedro Coelho`_

source: Added :class:`linear_model.TheilSenRegressor`, a robust generalized-median-based estimator. By :user:`Florian Wilhelm <FlorianWilhelm>`.
es_es: Añadido :class:`linear_model.TheilSenRegressor`, un estimador robusto basado en medianas generalizadas. Por :user:`Florian Wilhelm <FlorianWilhelm>`.

source: Added :func:`metrics.median_absolute_error`, a robust metric. By `Gael Varoquaux`_ and :user:`Florian Wilhelm <FlorianWilhelm>`.
es_es: Añadido :func:`metrics.median_absolute_error`, una métrica robusta. Por `Gael Varoquaux`_ y :user:`Florian Wilhelm <FlorianWilhelm>`.

source: Add :class:`cluster.Birch`, an online clustering algorithm. By `Manoj Kumar`_, `Alexandre Gramfort`_ and `Joel Nothman`_.
es_es: Añade :class:`cluster.Birch`, un algoritmo de clustering en línea. Por `Manoj Kumar`_, `Alexandre Gramfort`_ y `Joel Nothman`_.

source: Added shrinkage support to :class:`discriminant_analysis.LinearDiscriminantAnalysis` using two new solvers. By :user:`Clemens Brunner <cle1109>` and `Martin Billinger`_.
es_es: Añadido soporte para encogimiento a :class:`discriminant_analysis.LinearDiscriminantAnalysis` usando dos nuevos solucionadores. Por :user:`Clemens Brunner <cle1109>` y `Martin Billinger`_.

source: Added :class:`kernel_ridge.KernelRidge`, an implementation of kernelized ridge regression. By `Mathieu Blondel`_ and `Jan Hendrik Metzen`_.
es_es: Añadido :class:`kernel_ridge.KernelRidge`, una implementación de regresión de cresta kernelizada. Por `Mathieu Blondel`_ y `Jan Hendrik Metzen`_.

source: All solvers in :class:`linear_model.Ridge` now support `sample_weight`. By `Mathieu Blondel`_.
es_es: Todos los solucionadores en :class:`linear_model.Ridge` ahora soportan `sample_weight`. Por `Mathieu Blondel`_.

source: Added :class:`cross_validation.PredefinedSplit` cross-validation for fixed user-provided cross-validation folds. By :user:`Thomas Unterthiner <untom>`.
es_es: Se añadió la validación cruzada :class:`cross_validation.PredefinedSplit` para pliegues fijos de validación cruzada proporcionados por el usuario. Por :user:`Thomas Unterthiner <untom>`.

source: Added :class:`calibration.CalibratedClassifierCV`, an approach for calibrating the predicted probabilities of a classifier. By `Alexandre Gramfort`_, `Jan Hendrik Metzen`_, `Mathieu Blondel`_ and :user:`Balazs Kegl <kegl>`.
es_es: Añadido :class:`calibration.CalibratedClassifierCV`, un enfoque para calibrar las probabilidades predecidas de un clasificador. Por `Alexandre Gramfort`_, `Jan Hendrik Metzen`_, `Mathieu Blondel`_ y :user:`Balazs Kegl <kegl>`.

source: Enhancements
es_es: Mejoras (Enhancements)

source: Add option ``return_distance`` in :func:`hierarchical.ward_tree` to return distances between nodes for both structured and unstructured versions of the algorithm. By `Matteo Visconti di Oleggio Castello`_. The same option was added in :func:`hierarchical.linkage_tree`. By `Manoj Kumar`_
es_es: Añade la opción ``return_distance`` en :func:`jerarchical.ward_tree` para devolver distancias entre nodos para versiones estructuradas y no estructuradas del algoritmo. Por `Matteo Visconti di Oleggio Castello`_. La misma opción fue añadida en :func:`hierarchical.linkage_tree`. Por `Manoj Kumar`_

source: Add support for sample weights in scorer objects. Metrics with sample weight support will automatically benefit from it. By `Noel Dawe`_ and `Vlad Niculae`_.
es_es: Añade soporte para pesos de muestra en objetos de puntuación. Las métricas con soporte de peso de muestra se beneficiarán automáticamente. Por `Noel Dawe`_ y `Vlad Niculae`_.

source: Added ``newton-cg`` and `lbfgs` solver support in :class:`linear_model.LogisticRegression`. By `Manoj Kumar`_.
es_es: Se añadió el soporte del solucionador ``newton-cg`` y `lbfgs` en :class:`linear_model.LogisticRegression`. Por `Manoj Kumar`_.

source: Add ``selection="random"`` parameter to implement stochastic coordinate descent for :class:`linear_model.Lasso`, :class:`linear_model.ElasticNet` and related. By `Manoj Kumar`_.
es_es: Añade el parámetro ``selection="random"`` para implementar el descenso de coordenadas estocástico para :class:`linear_model.Lasso`, :class:`linear_model.ElasticNet` y relacionados. Por `Manoj Kumar`_.

source: Add ``sample_weight`` parameter to :func:`metrics.jaccard_similarity_score` and :func:`metrics.log_loss`. By :user:`Jatin Shah <jatinshah>`.
es_es: Agrega el parámetro ``sample_weight`` a :func:`metrics.jaccard_similarity_score` y :func:`metrics.log_loss`. Por :user:`Jatin Shah <jatinshah>`.

source: Support sparse multilabel indicator representation in :class:`preprocessing.LabelBinarizer` and :class:`multiclass.OneVsRestClassifier` (by :user:`Hamzeh Alsalhi <hamsal>` with thanks to Rohit Sivaprasad), as well as evaluation metrics (by `Joel Nothman`_).
es_es: Soporta la representación del indicador multietiqueta disperso en :class:`preprocessing.LabelBinarizer` y :class:`multiclase. neVsRestClassifier` (por :user:`Hamzeh Alsalhi <hamsal>` con gracias a Rohit Sivaprasad), así como métricas de evaluación (por `Joel Nothman`_).

source: Add ``sample_weight`` parameter to `metrics.jaccard_similarity_score`. By `Jatin Shah`.
es_es: Agrega el parámetro ``sample_weight`` a `metrics.jaccard_similarity_score`. Por `Jatin Shah`.

source: Add support for multiclass in `metrics.hinge_loss`. Added ``labels=None`` as optional parameter. By `Saurabh Jha`.
es_es: Añade soporte para multiclase en `metrics.hinge_loss`. Añadido ``labels=None `` como parámetro opcional. Por `Saurabh Jha`.

source: Add ``sample_weight`` parameter to `metrics.hinge_loss`. By `Saurabh Jha`.
es_es: Añade el parámetro ``sample_weight`` a `metrics.hinge_loss`. Por `Saurabh Jha`.

source: Add ``multi_class="multinomial"`` option in :class:`linear_model.LogisticRegression` to implement a Logistic Regression solver that minimizes the cross-entropy or multinomial loss instead of the default One-vs-Rest setting. Supports `lbfgs` and `newton-cg` solvers. By `Lars Buitinck`_ and `Manoj Kumar`_. Solver option `newton-cg` by Simon Wu.
es_es: Añade la opción ``multi_class="multinomial"`` en :class:`linear_model. ogisticRegression` para implementar un solucionador de Regresión Logística que minimice la pérdida cross-entropy o multinomial en lugar de la configuración predeterminada de One-vs-Rest. Soporta los solucionadores `lbfgs` y `newton-cg`. Por `Lars Buitinck`_ y `Manoj Kumar`_. Opción del solucionador `newton-cg` por Simon Wu.

source: ``DictVectorizer`` can now perform ``fit_transform`` on an iterable in a single pass, when giving the option ``sort=False``. By :user:`Dan Blanchard <dan-blanchard>`.
es_es: ``DictVectorizer`` ahora puede ejecutar ``fit_transform`` en un iterable en un solo pase, cuando se le da la opción ``sort=False``. Por :user:`Dan Blanchard <dan-blanchard>`.

source: :class:`GridSearchCV` and :class:`RandomizedSearchCV` can now be configured to work with estimators that may fail and raise errors on individual folds. This option is controlled by the `error_score` parameter. This does not affect errors raised on re-fit. By :user:`Michal Romaniuk <romaniukm>`.
es_es: :class:`GridSearchCV` y :class:`RandomizedSearchCV` ahora pueden ser configurados para trabajar con estimadores que pueden fallar y levantar errores en pliegues individuales. Esta opción está controlada por el parámetro `error_score`. Esto no afecta los errores generados al volver a encajar. Por :user:`Michal Romaniuk <romaniukm>`.

source: Add ``digits`` parameter to `metrics.classification_report` to allow report to show different precision of floating point numbers. By :user:`Ian Gilmore <agileminor>`.
es_es: Añade el parámetro ``digits`` a `metrics.classification_report` para permitir al reporte mostrar diferentes precisión de números de punto flotante. Por :user:`Ian Gilmore <agileminor>`.

source: Add a quantile prediction strategy to the :class:`dummy.DummyRegressor`. By :user:`Aaron Staple <staple>`.
es_es: Añade una estrategia de predicción de cuantiles al :class:`dummy.DummyRegressor`. De :user:`Aaron Staple <staple>`.

source: Add ``handle_unknown`` option to :class:`preprocessing.OneHotEncoder` to handle unknown categorical features more gracefully during transform. By `Manoj Kumar`_.
es_es: Añade la opción ``handle_unknown`` a :class:`preprocessing.OneHotEncoder` para manejar características categóricas desconocidas de forma más elegante durante la transformación. Por `Manoj Kumar`_.

source: Added support for sparse input data to decision trees and their ensembles. By `Fares Hedyati`_ and `Arnaud Joly`_.
es_es: Se ha añadido soporte para datos de entrada dispersos a los árboles de decisión y sus conjuntos. Por `Fares Hedyati`_ y `Arnaud Joly`_.

source: Optimized :class:`cluster.AffinityPropagation` by reducing the number of memory allocations of large temporary data-structures. By `Antony Lee`_.
es_es: Optimizado :class:`cluster.AffinityPropagation` al reducir el número de asignaciones de memoria de grandes estructuras temporales de datos. Por `Antony Lee`_.

source: Parellization of the computation of feature importances in random forest. By `Olivier Grisel`_ and `Arnaud Joly`_.
es_es: Parelización del cálculo de importancias de características en bosques aleatorios. Por `Olivier Grisel`_ and `Arnaud Joly`_.

source: Add ``n_iter_`` attribute to estimators that accept a ``max_iter`` attribute in their constructor. By `Manoj Kumar`_.
es_es: Añade el atributo ``n_iter_`` a los estimadores que aceptan un atributo ``max_iter`` en su constructor. Por `Manoj Kumar`_.

source: Added decision function for :class:`multiclass.OneVsOneClassifier` By `Raghav RV`_ and :user:`Kyle Beauchamp <kyleabeauchamp>`.
es_es: Se añadió la función de decisión para :class:`multiclass.OneVsOneClassifier` por `Raghav RV`_ y :user:`Kyle Beauchamp <kyleabeauchamp>`.

source: :func:`neighbors.kneighbors_graph` and :func:`radius_neighbors_graph` support non-Euclidean metrics. By `Manoj Kumar`_
es_es: :func:`neighbors.kneighbors_graph` y :func:`radius_neighbors_graph` soportan métricas no euclidianas. Por `Manoj Kumar`_

source: Parameter ``connectivity`` in :class:`cluster.AgglomerativeClustering` and family now accept callables that return a connectivity matrix. By `Manoj Kumar`_.
es_es: El parámetro ``connectivity`` en :class:`cluster.AgglomerativeClustering` y la familia ahora aceptan invocables que devuelven una matriz de conectividad. Por `Manoj Kumar`_.

source: Sparse support for :func:`paired_distances`. By `Joel Nothman`_.
es_es: Soporte disperso para :func:`paired_distances`. Por `Joel Nothman`_.

source: :class:`cluster.DBSCAN` now supports sparse input and sample weights and has been optimized: the inner loop has been rewritten in Cython and radius neighbors queries are now computed in batch. By `Joel Nothman`_ and `Lars Buitinck`_.
es_es: :class:`cluster. BSCAN` ahora soporta la entrada dispersa y los ponderados de muestra, y ha sido optimizado: el bucle interno ha sido reescrito en Cython y las consultas de los vecinos del radio ahora se calculan por lotes. Por `Joel Nothman`_ y `Lars Buitinck`_.

source: Add ``class_weight`` parameter to automatically weight samples by class frequency for :class:`ensemble.RandomForestClassifier`, :class:`tree.DecisionTreeClassifier`, :class:`ensemble.ExtraTreesClassifier` and :class:`tree.ExtraTreeClassifier`. By `Trevor Stephens`_.
es_es: Añade el parámetro ``class_weight`` para ponderar automáticamente las muestras por frecuencia de clase para :class:`ensemble.RandomForestClassifier`, :class:`tree.DecisionTreeClassifier`, :class:`ensemble.ExtraTreesClassifier` y :class:`tree.ExtraTreeClassifier`. Por `Trevor Stephens`_.

source: :class:`grid_search.RandomizedSearchCV` now does sampling without replacement if all parameters are given as lists. By `Andreas Müller`_.
es_es: :class:`grid_search.RandomizedSearchCV` ahora hace muestreo sin reemplazo si todos los parámetros son dados como listas. Por `Andreas Müller`_.

source: Parallelized calculation of :func:`pairwise_distances` is now supported for scipy metrics and custom callables. By `Joel Nothman`_.
es_es: Cálculo paralelizado de :func:`pairwise_distances` ahora es compatible con métricas scipy y invocables personalizados. Por `Joel Nothman`_.

source: Allow the fitting and scoring of all clustering algorithms in :class:`pipeline.Pipeline`. By `Andreas Müller`_.
es_es: Permite el ajuste y puntuación de todos los algoritmos de analísis de conglomerados en :class:`pipeline.Pipeline`. Por `Andreas Müller`_.

source: More robust seeding and improved error messages in :class:`cluster.MeanShift` by `Andreas Müller`_.
es_es: Sembrado más robusto y mensajes de error mejorados en :class:`cluster.MeanShift` por `Andreas Müller`_.

source: Make the stopping criterion for :class:`mixture.GMM`, :class:`mixture.DPGMM` and :class:`mixture.VBGMM` less dependent on the number of samples by thresholding the average log-likelihood change instead of its sum over all samples. By `Hervé Bredin`_.
es_es: Se hizo el criterio de parada para :class:`mixture.GMM`, :class:`mixture.DPGMM` y :class:`mixture.VBGMM` menos dependiente en el número de muestras usando una fijación de umbrales en el cambio promedio del logaritmo de verosimilitud en lugar de su suma sobre todas las muestras. Por `Hervé Bredin`_.

source: The outcome of :func:`manifold.spectral_embedding` was made deterministic by flipping the sign of eigenvectors. By :user:`Hasil Sharma <Hasil-Sharma>`.
es_es: El resultado de :func:`manifold.spectral_embedding` se hizo determinístico al voltear el signo de los eigenvectores. Por :user:`Hasil Sharma <Hasil-Sharma>`.

source: Significant performance and memory usage improvements in :class:`preprocessing.PolynomialFeatures`. By `Eric Martin`_.
es_es: Mejoras significativas de rendimiento y uso de memoria en :class:`preprocessing.PolynomialFeatures`. De `Eric Martin`_.

source: Numerical stability improvements for :class:`preprocessing.StandardScaler` and :func:`preprocessing.scale`. By `Nicolas Goix`_
es_es: Mejoras numéricas de estabilidad para :class:`preprocessing.StandardScaler` y :func:`preprocessing.scale`. Por `Nicolas Goix`_

source: :class:`svm.SVC` fitted on sparse input now implements ``decision_function``. By `Rob Zinkov`_ and `Andreas Müller`_.
es_es: :class:`svm.SVC` instalado en entrada dispersa ahora implementa ``decision_function``. Por `Rob Zinkov`_ y `Andreas Müller`_.

source: :func:`cross_validation.train_test_split` now preserves the input type, instead of converting to numpy arrays.
es_es: :func:`cross_validation.train_test_split` ahora preserva el tipo de entrada, en lugar de convertir a arreglos de numpy.

source: Documentation improvements
es_es: Mejoras de documentación

source: Added example of using :class:`FeatureUnion` for heterogeneous input. By :user:`Matt Terry <mrterry>`
es_es: Se ha añadido un ejemplo de uso de :class:`FeatureUnion` para una entrada heterogenea. Por :user:`Matt Terry <mrterry>`

source: Documentation on scorers was improved, to highlight the handling of loss functions. By :user:`Matt Pico <MattpSoftware>`.
es_es: La documentación sobre los puntuadores fue mejorada, para resaltar el manejo de las funciones de perdida. Por :user:`Matt Pico <MattpSoftware>`.

source: A discrepancy between liblinear output and scikit-learn's wrappers is now noted. By `Manoj Kumar`_.
es_es: Una discrepancia entre la salida liblineal y los envoltorios de scikit-learn es ahora señalada. Por `Manoj Kumar`_.

source: Improved documentation generation: examples referring to a class or function are now shown in a gallery on the class/function's API reference page. By `Joel Nothman`_.
es_es: Se mejoró la generación de documentación: ejemplos relacionados a una clase o función ahora se muestran en una galería en la pagina de referencia de API de clase o función. Por `Joel Nothman`_.

source: More explicit documentation of sample generators and of data transformation. By `Joel Nothman`_.
es_es: Documentación más explícita de generadores de muestras y de transformación de datos. Por `Joel Nothman`_.

source: :class:`sklearn.neighbors.BallTree` and :class:`sklearn.neighbors.KDTree` used to point to empty pages stating that they are aliases of BinaryTree. This has been fixed to show the correct class docs. By `Manoj Kumar`_.
es_es: :class:`sklearn.neighbors.BallTree` y :class:`sklearn.neighbors.KDTree` solían apuntar a páginas vacías indicando que son aliases de BinaryTree. Esto ha sido arreglado para mostrar los documentos de clase correctos. Por `Manoj Kumar`_.

source: Added silhouette plots for analysis of KMeans clustering using :func:`metrics.silhouette_samples` and :func:`metrics.silhouette_score`. See :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_silhouette_analysis.py`
es_es: Se añadieron gráficos de silueta para el análisis del clustering de KMeans usando :func:`metrics.silhouette_samples` y :func:`metrics.silhouette_score`. Ver :ref:`sphx_glr_auto_examples_plot_kmeans_silhouette_analysis.py`
