Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.17.po
Languages: es_es

source: Version 0.17.1
es_es: Versión 0.17.1

source: **February 18, 2016**
es_es: **18 de febrero de 2016**

source: Changelog
es_es: Registro de cambios

source: Bug fixes
es_es: Corrección de errores

source: Upgrade vendored joblib to version 0.9.4 that fixes an important bug in ``joblib.Parallel`` that can silently yield to wrong results when working on datasets larger than 1MB: https://github.com/joblib/joblib/blob/0.9.4/CHANGES.rst
es_es: Actualiza joblib a la versión 0.9.4 provista que corrige un error importante en ``joblib.Parallel`` que puede producir resultados erróneos de forma silenciosa cuando se trabaja con conjuntos de datos de más de 1MB: https://github.com/joblib/joblib/blob/0.9.4/CHANGES.rst

source: Fixed reading of Bunch pickles generated with scikit-learn version <= 0.16. This can affect users who have already downloaded a dataset with scikit-learn 0.16 and are loading it with scikit-learn 0.17. See :issue:`6196` for how this affected :func:`datasets.fetch_20newsgroups`. By `Loic Esteve`_.
es_es: Se ha corregido la lectura de los pickles de Bunch generados con la versión de scikit-learn <= 0.16. Esto puede afectar a los usuarios que ya han descargado un conjunto de datos con scikit-learn 0.16 y lo están cargando con scikit-learn 0.17. Ver :issue:`6196` para saber cómo afectaba esto a :func:`datasets.fetch_20newsgroups`. Por `Loic Esteve`_.

source: Fixed a bug that prevented using ROC AUC score to perform grid search on several CPU / cores on large arrays. See :issue:`6147` By `Olivier Grisel`_.
es_es: Se ha corregido un error que impedía utilizar la puntuación AUC de ROC para realizar la búsqueda en cuadrícula en varias CPU / núcleos(cores) en arreglos grandes. Ver :issue:`6147` Por `Olivier Grisel`_.

source: Fixed a bug that prevented to properly set the ``presort`` parameter in :class:`ensemble.GradientBoostingRegressor`. See :issue:`5857` By Andrew McCulloh.
es_es: Se ha corregido un error que impedía establecer correctamente el parámetro ``presort`` en :class:`ensemble.GradientBoostingRegressor`. Ver :issue:`5857` Por Andrew McCulloh.

source: Fixed a joblib error when evaluating the perplexity of a :class:`decomposition.LatentDirichletAllocation` model. See :issue:`6258` By Chyi-Kwei Yau.
es_es: Se ha corregido un error de joblib al evaluar la perplejidad de un modelo :class:`decomposition.LatentDirichletAllocation`. Ver :issue:`6258` Por Chyi-Kwei Yau.

source: Version 0.17
es_es: Versión 0.17

source: **November 5, 2015**
es_es: **5 de noviembre de 2015**

source: New features
es_es: Nuevas características

source: All the Scaler classes but :class:`preprocessing.RobustScaler` can be fitted online by calling `partial_fit`. By :user:`Giorgio Patrini <giorgiop>`.
es_es: Todas las clases Scaler excepto :class:`preprocessing.RobustScaler` pueden ser ajustadas en línea llamando a `partial_fit`. Por :user:`Giorgio Patrini <giorgiop>`.

source: The new class :class:`ensemble.VotingClassifier` implements a "majority rule" / "soft voting" ensemble classifier to combine estimators for classification. By `Sebastian Raschka`_.
es_es: La nueva clase :class:`ensemble.VotingClassifier` implementa un clasificador de conjunto(ensemble) de "regla de la mayoría" / "voto suave" para combinar estimadores para la clasificación. Por `Sebastian Raschka`_.

source: The new class :class:`preprocessing.RobustScaler` provides an alternative to :class:`preprocessing.StandardScaler` for feature-wise centering and range normalization that is robust to outliers. By :user:`Thomas Unterthiner <untom>`.
es_es: La nueva clase :class:`preprocessing.RobustScaler` proporciona una alternativa a :class:`preprocessing.StandardScaler` para el centrado de características y la normalización de rangos que es robusta a los valores atípicos. Por :user:`Thomas Unterthiner <untom>`.

source: The new class :class:`preprocessing.MaxAbsScaler` provides an alternative to :class:`preprocessing.MinMaxScaler` for feature-wise range normalization when the data is already centered or sparse. By :user:`Thomas Unterthiner <untom>`.
es_es: La nueva clase :class:`preprocessing.MaxAbsScaler` proporciona una alternativa a :class:`preprocessing.MinMaxScaler` para la normalización de rangos de características cuando los datos ya están centrados o son dispersos. Por :user:`Thomas Unterthiner <untom>`.

source: The new class :class:`preprocessing.FunctionTransformer` turns a Python function into a ``Pipeline``-compatible transformer object. By Joe Jevnik.
es_es: La nueva clase :class:`preprocessing.FunctionTransformer` convierte una función de Python en un objeto transformador compatible con ``Pipeline``. Por Joe Jevnik.

source: The new classes :class:`cross_validation.LabelKFold` and :class:`cross_validation.LabelShuffleSplit` generate train-test folds, respectively similar to :class:`cross_validation.KFold` and :class:`cross_validation.ShuffleSplit`, except that the folds are conditioned on a label array. By `Brian McFee`_, :user:`Jean Kossaifi <JeanKossaifi>` and `Gilles Louppe`_.
es_es: Las nuevas clases :class:`cross_validation.LabelKFold` y :class:`cross_validation.LabelShuffleSplit` generan pliegues de entrenamiento-prueba, respectivamente, similares a :class:`cross_validation.KFold` y :class:`cross_validation.ShuffleSplit`, excepto que los pliegues están condicionados a un arreglo de etiquetas. Por `Brian McFee`_, :user:`Jean Kossaifi <JeanKossaifi>` y `Gilles Louppe`_.

source: :class:`decomposition.LatentDirichletAllocation` implements the Latent Dirichlet Allocation topic model with online variational inference. By :user:`Chyi-Kwei Yau <chyikwei>`, with code based on an implementation by Matt Hoffman. (:issue:`3659`)
es_es: :class:`decomposition.LatentDirichletAllocation` implementa el modelo temático Asignación latente de Dirichlet (Latent Dirichlet Allocation) con inferencia variacional en línea. Por :user:`Chyi-Kwei Yau <chyikwei>`, con código basado en una implementación de Matt Hoffman. (:issue:`3659`)

source: The new solver ``sag`` implements a Stochastic Average Gradient descent and is available in both :class:`linear_model.LogisticRegression` and :class:`linear_model.Ridge`. This solver is very efficient for large datasets. By :user:`Danny Sullivan <dsullivan7>` and `Tom Dupre la Tour`_. (:issue:`4738`)
es_es: El nuevo solucionador ``sag`` implementa un descenso de gradiente medio estocástico (Stochastic Average Gradient descent) y está disponible tanto en :class:`linear_model.LogisticRegression` como en :class:`linear_model.Ridge`. Este solucionador es muy eficiente para grandes conjuntos de datos. Por :user:`Danny Sullivan <dsullivan7>` y `Tom Dupre la Tour`_. (:issue:`4738`)

source: The new solver ``cd`` implements a Coordinate Descent in :class:`decomposition.NMF`. Previous solver based on Projected Gradient is still available setting new parameter ``solver`` to ``pg``, but is deprecated and will be removed in 0.19, along with :class:`decomposition.ProjectedGradientNMF` and parameters ``sparseness``, ``eta``, ``beta`` and ``nls_max_iter``. New parameters ``alpha`` and ``l1_ratio`` control L1 and L2 regularization, and ``shuffle`` adds a shuffling step in the ``cd`` solver. By `Tom Dupre la Tour`_ and `Mathieu Blondel`_.
es_es: El nuevo solucionador ``cd`` implementa un Descenso de Coordenadas en :class:`decomposition.NMF`. El solucionador anterior basado en Gradiente Proyectado todavía está disponible estableciendo el nuevo parámetro ``solver`` a ``pg``, pero está obsoleto y será eliminado en 0.19, junto con :class:`decomposition.ProjectedGradientNMF` y los parámetros ``sparseness``, ``eta``, ``beta`` y ``nls_max_iter``. Los nuevos parámetros ``alpha`` y ``l1_ratio`` controlan la regularización L1 y L2, y ``shuffle`` añade un paso de mezclado en el solucionador ``cd``. Por `Tom Dupre la Tour`_ y `Mathieu Blondel`_.

source: Enhancements
es_es: Mejoras

source: :class:`manifold.TSNE` now supports approximate optimization via the Barnes-Hut method, leading to much faster fitting. By Christopher Erick Moody. (:issue:`4025`)
es_es: :class:`manifold.TSNE` ahora soporta la optimización aproximada a través del método Barnes-Hut, lo que lleva a un ajuste mucho más rápido. Por Christopher Erick Moody. (:issue:`4025`)

source: :class:`cluster.mean_shift_.MeanShift` now supports parallel execution, as implemented in the ``mean_shift`` function. By :user:`Martino Sorbaro <martinosorb>`.
es_es: :class:`cluster.mean_shift_.MeanShift` ahora soporta la ejecución en paralelo, como se implementa en la función ``mean_shift``. Por :user:`Martino Sorbaro <martinosorb>`.

source: :class:`naive_bayes.GaussianNB` now supports fitting with ``sample_weight``. By `Jan Hendrik Metzen`_.
es_es: :class:`naive_bayes.GaussianNB` ahora soporta el ajuste con ``sample_weight``. Por `Jan Hendrik Metzen`_.

source: :class:`dummy.DummyClassifier` now supports a prior fitting strategy. By `Arnaud Joly`_.
es_es: :class:`dummy.DummyClassifier` ahora soporta una estrategia de ajuste previo. Por `Arnaud Joly`_.

source: Added a ``fit_predict`` method for :class:`mixture.GMM` and subclasses. By :user:`Cory Lorenz <clorenz7>`.
es_es: Se añadió un método ``fit_predict`` para :class:`mixture.GM` y subclases. Por :user:`Cory Lorenz <clorenz7>`.

source: Added the :func:`metrics.label_ranking_loss` metric. By `Arnaud Joly`_.
es_es: Se añadió la métrica :func:`metrics.label_ranking_loss`. Por `Arnaud Joly`_.

source: Added the :func:`metrics.cohen_kappa_score` metric.
es_es: Se añadió la métrica :func:`metrics.cohen_kappa_score`.

source: Added a ``warm_start`` constructor parameter to the bagging ensemble models to increase the size of the ensemble. By :user:`Tim Head <betatim>`.
es_es: Se añadió un parámetro constructor ``warm_start`` a los modelos de conjunto empaquetado (ensemble bagging) para aumentar el tamaño del conjunto. Por :user:`Tim Head <betatim>`.

source: Added option to use multi-output regression metrics without averaging. By Konstantin Shmelkov and :user:`Michael Eickenberg<eickenberg>`.
es_es: Se añadió la opción de utilizar métricas de regresión de múltiples salidas sin promediar. Por Konstantin Shmelkov y :user:`Michael Eickenberg<eickenberg>`.

source: Added ``stratify`` option to :func:`cross_validation.train_test_split` for stratified splitting. By Miroslav Batchkarov.
es_es: Se añadió la opción ``stratify`` a :func:`cross_validation.train_test_split` para la división estratificada. Por Miroslav Batchkarov.

source: The :func:`tree.export_graphviz` function now supports aesthetic improvements for :class:`tree.DecisionTreeClassifier` and :class:`tree.DecisionTreeRegressor`, including options for coloring nodes by their majority class or impurity, showing variable names, and using node proportions instead of raw sample counts. By `Trevor Stephens`_.
es_es: La función :func:`tree.export_graphviz` soporta ahora mejoras estéticas para :class:`tree.DecisionTreeClassifier` y :class:`tree.DecisionTreeRegressor`, incluyendo opciones para colorear los nodos por su clase mayoritaria o impureza, mostrando los nombres de las variables, y utilizando las proporciones de los nodos en lugar de los recuentos en bruto de las muestras. Por `Trevor Stephens`_.

source: Improved speed of ``newton-cg`` solver in :class:`linear_model.LogisticRegression`, by avoiding loss computation. By `Mathieu Blondel`_ and `Tom Dupre la Tour`_.
es_es: Mejora de la velocidad del solucionador ``newton-cg`` en :class:`linear_model.LogisticRegression`, evitando el cálculo de pérdidas. Por `Mathieu Blondel`_ y `Tom Dupre la Tour`_.

source: The ``class_weight="auto"`` heuristic in classifiers supporting ``class_weight`` was deprecated and replaced by the ``class_weight="balanced"`` option, which has a simpler formula and interpretation. By `Hanna Wallach`_ and `Andreas Müller`_.
es_es: La heurística ``class_weight="auto"`` en los clasificadores que soportan ``class_weight`` quedó obsoleta y fue reemplazada por la opción ``class_weight="balanced"``, que tiene una fórmula e interpretación más simple. Por `Hanna Wallach`_ y `Andreas Müller`_.

source: Add ``class_weight`` parameter to automatically weight samples by class frequency for :class:`linear_model.PassiveAggressiveClassifier`. By `Trevor Stephens`_.
es_es: Se ha añadido el parámetro ``class_weight`` para ponderar automáticamente las muestras por la frecuencia de la clase para :class:`linear_model.PassiveAggressiveClassifier`. Por `Trevor Stephens`_.

source: Added backlinks from the API reference pages to the user guide. By `Andreas Müller`_.
es_es: Se han añadido los enlaces de las páginas de referencia de la API a la guía del usuario. Por `Andreas Müller`_.

source: The ``labels`` parameter to :func:`sklearn.metrics.f1_score`, :func:`sklearn.metrics.fbeta_score`, :func:`sklearn.metrics.recall_score` and :func:`sklearn.metrics.precision_score` has been extended. It is now possible to ignore one or more labels, such as where a multiclass problem has a majority class to ignore. By `Joel Nothman`_.
es_es: El parámetro ``labels`` de :func:`sklearn.metrics.f1_score`, :func:`sklearn.metrics.fbeta_score`, :func:`sklearn.metrics.recall_score` y :func:`sklearn.metrics.precision_score` ha sido ampliado. Ahora es posible ignorar una o más etiquetas, como en el caso de que un problema multiclase tenga una clase mayoritaria que ignorar. Por `Joel Nothman`_.

source: Add ``sample_weight`` support to :class:`linear_model.RidgeClassifier`. By `Trevor Stephens`_.
es_es: Añadido soporte de ``sample_weight`` a :class:`linear_model.RidgeClassifier`. Por `Trevor Stephens`_.

source: Provide an option for sparse output from :func:`sklearn.metrics.pairwise.cosine_similarity`. By :user:`Jaidev Deshpande <jaidevd>`.
es_es: Proporciona una opción para la salida dispersa de :func:`sklearn.metrics.pairwise.cosine_similarity`. Por :user:`Jaidev Deshpande <jaidevd>`.

source: Add :func:`minmax_scale` to provide a function interface for :class:`MinMaxScaler`. By :user:`Thomas Unterthiner <untom>`.
es_es: Añadida :func:`minmax_scale` para proporcionar una función de interfaz para :class:`MinMaxScaler`. Por :user:`Thomas Unterthiner <untom>`.

source: ``dump_svmlight_file`` now handles multi-label datasets. By Chih-Wei Chang.
es_es: ``dump_svmlight_file`` ahora maneja conjuntos de datos multietiqueta. Por Chih-Wei Chang.

source: RCV1 dataset loader (:func:`sklearn.datasets.fetch_rcv1`). By `Tom Dupre la Tour`_.
es_es: Cargador de conjuntos de datos RCV1 (:func:`sklearn.datasets.fetch_rcv1`). Por `Tom Dupre la Tour`_.

source: The "Wisconsin Breast Cancer" classical two-class classification dataset is now included in scikit-learn, available with :func:`sklearn.dataset.load_breast_cancer`.
es_es: El conjunto de datos de clasificación clásica de dos clases "Cáncer de mama de Wisconsin"(Wisconsin Breast Cancer) está ahora incluido en scikit-learn, disponible con :func:`sklearn.dataset.load_breast_cancer`.

source: Upgraded to joblib 0.9.3 to benefit from the new automatic batching of short tasks. This makes it possible for scikit-learn to benefit from parallelism when many very short tasks are executed in parallel, for instance by the :class:`grid_search.GridSearchCV` meta-estimator with ``n_jobs > 1`` used with a large grid of parameters on a small dataset. By `Vlad Niculae`_, `Olivier Grisel`_ and `Loic Esteve`_.
es_es: Actualizado a joblib 0.9.3 para beneficiarse del nuevo lote automático de tareas cortas. Esto hace posible que scikit-learn se beneficie del paralelismo cuando muchas tareas muy cortas se ejecutan en paralelo, por ejemplo por el metaestimador :class:`grid_search.GridSearchCV` con ``n_jobs > 1`` utilizado con una gran cuadrícula de parámetros en un pequeño conjunto de datos. Por `Vlad Niculae`_, `Olivier Grisel`_ y `Loic Esteve`_.

source: For more details about changes in joblib 0.9.3 see the release notes: https://github.com/joblib/joblib/blob/master/CHANGES.rst#release-093
es_es: Para más detalles sobre los cambios en joblib 0.9.3 consulta las notas de la versión: https://github.com/joblib/joblib/blob/master/CHANGES.rst#release-093

source: Improved speed (3 times per iteration) of :class:`decomposition.DictLearning` with coordinate descent method from :class:`linear_model.Lasso`. By :user:`Arthur Mensch <arthurmensch>`.
es_es: Velocidad mejorada (3 veces por iteración) de :class:`decomposition.DictLearning` con el método de descenso de coordenadas de :class:`linear_model.Lasso`. Por :user:`Arthur Mensch <arthurmensch>`.

source: Parallel processing (threaded) for queries of nearest neighbors (using the ball-tree) by Nikolay Mayorov.
es_es: Procesamiento paralelo (por hilos) para consultas de vecinos más cercanos (utilizando el árbol de bolas) por Nikolay Mayorov.

source: Allow :func:`datasets.make_multilabel_classification` to output a sparse ``y``. By Kashif Rasul.
es_es: Permite que :func:`datasets.make_multilabel_classification` dé salida a un ``y`` disperso. Por Kashif Rasul.

source: :class:`cluster.DBSCAN` now accepts a sparse matrix of precomputed distances, allowing memory-efficient distance precomputation. By `Joel Nothman`_.
es_es: :class:`cluster.DBSCAN` ahora acepta una matriz dispersa de distancias precalculadas, permitiendo un precálculo de distancias eficiente en memoria. Por `Joel Nothman`_.

source: :class:`tree.DecisionTreeClassifier` now exposes an ``apply`` method for retrieving the leaf indices samples are predicted as. By :user:`Daniel Galvez <galv>` and `Gilles Louppe`_.
es_es: :class:`tree.DecisionTreeClassifier` ahora presenta un método ``apply`` para recuperar los índices de las hojas de las muestras que se predicen. Por :user:`Daniel Galvez <galv>` y `Gilles Louppe`_.

source: Speed up decision tree regressors, random forest regressors, extra trees regressors and gradient boosting estimators by computing a proxy of the impurity improvement during the tree growth. The proxy quantity is such that the split that maximizes this value also maximizes the impurity improvement. By `Arnaud Joly`_, :user:`Jacob Schreiber <jmschrei>` and `Gilles Louppe`_.
es_es: Acelera los regresores de los árboles de decisión, los regresores de los bosques aleatorios, los regresores de los árboles adicionales y los estimadores de potenciación del gradiente calculando una cantidad proxy de la mejora de la impureza durante el crecimiento del árbol. La cantidad proxy es tal que la división que maximiza este valor también maximiza la mejora de la impureza. Por `Arnaud Joly`_, :user:`Jacob Schreiber <jmschrei>` y `Gilles Louppe`_.

source: Speed up tree based methods by reducing the number of computations needed when computing the impurity measure taking into account linear relationship of the computed statistics. The effect is particularly visible with extra trees and on datasets with categorical or sparse features. By `Arnaud Joly`_.
es_es: Acelera los métodos basados en árboles reduciendo el número de cálculos necesarios al calcular la medida de impureza teniendo en cuenta la relación lineal de los estadísticos calculados. El efecto es especialmente visible con árboles adicionales y en conjuntos de datos con características categóricas o dispersas. Por `Arnaud Joly`_.

source: :class:`ensemble.GradientBoostingRegressor` and :class:`ensemble.GradientBoostingClassifier` now expose an ``apply`` method for retrieving the leaf indices each sample ends up in under each try. By :user:`Jacob Schreiber <jmschrei>`.
es_es: :class:`ensemble.GradientBoostingRegressor` y :class:`ensemble.GradientBoostingClassifier` exponen ahora un método ``apply`` para recuperar los índices de hoja en los que termina cada muestra en cada intento. Por :user:`Jacob Schreiber <jmschrei>`.

source: Add ``sample_weight`` support to :class:`linear_model.LinearRegression`. By Sonny Hu. (:issue:`#4881`)
es_es: Añade el soporte ``sample_weight`` a :class:`linear_model.LinearRegression`. Por Sonny Hu. (:issue:`#4881`)

source: Add ``n_iter_without_progress`` to :class:`manifold.TSNE` to control the stopping criterion. By Santi Villalba. (:issue:`5186`)
es_es: Añade ``n_iter_without_progress`` a :class:`manifold.TSNE` para controlar el criterio de detenimiento. Por Santi Villalba. (:issue:`5186`)

source: Added optional parameter ``random_state`` in :class:`linear_model.Ridge` , to set the seed of the pseudo random generator used in ``sag`` solver. By `Tom Dupre la Tour`_.
es_es: Se añadió el parámetro opcional ``random_state`` en :class:`linear_model. idge` , para establecer la semilla del generador pseudo-aleatorio utilizado en el solucionador ``sag``. Por `Tom Dupre la Tour`_.

source: Added optional parameter ``warm_start`` in :class:`linear_model.LogisticRegression`. If set to True, the solvers ``lbfgs``, ``newton-cg`` and ``sag`` will be initialized with the coefficients computed in the previous fit. By `Tom Dupre la Tour`_.
es_es: Se añadió el parámetro opcional ``warm_start`` en :class:`linear_model.LogisticRegression`. Si se establece en True, los solucionadores ``lbfgs``, ``newton-cg`` y ``sag`` serán inicializados con los coeficientes calculados en el ajuste anterior. Por `Tom Dupre la Tour`_.

source: Added ``sample_weight`` support to :class:`linear_model.LogisticRegression` for the ``lbfgs``, ``newton-cg``, and ``sag`` solvers. By `Valentin Stolbunov`_. Support added to the ``liblinear`` solver. By `Manoj Kumar`_.
es_es: Se añadió el soporte ``sample_weight`` a :class:`linear_model.LogisticRegression` para los solucionadores ``lbfgs``, ``newton-cg``, y ``sag``. Por `Valentin Stolbunov`_. Soporte añadido al solucionador ``liblinear``. Por `Manoj Kumar`_.

source: Added optional parameter ``presort`` to :class:`ensemble.GradientBoostingRegressor` and :class:`ensemble.GradientBoostingClassifier`, keeping default behavior the same. This allows gradient boosters to turn off presorting when building deep trees or using sparse data. By :user:`Jacob Schreiber <jmschrei>`.
es_es: Se añadió el parámetro opcional ``presort`` a :class:`ensemble.GradientBoostingRegressor` y :class:`ensemble.GradientBoostingClassifier`, manteniendo el mismo comportamiento por defecto. Esto permite a los potenciadores de gradiente desactivar la preclasificación cuando se construyen árboles profundos o se utilizan datos dispersos. Por :user:`Jacob Schreiber <jmschrei>`.

source: Altered :func:`metrics.roc_curve` to drop unnecessary thresholds by default. By :user:`Graham Clenaghan <gclenaghan>`.
es_es: Se modificó :func:`metrics.roc_curve` para eliminar los umbrales innecesarios por defecto. Por :user:`Graham Clenaghan <gclenaghan>`.

source: Added :class:`feature_selection.SelectFromModel` meta-transformer which can be used along with estimators that have `coef_` or `feature_importances_` attribute to select important features of the input data. By :user:`Maheshakya Wijewardena <maheshakya>`, `Joel Nothman`_ and `Manoj Kumar`_.
es_es: Se añadió el metatransformador :class:`feature_selection.SelectFromModel` que puede utilizarse junto con los estimadores que tienen el atributo `coef_` o `feature_importances_` para seleccionar las características importantes de los datos de entrada. Por :user:`Maheshakya Wijewardena <maheshakya>`, `Joel Nothman`_ y `Manoj Kumar`_.

source: Added :func:`metrics.pairwise.laplacian_kernel`. By `Clyde Fare <https://github.com/Clyde-fare>`_.
es_es: Se añadió :func:`metrics.pairwise.laplacian_kernel`. Por `Clyde Fare <https://github.com/Clyde-fare>`_.

source: :class:`covariance.GraphLasso` allows separate control of the convergence criterion for the Elastic-Net subproblem via the ``enet_tol`` parameter.
es_es: :class:`covariance.GraphLasso` permite controlar por separado el criterio de convergencia del subproblema de la red elástica(Elastic-Net) mediante el parámetro ``enet_tol``.
