Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.17.po
Languages: es_es

source: Improved verbosity in :class:`decomposition.DictionaryLearning`.
es_es: Se mejoró la verbosidad en :class:`decomposition.DictionaryLearning`.

source: :class:`ensemble.RandomForestClassifier` and :class:`ensemble.RandomForestRegressor` no longer explicitly store the samples used in bagging, resulting in a much reduced memory footprint for storing random forest models.
es_es: :class:`ensemble.RandomForestClassifier` y :class:`ensemble.RandomForestRegressor` ya no almacenan explícitamente las muestras utilizadas en el empaquetado(bagging), lo que resulta en una huella de memoria mucho más reducida para el almacenamiento de modelos de bosque aleatorio.

source: Added ``positive`` option to :class:`linear_model.Lars` and :func:`linear_model.lars_path` to force coefficients to be positive. (:issue:`5131`)
es_es: Se añadió la opción ``positive`` a :class:`linear_model.Lars` y :func:`linear_model.lars_path` para forzar que los coeficientes sean positivos. (:issue:`5131`)

source: Added the ``X_norm_squared`` parameter to :func:`metrics.pairwise.euclidean_distances` to provide precomputed squared norms for ``X``.
es_es: Se añadió el parámetro ``X_norm_squared`` a :func:`metrics.pairwise.euclidean_distances` para proporcionar normas cuadradas precalculadas para ``X``.

source: Added the ``fit_predict`` method to :class:`pipeline.Pipeline`.
es_es: Se añadió el método ``fit_predict`` a :class:`pipeline.Pipeline`.

source: Added the :func:`preprocessing.min_max_scale` function.
es_es: Se añadió la función :func:`preprocessing.min_max_scale`.

source: Fixed non-determinism in :class:`dummy.DummyClassifier` with sparse multi-label output. By `Andreas Müller`_.
es_es: Se corrigió el no determinismo en :class:`dummy.DummyClassifier` con salida multietiqueta dispersa. Por `Andreas Müller`_.

source: Fixed the output shape of :class:`linear_model.RANSACRegressor` to ``(n_samples, )``. By `Andreas Müller`_.
es_es: Se corrigió la forma de salida de :class:`linear_model.RANSACRegressor` a ``(n_samples, )``. Por `Andreas Müller`_.

source: Fixed bug in :class:`decomposition.DictLearning` when ``n_jobs < 0``. By `Andreas Müller`_.
es_es: Se corrigió el error en :class:`decomposition.DictLearning` cuando ``n_jobs < 0``. Por `Andreas Müller`_.

source: Fixed bug where :class:`grid_search.RandomizedSearchCV` could consume a lot of memory for large discrete grids. By `Joel Nothman`_.
es_es: Se corrigió el error donde :class:`grid_search.RandomizedSearchCV` podía consumir mucha memoria para cuadrículas discretas de gran tamaño. Por `Joel Nothman`_.

source: Fixed bug in :class:`linear_model.LogisticRegressionCV` where `penalty` was ignored in the final fit. By `Manoj Kumar`_.
es_es: Se corrigió un error en :class:`linear_model.LogisticRegressionCV` donde `penalty` fue ignorado en el ajuste final. Por `Manoj Kumar`_.

source: Fixed bug in :class:`ensemble.forest.ForestClassifier` while computing oob_score and X is a sparse.csc_matrix. By :user:`Ankur Ankan <ankurankan>`.
es_es: Se corrigió un error en :class:`ensemble.forest.ForestClassifier` al calcular oob_score y X es una sparse.csc_matrix. Por :user:`Ankur Ankan <ankurankan>`.

source: All regressors now consistently handle and warn when given ``y`` that is of shape ``(n_samples, 1)``. By `Andreas Müller`_ and Henry Lin. (:issue:`5431`)
es_es: Todos los regresores ahora manejan y advierten consistentemente cuando se les da ``y`` que es de la forma ``(n_samples, 1)``. Por `Andreas Müller`_ y Henry Lin. (:issue:`5431`)

source: Fix in :class:`cluster.KMeans` cluster reassignment for sparse input by `Lars Buitinck`_.
es_es: Corrección en :class:`cluster.KMeans` reasignación de conglomerados para entradas dispersas por `Lars Buitinck`_.

source: Fixed a bug in :class:`lda.LDA` that could cause asymmetric covariance matrices when using shrinkage. By `Martin Billinger`_.
es_es: Se corrigió un error en :class:`lda.LDA` que podía provocar matrices de covarianza asimétricas al utilizar la reducción(shrinkage). Por `Martin Billinger`_.

source: Fixed :func:`cross_validation.cross_val_predict` for estimators with sparse predictions. By Buddha Prakash.
es_es: Se corrigió :func:`cross_validation.cross_val_predict` para estimadores con predicciones dispersas. Por Buddha Prakash.

source: Fixed the ``predict_proba`` method of :class:`linear_model.LogisticRegression` to use soft-max instead of one-vs-rest normalization. By `Manoj Kumar`_. (:issue:`5182`)
es_es: Se corregió el método ``predict_proba`` de :class:`linear_model.LogisticRegression` para que utilice soft-max en lugar de la normalización uno contra el resto(one-vs-rest). Por `Manoj Kumar`_. (:issue:`5182`)

source: Fixed the :func:`partial_fit` method of :class:`linear_model.SGDClassifier` when called with ``average=True``. By :user:`Andrew Lamb <andylamb>`. (:issue:`5282`)
es_es: Se corrigió el método :func:`partial_fit` de :class:`linear_model.SGDClassifier` cuando se llama con ``average=True``. Por :user:`Andrew Lamb <andylamb>`. (:issue:`5282`)

source: Dataset fetchers use different filenames under Python 2 and Python 3 to avoid pickling compatibility issues. By `Olivier Grisel`_. (:issue:`5355`)
es_es: Los buscadores de conjuntos de datos utilizan nombres de archivo diferentes en Python 2 y Python 3 para evitar incidencias de compatibilidad al serializar(pickling). Por `Olivier Grisel`_. (:issue:`5355`)

source: Fixed a bug in :class:`naive_bayes.GaussianNB` which caused classification results to depend on scale. By `Jake Vanderplas`_.
es_es: Se corrigió un error en :class:`naive_bayes.GaussianNB` que causaba que los resultados de la clasificación dependieran de la escala. Por `Jake Vanderplas`_.

source: Fixed temporarily :class:`linear_model.Ridge`, which was incorrect when fitting the intercept in the case of sparse data. The fix automatically changes the solver to 'sag' in this case. :issue:`5360` by `Tom Dupre la Tour`_.
es_es: Se corrigió temporalmente :class:`linear_model.Ridge`, que era incorrecto al ajustar el intercepto en el caso de datos dispersos. La corrección cambia automáticamente el solucionador a 'sag' en este caso. :issue:`5360` por `Tom Dupre la Tour`_.

source: Fixed a performance bug in :class:`decomposition.RandomizedPCA` on data with a large number of features and fewer samples. (:issue:`4478`) By `Andreas Müller`_, `Loic Esteve`_ and :user:`Giorgio Patrini <giorgiop>`.
es_es: Se corrigió un error de rendimiento en :class:`decomposition.RandomizedPCA` en datos con un gran número de características y menos muestras. (:issue:`4478`) Por `Andreas Müller`_, `Loic Esteve`_ y :user:`Giorgio Patrini <giorgiop>`.

source: Fixed bug in :class:`cross_decomposition.PLS` that yielded unstable and platform dependent output, and failed on `fit_transform`. By :user:`Arthur Mensch <arthurmensch>`.
es_es: Se corrigió un error en :class:`cross_decomposition.PLS` que producía una salida inestable y dependiente de la plataforma, y fallaba en `fit_transform`. Por :user:`Arthur Mensch <arthurmensch>`.
