Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.16.po
Languages: es_es

source: Metaestimators now support ducktyping for the presence of ``decision_function``, ``predict_proba`` and other methods. This fixes behavior of :class:`grid_search.GridSearchCV`, :class:`grid_search.RandomizedSearchCV`, :class:`pipeline.Pipeline`, :class:`feature_selection.RFE`, :class:`feature_selection.RFECV` when nested. By `Joel Nothman`_
es_es: Los metaestimadores ahora soportan el ducktyping para la presencia de ``decision_function``, ``predict_proba`` y otros métodos. Esto corrige el comportamiento de :class:`grid_search. ridSearchCV`, :class:`grid_search.RandomizedSearchCV`, :class:`pipeline.Pipeline`, :class:`feature_selection.RFE`, :class:`feature_selection.RFECV` cuando está anidado. Por `Joel Nothman`_

source: The ``scoring`` attribute of grid-search and cross-validation methods is no longer ignored when a :class:`grid_search.GridSearchCV` is given as a base estimator or the base estimator doesn't have predict.
es_es: El atributo ``scoring`` de los métodos de búsqueda en cuadrícula y validación cruzada ya no es ignorado cuando un :class:`grid_search. ridSearchCV` es dado como un estimador base o el estimador base no tiene predicho.

source: The function :func:`hierarchical.ward_tree` now returns the children in the same order for both the structured and unstructured versions. By `Matteo Visconti di Oleggio Castello`_.
es_es: La función :func:`hierarchical.ward_tree` ahora devuelve a los niños en el mismo orden tanto para las versiones estructuradas como no estructuradas. Por `Matteo Visconti di Oleggio Castello`_.

source: :class:`feature_selection.RFECV` now correctly handles cases when ``step`` is not equal to 1. By :user:`Nikolay Mayorov <nmayorov>`
es_es: :class:`feature_selection.RFECV` ahora maneja correctamente los casos cuando ``step`` no es igual a 1. Por :user:`Nikolay Mayorov <nmayorov>`

source: The :class:`decomposition.PCA` now undoes whitening in its ``inverse_transform``. Also, its ``components_`` now always have unit length. By :user:`Michael Eickenberg <eickenberg>`.
es_es: El :class:`decomposition.PCA` ahora deshace el whitening en su ``inverse_transform``. Además, sus ``components_`` ahora siempre tienen longitud unitaria. Por :user:`Michael Eickenberg <eickenberg>`.

source: Fix incomplete download of the dataset when :func:`datasets.download_20newsgroups` is called. By `Manoj Kumar`_.
es_es: Corregir la descarga incompleta del conjunto de datos cuando se llama a :func:`datasets.download_20newsgroups`. Por `Manoj Kumar`_.

source: Various fixes to the Gaussian processes subpackage by Vincent Dubourg and Jan Hendrik Metzen.
es_es: Varias correcciones al subpaquete de procesos Gaussianos de Vincent Dubourg y Jan Hendrik Metzen.

source: Calling ``partial_fit`` with ``class_weight=='auto'`` throws an appropriate error message and suggests a work around. By :user:`Danny Sullivan <dsullivan7>`.
es_es: Llamar a ``partial_fit`` con ``class_weight=='auto'`` arroja un mensaje de error apropiado y sugiere como trabajar alrededor de ello. Por :user:`Danny Sullivan <dsullivan7>`.
