Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.19.po
Languages: es_es

source: Added the :class:`model_selection.RepeatedKFold` and :class:`model_selection.RepeatedStratifiedKFold`. :issue:`8120` by `Neeraj Gangwar`_.
es_es: Se añadieron :class:`model_selection.RepeatedKFold` y :class:`model_selection.RepeatedStratifiedKFold`. :issue:`8120` por `Neeraj Gangwar`_.

source: Miscellaneous
es_es: Misceláneos

source: Validation that input data contains no NaN or inf can now be suppressed using :func:`config_context`, at your own risk. This will save on runtime, and may be particularly useful for prediction time. :issue:`7548` by `Joel Nothman`_.
es_es: La validación de que los datos de entrada no contengan NaN o inf ahora puede ser suprimida usando :func:`config_context`, bajo tu propio riesgo. Esto ahorrará en tiempo de ejecución, y puede ser particularmente útil para el tiempo de predicción. :issue:`7548` por `Joel Nothman`_.

source: Added a test to ensure parameter listing in docstrings match the function/class signature. :issue:`9206` by `Alexandre Gramfort`_ and `Raghav RV`_.
es_es: Se ha añadido una prueba para asegurar que la lista de parámetros en docstrings coincide con la firma de función/clase. :issue:`9206` por `Alexandre Gramfort`_ y `Raghav RV`_.

source: Trees and ensembles
es_es: Árboles y ensembles

source: The ``min_weight_fraction_leaf`` constraint in tree construction is now more efficient, taking a fast path to declare a node a leaf if its weight is less than 2 * the minimum. Note that the constructed tree will be different from previous versions where ``min_weight_fraction_leaf`` is used. :issue:`7441` by :user:`Nelson Liu <nelson-liu>`.
es_es: La restricción ``min_weight_fraction_leaf`` en la construcción del árbol es ahora más eficiente, tomando una ruta rápido para declarar un nodo como hoja si su peso es inferior a 2 * el mínimo. Tenga en cuenta que el árbol construido será diferente de las versiones anteriores donde se utiliza ``min_weight_fraction_leaf``. :issue:`7441` por :user:`Nelson Liu <nelson-liu>`.

source: :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` now support sparse input for prediction. :issue:`6101` by :user:`Ibraim Ganiev <olologin>`.
es_es: :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` ahora soportan entradas dispersas para predicción. :issue:`6101` de :user:`Ibraim Ganiev <olologin>`.

source: :class:`ensemble.VotingClassifier` now allows changing estimators by using :meth:`ensemble.VotingClassifier.set_params`. An estimator can also be removed by setting it to ``None``. :issue:`7674` by :user:`Yichuan Liu <yl565>`.
es_es: :class:`ensemble.VotingClassifier` ahora permite cambiar estimadores usando :meth:`ensemble.VotingClassifier.set_params`. Un estimador también puede ser eliminado asignándole ``None``. :issue:`7674` por :user:`Yichuan Liu <yl565>`.

source: :func:`tree.export_graphviz` now shows configurable number of decimal places. :issue:`8698` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: :func:`tree.export_graphviz` ahora muestra el número configurable de decimales. :issue:`8698` por :user:`Guillaume Lemaitre <glemaitre>`.

source: Added ``flatten_transform`` parameter to :class:`ensemble.VotingClassifier` to change output shape of `transform` method to 2 dimensional. :issue:`7794` by :user:`Ibraim Ganiev <olologin>` and :user:`Herilalaina Rakotoarison <herilalaina>`.
es_es: Se añadió el parámetro ``flatten_transform`` a :class:`ensemble.VotingClassifier` para cambiar la forma de salida del método `transform` a 2 dimensional. :issue:`7794` por :user:`Ibraim Ganiev <olologin>` y :user:`Herilalaina Rakotoarison <herilalaina>`.

source: Linear, kernelized and related models
es_es: Modelos lineales, kernelizados y relacionados

source: :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` and :class:`linear_model.Perceptron` now expose ``max_iter`` and ``tol`` parameters, to handle convergence more precisely. ``n_iter`` parameter is deprecated, and the fitted estimator exposes a ``n_iter_`` attribute, with actual number of iterations before convergence. :issue:`5036` by `Tom Dupre la Tour`_.
es_es: :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` y :class:`linear_model.Perceptron` ahora exponen los parámetros ``max_iter`` y ``tol``, para manejar la convergencia con mayor precisión. El parámetro ``n_iter`` está obsoleto, y el estimador ajustado expone un atributo ``n_iter_``, con el número real de iteraciones antes de la convergencia. :issue:`5036` por `Tom Dupre la Tour`_.

source: Added ``average`` parameter to perform weight averaging in :class:`linear_model.PassiveAggressiveClassifier`. :issue:`4939` by :user:`Andrea Esuli <aesuli>`.
es_es: Se añadió el parámetro ``average`` para realizar el promedio de peso en :class:`linear_model.PassiveAggressiveClassifier`. :issue:`4939` por :user:`Andrea Esuli <aesuli>`.

source: :class:`linear_model.RANSACRegressor` no longer throws an error when calling ``fit`` if no inliers are found in its first iteration. Furthermore, causes of skipped iterations are tracked in newly added attributes, ``n_skips_*``. :issue:`7914` by :user:`Michael Horrell <mthorrell>`.
es_es: :class:`linear_model.RANSACRegressor` ya no lanza un error al llamar a ``fit`` si no se encuentran valores típicos en su primera iteración. Además, las causas de las iteraciones saltadas son rastreadas en atributos añadidos recientemente, ``n_skips_*``. :issue:`7914` por :user:`Michael Horrell <mthorrell>`.

source: In :class:`gaussian_process.GaussianProcessRegressor`, method ``predict`` is a lot faster with ``return_std=True``. :issue:`8591` by :user:`Hadrien Bertrand <hbertrand>`.
es_es: En :class:`gaussian_process.GaussianProcessRegressor`, el método ``predict`` es mucho más rápido con ``return_std=True``. :issue:`8591` por :user:`Hadrien Bertrand <hbertrand>`.

source: Added ``return_std`` to ``predict`` method of :class:`linear_model.ARDRegression` and :class:`linear_model.BayesianRidge`. :issue:`7838` by :user:`Sergey Feldman <sergeyf>`.
es_es: Se añadió ``return_std`` al método ``predict`` de :class:`linear_model.ARDRegression` y :class:`linear_model.BayesianRidge`. :issue:`7838` de :user:`Sergey Feldman <sergeyf>`.

source: Memory usage enhancements: Prevent cast from float32 to float64 in: :class:`linear_model.MultiTaskElasticNet`; :class:`linear_model.LogisticRegression` when using newton-cg solver; and :class:`linear_model.Ridge` when using svd, sparse_cg, cholesky or lsqr solvers. :issue:`8835`, :issue:`8061` by :user:`Joan Massich <massich>` and :user:`Nicolas Cordier <ncordier>` and :user:`Thierry Guillemot <tguillemot>`.
es_es: Mejoras en el uso de la memoria: Evita la conversión desde float32 a float64 en: :class:`linear_model.MultiTaskElasticNet`; :class:`linear_model.LogisticRegression` cuando se utiliza el método de solución newton-cg; y :class:`linear_model.Ridge` al usar los solucionadores svd, sparse_cg, cholesky o lsqr. :issue:`8835`, :issue:`8061` por :user:`Joan Massich <massich>` y :user:`Nicolas Cordier <ncordier>` y :user:`Thierry Guillemot <tguillemot>`.

source: Other predictors
es_es: Otros predictores

source: Custom metrics for the :mod:`neighbors` binary trees now have fewer constraints: they must take two 1d-arrays and return a float. :issue:`6288` by `Jake Vanderplas`_.
es_es: Las métricas personalizadas para los árboles binarios :mod:`vecinos` ahora tienen menos restricciones: deben tomar dos arreglos 1d y devolver un float. :issue:`6288` por `Jake Vanderplas`_.

source: ``algorithm='auto`` in :mod:`neighbors` estimators now chooses the most appropriate algorithm for all input types and metrics. :issue:`9145` by :user:`Herilalaina Rakotoarison <herilalaina>` and :user:`Reddy Chinthala <preddy5>`.
es_es: ``algorithm='auto`` en estimadores de :mod:`vecinos` ahora eligen el algoritmo más apropiado para todos los tipos de entrada y métricas. :issue:`9145` por :user:`Herilalaina Rakotoarison <herilalaina>` y :user:`Reddy Chinthala <preddy5>`.

source: Decomposition, manifold learning and clustering
es_es: Descomposición, aprendizaje múltiple y análisis de conglomerados

source: :class:`cluster.MiniBatchKMeans` and :class:`cluster.KMeans` now use significantly less memory when assigning data points to their nearest cluster center. :issue:`7721` by :user:`Jon Crall <Erotemic>`.
es_es: :class:`cluster.MiniBatchKMeans` y :class:`cluster.KMeans` ahora usan significativamente menos memoria al asignar puntos de datos al centro de su conglomerado más cercano. :issue:`7721` por :user:`Jon Crall <Erotemic>`.

source: :class:`decomposition.PCA`, :class:`decomposition.IncrementalPCA` and :class:`decomposition.TruncatedSVD` now expose the singular values from the underlying SVD. They are stored in the attribute ``singular_values_``, like in :class:`decomposition.IncrementalPCA`. :issue:`7685` by :user:`Tommy Löfstedt <tomlof>`
es_es: :class:`decomposition.PCA`, :class:`decomposition.IncrementalPCA` y :class:`decomposition.TruncatedSVD` ahora exponen los valores singulares del SVD subyacente. Se almacenan en el atributo ``singular_values_``, como en :class:`decomposition.IncrementalPCA`. :issue:`7685` por :user:`Tommy Löfstedt <tomlof>`

source: :class:`decomposition.NMF` now faster when ``beta_loss=0``. :issue:`9277` by :user:`hongkahjun`.
es_es: :class:`decomposition.NMF` ahora es más rápido cuando ``beta_loss=0``. :issue:`9277` por :user:`hongkahjun`.

source: Memory improvements for method ``barnes_hut`` in :class:`manifold.TSNE` :issue:`7089` by :user:`Thomas Moreau <tomMoral>` and `Olivier Grisel`_.
es_es: Mejoras de memoria para el método ``barnes_hut`` en :class:`manifold.TSNE` :issue:`7089` por :user:`Thomas Moreau <tomMoral>` y `Olivier Grisel`_.

source: Optimization schedule improvements for Barnes-Hut :class:`manifold.TSNE` so the results are closer to the one from the reference implementation `lvdmaaten/bhtsne <https://github.com/lvdmaaten/bhtsne>`_ by :user:`Thomas Moreau <tomMoral>` and `Olivier Grisel`_.
es_es: Mejoras en el programa de optimización de Barnes-Hut :class:`manifold.TSNE` para que los resultados se acerquen más a los de la implementación de referencia `lvdmaaten/bhtsne <https://github.com/lvdmaaten/bhtsne>`_ de :user:`Thomas Moreau <tomMoral>` y `Olivier Grisel`_.

source: Memory usage enhancements: Prevent cast from float32 to float64 in :class:`decomposition.PCA` and :func:`decomposition.randomized_svd_low_rank`. :issue:`9067` by `Raghav RV`_.
es_es: Mejoras en el uso de la memoria: Evita la conversión de float32 a float64 en :class:`decomposition.PCA` y :func:`decomposition.randomized_svd_low_rank`. :issue:`9067` por `Raghav RV`_.

source: Preprocessing and feature selection
es_es: Preprocesamiento y selección de características

source: Added ``norm_order`` parameter to :class:`feature_selection.SelectFromModel` to enable selection of the norm order when ``coef_`` is more than 1D. :issue:`6181` by :user:`Antoine Wendlinger <antoinewdg>`.
es_es: Se añadió el parámetro ``norm_order`` a :class:`feature_selection.SelectFromModel` para habilitar la selección del orden de la norma cuando ``coef_`` es superior a 1D. :issue:`6181` por :user:`Antoine Wendlinger <antoinewdg>`.

source: Added ability to use sparse matrices in :func:`feature_selection.f_regression` with ``center=True``. :issue:`8065` by :user:`Daniel LeJeune <acadiansith>`.
es_es: Se ha añadido la habilidad de usar matrices dispersas en :func:`feature_selection.f_regression` con ``center=True``. :issue:`8065` por :user:`Daniel LeJeune <acadiansith>`.

source: Small performance improvement to n-gram creation in :mod:`feature_extraction.text` by binding methods for loops and special-casing unigrams. :issue:`7567` by :user:`Jaye Doepke <jtdoepke>`
es_es: Pequeña mejora de rendimiento en la creación de n-gramas en :mod:`feature_extraction.text` mediante métodos de enlace para bucles y unigramas de casos especiales. :issue:`7567` por :user:`Jaye Doepke <jtdoepke>`

source: Relax assumption on the data for the :class:`kernel_approximation.SkewedChi2Sampler`. Since the Skewed-Chi2 kernel is defined on the open interval :math:`(-skewedness; +\infty)^d`, the transform function should not check whether ``X < 0`` but whether ``X < -self.skewedness``. :issue:`7573` by :user:`Romain Brault <RomainBrault>`.
es_es: Relaja la suposición sobre los datos para el :class:`kernel_approximation.SkewedChi2Sampler`. Dado que el núcleo Skewed-Chi2 se define en el intervalo abierto :math:`(-skewedness; +\infty)^d`, la función de transformación no debería comprobar si ``X < 0`` sino si ``X < -self.skewedness``. :issue:`7573` por :user:`Romain Brault <RomainBrault>`.

source: Made default kernel parameters kernel-dependent in :class:`kernel_approximation.Nystroem`. :issue:`5229` by :user:`Saurabh Bansod <mth4saurabh>` and `Andreas Müller`_.
es_es: Se han hecho los parámetros del núcleo por defecto dependientes del núcleo en :class:`kernel_approximation.Nystroem`. :issue:`5229` por :user:`Saurabh Bansod <mth4saurabh>` y `Andreas Müller`_.

source: Model evaluation and meta-estimators
es_es: Evaluación del modelo y meta-estimadores

source: :class:`pipeline.Pipeline` is now able to cache transformers within a pipeline by using the ``memory`` constructor parameter. :issue:`7990` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: :class:`pipeline.Pipeline` ahora es capaz de almacenar en caché los transformadores dentro de una tubería usando el parámetro del constructor ``memory``. :issue:`7990` por :user:`Guillaume Lemaitre <glemaitre>`.

source: :class:`pipeline.Pipeline` steps can now be accessed as attributes of its ``named_steps`` attribute. :issue:`8586` by :user:`Herilalaina Rakotoarison <herilalaina>`.
es_es: Los pasos de :class:`pipeline.Pipeline` ahora pueden ser accedidos como atributos de su atributo ``named_steps``. :issue:`8586` por :user:`Herilalaina Rakotoarison <herilalaina>`.

source: Added ``sample_weight`` parameter to :meth:`pipeline.Pipeline.score`. :issue:`7723` by :user:`Mikhail Korobov <kmike>`.
es_es: Se añadió el parámetro ``sample_weight`` a :meth:`pipeline.Pipeline.score`. :issue:`7723` por :user:`Mikhail Korobov <kmike>`.

source: Added ability to set ``n_jobs`` parameter to :func:`pipeline.make_union`. A ``TypeError`` will be raised for any other kwargs. :issue:`8028` by :user:`Alexander Booth <alexandercbooth>`.
es_es: Se ha añadido la capacidad de asignar el parámetro ``n_jobs`` a :func:`pipeline.make_union`. Se elevará un ``TypeError`` para cualquier otro argumento de palabra clave. :issue:`8028` por :user:`Alexander Booth <alexandercbooth>`.

source: :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV` and :func:`model_selection.cross_val_score` now allow estimators with callable kernels which were previously prohibited. :issue:`8005` by `Andreas Müller`_ .
es_es: :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV` y :func:`model_selection.cross_val_score` ahora permiten estimadores con núcleos invocables lo cual estaba previamente prohibido. :issue:`8005` por `Andreas Muller`_ .

source: :func:`model_selection.cross_val_predict` now returns output of the correct shape for all values of the argument ``method``. :issue:`7863` by :user:`Aman Dalmia <dalmia>`.
es_es: :func:`model_selection.cross_val_predict` ahora devuelve la salida de forma correcta para todos los valores del argumento ``method``. :issue:`7863` por :user:`Aman Dalmia <dalmia>`.

source: Added ``shuffle`` and ``random_state`` parameters to shuffle training data before taking prefixes of it based on training sizes in :func:`model_selection.learning_curve`. :issue:`7506` by :user:`Narine Kokhlikyan <NarineK>`.
es_es: Se añadieron los parámetros ``shuffle`` y ``random_state`` para revolver los datos de entrenamiento antes de tomar prefijos basados en tamaños de entrenamiento en :func:`model_selection.learning_curve`. :issue:`7506` por :user:`Narine Kokhlikyan <NarineK>`.

source: :class:`model_selection.StratifiedShuffleSplit` now works with multioutput multiclass (or multilabel) data. :issue:`9044` by `Vlad Niculae`_.
es_es: :class:`model_selection.StratifiedShuffleSplit` ahora funciona con datos de múltiples salidas multiclase (o multietiqueta). :issue:`9044` by `Vlad Niculae`_.

source: Speed improvements to :class:`model_selection.StratifiedShuffleSplit`. :issue:`5991` by :user:`Arthur Mensch <arthurmensch>` and `Joel Nothman`_.
es_es: Mejoras de velocidad en :class:`model_selection.StratifiedShuffleSplit`. :issue:`5991` por :user:`Arthur Mensch <arthurmensch>` y `Joel Nothman`_.

source: Add ``shuffle`` parameter to :func:`model_selection.train_test_split`. :issue:`8845` by :user:`themrmax <themrmax>`
es_es: Añade el parámetro ``shuffle`` a :func:`model_selection.train_test_split`. :issue:`8845` por :user:`themrmax <themrmax>`

source: :class:`multioutput.MultiOutputRegressor` and :class:`multioutput.MultiOutputClassifier` now support online learning using ``partial_fit``. :issue: `8053` by :user:`Peng Yu <yupbank>`.
es_es: :class:`multioutput.MultiOutputRegressor` y :class:`multioutput.MultiOutputClassifier` ahora soportan el aprendizaje en línea usando ``partial_fit``. :issue: `8053` de :user:`Peng Yu <yupbank>`.

source: Add ``max_train_size`` parameter to :class:`model_selection.TimeSeriesSplit` :issue:`8282` by :user:`Aman Dalmia <dalmia>`.
es_es: Se añade el parámetro ``max_train_size`` a :class:`model_selection.TimeSeriesSplit` :issue:`8282` por :user:`Aman Dalmia <dalmia>`.

source: More clustering metrics are now available through :func:`metrics.get_scorer` and ``scoring`` parameters. :issue:`8117` by `Raghav RV`_.
es_es: Ahora hay más métricas de análisis de conglomerados disponibles a través de los parámetros :func:`metrics.get_scorer` y ``scoring``. :issue:`8117` de `Raghav RV`_.

source: A scorer based on :func:`metrics.explained_variance_score` is also available. :issue:`9259` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: También está disponible un puntuador basado en :func:`metrics.explained_variance_score`. :issue:`9259` por :user:`Hanmin Qin <qinhanmin2014>`.

source: Metrics
es_es: Métricas

source: :func:`metrics.matthews_corrcoef` now support multiclass classification. :issue:`8094` by :user:`Jon Crall <Erotemic>`.
es_es: :func:`metrics.matthews_corrcoef` ahora soporta la clasificación multiclase. :issue:`8094` por :user:`Jon Crall <Erotemic>`.

source: Add ``sample_weight`` parameter to :func:`metrics.cohen_kappa_score`. :issue:`8335` by :user:`Victor Poughon <vpoughon>`.
es_es: Se añade el parámetro ``sample_weight`` a :func:`metrics.cohen_kappa_score`. :issue:`8335` por :user:`Victor Poughon <vpoughon>`.

source: :func:`utils.check_estimator` now attempts to ensure that methods transform, predict, etc. do not set attributes on the estimator. :issue:`7533` by :user:`Ekaterina Krivich <kiote>`.
es_es: :func:`utils.check_estimator` ahora intenta asegurar que los métodos transform, predict, etc. no establecen atributos en el estimador. :issue:`7533` por :user:`Ekaterina Krivich <kiote>`.

source: Added type checking to the ``accept_sparse`` parameter in :mod:`utils.validation` methods. This parameter now accepts only boolean, string, or list/tuple of strings. ``accept_sparse=None`` is deprecated and should be replaced by ``accept_sparse=False``. :issue:`7880` by :user:`Josh Karnofsky <jkarno>`.
es_es: Se ha añadido la comprobación de tipo al parámetro ``accept_sparse`` en los métodos de :mod:`utils.validation`. Este parámetro ahora sólo acepta booleanos, cadenas o listas/tuplas de cadenas. ``accept_sparse=None`` está obsoleto y debe ser sustituido por ``accept_sparse=False``. :issue:`7880` por :user:`Josh Karnofsky <jkarno>`.

source: Make it possible to load a chunk of an svmlight formatted file by passing a range of bytes to :func:`datasets.load_svmlight_file`. :issue:`935` by :user:`Olivier Grisel <ogrisel>`.
es_es: Se posibilita la carga de una porción de un archivo con formato svmlight pasando un rango de bytes a :func:`datasets.load_svmlight_file`. :issue:`935` por :user:`Olivier Grisel <ogrisel>`.

source: :class:`dummy.DummyClassifier` and :class:`dummy.DummyRegressor` now accept non-finite features. :issue:`8931` by :user:`Attractadore`.
es_es: :class:`dummy.DummyClassifier` y :class:`dummy.DummyRegressor` ahora aceptan características no finitas. :issue:`8931` por :user:`Attractadore`.

source: Fixed a memory leak in trees when using trees with ``criterion='mae'``. :issue:`8002` by `Raghav RV`_.
es_es: Se ha corregido una fuga de memoria en los árboles cuando se utilizan árboles con ``criterion='mae'``. :issue:`8002` por `Raghav RV`_.

source: Fixed a bug where :class:`ensemble.IsolationForest` uses an an incorrect formula for the average path length :issue:`8549` by `Peter Wang <https://github.com/PTRWang>`_.
es_es: Se ha corregido un error por el que :class:`ensemble.IsolationForest` utiliza una fórmula incorrecta para la longitud media de la trayectoria :issue:`8549` de `Peter Wang <https://github.com/PTRWang>`_.

source: Fixed a bug where :class:`ensemble.AdaBoostClassifier` throws ``ZeroDivisionError`` while fitting data with single class labels. :issue:`7501` by :user:`Dominik Krzeminski <dokato>`.
es_es: Se ha corregido un error por el que :class:`ensemble.AdaBoostClassifier` lanza ``ZeroDivisionError`` al ajustar datos con etiquetas de una sola clase. :issue:`7501` por :user:`Dominik Krzeminski <dokato>`.

source: Fixed a bug in :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` where a float being compared to ``0.0`` using ``==`` caused a divide by zero error. :issue:`7970` by :user:`He Chen <chenhe95>`.
es_es: Se ha corregido un error en :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` por el que un número de punto flotante (float) que se comparaba con ``0.0`` utilizando ``==` provocaba un error de división por cero. :issue:`7970` por :user:`He Chen <chenhe95>`.

source: Fix a bug where :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` ignored the ``min_impurity_split`` parameter. :issue:`8006` by :user:`Sebastian Pölsterl <sebp>`.
es_es: Se corrige un error por el que :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` ignoraban el parámetro ``min_impurity_split``. :issue:`8006` por :user:`Sebastian Pölsterl <sebp>`.

source: Fixed ``oob_score`` in :class:`ensemble.BaggingClassifier`. :issue:`8936` by :user:`Michael Lewis <mlewis1729>`
es_es: Se ha corregido ``oob_score`` en :class:`ensemble.BaggingClassifier`. :issue:`8936` por :user:`Michael Lewis <mlewis1729>`.

source: Fixed excessive memory usage in prediction for random forests estimators. :issue:`8672` by :user:`Mike Benfield <mikebenfield>`.
es_es: Se ha corregido el uso excesivo de memoria en la predicción de los estimadores de bosques aleatorios. :issue:`8672` por :user:`Mike Benfield <mikebenfield>`.

source: Fixed a bug where ``sample_weight`` as a list broke random forests in Python 2 :issue:`8068` by :user:`xor`.
es_es: Se ha corregido un error por el que ``sample_weight`` como lista rompía los bosques aleatorios en Python 2 :issue:`8068` por :user:`xor`.

source: Fixed a bug where :class:`ensemble.IsolationForest` fails when ``max_features`` is less than 1. :issue:`5732` by :user:`Ishank Gulati <IshankGulati>`.
es_es: Se ha corregido un error por el que :class:`ensemble.IsolationForest` falla cuando ``max_features`` es menor que 1. :issue:`5732` por :user:`Ishank Gulati <IshankGulati>`.
