Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.19.po
Languages: es_es

source: Version 0.19.2
es_es: Versión 0.19

source: **July, 2018**
es_es: **Julio, 2018**

source: This release is exclusively in order to support Python 3.7.
es_es: Esta versión está destinada exclusivamente a soportar Python 3.7.

source: Related changes
es_es: Cambios relacionados

source: ``n_iter_`` may vary from previous releases in :class:`linear_model.LogisticRegression` with ``solver='lbfgs'`` and :class:`linear_model.HuberRegressor`. For Scipy <= 1.0.0, the optimizer could perform more than the requested maximum number of iterations. Now both estimators will report at most ``max_iter`` iterations even if more were performed. :issue:`10723` by `Joel Nothman`_.
es_es: ``n_iter_`` puede variar respecto a versiones anteriores en :class:`linear_model.LogisticRegression` con ``solver='lbfgs'`` y :class:`linear_model.HuberRegressor`. Para Scipy <= 1.0.0, el optimizador podía realizar más iteraciones que el número máximo solicitado. Ahora ambos estimadores informarán de un máximo de iteraciones ``max_iter`` aunque se hayan realizado más. :issue:`10723` by `Joel Nothman`_.

source: Version 0.19.1
es_es: Versión 0.19.1

source: **October 23, 2017**
es_es: **23 de octubre de 2017**

source: This is a bug-fix release with some minor documentation improvements and enhancements to features released in 0.19.0.
es_es: Esta es una versión de corrección de errores con algunas mejoras menores de documentación y mejoras a las características publicadas en 0.19.0.

source: Note there may be minor differences in TSNE output in this release (due to :issue:`9623`), in the case where multiple samples have equal distance to some sample.
es_es: Tenga en cuenta que puede haber diferencias menores en la salida TSNE en esta versión (debido a :issue:`9623`), en el caso en que múltiples muestras tengan la misma distancia a alguna muestra.

source: Changelog
es_es: Registro de cambios

source: API changes
es_es: Cambios del API

source: Reverted the addition of ``metrics.ndcg_score`` and ``metrics.dcg_score`` which had been merged into version 0.19.0 by error. The implementations were broken and undocumented.
es_es: Se revirtió la adición de ``metrics.ndcg_score`` y ``metrics.dcg_score`` que habían sido fusionados en la versión 0.19.0 por error. Las implementaciones tenían fallos y no estaban documentadas.

source: ``return_train_score`` which was added to :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV` and :func:`model_selection.cross_validate` in version 0.19.0 will be changing its default value from True to False in version 0.21. We found that calculating training score could have a great effect on cross validation runtime in some cases. Users should explicitly set ``return_train_score`` to False if prediction or scoring functions are slow, resulting in a deleterious effect on CV runtime, or to True if they wish to use the calculated scores. :issue:`9677` by :user:`Kumar Ashutosh <thechargedneutron>` and `Joel Nothman`_.
es_es: ``return_train_score`` que se añadió a :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV` y :func:`model_selection.cross_validate` en la versión 0.19.0 cambiará su valor por defecto de True a False en la versión 0.21. Hemos descubierto que el cálculo de la puntuación de entrenamiento podría tener un gran efecto en el tiempo de ejecución de la validación cruzada en algunos casos. Los usuarios deben establecer explícitamente ``return_train_score`` a False si las funciones de predicción o puntuación son lentas, lo que tiene un efecto perjudicial en el tiempo de ejecución de la CV, o a True si desean utilizar las puntuaciones calculadas. :issue:`9677` por :user:`Kumar Ashutosh <thechargedneutron>` y `Joel Nothman`_.

source: ``correlation_models`` and ``regression_models`` from the legacy gaussian processes implementation have been belatedly deprecated. :issue:`9717` by :user:`Kumar Ashutosh <thechargedneutron>`.
es_es: ``correlation_models`` y ``regression_models`` de anteriores implementaciones de procesos gaussianos han quedado obsoletos tardíamente. :issue:`9717` por :user:`Kumar Ashutosh <thechargedneutron>`.

source: Bug fixes
es_es: Corrección de errores

source: Avoid integer overflows in :func:`metrics.matthews_corrcoef`. :issue:`9693` by :user:`Sam Steingold <sam-s>`.
es_es: Evita desbordamientos de enteros en :func:`metrics.matthews_corrcoef`. :issue:`9693` por :user:`Sam Steingold <sam-s>`.

source: Fixed a bug in the objective function for :class:`manifold.TSNE` (both exact and with the Barnes-Hut approximation) when ``n_components >= 3``. :issue:`9711` by :user:`goncalo-rodrigues`.
es_es: Se ha corregido un error en la función objetivo de :class:`múltiple. SNE` (tanto exacta como con la aproximación de Barnes-Hut) cuando ``n_components >= 3``. :issue:`9711` por :user:`goncalo-rodrigues`.

source: Fix regression in :func:`model_selection.cross_val_predict` where it raised an error with ``method='predict_proba'`` for some probabilistic classifiers. :issue:`9641` by :user:`James Bourbeau <jrbourbeau>`.
es_es: Correge la regresión en :func:`model_selection.cross_val_predict` donde se reportó un error con ``method='predict_proba'` para algunos clasificadores probabilísticos. :issue:`9641` por :user:`James Bourbeau <jrbourbeau>`.

source: Fixed a bug where :func:`datasets.make_classification` modified its input ``weights``. :issue:`9865` by :user:`Sachin Kelkar <s4chin>`.
es_es: Se ha corregido un error donde :func:`datasets.make_classification` modificó su entrada ``weights``. :issue:`9865` por :user:`Sachin Kelkar <s4chin>`.

source: :class:`model_selection.StratifiedShuffleSplit` now works with multioutput multiclass or multilabel data with more than 1000 columns. :issue:`9922` by :user:`Charlie Brummitt <crbrummitt>`.
es_es: :class:`model_selection.StratifiedShuffleSplit` ahora funciona con datos de múltiples salidas, multiclase o multietiqueta con más de 1000 columnas. :issue:`9922` por :user:`Charlie Brummitt <crbrummitt>`.

source: Fixed a bug with nested and conditional parameter setting, e.g. setting a pipeline step and its parameter at the same time. :issue:`9945` by `Andreas Müller`_ and `Joel Nothman`_.
es_es: Se ha corregido un error con la configuración de parámetros anidados y condicionales, por ejemplo, al asignar un paso del pipeline y su parámetro al mismo tiempo. :issue:`9945` por `Andreas Müller`_ y `Joel Nothman`_.

source: Regressions in 0.19.0 fixed in 0.19.1:
es_es: Regresiones en 0.19.0 corregidas en 0.19.1:

source: Fixed a bug where parallelised prediction in random forests was not thread-safe and could (rarely) result in arbitrary errors. :issue:`9830` by `Joel Nothman`_.
es_es: Se ha corregido un error por el que la predicción paralela en los bosques aleatorios no era segura para los hilos y podía (raramente) dar lugar a errores arbitrarios. :issue:`9830` por `Joel Nothman`_.

source: Fix regression in :func:`model_selection.cross_val_predict` where it no longer accepted ``X`` as a list. :issue:`9600` by :user:`Rasul Kerimov <CoderINusE>`.
es_es: Corrige la regresión en :func:`model_selection.cross_val_predict` donde ya no aceptaba ``X`` como lista. :issue:`9600` por :user:`Rasul Kerimov <CoderINusE>`.

source: Fixed handling of :func:`cross_val_predict` for binary classification with ``method='decision_function'``. :issue:`9593` by :user:`Reiichiro Nakano <reiinakano>` and core devs.
es_es: Se ha corregido el manejo de :func:`cross_val_predict` para la clasificación binaria con ``method='decision_function'``. :issue:`9593` por :user:`Reiichiro Nakano <reiinakano>` y los desarrolladores principales.

source: Fix regression in :class:`pipeline.Pipeline` where it no longer accepted ``steps`` as a tuple. :issue:`9604` by :user:`Joris Van den Bossche <jorisvandenbossche>`.
es_es: Corrige la regresión en :class:`pipeline.Pipeline` donde ya no aceptaba ``steps`` como tupla. :issue:`9604` por :user:`Joris Van den Bossche <jorisvandenbossche>`.

source: Fix bug where ``n_iter`` was not properly deprecated, leaving ``n_iter`` unavailable for interim use in :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` and :class:`linear_model.Perceptron`. :issue:`9558` by `Andreas Müller`_.
es_es: Se ha corregido un error por el que ``n_iter`` no estaba correctamente obsoleto, lo que hacía que ``n_iter`` no estuviera disponible para su uso provisional en :class:`linear_model.SGDClassifier`, :class:`linear_model. SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` y :class:`linear_model.Perceptron`. :issue:`9558` por `Andreas Müller`_.

source: Dataset fetchers make sure temporary files are closed before removing them, which caused errors on Windows. :issue:`9847` by :user:`Joan Massich <massich>`.
es_es: Los recuperadores de conjuntos de datos se aseguran de cerrar los archivos temporales antes de eliminarlos, lo que provocaba errores en Windows. :issue:`9847` por :user:`Joan Massich <massich>`.

source: Fixed a regression in :class:`manifold.TSNE` where it no longer supported metrics other than 'euclidean' and 'precomputed'. :issue:`9623` by :user:`Oli Blum <oliblum90>`.
es_es: Se ha corregido una regresión en :class:`manifold.TSNE` por la que ya no soportaba métricas distintas de 'euclidian' y 'precomputed'. :issue:`9623` por :user:`Oli Blum <oliblum90>`.

source: Enhancements
es_es: Mejoras

source: Our test suite and :func:`utils.estimator_checks.check_estimators` can now be run without Nose installed. :issue:`9697` by :user:`Joan Massich <massich>`.
es_es: Nuestro conjunto de pruebas y :func:`utils.estimator_checks.check_estimators` ahora pueden ejecutarse sin Nose instalado. :issue:`9697` por :user:`Joan Massich <massich>`.

source: To improve usability of version 0.19's :class:`pipeline.Pipeline` caching, ``memory`` now allows ``joblib.Memory`` instances. This make use of the new :func:`utils.validation.check_memory` helper. issue:`9584` by :user:`Kumar Ashutosh <thechargedneutron>`
es_es: Para mejorar la usabilidad del almacenamiento en caché :class:`pipeline.Pipeline` de la versión 0.19, ``memory`` permite ahora instancias de ``joblib.Memory``. Para ello se utiliza la nueva :func:`utils.validation.check_memory` helper. issue:`9584` by :user:`Kumar Ashutosh <thechargedneutron>`

source: Some fixes to examples: :issue:`9750`, :issue:`9788`, :issue:`9815`
es_es: Algunas correcciones a los ejemplos: :issue:`9750`, :issue:`9788`, :issue:`9815`

source: Made a FutureWarning in SGD-based estimators less verbose. :issue:`9802` by :user:`Vrishank Bhardwaj <vrishank97>`.
es_es: Se ha hecho menos detallado el FutureWarning en los estimadores basados en SGD. :issue:`9802` por :user:`Vrishank Bhardwaj <vrishank97>`.

source: Code and Documentation Contributors
es_es: Colaboradores de código y documentación

source: With thanks to:
es_es: Con agradecimiento a:

source: Version 0.19
es_es: Versión 0.19

source: **August 12, 2017**
es_es: **12 de agosto de 2017**

source: Highlights
es_es: Destacados

source: We are excited to release a number of great new features including :class:`neighbors.LocalOutlierFactor` for anomaly detection, :class:`preprocessing.QuantileTransformer` for robust feature transformation, and the :class:`multioutput.ClassifierChain` meta-estimator to simply account for dependencies between classes in multilabel problems. We have some new algorithms in existing estimators, such as multiplicative update in :class:`decomposition.NMF` and multinomial :class:`linear_model.LogisticRegression` with L1 loss (use ``solver='saga'``).
es_es: Estamos muy contentos de lanzar una serie de nuevas características, incluyendo :class:`neighbors.LocalOutlierFactor` para la detección de anomalías, :class:`preprocessing.QuantileTransformer` para la transformación robusta de características, y el meta-estimador :class:`multioutput.ClassifierChain` para tener en cuenta de forma sencilla las dependencias entre las clases en los problemas multietiqueta. Tenemos algunos algoritmos nuevos en los estimadores existentes, como la actualización multiplicativa en :class:`decomposition.NMF` y la :class:`linear_model.LogisticRegression` multinomial con pérdida L1 (utilice ``solver='saga``).

source: Cross validation is now able to return the results from multiple metric evaluations. The new :func:`model_selection.cross_validate` can return many scores on the test data as well as training set performance and timings, and we have extended the ``scoring`` and ``refit`` parameters for grid/randomized search :ref:`to handle multiple metrics <multimetric_grid_search>`.
es_es: La validación cruzada es ahora capaz de devolver los resultados de múltiples evaluaciones métricas. La nueva :func:`model_selection.cross_validate` puede devolver muchas puntuaciones en los datos de prueba, así como el rendimiento y los tiempos del conjunto de entrenamiento, y hemos ampliado los parámetros ``scoring`` y ``refit`` para la búsqueda cuadriculada/aleatoria :ref:`para manejar métricas múltiples <multimetric_grid_search>`.

source: You can also learn faster. For instance, the :ref:`new option to cache transformations <pipeline_cache>` in :class:`pipeline.Pipeline` makes grid search over pipelines including slow transformations much more efficient. And you can predict faster: if you're sure you know what you're doing, you can turn off validating that the input is finite using :func:`config_context`.
es_es: También puedes aprender más rápido. Por ejemplo, la :ref:`nueva opción a las transformaciones de caché <pipeline_cache>` en :class:`pipeline.Pipeline` hace la búsqueda de cuadrícula sobre tuberías incluyendo transformaciones lentas mucho más eficiente. Y puedes predecir más rápido: si estás seguro de lo que estás haciendo, puedes desactivar validando que la entrada es finita usando :func:`config_context`.

source: We've made some important fixes too. We've fixed a longstanding implementation error in :func:`metrics.average_precision_score`, so please be cautious with prior results reported from that function. A number of errors in the :class:`manifold.TSNE` implementation have been fixed, particularly in the default Barnes-Hut approximation. :class:`semi_supervised.LabelSpreading` and :class:`semi_supervised.LabelPropagation` have had substantial fixes. LabelPropagation was previously broken. LabelSpreading should now correctly respect its alpha parameter.
es_es: También hemos realizado algunas correcciones importantes. Hemos solucionado un antiguo error de implementación en :func:`metrics.average_precision_score`, así que tenga cuidado con los resultados anteriores reportados por esa función. Se han corregido varios errores en la implementación de :class:`manifold.TSNE`, especialmente en la aproximación por defecto de Barnes-Hut. Se han corregido sustancialmente :class:`semi_supervised.LabelSpreading` y :class:`semi_supervised.LabelPropagation`. LabelPropagation no funcionaba antes. LabelSpreading debería ahora respetar correctamente su parámetro alfa.

source: Changed models
es_es: Modelos modificados

source: The following estimators and functions, when fit with the same data and parameters, may produce different models from the previous version. This often occurs due to changes in the modelling logic (bug fixes or enhancements), or in random sampling procedures.
es_es: Los siguientes estimadores y funciones, cuando ajustan a los mismos datos y parámetros, pueden producir diferentes modelos que en la versión anterior. Esto ocurre a menudo debido a cambios en la lógica de modelado (correcciones de errores o mejoras), o en procedimientos de muestreo aleatorio.

source: :class:`cluster.KMeans` with sparse X and initial centroids given (bug fix)
es_es: :class:`cluster.KMeans` con X disperso y centroides iniciales dados (corrección de errores)

source: :class:`cross_decomposition.PLSRegression` with ``scale=True`` (bug fix)
es_es: :class:`cross_decomposition.PLSRegression` con ``scale=True`` (corrección de errores)

source: :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` where ``min_impurity_split`` is used (bug fix)
es_es: :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` donde ``min_impurity_split`` es usado (corrección de errores)

source: gradient boosting ``loss='quantile'`` (bug fix)
es_es: potenciación de gradiente ``loss='quantile'`` (corrección de errores)

source: :class:`ensemble.IsolationForest` (bug fix)
es_es: :class:`ensemble.IsolationForest` (corrección de errores)

source: :class:`feature_selection.SelectFdr` (bug fix)
es_es: :class:`feature_selection.SelectFdr` (corrección de errores)

source: :class:`linear_model.RANSACRegressor` (bug fix)
es_es: :class:`linear_model.RANSACRegressor` (corrección de errores)

source: :class:`linear_model.LassoLars` (bug fix)
es_es: :class:`linear_model.LassoLars` (corrección de errores)

source: :class:`linear_model.LassoLarsIC` (bug fix)
es_es: :class:`linear_model.LassoLarsIC` (corrección de errores)

source: :class:`manifold.TSNE` (bug fix)
es_es: :class:`manifold.TSNE` (corrección de errores)

source: :class:`neighbors.NearestCentroid` (bug fix)
es_es: :class:`neighbors.NearestCentroid` (corrección de errores)

source: :class:`semi_supervised.LabelSpreading` (bug fix)
es_es: :class:`semi_supervised.LabelSpreading` (corrección de errores)

source: :class:`semi_supervised.LabelPropagation` (bug fix)
es_es: :class:`semi_supervised.LabelPropagation` (corrección de errores)

source: tree based models where ``min_weight_fraction_leaf`` is used (enhancement)
es_es: modelos basados en árboles donde se utiliza ``min_weight_fraction_leaf`` (mejora)

source: :class:`model_selection.StratifiedKFold` with ``shuffle=True`` (this change, due to :issue:`7823` was not mentioned in the release notes at the time)
es_es: :class:`model_selection.StratifiedKFold` con ``shuffle=True`` (este cambio, debido a :issue:`7823` no fue mencionado en las notas de lanzamiento en ese momento)

source: Details are listed in the changelog below.
es_es: Los detalles están listados en el registro de cambios a continuación.

source: (While we are trying to better inform users by providing this information, we cannot assure that this list is complete.)
es_es: (Mientras intentamos informar mejor a los usuarios proporcionando esta información, no podemos asegurar que esta lista esté completa.)

source: New features
es_es: Nuevas características

source: Classifiers and regressors
es_es: Clasificadores y regresores

source: Added :class:`multioutput.ClassifierChain` for multi-label classification. By :user:`Adam Kleczewski <adamklec>`.
es_es: Se añadió :class:`multioutput.ClassifierChain` para clasificación multietiqueta. Por :user:`Adam Kleczewski <adamklec>`.

source: Added solver ``'saga'`` that implements the improved version of Stochastic Average Gradient, in :class:`linear_model.LogisticRegression` and :class:`linear_model.Ridge`. It allows the use of L1 penalty with multinomial logistic loss, and behaves marginally better than 'sag' during the first epochs of ridge and logistic regression. :issue:`8446` by `Arthur Mensch`_.
es_es: Añadido el solucionador ``'saga`` que implementa la versión mejorada del Gradiente Promedio Estocástico, en :class:`linear_model.LogisticRegression` y :class:`linear_model.Ridge`. Permite el uso de la penalización L1 con pérdida logística multinomial, y se comporta marginalmente mejor que `sag` durante los primeros epochs de la regresión de cresta y logística. :issue:`8446` por `Arthur Mensch`_.

source: Other estimators
es_es: Otros Estimadores

source: Added the :class:`neighbors.LocalOutlierFactor` class for anomaly detection based on nearest neighbors. :issue:`5279` by `Nicolas Goix`_ and `Alexandre Gramfort`_.
es_es: Se ha añadido la clase :class:`neighbors.LocalOutlierFactor` para detección de anomalías basada en vecinos más cercanos. :issue:`5279` por `Nicolas Goix`_ y `Alexandre Gramfort`_.

source: Added :class:`preprocessing.QuantileTransformer` class and :func:`preprocessing.quantile_transform` function for features normalization based on quantiles. :issue:`8363` by :user:`Denis Engemann <dengemann>`, :user:`Guillaume Lemaitre <glemaitre>`, `Olivier Grisel`_, `Raghav RV`_, :user:`Thierry Guillemot <tguillemot>`, and `Gael Varoquaux`_.
es_es: Se añadió la clase :class:`preprocessing.QuantileTransformer` y la función :func:`preprocessing.quantile_transform` para normalizar características basadas en cuantiles. :issue:`8363` por :user:`Denis Engemann <dengemann>`, :user:`Guillaume Lemaitre <glemaitre>`, `Olivier Grisel`_, `Raghav RV`_, :user:`Thierry Guillemot <tguillemot>`, y `Gael Varoquaux`_.

source: The new solver ``'mu'`` implements a Multiplicate Update in :class:`decomposition.NMF`, allowing the optimization of all beta-divergences, including the Frobenius norm, the generalized Kullback-Leibler divergence and the Itakura-Saito divergence. :issue:`5295` by `Tom Dupre la Tour`_.
es_es: El nuevo solucionador ``'mu'`` implementa una Actualización Multiplicada en :class:`descomposición. MF`, permitiendo la optimización de todas las beta-divergencias, incluyendo la norma Frobenius, la divergencia Kullback-Leibler generalizada y la divergencia Itakura-Saito. :issue:`5295` por `Tom Dupre la Tour`_.

source: Model selection and evaluation
es_es: Selección y evaluación de modelos

source: :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` now support simultaneous evaluation of multiple metrics. Refer to the :ref:`multimetric_grid_search` section of the user guide for more information. :issue:`7388` by `Raghav RV`_
es_es: :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` ahora soportan la evaluación simultánea de múltiples métricas. Consulte la sección :ref:`multimetric_grid_search` del manual del usuario para más información. :issue:`7388` por `Raghav RV`_

source: Added the :func:`model_selection.cross_validate` which allows evaluation of multiple metrics. This function returns a dict with more useful information from cross-validation such as the train scores, fit times and score times. Refer to :ref:`multimetric_cross_validation` section of the userguide for more information. :issue:`7388` by `Raghav RV`_
es_es: Se añadió :func:`model_selection.cross_validate` que permite la evaluación de múltiples métricas. Esta función devuelve un dict con información más útil de la validación cruzada como las puntuaciones de entrenamiento, los tiempos de ajuste y los tiempos de puntuación. Consulte la sección :ref:`multimetric_cross_validation` del manual del usuario para más información. :issue:`7388` por `Raghav RV`_

source: Added :func:`metrics.mean_squared_log_error`, which computes the mean square error of the logarithmic transformation of targets, particularly useful for targets with an exponential trend. :issue:`7655` by :user:`Karan Desai <karandesai-96>`.
es_es: Se añadió :func:`metrics.mean_squared_log_error`, que calcula el error cuadrático medio de la transformación logarítmica de los objetivos, particularmente útil para objetivos con una tendencia exponencial. :issue:`7655` por :user:`Karan Desai <karandesai-96>`.

source: Added :func:`metrics.dcg_score` and :func:`metrics.ndcg_score`, which compute Discounted cumulative gain (DCG) and Normalized discounted cumulative gain (NDCG). :issue:`7739` by :user:`David Gasquez <davidgasquez>`.
es_es: Se añadieron :func:`metrics.dcg_score` y :func:`metrics.ndcg_score`, que calculan la ganancia acumulativa descontada (DCG) y la ganancia acumulativa descontada normalizada (NDCG). :issue:`7739` por :user:`David Gasquez <davidgasquez>`.
