Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.19.po
Languages: es_es

source: Fix a bug where gradient boosting with ``loss='quantile'`` computed negative errors for negative values of ``ytrue - ypred`` leading to wrong values when calling ``__call__``. :issue:`8087` by :user:`Alexis Mignon <AlexisMignon>`
es_es: Se corrige un error por el que la potenciación del gradiente con ``loss='quantile'`` calculaba errores negativos para valores negativos de ``ytrue - ypred`` lo que conducía a valores erróneos al llamar a ``__call__``. :issue:`8087` por :user:`Alexis Mignon <AlexisMignon>`.

source: Fix a bug where :class:`ensemble.VotingClassifier` raises an error when a numpy array is passed in for weights. :issue:`7983` by :user:`Vincent Pham <vincentpham1991>`.
es_es: Se corrige un error por el que :class:`ensemble.VotingClassifier` genera un error cuando se pasa un arreglo numpy para las ponderaciones. :issue:`7983` por :user:`Vincent Pham <vincentpham1991>`.

source: Fixed a bug where :func:`tree.export_graphviz` raised an error when the length of features_names does not match n_features in the decision tree. :issue:`8512` by :user:`Li Li <aikinogard>`.
es_es: Se ha corregido un error por el que :func:`tree.export_graphviz` generaba un error cuando la longitud de features_names no coincidía con n_features en el árbol de decisión. :issue:`8512` por :user:`Li Li <aikinogard>`.

source: Fixed a bug where :func:`linear_model.RANSACRegressor.fit` may run until ``max_iter`` if it finds a large inlier group early. :issue:`8251` by :user:`aivision2020`.
es_es: Se ha corregido un error por el que :func:`linear_model.RANSACRegressor.fit` podía ejecutarse hasta ``max_iter`` si encontraba un grupo inlier grande anticipadamente. :issue:`8251` por :user:`aivision2020`.

source: Fixed a bug where :class:`naive_bayes.MultinomialNB` and :class:`naive_bayes.BernoulliNB` failed when ``alpha=0``. :issue:`5814` by :user:`Yichuan Liu <yl565>` and :user:`Herilalaina Rakotoarison <herilalaina>`.
es_es: Se ha corregido un error por el que :class:`naive_bayes.MultinomialNB` y :class:`naive_bayes.BernoulliNB` fallaban cuando ``alpha=0``. :issue:`5814` por :user:`Yichuan Liu <yl565>` y :user:`Herilalaina Rakotoarison <herilalaina>`.

source: Fixed a bug where :class:`linear_model.LassoLars` does not give the same result as the LassoLars implementation available in R (lars library). :issue:`7849` by :user:`Jair Montoya Martinez <jmontoyam>`.
es_es: Se ha corregido un error por el que :class:`linear_model.LassoLars` no daba el mismo resultado que la implementación de LassoLars disponible en R (biblioteca lars). :issue:`7849` por :user:`Jair Montoya Martinez <jmontoyam>`.

source: Fixed a bug in :class:`linear_model.RandomizedLasso`, :class:`linear_model.Lars`, :class:`linear_model.LassoLars`, :class:`linear_model.LarsCV` and :class:`linear_model.LassoLarsCV`, where the parameter ``precompute`` was not used consistently across classes, and some values proposed in the docstring could raise errors. :issue:`5359` by `Tom Dupre la Tour`_.
es_es: Se ha corregido un error en :class:`linear_model.RandomizedLasso`, :class:`linear_model.Lars`, :class:`linear_model.LassoLars`, :class:`linear_model.LarsCV` y :class:`linear_model. LassoLarsCV`, donde el parámetro ``precompute`` no se utilizaba de forma consistente en todas las clases, y algunos valores propuestos en la cadena de documentación podían generar errores. :issue:`5359` por `Tom Dupre la Tour`_.

source: Fix inconsistent results between :class:`linear_model.RidgeCV` and :class:`linear_model.Ridge` when using ``normalize=True``. :issue:`9302` by `Alexandre Gramfort`_.
es_es: Se corrigen resultados inconsistentes entre :class:`linear_model.RidgeCV` y :class:`linear_model.Ridge` cuando se utiliza ``normalize=True``. :issue:`9302` por `Alexandre Gramfort`_.

source: Fix a bug where :func:`linear_model.LassoLars.fit` sometimes left ``coef_`` as a list, rather than an ndarray. :issue:`8160` by :user:`CJ Carey <perimosocordiae>`.
es_es: Se corrige un error por el que :func:`linear_model.LassoLars.fit` a veces dejaba ``coef_`` como una lista, en lugar de un ndarray. :issue:`8160` por :user:`CJ Carey <perimosocordiae>`.

source: Fix :func:`linear_model.BayesianRidge.fit` to return ridge parameter ``alpha_`` and ``lambda_`` consistent with calculated coefficients ``coef_`` and ``intercept_``. :issue:`8224` by :user:`Peter Gedeck <gedeck>`.
es_es: Se corrige :func:`linear_model.BayesianRidge.fit` para que devuelva el parámetro de cresta (ridge) ``alpha_`` y ``lambda_`` consistentes con los coeficientes calculados ``coef_`` e ``intercept_``. :issue:`8224` por :user:`Peter Gedeck <gedeck>`.

source: Fixed a bug in :class:`svm.OneClassSVM` where it returned floats instead of integer classes. :issue:`8676` by :user:`Vathsala Achar <VathsalaAchar>`.
es_es: Se ha corregido un error en :class:`svm.OneClassSVM` por el que devolvía números de punto flotante (floats) en lugar de clases enteras. :issue:`8676` por :user:`Vathsala Achar <VathsalaAchar>`.

source: Fix AIC/BIC criterion computation in :class:`linear_model.LassoLarsIC`. :issue:`9022` by `Alexandre Gramfort`_ and :user:`Mehmet Basbug <mehmetbasbug>`.
es_es: Se corrige el cálculo del criterio AIC/BIC en :class:`linear_model.LassoLarsIC`. :issue:`9022` por `Alexandre Gramfort`_ y :user:`Mehmet Basbug <mehmetbasbug>`.

source: Fixed a memory leak in our LibLinear implementation. :issue:`9024` by :user:`Sergei Lebedev <superbobry>`
es_es: Se ha corregido una fuga de memoria en nuestra implementación de LibLinear. :issue:`9024` por :user:`Sergei Lebedev <superbobry>`.

source: Fix bug where stratified CV splitters did not work with :class:`linear_model.LassoCV`. :issue:`8973` by :user:`Paulo Haddad <paulochf>`.
es_es: Se corrige un error por el que los separadores de CV estratificados no funcionaban con :class:`linear_model.LassoCV`. :issue:`8973` por :user:`Paulo Haddad <paulochf>`.

source: Fixed a bug in :class:`gaussian_process.GaussianProcessRegressor` when the standard deviation and covariance predicted without fit would fail with a unmeaningful error by default. :issue:`6573` by :user:`Quazi Marufur Rahman <qmaruf>` and `Manoj Kumar`_.
es_es: Se ha corregido un error en :class:`gaussian_process.GaussianProcessRegressor` cuando la desviación estándar y la covarianza predichas sin ajuste fallaban con un error no significativo por defecto. :issue:`6573` por :user:`Quazi Marufur Rahman <qmaruf>` y `Manoj Kumar`_.

source: Fix :class:`semi_supervised.BaseLabelPropagation` to correctly implement ``LabelPropagation`` and ``LabelSpreading`` as done in the referenced papers. :issue:`9239` by :user:`Andre Ambrosio Boechat <boechat107>`, :user:`Utkarsh Upadhyay <musically-ut>`, and `Joel Nothman`_.
es_es: Se corrige :class:`semi_supervised.BaseLabelPropagation` para implementar correctamente ``LabelPropagation`` y ``LabelSpreading`` como se hace en los documentos referenciados. :issue:`9239` por :user:`Andre Ambrosio Boechat <boechat107>`, :user:`Utkarsh Upadhyay <musically-ut>` y `Joel Nothman`_.

source: Fixed the implementation of :class:`manifold.TSNE`:
es_es: Se ha corregido la implementación de :class:`manifold.TSNE`:

source: ``early_exageration`` parameter had no effect and is now used for the first 250 optimization iterations.
es_es: El parámetro ``early_exageration`` no tenía efecto y ahora se utiliza para las primeras 250 iteraciones de optimización.

source: Fixed the ``AssertionError: Tree consistency failed`` exception reported in :issue:`8992`.
es_es: Se ha corregido la excepción ``AssertionError: Tree consistency failed``, reportada en :issue:`8992`.

source: Improve the learning schedule to match the one from the reference implementation `lvdmaaten/bhtsne <https://github.com/lvdmaaten/bhtsne>`_. by :user:`Thomas Moreau <tomMoral>` and `Olivier Grisel`_.
es_es: Se mejora el programa de aprendizaje para que coincida con el de la implementación de referencia `lvdmaaten/bhtsne <https://github.com/lvdmaaten/bhtsne>`_. Por :user:`Thomas Moreau <tomMoral>` y `Olivier Grisel`_.

source: Fix a bug in :class:`decomposition.LatentDirichletAllocation` where the ``perplexity`` method was returning incorrect results because the ``transform`` method returns normalized document topic distributions as of version 0.18. :issue:`7954` by :user:`Gary Foreman <garyForeman>`.
es_es: Se corrige un error en :class:`decomposition.LatentDirichletAllocation` por el que el método ``perplexity`` devolvía resultados incorrectos porque el método ``transform`` devuelve distribuciones de temas de documentos normalizadas a partir de la versión 0.18. :issue:`7954` por :user:`Gary Foreman <garyForeman>`.

source: Fix output shape and bugs with n_jobs > 1 in :class:`decomposition.SparseCoder` transform and :func:`decomposition.sparse_encode` for one-dimensional data and one component. This also impacts the output shape of :class:`decomposition.DictionaryLearning`. :issue:`8086` by `Andreas Müller`_.
es_es: Se corrige la forma de salida y los errores con n_jobs > 1 en la transformación :class:`decomposition.SparseCoder` y :func:`decomposition.sparse_encode` para datos unidimensionales y un componente. Esto también afecta a la forma de salida de :class:`decomposition.DictionaryLearning`. :issue:`8086` por `Andreas Müller`_.

source: Fixed the implementation of ``explained_variance_`` in :class:`decomposition.PCA`, :class:`decomposition.RandomizedPCA` and :class:`decomposition.IncrementalPCA`. :issue:`9105` by `Hanmin Qin <https://github.com/qinhanmin2014>`_.
es_es: Se ha corregido la implementación de ``explained_variance_`` en :class:`decomposition.PCA`, :class:`decomposition.RandomizedPCA` y :class:`decomposition.IncrementalPCA`. :issue:`9105` por `Hanmin Qin <https://github.com/qinhanmin2014>`_.

source: Fixed the implementation of ``noise_variance_`` in :class:`decomposition.PCA`. :issue:`9108` by `Hanmin Qin <https://github.com/qinhanmin2014>`_.
es_es: Se ha corregido la implementación de ``noise_variance_`` en :class:`decomposition.PCA`. :issue:`9108` por `Hanmin Qin <https://github.com/qinhanmin2014>`_.

source: Fixed a bug where :class:`cluster.DBSCAN` gives incorrect result when input is a precomputed sparse matrix with initial rows all zero. :issue:`8306` by :user:`Akshay Gupta <Akshay0724>`
es_es: Se ha corregido un error por el que :class:`cluster.DBSCAN` daba un resultado incorrecto cuando la entrada era una matriz dispersa precalculada con filas iniciales todas en cero. :issue:`8306` por :user:`Akshay Gupta <Akshay0724>`.

source: Fix a bug regarding fitting :class:`cluster.KMeans` with a sparse array X and initial centroids, where X's means were unnecessarily being subtracted from the centroids. :issue:`7872` by :user:`Josh Karnofsky <jkarno>`.
es_es: Se corrige un error relacionado con el ajuste de :class:`cluster.KMeans` con una matriz dispersa X y centroides iniciales, donde las medias de X se restaban innecesariamente de los centroides. :issue:`7872` por :user:`Josh Karnofsky <jkarno>`.

source: Fixes to the input validation in :class:`covariance.EllipticEnvelope`. :issue:`8086` by `Andreas Müller`_.
es_es: Se hacen correcciones a la validación de entradas en :class:`covariance.EllipticEnvelope`. :issue:`8086` por `Andreas Müller`_.

source: Fixed a bug in :class:`covariance.MinCovDet` where inputting data that produced a singular covariance matrix would cause the helper method ``_c_step`` to throw an exception. :issue:`3367` by :user:`Jeremy Steward <ThatGeoGuy>`
es_es: Se ha corregido un error en :class:`covariance.MinCovDet` por el que la introducción de datos que producía una matriz de covarianzas singular provocaba que el método ayudante ``_c_step`` lanzara una excepción. :issue:`3367` por :user:`Jeremy Steward <ThatGeoGuy>`.

source: Fixed a bug in :class:`manifold.TSNE` affecting convergence of the gradient descent. :issue:`8768` by :user:`David DeTomaso <deto>`.
es_es: Se ha corregido un error en :class:`manifold.TSNE` que afectaba a la convergencia del descenso de gradiente. :issue:`8768` por :user:`David DeTomaso <deto>`.

source: Fixed a bug in :class:`manifold.TSNE` where it stored the incorrect ``kl_divergence_``. :issue:`6507` by :user:`Sebastian Saeger <ssaeger>`.
es_es: Se ha corregido un error en :class:`manifold.TSNE` donde se almacenaba la ``kl_divergence_`` incorrecta. :issue:`6507` por :user:`Sebastian Saeger <ssaeger>`.

source: Fixed improper scaling in :class:`cross_decomposition.PLSRegression` with ``scale=True``. :issue:`7819` by :user:`jayzed82 <jayzed82>`.
es_es: Se ha corregido el escalamiento incorrecto en :class:`cross_decomposition.PLSRegression` con ``scale=True``. :issue:`7819` por :user:`jayzed82 <jayzed82>`.

source: :class:`cluster.bicluster.SpectralCoclustering` and :class:`cluster.bicluster.SpectralBiclustering` ``fit`` method conforms with API by accepting ``y`` and returning the object. :issue:`6126`, :issue:`7814` by :user:`Laurent Direr <ldirer>` and :user:`Maniteja Nandana <maniteja123>`.
es_es: El método ``fit` de :class:`cluster.bicluster.SpectralCoclustering` y :class:`cluster.bicluster.SpectralBiclustering` se ajusta a la API aceptando ``y`` y devolviendo el objeto. :issue:`6126`, :issue:`7814` por :user:`Laurent Direr <ldirer>` y :user:`Maniteja Nandana <maniteja123>`.

source: Fix bug where :mod:`mixture` ``sample`` methods did not return as many samples as requested. :issue:`7702` by :user:`Levi John Wolf <ljwolf>`.
es_es: Se corrige un error por el que los métodos ``sample`` de :mod:`mixture` no devolvían tantas muestras como se pedía. :issue:`7702` por :user:`Levi John Wolf <ljwolf>`.

source: Fixed the shrinkage implementation in :class:`neighbors.NearestCentroid`. :issue:`9219` by `Hanmin Qin <https://github.com/qinhanmin2014>`_.
es_es: Se ha corregido la implementación de la contracción en :class:`neighbors.NearestCentroid`. :issue:`9219` por `Hanmin Qin <https://github.com/qinhanmin2014>`_.

source: For sparse matrices, :func:`preprocessing.normalize` with ``return_norm=True`` will now raise a ``NotImplementedError`` with 'l1' or 'l2' norm and with norm 'max' the norms returned will be the same as for dense matrices. :issue:`7771` by `Ang Lu <https://github.com/luang008>`_.
es_es: Para las matrices dispersas, :func:`preprocessing.normalize` con ``return_norm=True`` ahora lanzará un ``NotImplementedError`` con norma 'l1' o 'l2' y con norma 'max' las normas devueltas serán las mismas que para las matrices densas. :issue:`7771` por `Ang Lu <https://github.com/luang008>`_.

source: Fix a bug where :class:`feature_selection.SelectFdr` did not exactly implement Benjamini-Hochberg procedure. It formerly may have selected fewer features than it should. :issue:`7490` by :user:`Peng Meng <mpjlu>`.
es_es: Se corrige un error por el que :class:`feature_selection.SelectFdr` no implementaba exactamente el procedimiento Benjamini-Hochberg. Es posible que antes haya seleccionado menos características de las que debería. :issue:`7490` por :user:`Peng Meng <mpjlu>`.

source: Fixed a bug where :class:`linear_model.RandomizedLasso` and :class:`linear_model.RandomizedLogisticRegression` breaks for sparse input. :issue:`8259` by :user:`Aman Dalmia <dalmia>`.
es_es: Se ha corregido un error por el que :class:`linear_model.RandomizedLasso` y :class:`linear_model.RandomizedLogisticRegression` se rompían para entradas dispersas. :issue:`8259` por :user:`Aman Dalmia <dalmia>`.

source: Fix a bug where :class:`feature_extraction.FeatureHasher` mandatorily applied a sparse random projection to the hashed features, preventing the use of :class:`feature_extraction.text.HashingVectorizer` in a pipeline with :class:`feature_extraction.text.TfidfTransformer`. :issue:`7565` by :user:`Roman Yurchak <rth>`.
es_es: Se corrige un error por el que :class:`feature_extraction.FeatureHasher` aplicaba obligatoriamente una proyección aleatoria dispersa a las características con hash, impidiendo el uso de :class:`feature_extraction.text.HashingVectorizer` en un pipeline con :class:`feature_extraction.text.TfidfTransformer`. :issue:`7565` por :user:`Roman Yurchak <rth>`.

source: Fix a bug where :class:`feature_selection.mutual_info_regression` did not correctly use ``n_neighbors``. :issue:`8181` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: Se corrige un error por el que :class:`feature_selection.mutual_info_regression` no utilizaba correctamente ``n_neighbors``. :issue:`8181` por :user:`Guillaume Lemaitre <glemaitre>`.

source: Fixed a bug where :func:`model_selection.BaseSearchCV.inverse_transform` returns ``self.best_estimator_.transform()`` instead of ``self.best_estimator_.inverse_transform()``. :issue:`8344` by :user:`Akshay Gupta <Akshay0724>` and :user:`Rasmus Eriksson <MrMjauh>`.
es_es: Se ha corregido un error por el que :func:`model_selection.BaseSearchCV.inverse_transform` devolvía ``self.best_estimator_.transform()`` en lugar de ``self.best_estimator_.inverse_transform()``. :issue:`8344` por :user:`Akshay Gupta <Akshay0724>` y :user:`Rasmus Eriksson <MrMjauh>`.

source: Added ``classes_`` attribute to :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV`, :class:`grid_search.GridSearchCV`, and :class:`grid_search.RandomizedSearchCV` that matches the ``classes_`` attribute of ``best_estimator_``. :issue:`7661` and :issue:`8295` by :user:`Alyssa Batula <abatula>`, :user:`Dylan Werner-Meier <unautre>`, and :user:`Stephen Hoover <stephen-hoover>`.
es_es: Se ha añadido el atributo ``classes_`` a :class:`model_selection.GridSearchCV`, :class:`model_selection.RandomizedSearchCV`, :class:`grid_search.GridSearchCV` y :class:`grid_search.RandomizedSearchCV` que coincide con el atributo ``classes_`` de ``best_estimator_``. :issue:`7661` y :issue:`8295` por :user:`Alyssa Batula <abatula>`, :user:`Dylan Werner-Meier <unautre>` y :user:`Stephen Hoover <stephen-hoover>`.

source: Fixed a bug where :func:`model_selection.validation_curve` reused the same estimator for each parameter value. :issue:`7365` by :user:`Aleksandr Sandrovskii <Sundrique>`.
es_es: Se ha corregido un error por el que :func:`model_selection.validation_curve` reutilizaba el mismo estimador para cada valor de parámetro. :issue:`7365` por :user:`Aleksandr Sandrovskii <Sundrique>`.

source: :func:`model_selection.permutation_test_score` now works with Pandas types. :issue:`5697` by :user:`Stijn Tonk <equialgo>`.
es_es: :func:`model_selection.permutation_test_score` ahora funciona con los tipos de Pandas. :issue:`5697` por :user:`Stijn Tonk <equialgo>`.

source: Several fixes to input validation in :class:`multiclass.OutputCodeClassifier` :issue:`8086` by `Andreas Müller`_.
es_es: Varias correcciones a la validación de entradas en :class:`multiclass.OutputCodeClassifier` :issue:`8086` por `Andreas Müller`_.

source: :class:`multiclass.OneVsOneClassifier`'s ``partial_fit`` now ensures all classes are provided up-front. :issue:`6250` by :user:`Asish Panda <kaichogami>`.
es_es: :class:`multiclass.OneVsOneClassifier` de ``partial_fit`` ahora asegura que todas las clases sean proporcionadas por adelantado. :issue:`6250` por :user:`Asish Panda <kaichogami>`.

source: Fix :func:`multioutput.MultiOutputClassifier.predict_proba` to return a list of 2d arrays, rather than a 3d array. In the case where different target columns had different numbers of classes, a ``ValueError`` would be raised on trying to stack matrices with different dimensions. :issue:`8093` by :user:`Peter Bull <pjbull>`.
es_es: Se corrige :func:`multioutput.MultiOutputClassifier.predict_proba` para que devuelva una lista de arreglos 2D, en lugar de un arreglo 3D. En el caso de que diferentes columnas objetivo tuvieran diferentes números de clases, se produciría un ``ValueError`` al intentar apilar matrices con diferentes dimensiones. :issue:`8093` por :user:`Peter Bull <pjbull>`.

source: Cross validation now works with Pandas datatypes that that have a read-only index. :issue:`9507` by `Loic Esteve`_.
es_es: La validación cruzada ahora funciona con los tipos de datos de Pandas que tienen un índice de sólo lectura. :issue:`9507` por `Loic Esteve`_.

source: :func:`metrics.average_precision_score` no longer linearly interpolates between operating points, and instead weighs precisions by the change in recall since the last operating point, as per the `Wikipedia entry <https://en.wikipedia.org/wiki/Average_precision>`_. (`#7356 <https://github.com/scikit-learn/scikit-learn/pull/7356>`_). By :user:`Nick Dingwall <ndingwall>` and `Gael Varoquaux`_.
es_es: :func:`metrics.average_precision_score` ya no interpola linealmente entre puntos de operación, y en su lugar pondera las precisiones por el cambio en la exhaustividad desde el último punto de operación, según la `entrada de la Wikipedia <https://en.wikipedia.org/wiki/Average_precision>`_. (`#7356 <https://github.com/scikit-learn/scikit-learn/pull/7356>`_). Por :user:`Nick Dingwall <ndingwall>` y `Gael Varoquaux`_.

source: Removed in 0.19:
es_es: Eliminado en 0.19:

source: Deprecated in 0.19, to be removed in 0.21:
es_es: Obsoleto en 0.19, se eliminará en 0.21:

source: Thanks to everyone who has contributed to the maintenance and improvement of the project since version 0.18, including:
es_es: Gracias a todos los que han contribuido al mantenimiento y la mejora del proyecto desde la versión 0.18, incluyendo:
