Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: |API| The ``axis`` parameter that was in :class:`preprocessing.Imputer` is no longer present in :class:`impute.SimpleImputer`. The behavior is equivalent to ``axis=0`` (impute along columns). Row-wise imputation can be performed with FunctionTransformer (e.g., ``FunctionTransformer(lambda X: SimpleImputer().fit_transform(X.T).T)``). :issue:`10829` by :user:`Guillaume Lemaitre <glemaitre>` and :user:`Gilberto Olimpio <gilbertoolimpio>`.
es_es: |API| El parámetro ``axis`` que estaba en :class:`preprocessing.Imputer` ya no está presente en :class:`impute.SimpleImputer`. El comportamiento es equivalente a ``axis=0`` (impute a lo largo de las columnas). La imputación en sentido contrario puede realizarse con FunctionTransformer (por ejemplo, ``FunctionTransformer(lambda X: SimpleImputer().fit_transform(X. ).T)``). :issue:`10829` por :user:`Guillaume Lemaitre <glemaitre>` y :user:`Gilberto Olimpio <gilbertoolimpio>`.

source: |API| The NaN marker for the missing values has been changed between the :class:`preprocessing.Imputer` and the :class:`impute.SimpleImputer`. ``missing_values='NaN'`` should now be ``missing_values=np.nan``. :issue:`11211` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |API| El marcador NaN para los valores faltantes ha sido cambiado entre el :class:`preprocessing.Imputer` y el :class:`impute.SimpleImputer`. ``missing_values='NaN'`` ahora debería ser ``missing_values=np.nan``. :issue:`11211` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |API| In :class:`preprocessing.FunctionTransformer`, the default of ``validate`` will be from ``True`` to ``False`` in 0.22. :issue:`10655` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |API| En :class:`preprocessing.FunctionTransformer`, el predeterminado de ``validate`` será de ``True`` a ``False`` en 0.22. :issue:`10655` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`svm.SVC` where when the argument ``kernel`` is unicode in Python2, the ``predict_proba`` method was raising an unexpected TypeError given dense inputs. :issue:`10412` by :user:`Jiongyan Zhang <qmick>`.
es_es: |Fix| Se corrigió un error en :class:`svm.SVC` donde cuando el argumento ``kernel`` es unicode en Python2, el método ``predict_proba`` estaba levantando un TypeError inesperado dado entradas densas. :issue:`10412` por :user:`Jiongyan Zhang <qmick>`.

source: |API| Deprecate ``random_state`` parameter in :class:`svm.OneClassSVM` as the underlying implementation is not random. :issue:`9497` by :user:`Albert Thomas <albertcthomas>`.
es_es: |API| Desaprobar el parámetro ``random_state`` en :class:`svm.OneClassSVM` ya que la implementación subyacente no es aleatoria. :issue:`9497` por :user:`Albert Thomas <albertcthomas>`.

source: |API| The default value of ``gamma`` parameter of :class:`svm.SVC`, :class:`~svm.NuSVC`, :class:`~svm.SVR`, :class:`~svm.NuSVR`, :class:`~svm.OneClassSVM` will change from ``'auto'`` to ``'scale'`` in version 0.22 to account better for unscaled features. :issue:`8361` by :user:`Gaurav Dhingra <gxyd>` and :user:`Ting Neo <neokt>`.
es_es: |API| El valor predeterminado del parámetro ``gamma`` de :class:`svm.SVC`, :class:`~svm.NuSVC`, :class:`~svm.SVR`, :class:`~svm.NuSVR`, :class:`~svm.OneClassSVM` cambiará de ``'auto'`` a ``'scale'`` en la versión 0.22 para tener mejor cuenta las características sin escalar. :issue:`8361` por :user:`Gaurav Dhingra <gxyd>` y :user:`Ting Neo <neokt>`.

source: |Enhancement| Although private (and hence not assured API stability), :class:`tree._criterion.ClassificationCriterion` and :class:`tree._criterion.RegressionCriterion` may now be cimported and extended. :issue:`10325` by :user:`Camil Staps <camilstaps>`.
es_es: |Enhancement| Aunque es privado (y por lo tanto no garantizado la estabilidad de la API), :class:`tree._criterion.ClassificationCriterion` y :class:`tree. criterion.RegressionCriterion` ahora puede ser cimportado y extendido. :issue:`10325` por :user:`Camil Staps <camilstaps>`.

source: |Fix| Fixed a bug in :class:`tree.BaseDecisionTree` with `splitter="best"` where split threshold could become infinite when values in X were near infinite. :issue:`10536` by :user:`Jonathan Ohayon <Johayon>`.
es_es: |Fix| Se corrigió un error en :class:`tree.BaseDecisionTree` con `splitter="best"` donde el umbral de división podía volverse infinito cuando los valores en X estaban cerca de infinito. :issue:`10536` por :user:`Jonathan Ohayon <Johayon>`.

source: |Fix| Fixed a bug in :class:`tree.MAE` to ensure sample weights are being used during the calculation of tree MAE impurity. Previous behaviour could cause suboptimal splits to be chosen since the impurity calculation considered all samples to be of equal weight importance. :issue:`11464` by :user:`John Stott <JohnStott>`.
es_es: |Fix| Se corrigió un error en :class:`tree.MAE` para asegurar que los pesos de muestra se estén utilizando durante el cálculo de impureza del árbol MAE. El comportamiento anterior podría provocar la elección de divisiones subóptimas, ya que el cálculo de impureza consideraba que todas las muestras eran de igual importancia. :issue:`11464` por :user:`John Stott <JohnStott>`.

source: |Feature| :func:`utils.check_array` and :func:`utils.check_X_y` now have ``accept_large_sparse`` to control whether scipy.sparse matrices with 64-bit indices should be rejected. :issue:`11327` by :user:`Karan Dhingra <kdhingra307>` and `Joel Nothman`_.
es_es: |Feature| :func:`utils.check_array` y :func:`utils.check_X_y` ahora tienen ``accept_large_sparse`` para controlar si las matrices scipy.sparce deben rechazarse de análisis con índices de 64-bits. :issue:`11327` por :user:`Karan Dhingra <kdhingra307>` y `Joel Nothman`_.

source: |Efficiency| |Fix| Avoid copying the data in :func:`utils.check_array` when the input data is a memmap (and ``copy=False``). :issue:`10663` by :user:`Arthur Mensch <arthurmensch>` and :user:`Loïc Estève <lesteve>`.
es_es: |Efficiency| |Fix| Evita copiar los datos en :func:`utils.check_array` cuando los datos de entrada son un mapa de mem(y ``copy=False``). :issue:`10663` por :user:`Arthur Mensch <arthurmensch>` y :user:`Loïc Estève <lesteve>`.

source: |API| :func:`utils.check_array` yield a ``FutureWarning`` indicating that arrays of bytes/strings will be interpreted as decimal numbers beginning in version 0.22. :issue:`10229` by :user:`Ryan Lee <rtlee9>`
es_es: |API| :func:`utils.check_array` produce un ``FutureWarning`` indicando que los arreglos de bytes/strings se interpretarán como números decimales que empiezan en la versión 0. 2. :issue:`10229` por :user:`Ryan Lee <rtlee9>`

source: Multiple modules
es_es: Múltiples módulos

source: |Feature| |API| More consistent outlier detection API: Add a ``score_samples`` method in :class:`svm.OneClassSVM`, :class:`ensemble.IsolationForest`, :class:`neighbors.LocalOutlierFactor`, :class:`covariance.EllipticEnvelope`. It allows to access raw score functions from original papers. A new ``offset_`` parameter allows to link ``score_samples`` and ``decision_function`` methods. The ``contamination`` parameter of :class:`ensemble.IsolationForest` and :class:`neighbors.LocalOutlierFactor` ``decision_function`` methods is used to define this ``offset_`` such that outliers (resp. inliers) have negative (resp. positive) ``decision_function`` values. By default, ``contamination`` is kept unchanged to 0.1 for a deprecation period. In 0.22, it will be set to "auto", thus using method-specific score offsets. In :class:`covariance.EllipticEnvelope` ``decision_function`` method, the ``raw_values`` parameter is deprecated as the shifted Mahalanobis distance will be always returned in 0.22. :issue:`9015` by `Nicolas Goix`_.
es_es: |Feature| |API| Más consistente API de detección atíptica: Agrega un método ``score_samples`` en :class:`svm.OneClassSVM`, :class:`ensemble.IsolationForest`, :class:`neighbors.LocalOutlierFactor`, :class:`covariance.EllipticEnvelope`. Permite acceder a las funciones de puntuación cruda de los documentos originales. Un nuevo parámetro ``offset_`` permite enlazar los métodos ``score_samples`` y ``decision_function``. El parámetro ``contaminación`` de :class:`ensemble.IsolationForest` y :class:`neighbors.LocalOutlierFactor` ``decision_function`` se utilizan para definir este ``offset_`` tal que los aterrizadores (resp. inliers) tengan negativos (resp. positivo) valores de ``decisi_function``. Por defecto, ``contamination`` se mantiene sin cambios a 0.1 durante un período de desaprobación. En 0. 2, se establecerá en "auto", usando el método de compensación de puntuación específico. En :class:`covarianceEllipticEnvelope` ``decision_function``, el parámetro ``raw_values`` es obsoleto ya que la distancia desplazada de Mahalanobis siempre será devuelta en 0.22. :issue:`9015` por `Nicolas Goix`_.

source: |Feature| |API| A ``behaviour`` parameter has been introduced in :class:`ensemble.IsolationForest` to ensure backward compatibility. In the old behaviour, the ``decision_function`` is independent of the ``contamination`` parameter. A threshold attribute depending on the ``contamination`` parameter is thus used. In the new behaviour the ``decision_function`` is dependent on the ``contamination`` parameter, in such a way that 0 becomes its natural threshold to detect outliers. Setting behaviour to "old" is deprecated and will not be possible in version 0.22. Beside, the behaviour parameter will be removed in 0.24. :issue:`11553` by `Nicolas Goix`_.
es_es: |Feature| |API| Un parámetro ``behaviour`` ha sido introducido en :class:`ensemble.IsolationForest` para asegurar la compatibilidad con versiones anteriores. En el comportamiento antiguo, la ``decisi_function`` es independiente del parámetro ``contamination``. Así se utiliza un atributo de umbral dependiendo del parámetro ``contamination``. En el nuevo comportamiento, la ``decisi_function`` depende del parámetro ``contamination``, de tal manera que 0 se convierte en su umbral natural para detectar los vientres. Establecer comportamiento a "viejo" es obsoleto y no será posible en la versión 0.22. Al margen, el parámetro de comportamiento será eliminado en 0.24. :issue:`11553` por `Nicolas Goix`_.

source: |API| Added convergence warning to :class:`svm.LinearSVC` and :class:`linear_model.LogisticRegression` when ``verbose`` is set to 0. :issue:`10881` by :user:`Alexandre Sevin <AlexandreSev>`.
es_es: |API| Se añadió una advertencia de convergencia a :class:`svm.LinearSVC` y :class:`linear_model.LogisticRegression` cuando ``verbose`` está establecido en 0. :issue:`10881` por :user:`Alexandre Sevin <AlexandreSev>`.

source: |API| Changed warning type from :class:`UserWarning` to :class:`exceptions.ConvergenceWarning` for failing convergence in :func:`linear_model.logistic_regression_path`, :class:`linear_model.RANSACRegressor`, :func:`linear_model.ridge_regression`, :class:`gaussian_process.GaussianProcessRegressor`, :class:`gaussian_process.GaussianProcessClassifier`, :func:`decomposition.fastica`, :class:`cross_decomposition.PLSCanonical`, :class:`cluster.AffinityPropagation`, and :class:`cluster.Birch`. :issue:`10306` by :user:`Jonathan Siebert <jotasi>`.
es_es: |API| Se ha cambiado el tipo de advertencia de :class:`UserWarning` a :class:`exceptions.ConvergenceWarning` por convergencia fallida en :func:`linear_model.logistic_regression_path`, :class:`linear_model.RANSACRegressor`, :func:`linear_model.ridge_regression`, :class:`gaussian_process.GaussianProcessRegressor`, :class:`gaussian_process.GaussianProcessClassifier`, :func:`decomposition.fastica`, :class:`cross_decomposition.PLSCanonical`, :class:`cluster.AffinityPropagation`, y :class:`cluster.Birch`. :issue:`10306` por :user:`Jonathan Siebert <jotasi>`.

source: |MajorFeature| A new configuration parameter, ``working_memory`` was added to control memory consumption limits in chunked operations, such as the new :func:`metrics.pairwise_distances_chunked`. See :ref:`working_memory`. :issue:`10280` by `Joel Nothman`_ and :user:`Aman Dalmia <dalmia>`.
es_es: |MajorFeature| Un nuevo parámetro de configuración, ``working_memory`` fue añadido para controlar los límites de consumo de memoria en operaciones por bloques (chunked), como la nueva :func:`metrics.pairwise_distances_chunked`. Ver :ref:`working_memory`. :issue:`10280` por `Joel Nothman`_ y :user:`Aman Dalmia <dalmia>`.

source: |Feature| The version of :mod:`joblib` bundled with Scikit-learn is now 0.12. This uses a new default multiprocessing implementation, named `loky <https://github.com/tomMoral/loky>`_. While this may incur some memory and communication overhead, it should provide greater cross-platform stability than relying on Python standard library multiprocessing. :issue:`11741` by the Joblib developers, especially :user:`Thomas Moreau <tomMoral>` and `Olivier Grisel`_.
es_es: |Feature| La versión de :mod:`joblib` empaquetada con Scikit-learn ahora es 0.12. Esto usa una nueva implementación multiprocesamiento predeterminada, llamada `loky <https://github.com/tomMoral/loky>`_. Aunque esto puede incurrir en algo de memoria y comunicación, debería proporcionar una mayor estabilidad entre plataformas que depender del multiprocesamiento estándar de librerías Python. :issue:`11741` por los desarrolladores de Joblib, especialmente :user:`Thomas Moreau <tomMoral>` y `Olivier Grisel`_.

source: |Feature| An environment variable to use the site joblib instead of the vendored one was added (:ref:`environment_variable`). The main API of joblib is now exposed in :mod:`sklearn.utils`. :issue:`11166` by `Gael Varoquaux`_.
es_es: |Feature| Se ha añadido una variable de entorno para usar el joblib del sitio en lugar de la vendida (:ref:`environment_variable`). La API principal de joblib está ahora expuesta en :mod:`sklearn.utils`. :issue:`11166` por `Gael Varoquaux`_.

source: |Feature| Add almost complete PyPy 3 support. Known unsupported functionalities are :func:`datasets.load_svmlight_file`, :class:`feature_extraction.FeatureHasher` and :class:`feature_extraction.text.HashingVectorizer`. For running on PyPy, PyPy3-v5.10+, Numpy 1.14.0+, and scipy 1.1.0+ are required. :issue:`11010` by :user:`Ronan Lamy <rlamy>` and `Roman Yurchak`_.
es_es: |Feature| Añade soporte de PyPy 3 casi completo. Las funcionalidades no soportadas son :func:`datasets.load_svmlight_file`, :class:`feature_extraction.FeatureHasher` y :class:`feature_extraction.text.HashingVectorizer`. Para ejecutarse en PyPy, PyPy3-v5.10+, Numpy 1.14.0+, y scipy 1.1. + son requeridos. :issue:`11010` por :user:`Ronan Lamy <rlamy>` y `Roman Yurchak`_.

source: |Feature| A utility method :func:`sklearn.show_versions()` was added to print out information relevant for debugging. It includes the user system, the Python executable, the version of the main libraries and BLAS binding information. :issue:`11596` by :user:`Alexandre Boucaud <aboucaud>`
es_es: |Feature| Un método de utilidad :func:`sklearn.show_versions()` fue añadido para imprimir información relevante para la depuración. Incluye el sistema de usuarios, el ejecutable Python, la versión de las bibliotecas principales y la información de enlace BLAS . :issue:`11596` por :user:`Alexandre Boucaud <aboucaud>`

source: |Fix| Fixed a bug when setting parameters on meta-estimator, involving both a wrapped estimator and its parameter. :issue:`9999` by :user:`Marcus Voss <marcus-voss>` and `Joel Nothman`_.
es_es: |Fix| Se corrigió un error al configurar parámetros en el meta-estimador, involucrando tanto un estimador envuelto como su parámetro. :issue:`9999` por :user:`Marcus Voss <marcus-voss>` y `Joel Nothman`_.

source: |Fix| Fixed a bug where calling :func:`sklearn.base.clone` was not thread safe and could result in a "pop from empty list" error. :issue:`9569` by `Andreas Müller`_.
es_es: |Fix| Se corrigió un error en el que se llamaba a :func:`sklearn.base.clone` no estaba seguro en el hilo y podría resultar en un error de "pop de lista vacía". :issue:`9569` por `Andreas Müller`_.

source: |API| The default value of ``n_jobs`` is changed from ``1`` to ``None`` in all related functions and classes. ``n_jobs=None`` means ``unset``. It will generally be interpreted as ``n_jobs=1``, unless the current ``joblib.Parallel`` backend context specifies otherwise (See :term:`Glossary <n_jobs>` for additional information). Note that this change happens immediately (i.e., without a deprecation cycle). :issue:`11741` by `Olivier Grisel`_.
es_es: |API| El valor predeterminado de ``n_jobs`` se cambia de ``1`` a ``None`` en todas las funciones y clases relacionadas. ``n_jobs=None`` significa ``unset``. Generalmente será interpretado como ``n_jobs=1``, a menos que el ``joblib.Parallel`` en el contexto del backend especifica lo contrario (Ver :term:`Glossary <n_jobs>` para obtener información adicional). Ten en cuenta que este cambio sucede inmediatamente (es decir, sin un ciclo de desaprobación). :issue:`11741` por `Olivier Grisel`_.

source: |Fix| Fixed a bug in validation helpers where passing a Dask DataFrame results in an error. :issue:`12462` by :user:`Zachariah Miller <zwmiller>`
es_es: |Fix| Se corrigió un error en los ayudantes de validación donde pasar un DataFrame de Dask resulta en un error. :issue:`12462` por :user:`Zachariah Miller <zwmiller>`

source: Changes to estimator checks
es_es: Cambios en las comprobaciones de los estimadores

source: These changes mostly affect library developers.
es_es: Estos cambios afectan principalmente a los desarrolladores de bibliotecas.

source: Checks for transformers now apply if the estimator implements :term:`transform`, regardless of whether it inherits from :class:`sklearn.base.TransformerMixin`. :issue:`10474` by `Joel Nothman`_.
es_es: Comprobaciones de transformadores ahora se aplican si el estimador implementa :term:`transform`, independientemente de si hereda de :class:`sklearn.base.TransformerMixin`. :issue:`10474` por `Joel Nothman`_.

source: Classifiers are now checked for consistency between :term:`decision_function` and categorical predictions. :issue:`10500` by :user:`Narine Kokhlikyan <NarineK>`.
es_es: Ahora se comprueba la consistencia entre :term:`decision_function` y predicciones categóricas. :issue:`10500` por :user:`Narine Kokhlikyan <NarineK>`.

source: Allow tests in :func:`utils.estimator_checks.check_estimator` to test functions that accept pairwise data. :issue:`9701` by :user:`Kyle Johnson <gkjohns>`
es_es: Permitir que las pruebas en :func:`utils.estimator_checks.check_estimator` prueben funciones que acepten datos combinados. :issue:`9701` por :user:`Kyle Johnson <gkjohns>`

source: Allow :func:`utils.estimator_checks.check_estimator` to check that there is no private settings apart from parameters during estimator initialization. :issue:`9378` by :user:`Herilalaina Rakotoarison <herilalaina>`
es_es: Permitir a :func:`utils.estimator_checks.check_estimator` verificar que no hay ninguna configuración privada aparte de parámetros durante la inicialización del estimador. :issue:`9378` por :user:`Herilalaina Rakotoarison <herilalaina>`

source: The set of checks in :func:`utils.estimator_checks.check_estimator` now includes a ``check_set_params`` test which checks that ``set_params`` is equivalent to passing parameters in ``__init__`` and warns if it encounters parameter validation. :issue:`7738` by :user:`Alvin Chiang <absolutelyNoWarranty>`
es_es: El conjunto de comprobaciones en :func:`utils.estimator_checks.check_estimator` ahora incluye una prueba de ``check_set_params`` que comprueba que ``set_params`` es equivalente a pasar parámetros en ``__init__`` y advierte si encuentra validación de parámetros. :issue:`7738` por :user:`Alvin Chiang <absolutelyNoWarranty>`

source: Add invariance tests for clustering metrics. :issue:`8102` by :user:`Ankita Sinha <anki08>` and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: Añade pruebas de invariancia para las métricas de racimo. :issue:`8102` por :user:`Ankita Sinha <anki08>` y :user:`Guillaume Lemaitre <glemaitre>`.

source: Add ``check_methods_subset_invariance`` to :func:`~utils.estimator_checks.check_estimator`, which checks that estimator methods are invariant if applied to a data subset. :issue:`10428` by :user:`Jonathan Ohayon <Johayon>`
es_es: Añade ``check_methods_subset_invariance`` a :func:`~utils.estimator_checks.check_estimator`, que comprueba que los métodos de estimación son invariantes si se aplican a un subconjunto de datos. :issue:`10428` por :user:`Jonathan Ohayon <Johayon>`

source: Add tests in :func:`utils.estimator_checks.check_estimator` to check that an estimator can handle read-only memmap input data. :issue:`10663` by :user:`Arthur Mensch <arthurmensch>` and :user:`Loïc Estève <lesteve>`.
es_es: Añade pruebas en :func:`utils.estimator_checks.check_estimator` para comprobar que un estimador puede manejar datos de entrada de memmap de solo lectura. :issue:`10663` por :user:`Arthur Mensch <arthurmensch>` y :user:`Loïc Estève <lesteve>`.

source: ``check_sample_weights_pandas_series`` now uses 8 rather than 6 samples to accommodate for the default number of clusters in :class:`cluster.KMeans`. :issue:`10933` by :user:`Johannes Hansen <jnhansen>`.
es_es: ``check_sample_weights_pandas_series`` ahora usa 8 en lugar de 6 muestras para acomodar el número predeterminado de clústeres en :class:`cluster.KMeans`. :issue:`10933` por :user:`Johannes Hansen <jnhansen>`.

source: Estimators are now checked for whether ``sample_weight=None`` equates to ``sample_weight=np.ones(...)``. :issue:`11558` by :user:`Sergul Aydore <sergulaydore>`.
es_es: Los estimadores ahora se comprueban si ``sample_weight=None`` equivale a ``sample_weight=np.ones(...)``. :issue:`11558` por :user:`Sergul Aydore <sergulaydore>`.

source: Thanks to everyone who has contributed to the maintenance and improvement of the project since version 0.19, including:
es_es: Gracias a quienes han contribuido al mantenimiento y mejora del proyecto desde la versión 0.19, incluyendo:
