Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: |Fix| Fixed a bug in :class:`preprocessing.OneHotEncoder` where transform failed when set to ignore unknown numpy strings of different lengths :issue:`12471` by :user:`Gabriel Marzinotto<GMarzinotto>`.
es_es: |Fix| Se corrigió un error en :class:`preprocessing.OneHotEncoder` donde falló la transformación cuando se estableció para ignorar cadenas numéricas desconocidas de diferentes longitudes :issue:`12471` por :user:`Gabriel Marzinotto<GMarzinotto>`.

source: |API| The default value of the :code:`method` argument in :func:`preprocessing.power_transform` will be changed from :code:`box-cox` to :code:`yeo-johnson` to match :class:`preprocessing.PowerTransformer` in version 0.23. A FutureWarning is raised when the default value is used. :issue:`12317` by :user:`Eric Chang <chang>`.
es_es: |API| El valor predeterminado del argumento :code:`method` en :func:`preprocessing.power_transform` cambiará de :code:`box-cox` a :code:`yeo-johnson` para que coincida con :class:`preprocessing.PowerTransformer` en la versión 0.23. Un FutureWarning se eleva cuando se utiliza el valor predeterminado. :issue:`12317` por :user:`Eric Chang <chang>`.

source: |Fix| Use float64 for mean accumulator to avoid floating point precision issues in :class:`preprocessing.StandardScaler` and :class:`decomposition.IncrementalPCA` when using float32 datasets. :issue:`12338` by :user:`bauks <bauks>`.
es_es: |Fix| Usar float64 para acumulador medio para evitar problemas de precisión de punto flotante en :class:`preprocessing.StandardScaler` y :class:`decomposition.IncrementalPCA` al usar conjuntos de datos float32. :issue:`12338` por :user:`bauks <bauks>`.

source: |Fix| Calling :func:`utils.check_array` on `pandas.Series`, which raised an error in 0.20.0, now returns the expected output again. :issue:`12625` by `Andreas Müller`_
es_es: |Fix| La llamada a :func:`utils.check_array` en `pandas.Series` con datos categóricos, que daba un error en 0.20.0, ahora devuelve de nuevo la salida esperada. :issue:`12625` por `Andreas Müller`_

source: Miscellaneous
es_es: Varios

source: |Fix| When using site joblib by setting the environment variable `SKLEARN_SITE_JOBLIB`, added compatibility with joblib 0.11 in addition to 0.12+. :issue:`12350` by `Joel Nothman`_ and `Roman Yurchak`_.
es_es: |Fix| Cuando se utiliza joblib del sitio configurando la variable de entorno `SKLEARN_SITE_JOBLIB`, añadió compatibilidad con joblib 0. 1 además de 0.12+. :issue:`12350` por `Joel Nothman`_ y `Roman Yurchak`_.

source: |Fix| Make sure to avoid raising ``FutureWarning`` when calling ``np.vstack`` with numpy 1.16 and later (use list comprehensions instead of generator expressions in many locations of the scikit-learn code base). :issue:`12467` by :user:`Olivier Grisel <ogrisel>`.
es_es: |Fix| Asegúrate de evitar levantar ``FutureWarning`` al llamar a ``np.vstack`` con número 1. 6 y posteriores (utilice las expresiones de la lista en lugar de las expresiones del generador en muchas ubicaciones de la base de código de la scikit). :issue:`12467` por :user:`Olivier Grisel <ogrisel>`.

source: |API| Removed all mentions of ``sklearn.externals.joblib``, and deprecated joblib methods exposed in ``sklearn.utils``, except for :func:`utils.parallel_backend` and :func:`utils.register_parallel_backend`, which allow users to configure parallel computation in scikit-learn. Other functionalities are part of `joblib <https://joblib.readthedocs.io/>`_. package and should be used directly, by installing it. The goal of this change is to prepare for unvendoring joblib in future version of scikit-learn. :issue:`12345` by :user:`Thomas Moreau <tomMoral>`
es_es: |API| Se eliminaron todas las menciones de ``sklearn.externals.joblib``, y métodos joblib obsoletos expuestos en ``sklearn.utils``, excepto por :func:`utils.parallel_backend` y :func:`utils.register_parallel_backend`, que permiten a los usuarios configurar el cálculo paralelo en scikit-learn. Otras funcionalidades son parte de `joblib <https://joblib.readthedocs.io/>`_. paquete y deberían ser usadas directamente, instalándolo. El objetivo de este cambio es prepararse para no avalar el trabajo en la futura versión de la ciencia-aprendizaje. :issue:`12345` por :user:`Thomas Moreau <tomMoral>`

source: Version 0.20.0
es_es: Versión 0.20.0

source: **September 25, 2018**
es_es: **25 de septiembre de 2018**

source: This release packs in a mountain of bug fixes, features and enhancements for the Scikit-learn library, and improvements to the documentation and examples. Thanks to our contributors!
es_es: Este paquete de versiones se encuentra en una montaña de correcciones de errores, características y mejoras para la biblioteca Scikit-learn, y mejoras en la documentación y ejemplos. ¡Gracias a nuestros colaboradores!

source: This release is dedicated to the memory of Raghav Rajagopalan.
es_es: Este lanzamiento está dedicado a la memoria de Raghav Rajagopalan.

source: Version 0.20 is the last version of scikit-learn to support Python 2.7 and Python 3.4. Scikit-learn 0.21 will require Python 3.5 or higher.
es_es: La versión 0.20 es la última versión de scikit-learn para soportar Python 2.7 y Python 3.4. Scikit-learn 0.21 requerirá Python 3.5 o superior.

source: Highlights
es_es: Destacados

source: We have tried to improve our support for common data-science use-cases including missing values, categorical variables, heterogeneous data, and features/targets with unusual distributions. Missing values in features, represented by NaNs, are now accepted in column-wise preprocessing such as scalers. Each feature is fitted disregarding NaNs, and data containing NaNs can be transformed. The new :mod:`impute` module provides estimators for learning despite missing data.
es_es: Hemos intentado mejorar nuestro soporte para casos de uso comunes de las ciencias de la información, incluyendo valores faltantes, variables categóricas, datos heterogéneos y características con distribuciones inusuales. Los valores faltantes en las características, representados por NaNs, ahora son aceptados en el preprocesamiento de columnas como escalones. Cada característica se ajusta sin tener en cuenta NaNs, y los datos que contienen NaNs pueden ser transformados. El nuevo módulo :mod:`impute` proporciona estimadores para aprender a pesar de que faltan datos.

source: :class:`~compose.ColumnTransformer` handles the case where different features or columns of a pandas.DataFrame need different preprocessing. String or pandas Categorical columns can now be encoded with :class:`~preprocessing.OneHotEncoder` or :class:`~preprocessing.OrdinalEncoder`.
es_es: :class:`~compose.ColumnTransformer` maneja el caso donde diferentes características o columnas de un pandas.DataFrame necesitan un preprocesamiento diferente. Las columnas Categóricas de cadenas o pandas ahora pueden ser codificadas con :class:`~preprocessing.OneHotEncoder` o :class:`~preprocessing.OrdinalEncoder`.

source: :class:`~compose.TransformedTargetRegressor` helps when the regression target needs to be transformed to be modeled. :class:`~preprocessing.PowerTransformer` and :class:`~preprocessing.KBinsDiscretizer` join :class:`~preprocessing.QuantileTransformer` as non-linear transformations.
es_es: :class:`~compose.TransformedTargetRegressor` ayuda cuando el objetivo de regresión necesita ser transformado para ser modelado. :class:`~preprocessing.PowerTransformer` y :class:`~preprocessing.KBinsDiscretizer` se unen a :class:`~preprocessing.QuantileTransformer` como transformaciones no lineales.

source: Beyond this, we have added :term:`sample_weight` support to several estimators (including :class:`~cluster.KMeans`, :class:`~linear_model.BayesianRidge` and :class:`~neighbors.KernelDensity`) and improved stopping criteria in others (including :class:`~neural_network.MLPRegressor`, :class:`~ensemble.GradientBoostingRegressor` and :class:`~linear_model.SGDRegressor`).
es_es: Más allá de esto, hemos añadido el soporte de :term:`sample_weight` a varios estimadores (incluyendo :class:`~cluster.KTechns`, :class:`~linear_model.BayesianRidge` y :class:`~neighbors. ernelDensity`) y criterios de detención mejorados en otros (incluyendo :class:`~neural_network.MLPRegressor`, :class:`~ensemble.GradientBoostingRegressor` y :class:`~linear_model.SGDRegressor`).

source: This release is also the first to be accompanied by a :ref:`glossary` developed by `Joel Nothman`_. The glossary is a reference resource to help users and contributors become familiar with the terminology and conventions used in Scikit-learn.
es_es: Esta versión también es la primera en ir acompañada de un :ref:`glossary` desarrollado por `Joel Nothman`_. El glosario es un recurso de referencia para ayudar a los usuarios y colaboradores a familiarizarse con la terminología y las convenciones utilizadas en Scikit-learn.

source: Sorry if your contribution didn't make it into the highlights. There's a lot here...
es_es: Disculpa si tu contribución no ha entrado en los destacados. Hay mucho aquí...

source: :class:`decomposition.IncrementalPCA` in Python 2 (bug fix)
es_es: :class:`decomposition.IncrementalPCA` en Python 2 (bug fix)

source: :class:`ensemble.GradientBoostingClassifier` (bug fix affecting feature importances)
es_es: :class:`ensemble.GradientBoostingClassifier` (corrección de errores que afecta las características de importancias)

source: The v0.19.0 release notes failed to mention a backwards incompatibility with :class:`model_selection.StratifiedKFold` when ``shuffle=True`` due to :issue:`7823`.
es_es: Las notas de lanzamiento v0.19.0 no pudieron mencionar una incompatibilidad hacia atrás con :class:`model_selection.StratifiedKFold` cuando ``shuffle=True`` debido a :issue:`7823`.

source: Details are listed in the changelog below.
es_es: Los detalles están listados en el registro de cambios a continuación.

source: (While we are trying to better inform users by providing this information, we cannot assure that this list is complete.)
es_es: (Mientras intentamos informar mejor a los usuarios proporcionando esta información, no podemos asegurar que esta lista esté completa.)

source: Known Major Bugs
es_es: Mayores Errores Conocidos

source: :issue:`11924`: :class:`linear_model.LogisticRegressionCV` with `solver='lbfgs'` and `multi_class='multinomial'` may be non-deterministic or otherwise broken on macOS. This appears to be the case on Travis CI servers, but has not been confirmed on personal MacBooks! This issue has been present in previous releases.
es_es: :issue:`11924`: :class:`linear_model.LogisticRegressionCV` con `solver='lbfgs'` y `multi_class='multinomial'` puede ser no determinista o roto en macOS. Este parece ser el caso en los servidores Travis CI, pero no ha sido confirmado en MacBook personal! Este número ha estado presente en versiones anteriores.

source: :issue:`9354`: :func:`metrics.pairwise.euclidean_distances` (which is used several times throughout the library) gives results with poor precision, which particularly affects its use with 32-bit float inputs. This became more problematic in versions 0.18 and 0.19 when some algorithms were changed to avoid casting 32-bit data into 64-bit.
es_es: :issue:`9354`: :func:`metrics.pairwise.euclidean_distances` (que se usa varias veces a lo largo de la biblioteca) da resultados con poca precisión, lo que afecta particularmente a su uso con entradas flotantes de 32-bits. Esto se volvió más problemático en las versiones 0.18 y 0.19 cuando algunos algoritmos fueron cambiados para evitar lanzar datos de 32 bits en 64-bit.

source: Support for Python 3.3 has been officially dropped.
es_es: Se ha eliminado oficialmente el soporte para Python 3.3.

source: |MajorFeature| :class:`cluster.AgglomerativeClustering` now supports Single Linkage clustering via ``linkage='single'``. :issue:`9372` by :user:`Leland McInnes <lmcinnes>` and :user:`Steve Astels <sastels>`.
es_es: |MajorFeature| :class:`cluster.AgglomerativeClustering` ahora soporta un clúster de Enlace único a través de ``linkage='single'``. :issue:`9372` por :user:`Leland McInnes <lmcinnes>` y :user:`Steve Astels <sastels>`.

source: |Feature| :class:`cluster.KMeans` and :class:`cluster.MiniBatchKMeans` now support sample weights via new parameter ``sample_weight`` in ``fit`` function. :issue:`10933` by :user:`Johannes Hansen <jnhansen>`.
es_es: |Feature| :class:`cluster.KMeans` y :class:`cluster.MiniBatchKMeans` ahora soportan pesos de muestra mediante el nuevo parámetro ``sample_weight`` en la función ``fit```. :issue:`10933` de :user:`Johannes Hansen <jnhansen>`.

source: |Efficiency| :class:`cluster.KMeans`, :class:`cluster.MiniBatchKMeans` and :func:`cluster.k_means` passed with ``algorithm='full'`` now enforces row-major ordering, improving runtime. :issue:`10471` by :user:`Gaurav Dhingra <gxyd>`.
es_es: |Efficiency| :class:`cluster.KMeans`, :class:`cluster.MiniBatchKMeans` y :func:`cluster.k_means` pasaron con ``algorithm='full'`` ahora fuerza el pedido mayor de filas, mejorando el tiempo de ejecución. :issue:`10471` por :user:`Gaurav Dhingra <gxyd>`.

source: |Efficiency| :class:`cluster.DBSCAN` now is parallelized according to ``n_jobs`` regardless of ``algorithm``. :issue:`8003` by :user:`Joël Billaud <recamshak>`.
es_es: |Efficiency| :class:`cluster.DBSCAN` ahora está paralelizado de acuerdo a ``n_jobs`` independientemente del ``algoritmo``. :issue:`8003` por :user:`Joël Billaud <recamshak>`.

source: |Enhancement| :class:`cluster.KMeans` now gives a warning if the number of distinct clusters found is smaller than ``n_clusters``. This may occur when the number of distinct points in the data set is actually smaller than the number of cluster one is looking for. :issue:`10059` by :user:`Christian Braune <christianbraune79>`.
es_es: |Enhancement| :class:`cluster.KMeans` ahora da una advertencia si el número de clústeres distintos encontrados es menor que ``n_clusters``. Esto puede ocurrir cuando el número de puntos distintos en el conjunto de datos es realmente menor que el número de cluster que está buscando. :issue:`10059` por :user:`Christian Braune <christianbraune79>`.

source: |Fix| Fixed a bug where the ``fit`` method of :class:`cluster.AffinityPropagation` stored cluster centers as 3d array instead of 2d array in case of non-convergence. For the same class, fixed undefined and arbitrary behavior in case of training data where all samples had equal similarity. :issue:`9612`. By :user:`Jonatan Samoocha <jsamoocha>`.
es_es: |Fix| Se ha corregido un error por el que el método ``fit`` de :class:`cluster.AffinityPropagation` almacenaba los centros de los clusters como una matriz 3d en lugar de 2d en caso de no convergencia. Para la misma clase, se ha corregido un comportamiento indefinido y arbitrario en caso de datos de entrenamiento en los que todas las muestras tenían la misma similitud. :issue:`9612`. Por :user:`Jonatan Samoocha <jsamoocha>`.

source: |Fix| Fixed a bug in :func:`cluster.spectral_clustering` where the normalization of the spectrum was using a division instead of a multiplication. :issue:`8129` by :user:`Jan Margeta <jmargeta>`, :user:`Guillaume Lemaitre <glemaitre>`, and :user:`Devansh D. <devanshdalal>`.
es_es: |Fix| Se corrigió un error en :func:`cluster.spectral_clustering` donde la normalización del espectro estaba utilizando una división en lugar de una multiplicación. :issue:`8129` por :user:`Jan Margeta <jmargeta>`, :user:`Guillaume Lemaitre <glemaitre>`, y :user:`Devansh D. <devanshdalal>`.

source: |Fix| Fixed a bug in :func:`cluster.k_means_elkan` where the returned ``iteration`` was 1 less than the correct value. Also added the missing ``n_iter_`` attribute in the docstring of :class:`cluster.KMeans`. :issue:`11353` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :func:`cluster.k_means_elkan` donde la ``iteración`` devuelta era 1 menor que el valor correcto. También agregó el atributo ``n_iter_`` faltante en la cadena docstring de :class:`cluster.KMeans`. :issue:`11353` de :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :func:`cluster.mean_shift` where the assigned labels were not deterministic if there were multiple clusters with the same intensities. :issue:`11901` by :user:`Adrin Jalali <adrinjalali>`.
es_es: |Fix| Se corrigió un error en :func:`cluster.mean_shift` donde las etiquetas asignadas no eran deterministas si había varios clusters con las mismas intensidades. :issue:`11901` por :user:`Adrin Jalali <adrinjalali>`.

source: |API| Deprecate ``pooling_func`` unused parameter in :class:`cluster.AgglomerativeClustering`. :issue:`9875` by :user:`Kumar Ashutosh <thechargedneutron>`.
es_es: |API| Queda obsoleto ``pooling_func`` parámetro no utilizado en :class:`cluster.AgglomerativeClustering`. :issue:`9875` por :user:`Kumar Ashutosh <thechargedneutron>`.

source: New module.
es_es: Nuevo módulo.

source: |MajorFeature| Added :class:`compose.ColumnTransformer`, which allows to apply different transformers to different columns of arrays or pandas DataFrames. :issue:`9012` by `Andreas Müller`_ and `Joris Van den Bossche`_, and :issue:`11315` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |MajorFeature| Se añadió :class:`compose.ColumnTransformer`, que permite aplicar diferentes transformadores a diferentes columnas de arrays o pandas DataFrames. :issue:`9012` por `Andreas Müller`_ y `Joris Van den Bossche`_, y :issue:`11315` por :user:`Thomas Fan <thomasjpfan>`.

source: |MajorFeature| Added the :class:`compose.TransformedTargetRegressor` which transforms the target y before fitting a regression model. The predictions are mapped back to the original space via an inverse transform. :issue:`9041` by `Andreas Müller`_ and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |MajorFeature| Se ha añadido el :class:`compose.TransformedTargetRegressor` que transforma el objetivo y antes de encajar un modelo de regresión. Las predicciones se mapean al espacio original a través de una transforma inversa. :issue:`9041` por `Andreas Müller`_ y :user:`Guillaume Lemaitre <glemaitre>`.

source: |Efficiency| Runtime improvements to :class:`covariance.GraphicalLasso`. :issue:`9858` by :user:`Steven Brown <stevendbrown>`.
es_es: |Efficiency| Mejoras en el tiempo de ejecución en :class:`covariance.GraphicalLasso`. :issue:`9858` por :user:`Steven Brown <stevendbrown>`.

source: |API| The :func:`covariance.graph_lasso`, :class:`covariance.GraphLasso` and :class:`covariance.GraphLassoCV` have been renamed to :func:`covariance.graphical_lasso`, :class:`covariance.GraphicalLasso` and :class:`covariance.GraphicalLassoCV` respectively and will be removed in version 0.22. :issue:`9993` by :user:`Artiem Krinitsyn <artiemq>`
es_es: |API| El :func:`covariance.graph_lasso`, :class:`covariance.GraphLasso` y :class:`covariance.GraphLassoCV` han sido renombrados a :func:`covariance.graphical_lasso`, :class:`covariance.GraphicalLasso` y :class:`covariance.GraphicalLassoCV` respectivamente y será eliminado en la versión 0.22. :issue:`9993` por :user:`Artiem Krinitsyn <artiemq>`

source: |MajorFeature| Added :func:`datasets.fetch_openml` to fetch datasets from `OpenML <https://openml.org>`_. OpenML is a free, open data sharing platform and will be used instead of mldata as it provides better service availability. :issue:`9908` by `Andreas Müller`_ and :user:`Jan N. van Rijn <janvanrijn>`.
es_es: |MajorFeature| Se añadió :func:`datasets.fetch_openml` para obtener conjuntos de datos de `OpenML <https://openml.org>`_. OpenML es una plataforma libre y abierta para compartir datos y se utilizará en lugar de mldata ya que proporciona mejor disponibilidad de servicio. :issue:`9908` por `Andreas Müller`_ y :user:`Jan N. van Rijn <janvanrijn>`.

source: |Feature| In :func:`datasets.make_blobs`, one can now pass a list to the ``n_samples`` parameter to indicate the number of samples to generate per cluster. :issue:`8617` by :user:`Maskani Filali Mohamed <maskani-moh>` and :user:`Konstantinos Katrioplas <kkatrio>`.
es_es: |Feature| En :func:`datasets.make_blobs`, ahora se puede pasar una lista al parámetro ``n_samples`` para indicar el número de muestras a generar por cada clúster. :issue:`8617` por :user:`Maskani Filali Mohamed <maskani-moh>` y :user:`Konstantinos Katrioplas <kkatrio>`.

source: |Feature| Add ``filename`` attribute to :mod:`datasets` that have a CSV file. :issue:`9101` by :user:`alex-33 <alex-33>` and :user:`Maskani Filali Mohamed <maskani-moh>`.
es_es: |Feature| Se añadió el atributo ``filename`` a :mod:`datasets` que tienen un archivo CSV. :issue:`9101` por :user:`alex-33 <alex-33>` y :user:`Maskani Filali Mohamed <maskani-moh>`.

source: |Feature| ``return_X_y`` parameter has been added to several dataset loaders. :issue:`10774` by :user:`Chris Catalfo <ccatalfo>`.
es_es: |Feature| Se ha añadido el parámetro ``return_X_y`` a varios cargadores de conjuntos de datos. :issue:`10774` por :user:`Chris Catalfo <ccatalfo>`.

source: |Fix| Fixed a bug in :func:`datasets.load_boston` which had a wrong data point. :issue:`10795` by :user:`Takeshi Yoshizawa <tarcusx>`.
es_es: |Fix| Corregido un error en :func:`datasets.load_boston` que tenía un punto de datos erróneo. :issue:`10795` por :user:`Takeshi Yoshizawa <tarcusx>`.

source: |Fix| Fixed a bug in :func:`datasets.load_iris` which had two wrong data points. :issue:`11082` by :user:`Sadhana Srinivasan <rotuna>` and :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error en :func:`datasets.load_iris` que tenía dos puntos de datos erróneos. :issue:`11082` por :user:`Sadhana Srinivasan <rotuna>` y :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :func:`datasets.fetch_kddcup99`, where data were not properly shuffled. :issue:`9731` by `Nicolas Goix`_.
es_es: |Fix| Se ha corregido un error en :func:`datasets.fetch_kddcup99`, donde los datos no se barajaban correctamente. :issue:`9731` por `Nicolas Goix`_.

source: |Fix| Fixed a bug in :func:`datasets.make_circles`, where no odd number of data points could be generated. :issue:`10045` by :user:`Christian Braune <christianbraune79>`.
es_es: |Fix| Se ha corregido un error en :func:`datasets.make_circles`, por el que no se podía generar un número impar de puntos de datos. :issue:`10045` por :user:`Christian Braune <christianbraune79>`.

source: |API| Deprecated :func:`sklearn.datasets.fetch_mldata` to be removed in version 0.22. mldata.org is no longer operational. Until removal it will remain possible to load cached datasets. :issue:`11466` by `Joel Nothman`_.
es_es: |API| Obsoleto :func:`sklearn.datasets.fetch_mldata` que se eliminará en la versión 0.22. mldata.org ya no está operativo. Hasta su eliminación seguirá siendo posible cargar conjuntos de datos en caché. :issue:`11466` por `Joel Nothman`_.

source: |Feature| :func:`decomposition.dict_learning` functions and models now support positivity constraints. This applies to the dictionary and sparse code. :issue:`6374` by :user:`John Kirkham <jakirkham>`.
es_es: |Feature| :func:`decomposition.dict_learning` funciones y modelos ahora soportan restricciones de positividad. Esto se aplica al diccionario y al código disperso. :issue:`6374` por :user:`John Kirkham <jakirkham>`.
