Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: |Enhancement| Add improved error message in :func:`model_selection.cross_val_score` when multiple metrics are passed in ``scoring`` keyword. :issue:`11006` by :user:`Ming Li <minggli>`.
es_es: |Enhancement| Añadir un mensaje de error mejorado en :func:`model_selection.cross_val_score` cuando se pasan múltiples métricas en la palabra clave ``scoring``. :issue:`11006` por :user:`Ming Li <minggli>`.

source: |API| The default number of cross-validation folds ``cv`` and the default number of splits ``n_splits`` in the :class:`model_selection.KFold`-like splitters will change from 3 to 5 in 0.22 as 3-fold has a lot of variance. :issue:`11557` by :user:`Alexandre Boucaud <aboucaud>`.
es_es: |API| El número por defecto de pliegues de validación cruzada ``cv`` y el número por defecto de divisiones ``n_splits`` en los divisores tipo :class:`model_selection.KFold` cambiarán de 3 a 5 en 0.22 ya que 3 pliegues tienen mucha varianza. :issue:`11557` por :user:`Alexandre Boucaud <aboucaud>`.

source: |API| The default of ``iid`` parameter of :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` will change from ``True`` to ``False`` in version 0.22 to correspond to the standard definition of cross-validation, and the parameter will be removed in version 0.24 altogether. This parameter is of greatest practical significance where the sizes of different test sets in cross-validation were very unequal, i.e. in group-based CV strategies. :issue:`9085` by :user:`Laurent Direr <ldirer>` and `Andreas Müller`_.
es_es: |API| El parámetro ``iid`` por defecto de :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` cambiará de ``True`` a ``False`` en la versión 0.22 para corresponder a la definición estándar de validación cruzada, y el parámetro se eliminará en la versión 0.24 por completo. Este parámetro tiene mayor importancia práctica cuando los tamaños de los diferentes conjuntos de pruebas en la validación cruzada son muy desiguales, es decir, en las estrategias de CV basadas en grupos. :issue:`9085` by :user:`Laurent Direr <ldirer>` and `Andreas Müller`_.

source: |API| The default value of the ``error_score`` parameter in :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` will change to ``np.NaN`` in version 0.22. :issue:`10677` by :user:`Kirill Zhdanovich <Zhdanovich>`.
es_es: |API| El valor por defecto del parámetro ``error_score`` en :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` cambiará a ``np.NaN`` en la versión 0.22. :issue:`10677` por :user:`Kirill Zhdanovich <Zhdanovich>`.

source: |API| Changed ValueError exception raised in :class:`model_selection.ParameterSampler` to a UserWarning for case where the class is instantiated with a greater value of ``n_iter`` than the total space of parameters in the parameter grid. ``n_iter`` now acts as an upper bound on iterations. :issue:`10982` by :user:`Juliet Lawton <julietcl>`
es_es: |API| Se ha cambiado la excepción ValueError lanzada en :class:`model_selection.ParameterSampler` a un UserWarning para el caso en que la clase se instancie con un valor de ``n_iter`` mayor que el espacio total de parámetros en la parrilla de parámetros. ``n_iter`` actúa ahora como límite superior de las iteraciones. :issue:`10982` by :user:`Juliet Lawton <julietcl>`

source: |API| Invalid input for :class:`model_selection.ParameterGrid` now raises TypeError. :issue:`10928` by :user:`Solutus Immensus <solutusimmensus>`
es_es: |API| La entrada no válida para :class:`model_selection.ParameterGrid` ahora genera TypeError. :issue:`10928` por :user:`Solutus Immensus <solutusimmensus>`

source: |MajorFeature| Added :class:`multioutput.RegressorChain` for multi-target regression. :issue:`9257` by :user:`Kumar Ashutosh <thechargedneutron>`.
es_es: |MajorFeature| Añadida :class:`multioutput.RegressorChain` para la regresión multiobjetivo. :issue:`9257` por :user:`Kumar Ashutosh <thechargedneutron>`.

source: |MajorFeature| Added :class:`naive_bayes.ComplementNB`, which implements the Complement Naive Bayes classifier described in Rennie et al. (2003). :issue:`8190` by :user:`Michael A. Alcorn <airalcorn2>`.
es_es: |MajorFeature| Añadida :class:`naive_bayes.ComplementNB`, que implementa el clasificador Complement Naive Bayes descrito en Rennie et al. (2003). :issue:`8190` por :user:`Michael A. Alcorn <airalcorn2>`.

source: |Feature| Add `var_smoothing` parameter in :class:`naive_bayes.GaussianNB` to give a precise control over variances calculation. :issue:`9681` by :user:`Dmitry Mottl <Mottl>`.
es_es: |Feature| Añadir el parámetro `var_smoothing` en :class:`naive_bayes.GaussianNB` para dar un control preciso sobre el cálculo de las varianzas. :issue:`9681` por :user:`Dmitry Mottl <Mottl>`.

source: |Fix| Fixed a bug in :class:`naive_bayes.GaussianNB` which incorrectly raised error for prior list which summed to 1. :issue:`10005` by :user:`Gaurav Dhingra <gxyd>`.
es_es: |Fix| Se ha corregido un error en :class:`naive_bayes.GaussianNB` que generaba un error incorrecto para la lista anterior que sumaba 1. :issue:`10005` por :user:`Gaurav Dhingra <gxyd>`.

source: |Fix| Fixed a bug in :class:`naive_bayes.MultinomialNB` which did not accept vector valued pseudocounts (alpha). :issue:`10346` by :user:`Tobias Madsen <TobiasMadsen>`
es_es: |Fix| Se ha corregido un error en :class:`naive_bayes.MultinomialNB` que no aceptaba pseudocuentas con valor vectorial (alpha). :issue:`10346` por :user:`Tobias Madsen <TobiasMadsen>`

source: |Efficiency| :class:`neighbors.RadiusNeighborsRegressor` and :class:`neighbors.RadiusNeighborsClassifier` are now parallelized according to ``n_jobs`` regardless of ``algorithm``. :issue:`10887` by :user:`Joël Billaud <recamshak>`.
es_es: |Efficiency| :class:`neighbors.RadiusNeighborsRegressor` y :class:`neighbors.RadiusNeighborsClassifier` ahora se paralelizan según ``n_jobs`` independientemente del ``algoritmo``. :issue:`10887` por :user:`Joël Billaud <recamshak>`.

source: |Efficiency| :mod:`Nearest neighbors <neighbors>` query methods are now more memory efficient when ``algorithm='brute'``. :issue:`11136` by `Joel Nothman`_ and :user:`Aman Dalmia <dalmia>`.
es_es: |Efficiency| :mod:`Nearest neighbors <neighbors>` los métodos de consulta son ahora más eficientes en memoria cuando ``algorithm='brute'``. :issue:`11136` por `Joel Nothman`_ y :user:`Aman Dalmia <dalmia>`.

source: |Feature| Add ``sample_weight`` parameter to the fit method of :class:`neighbors.KernelDensity` to enable weighting in kernel density estimation. :issue:`4394` by :user:`Samuel O. Ronsin <samronsin>`.
es_es: |Feature| Añadir el parámetro ``sample_weight`` al método de ajuste de :class:`neighbors.KernelDensity` para permitir la ponderación en la estimación de la densidad del núcleo. :issue:`4394` por :user:`Samuel O. Ronsin <samronsin>`.

source: |Feature| Novelty detection with :class:`neighbors.LocalOutlierFactor`: Add a ``novelty`` parameter to :class:`neighbors.LocalOutlierFactor`. When ``novelty`` is set to True, :class:`neighbors.LocalOutlierFactor` can then be used for novelty detection, i.e. predict on new unseen data. Available prediction methods are ``predict``, ``decision_function`` and ``score_samples``. By default, ``novelty`` is set to ``False``, and only the ``fit_predict`` method is avaiable. By :user:`Albert Thomas <albertcthomas>`.
es_es: |Feature| Detección de novedades con :class:`neighbors.LocalOutlierFactor`: Añadir un parámetro ``novelty`` a :class:`neighbors.LocalOutlierFactor`. Cuando ``novelty`` se establece como True, :class:`neighbors.LocalOutlierFactor` puede utilizarse para la detección de novedades, es decir, para predecir sobre nuevos datos no vistos. Los métodos de predicción disponibles son ``predict``, ``decision_function`` y ``score_samples``. Por defecto, ``novelty`` está establecido en ``False``, y sólo está disponible el método ``fit_predict``. Por :user:`Albert Thomas <albertcthomas>`.

source: |Fix| Fixed a bug in :class:`neighbors.NearestNeighbors` where fitting a NearestNeighbors model fails when a) the distance metric used is a callable and b) the input to the NearestNeighbors model is sparse. :issue:`9579` by :user:`Thomas Kober <tttthomasssss>`.
es_es: |Fix| Se ha corregido un error en :class:`neighbors.NearestNeighbors` por el que el ajuste de un modelo NearestNeighbors falla cuando a) la métrica de distancia utilizada es una llamada y b) la entrada al modelo NearestNeighbors es dispersa. :issue:`9579` por :user:`Thomas Kober <tttthomasssss>`.

source: |Fix| Fixed a bug so ``predict`` in :class:`neighbors.RadiusNeighborsRegressor` can handle empty neighbor set when using non uniform weights. Also raises a new warning when no neighbors are found for samples. :issue:`9655` by :user:`Andreas Bjerre-Nielsen <abjer>`.
es_es: |Fix| Corregido un error para que ``predict`` en :class:`neighbors.RadiusNeighborsRegressor` pueda manejar conjuntos de vecinos vacíos cuando se usan pesos no uniformes. También se genera una nueva advertencia cuando no se encuentran vecinos para las muestras. :issue:`9655` por :user:`Andreas Bjerre-Nielsen <abjer>`.

source: |Fix| |Efficiency| Fixed a bug in ``KDTree`` construction that results in faster construction and querying times. :issue:`11556` by :user:`Jake VanderPlas <jakevdp>`
es_es: |Fix| |Efficiency| Se ha corregido un error en la construcción de ``KDTree`` que resulta en tiempos de construcción y consulta más rápidos. :issue:`11556` por :user:`Jake VanderPlas <jakevdp>`

source: |Fix| Fixed a bug in :class:`neighbors.KDTree` and :class:`neighbors.BallTree` where pickled tree objects would change their type to the super class :class:`BinaryTree`. :issue:`11774` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`neighbors.KDTree` y :class:`neighbors.BallTree` por el que los objetos de árbol decapados cambiaban su tipo a la superclase :class:`BinaryTree`. :issue:`11774` por :user:`Nicolas Hug <NicolasHug>`.

source: |Feature| Add `n_iter_no_change` parameter in :class:`neural_network.BaseMultilayerPerceptron`, :class:`neural_network.MLPRegressor`, and :class:`neural_network.MLPClassifier` to give control over maximum number of epochs to not meet ``tol`` improvement. :issue:`9456` by :user:`Nicholas Nadeau <nnadeau>`.
es_es: |Feature| Añadir el parámetro `n_iter_no_change` en :class:`neural_network.BaseMultilayerPerceptron`, :class:`neural_network.MLPRegressor`, y :class:`neural_network.MLPClassifier` para dar control sobre el número máximo de épocas para no cumplir con la mejora de ``tol``. :issue:`9456` por :user:`Nicholas Nadeau <nnadeau>`.

source: |Fix| Fixed a bug in :class:`neural_network.BaseMultilayerPerceptron`, :class:`neural_network.MLPRegressor`, and :class:`neural_network.MLPClassifier` with new ``n_iter_no_change`` parameter now at 10 from previously hardcoded 2. :issue:`9456` by :user:`Nicholas Nadeau <nnadeau>`.
es_es: |Fix| Se ha corregido un error en :class:`neural_network.BaseMultilayerPerceptron`, :class:`neural_network.MLPRegressor`, y :class:`neural_network.MLPClassifier` con el nuevo parámetro ``n_iter_no_change`` ahora en 10 desde el 2 previamente codificado. :issue:`9456` por :user:`Nicholas Nadeau <nnadeau>`.

source: |Fix| Fixed a bug in :class:`neural_network.MLPRegressor` where fitting quit unexpectedly early due to local minima or fluctuations. :issue:`9456` by :user:`Nicholas Nadeau <nnadeau>`
es_es: |Fix| Se ha corregido un error en :class:`neural_network.MLPRegressor` por el que el ajuste abandonaba inesperadamente antes de tiempo debido a mínimos locales o fluctuaciones. :issue:`9456` por :user:`Nicholas Nadeau <nnadeau>`

source: |Feature| The ``predict`` method of :class:`pipeline.Pipeline` now passes keyword arguments on to the pipeline's last estimator, enabling the use of parameters such as ``return_std`` in a pipeline with caution. :issue:`9304` by :user:`Breno Freitas <brenolf>`.
es_es: |Feature| El método ``predict`` de :class:`pipeline.Pipeline` ahora pasa los argumentos de las palabras clave al último estimador del pipeline, permitiendo el uso de parámetros como ``return_std`` en un pipeline con precaución. :issue:`9304` por :user:`Breno Freitas <brenolf>`.

source: |API| :class:`pipeline.FeatureUnion` now supports ``'drop'`` as a transformer to drop features. :issue:`11144` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |API| :class:`pipeline.FeatureUnion` ahora soporta ``'drop'`` como transformador para soltar características. :issue:`11144` por :user:`Thomas Fan <thomasjpfan>`.

source: |MajorFeature| Expanded :class:`preprocessing.OneHotEncoder` to allow to encode categorical string features as a numeric array using a one-hot (or dummy) encoding scheme, and added :class:`preprocessing.OrdinalEncoder` to convert to ordinal integers. Those two classes now handle encoding of all feature types (also handles string-valued features) and derives the categories based on the unique values in the features instead of the maximum value in the features. :issue:`9151` and :issue:`10521` by :user:`Vighnesh Birodkar <vighneshbirodkar>` and `Joris Van den Bossche`_.
es_es: |MajorFeature| Ampliado :class:`preprocessing.OneHotEncoder` para permitir la codificación de características categóricas de cadena como una matriz numérica utilizando un esquema de codificación de una sola vez (o ficticia), y añadido :class:`preprocessing.OrdinalEncoder` para convertir a enteros ordinales. Estas dos clases ahora manejan la codificación de todos los tipos de características (también maneja características con valores de cadena) y deriva las categorías basadas en los valores únicos de las características en lugar del valor máximo de las mismas. :issue:`9151` y :issue:`10521` por :user:`Vighnesh Birodkar <vighneshbirodkar>` y `Joris Van den Bossche`_.

source: |MajorFeature| Added :class:`preprocessing.KBinsDiscretizer` for turning continuous features into categorical or one-hot encoded features. :issue:`7668`, :issue:`9647`, :issue:`10195`, :issue:`10192`, :issue:`11272`, :issue:`11467` and :issue:`11505`. by :user:`Henry Lin <hlin117>`, `Hanmin Qin`_, `Tom Dupre la Tour`_ and :user:`Giovanni Giuseppe Costa <ggc87>`.
es_es: |MajorFeature| Añadido :class:`preprocessing.KBinsDiscretizer` para convertir las características continuas en características categóricas o codificadas en un punto. :issue:`7668`, :issue:`9647`, :issue:`10195`, :issue:`10192`, :issue:`11272`, :issue:`11467` y :issue:`11505`. por :user:`Henry Lin <hlin117>`, `Hanmin Qin`_, `Tom Dupre la Tour`_ y :user:`Giovanni Giuseppe Costa <ggc87>`.

source: |MajorFeature| Added :class:`preprocessing.PowerTransformer`, which implements the Yeo-Johnson and Box-Cox power transformations. Power transformations try to find a set of feature-wise parametric transformations to approximately map data to a Gaussian distribution centered at zero and with unit variance. This is useful as a variance-stabilizing transformation in situations where normality and homoscedasticity are desirable. :issue:`10210` by :user:`Eric Chang <chang>` and :user:`Maniteja Nandana <maniteja123>`, and :issue:`11520` by :user:`Nicolas Hug <nicolashug>`.
es_es: |MajorFeature| Añadido :class:`preprocessing.PowerTransformer`, que implementa las transformaciones de potencia de Yeo-Johnson y Box-Cox. Las transformaciones de potencia intentan encontrar un conjunto de transformaciones paramétricas en función de las características para asignar aproximadamente los datos a una distribución gaussiana centrada en cero y con varianza unitaria. Esto es útil como una transformación estabilizadora de la varianza en situaciones donde la normalidad y la homocedasticidad son deseables. :issue:`10210` por :user:`Eric Chang <chang>` y :user:`Maniteja Nandana <maniteja123>`, y :issue:`11520` por :user:`Nicolas Hug <nicolashug>`.

source: |MajorFeature| NaN values are ignored and handled in the following preprocessing methods: :class:`preprocessing.MaxAbsScaler`, :class:`preprocessing.MinMaxScaler`, :class:`preprocessing.RobustScaler`, :class:`preprocessing.StandardScaler`, :class:`preprocessing.PowerTransformer`, :class:`preprocessing.QuantileTransformer` classes and :func:`preprocessing.maxabs_scale`, :func:`preprocessing.minmax_scale`, :func:`preprocessing.robust_scale`, :func:`preprocessing.scale`, :func:`preprocessing.power_transform`, :func:`preprocessing.quantile_transform` functions respectively addressed in issues :issue:`11011`, :issue:`11005`, :issue:`11308`, :issue:`11206`, :issue:`11306`, and :issue:`10437`. By :user:`Lucija Gregov <LucijaGregov>` and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |MajorFeature| Los valores NaN se ignoran y se tratan en los siguientes métodos de preprocesamiento: :class:`preprocessing.MaxAbsScaler`, :class:`preprocessing.MinMaxScaler`, :class:`preprocessing.RobustScaler`, :class:`preprocessing.StandardScaler`, :class:`preprocessing.PowerTransformer`, :class:`preprocessing.QuantileTransformer` y :func:`preprocessing. maxabs_scale`, :func:`preprocessing.minmax_scale`, :func:`preprocessing.robust_scale`, :func:`preprocessing.scale`, :func:`preprocessing.power_transform`, :func:`preprocessing. quantile_transform` respectivamente en los temas :issue:`11011`, :issue:`11005`, :issue:`11308`, :issue:`11206`, :issue:`11306`, y :issue:`10437`. Por :user:`Lucija Gregov <LucijaGregov>` y :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| :class:`preprocessing.PolynomialFeatures` now supports sparse input. :issue:`10452` by :user:`Aman Dalmia <dalmia>` and `Joel Nothman`_.
es_es: |Feature| :class:`preprocessing.PolynomialFeatures` ahora soporta entrada dispersa. :issue:`10452` por :user:`Aman Dalmia <dalmia>` y `Joel Nothman`_.

source: |Feature| :class:`preprocessing.RobustScaler` and :func:`preprocessing.robust_scale` can be fitted using sparse matrices. :issue:`11308` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Feature| :class:`preprocessing.RobustScaler` y :func:`preprocessing.robust_scale` pueden ajustarse usando matrices dispersas. :issue:`11308` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| :class:`preprocessing.OneHotEncoder` now supports the :term:`get_feature_names` method to obtain the transformed feature names. :issue:`10181` by :user:`Nirvan Anjirbag <Nirvan101>` and `Joris Van den Bossche`_.
es_es: |Feature| :class:`preprocessing.OneHotEncoder` ahora admite el método :term:`get_feature_names` para obtener los nombres de características transformadas. :issue:`10181` por :user:`Nirvan Anjirbag <Nirvan101>` y `Joris Van den Bossche`_.

source: |Feature| A parameter ``check_inverse`` was added to :class:`preprocessing.FunctionTransformer` to ensure that ``func`` and ``inverse_func`` are the inverse of each other. :issue:`9399` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Feature| Se ha añadido un parámetro ``check_inverse`` a :class:`preprocessing.FunctionTransformer` para asegurar que ``func`` y ``inverse_func`` son la inversa de la otra. :issue:`9399` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| The ``transform`` method of :class:`sklearn.preprocessing.MultiLabelBinarizer` now ignores any unknown classes. A warning is raised stating the unknown classes classes found which are ignored. :issue:`10913` by :user:`Rodrigo Agundez <rragundez>`.
es_es: |El método ``transform`` de :class:`sklearn.preprocessing.MultiLabelBinarizer` ahora ignora cualquier clase desconocida. Se lanza una advertencia indicando las clases desconocidas encontradas que se ignoran. :issue:`10913` by :user:`Rodrigo Agundez <rragundez>`.

source: |Fix| Fixed bugs in :class:`preprocessing.LabelEncoder` which would sometimes throw errors when ``transform`` or ``inverse_transform`` was called with empty arrays. :issue:`10458` by :user:`Mayur Kulkarni <maykulkarni>`.
es_es: |Fix| Corregidos errores en :class:`preprocessing.LabelEncoder` que a veces lanzaba errores cuando se llamaba a ``transform`` o ``inverse_transform`` con arrays vacíos. :issue:`10458` por :user:`Mayur Kulkarni <maykulkarni>`.

source: |Fix| Fix ValueError in :class:`preprocessing.LabelEncoder` when using ``inverse_transform`` on unseen labels. :issue:`9816` by :user:`Charlie Newey <newey01c>`.
es_es: |Fix| Corregir ValueError en :class:`preprocessing.LabelEncoder` al usar ``inverse_transform`` en etiquetas no vistas. :issue:`9816` por :user:`Charlie Newey <newey01c>`.

source: |Fix| Fix bug in :class:`preprocessing.OneHotEncoder` which discarded the ``dtype`` when returning a sparse matrix output. :issue:`11042` by :user:`Daniel Morales <DanielMorales9>`.
es_es: |Fix| Corregir error en :class:`preprocessing.OneHotEncoder` que descartaba el ``dtype`` cuando devolvía una salida de matriz dispersa. :issue:`11042` por :user:`Daniel Morales <DanielMorales9>`.

source: |Fix| Fix ``fit`` and ``partial_fit`` in :class:`preprocessing.StandardScaler` in the rare case when ``with_mean=False`` and `with_std=False` which was crashing by calling ``fit`` more than once and giving inconsistent results for ``mean_`` whether the input was a sparse or a dense matrix. ``mean_`` will be set to ``None`` with both sparse and dense inputs. ``n_samples_seen_`` will be also reported for both input types. :issue:`11235` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Corregir ``fit`` y ``partial_fit`` en :class:`preprocssing.StandardScaler` en el caso raro cuando ``with_mean=False`` y `with_std=False` que se bloquearon al llamar a ``encajar`` más de una vez y dar resultados inconsistentes para ``mean_`` si la entrada era una matriz esparse o una matriz densa. ``mean_`` se establecerá en ``Ninguno`` con entradas dispersas y densas. ``n_samples_seen_`` también será reportado para ambos tipos de entrada. :issue:`11235` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |API| Deprecate ``n_values`` and ``categorical_features`` parameters and ``active_features_``, ``feature_indices_`` and ``n_values_`` attributes of :class:`preprocessing.OneHotEncoder`. The ``n_values`` parameter can be replaced with the new ``categories`` parameter, and the attributes with the new ``categories_`` attribute. Selecting the categorical features with the ``categorical_features`` parameter is now better supported using the :class:`compose.ColumnTransformer`. :issue:`10521` by `Joris Van den Bossche`_.
es_es: |API| Obsoletos los parámetros ``n_values`` y ``categorical_features`` y los atributos ``active_features_``, ``feature_indices_`` y ``n_values_`` de :class:`preprocessing.OneHotEncoder`. El parámetro ``n_values`` puede ser reemplazado por el nuevo parámetro ``categories``, y los atributos con el nuevo atributo ``categories_``. Seleccionando las características categóricas con el parámetro ``categorical_features`` ahora es mejor soportado usando :class:`compose.ColumnTransformer`. :issue:`10521` por `Joris Van den Bossche`_.

source: |API| Deprecate :class:`preprocessing.Imputer` and move the corresponding module to :class:`impute.SimpleImputer`. :issue:`9726` by :user:`Kumar Ashutosh <thechargedneutron>`.
es_es: |API| Obsoleto :class:`preprocessing.Imputer` y mover el módulo correspondiente a :class:`impute.SimpleImputer`. :issue:`9726` por :user:`Kumar Ashutosh <thechargedneutron>`.
