Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.23.po
Languages: es_es

source: |Enhancement| Added ``return_centers`` parameter in :func:`datasets.make_blobs`, which can be used to return centers for each cluster. :pr:`15709` by :user:`shivamgargsya` and :user:`Venkatachalam N <venkyyuvy>`.
es_es: |Enhancement| Se añadió el parámetro ``return_centers`` en :func:`datasets.make_blobs`, que puede utilizarse para devolver los centros de cada conglomerado. :pr:`15709` por :user:`shivamgargsya` y :user:`Venkatachalam N <venkyyuvy>`.

source: |Enhancement| Functions :func:`datasets.make_circles` and :func:`datasets.make_moons` now accept two-element tuple. :pr:`15707` by :user:`Maciej J Mikulski <mjmikulski>`.
es_es: |Enhancement| Las funciones :func:`datasets.make_circles` y :func:`datasets.make_moons` aceptan ahora tuplas de dos elementos. :pr:`15707` por :user:`Maciej J Mikulski <mjmikulski>`.

source: |Fix| :func:`datasets.make_multilabel_classification` now generates `ValueError` for arguments `n_classes < 1` OR `length < 1`. :pr:`16006` by :user:`Rushabh Vasani <rushabh-v>`.
es_es: |Fix| :func:`datasets.make_multilabel_classification` ahora genera `ValueError` para argumentos `n_classes < 1` O `length < 1`. :pr:`16006` por :user:`Rushabh Vasani <rushabh-v>`.

source: |API| The `StreamHandler` was removed from `sklearn.logger` to avoid double logging of messages in common cases where a hander is attached to the root logger, and to follow the Python logging documentation recommendation for libraries to leave the log message handling to users and application code. :pr:`16451` by :user:`Christoph Deil <cdeil>`.
es_es: |API| El `StreamHandler` fue eliminado de `sklearn.logger` para evitar el doble registro de mensajes en los casos comunes donde se conecta un manejador al registrador raíz, y para seguir la recomendación de la documentación de registro de Python para que las bibliotecas dejen el manejo de los mensajes de registro a los usuarios y al código de la aplicación. :pr:`16451` por :user:`Christoph Deil <cdeil>`.

source: |Enhancement| :class:`decomposition.NMF` and :func:`decomposition.non_negative_factorization` now preserves float32 dtype. :pr:`16280` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Enhancement| :class:`decomposition.NMF` y :func:`decomposition.non_negative_factorization` ahora preserva el dtype float32. :pr:`16280` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Enhancement| :func:`TruncatedSVD.transform` is now faster on given sparse ``csc`` matrices. :pr:`16837` by :user:`wornbb`.
es_es: |Enhancement| :func:`TruncatedSVD.transform` es ahora más rápido en matrices dispersas ``csc`` dadas. :pr:`16837` por :user:`wornbb`.

source: |Fix| :class:`decomposition.PCA` with a float `n_components` parameter, will exclusively choose the components that explain the variance greater than `n_components`. :pr:`15669` by :user:`Krishna Chaitanya <krishnachaitanya9>`
es_es: |Fix| :class:`decomposition.PCA` con un parámetro de punto flotante (float) `n_components`, elegirá exclusivamente los componentes que expliquen la varianza mayor que `n_components`. :pr:`15669` by :user:`Krishna Chaitanya <krishnachaitanya9>`

source: |Fix| :class:`decomposition.PCA` with `n_components='mle'` now correctly handles small eigenvalues, and does not infer 0 as the correct number of components. :pr:`16224` by :user:`Lisa Schwetlick <lschwetlick>`, and :user:`Gelavizh Ahmadi <gelavizh1>` and :user:`Marija Vlajic Wheeler <marijavlajic>` and :pr:`16841` by `Nicolas Hug`_.
es_es: |Fix| :class:`decomposition.PCA` con `n_components='mle'` ahora maneja correctamente los autovalores pequeños, y no infiere 0 como el número correcto de componentes. :pr:`16224` por :user:`Lisa Schwetlick <lschwetlick>`, y :user:`Gelavizh Ahmadi <gelavizh1>` y :user:`Marija Vlajic Wheeler <marijavlajic>` y :pr:`16841` por `Nicolas Hug`_.

source: |Fix| :class:`decomposition.KernelPCA` method ``inverse_transform`` now applies the correct inverse transform to the transformed data. :pr:`16655` by :user:`Lewis Ball <lrjball>`.
es_es: |Fix| El método ``inverse_transform`` de :class:`decomposition.KernelPCA` ahora aplica la transformación inversa correcta a los datos transformados. :pr:`16655` por :user:`Lewis Ball <lrjball>`.

source: |Fix| Fixed bug that was causing :class:`decomposition.KernelPCA` to sometimes raise `invalid value encountered in multiply` during `fit`. :pr:`16718` by :user:`Gui Miotto <gui-miotto>`.
es_es: |Fix| Se corrigió el error que provocaba que :class:`decomposition.KernelPCA` generara a veces un `invalid value encountered in multiply`(valor no válido encontrado en la multiplicación) durante `fit`. :pr:`16718` por :user:`Gui Miotto <gui-miotto>`.

source: |Feature| Added `n_components_` attribute to :class:`decomposition.SparsePCA` and :class:`decomposition.MiniBatchSparsePCA`. :pr:`16981` by :user:`Mateusz Górski <Reksbril>`.
es_es: |Feature| Añadido el atributo `n_components_` a :class:`decomposition.SparsePCA` y :class:`decomposition.MiniBatchSparsePCA`. :pr:`16981` por :user:`Mateusz Górski <Reksbril>`.

source: |MajorFeature| :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor` now support :term:`sample_weight`. :pr:`14696` by `Adrin Jalali`_ and `Nicolas Hug`_.
es_es: |MajorFeature| :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor` ahora soportan :term:`sample_weight`. :pr:`14696` por `Adrin Jalali`_ y `Nicolas Hug`_.

source: |Feature| Early stopping in :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor` is now determined with a new `early_stopping` parameter instead of `n_iter_no_change`. Default value is 'auto', which enables early stopping if there are at least 10,000 samples in the training set. :pr:`14516` by :user:`Johann Faouzi <johannfaouzi>`.
es_es: |Feature| La parada anticipada en :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor` se determina ahora con un nuevo parámetro `early_stopping` en lugar de `n_iter_no_change`. El valor por defecto es 'auto', que permite la parada anticipada si hay al menos 10.000 muestras en el conjunto de entrenamiento. :pr:`14516` by :user:`Johann Faouzi <johannfaouzi>`.

source: |MajorFeature| :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor` now support monotonic constraints, useful when features are supposed to have a positive/negative effect on the target. :pr:`15582` by `Nicolas Hug`_.
es_es: |MajorFeature| :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor` ahora soportan restricciones monotónicas, útiles cuando las características se supone que tienen un efecto positivo/negativo en el objetivo. :pr:`15582` por `Nicolas Hug`_.

source: |API| Added boolean `verbose` flag to classes: :class:`ensemble.VotingClassifier` and :class:`ensemble.VotingRegressor`. :pr:`16069` by :user:`Sam Bail <spbail>`, :user:`Hanna Bruce MacDonald <hannahbrucemacdonald>`, :user:`Reshama Shaikh <reshamas>`, and :user:`Chiara Marmo <cmarmo>`.
es_es: |API| Añadido el indicador booleano `verbose` a las clases: :class:`ensemble.VotingClassifier` y :class:`ensemble.VotingRegressor`. :pr:`16069` por :user:`Sam Bail <spbail>`, :user:`Hanna Bruce MacDonald <hannahbrucemacdonald>`, :user:`Reshama Shaikh <reshamas>`, y :user:`Chiara Marmo <cmarmo>`.

source: |API| Fixed a bug in :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor` that would not respect the `max_leaf_nodes` parameter if the criteria was reached at the same time as the `max_depth` criteria. :pr:`16183` by `Nicolas Hug`_.
es_es: |API| Se corrigió un error en :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor` que no respetaba el parámetro `max_leaf_nodes` si el criterio se alcanzaba al mismo tiempo que el criterio `max_depth`. :pr:`16183` por `Nicolas Hug`_.

source: |Fix| Changed the convention for `max_depth` parameter of :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor`. The depth now corresponds to the number of edges to go from the root to the deepest leaf. Stumps (trees with one split) are now allowed. :pr:`16182` by :user:`Santhosh B <santhoshbala18>`
es_es: |Fix| Se cambió la convención del parámetro `max_depth` de :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor`. La profundidad corresponde ahora al número de aristas para ir desde la raíz hasta la hoja más profunda. Ahora se permiten los tocones (árboles con una división). :pr:`16182` by :user:`Santhosh B <santhoshbala18>`

source: |Fix| Fixed a bug in :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` and :class:`ensemble.IsolationForest` where the attribute `estimators_samples_` did not generate the proper indices used during `fit`. :pr:`16437` by :user:`Jin-Hwan CHO <chofchof>`.
es_es: |Fix| Se corrigió un error en :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` y :class:`ensemble.IsolationForest` donde el atributo `estimators_samples_` no generaba los índices adecuados utilizados durante `fit`. :pr:`16437` por :user:`Jin-Hwan CHO <chofchof>`.

source: |Fix| Fixed a bug in :class:`ensemble.StackingClassifier` and :class:`ensemble.StackingRegressor` where the `sample_weight` argument was not being passed to `cross_val_predict` when evaluating the base estimators on cross-validation folds to obtain the input to the meta estimator. :pr:`16539` by :user:`Bill DeRose <wderose>`.
es_es: |Fix| Se corrigió un error en :class:`ensemble.StackingClassifier` y :class:`ensemble.StackingRegressor` donde el argumento `sample_weight` no se pasaba a `cross_val_predict` cuando se evaluaban los estimadores base en pliegues de validación cruzada para obtener la entrada del metaestimador. :pr:`16539` por :user:`Bill DeRose <wderose>`.

source: |Feature| Added additional option `loss="poisson"` to :class:`ensemble.HistGradientBoostingRegressor`, which adds Poisson deviance with log-link useful for modeling count data. :pr:`16692` by :user:`Christian Lorentzen <lorentzenchr>`
es_es: |Feature| Añadida la opción adicional `loss="poisson"` a :class:`ensemble.HistGradientBoostingRegressor`, que añade la desviación de Poisson con enlace logarítmico útil para modelar datos de conteo. :pr:`16692` por :user:`Christian Lorentzen <lorentzenchr>`

source: |Fix| Fixed a bug where :class:`ensemble.HistGradientBoostingRegressor` and :class:`ensemble.HistGradientBoostingClassifier` would fail with multiple calls to fit when `warm_start=True`, `early_stopping=True`, and there is no validation set. :pr:`16663` by `Thomas Fan`_.
es_es: |Fix| Se corrigió un error por el que :class:`ensemble.HistGradientBoostingRegressor` y :class:`ensemble.HistGradientBoostingClassifier` fallaban con múltiples llamadas a fit cuando `warm_start=True`, `early_stopping=True`, y no hay validación establecida. :pr:`16663` por `Thomas Fan`_.

source: |Efficiency| :class:`feature_extraction.text.CountVectorizer` now sorts features after pruning them by document frequency. This improves performances for datasets with large vocabularies combined with ``min_df`` or ``max_df``. :pr:`15834` by :user:`Santiago M. Mola <smola>`.
es_es: |Efficiency| :class:`feature_extraction.text.CountVectorizer` ahora ordena las características después de podarlas por frecuencia de documentos. Esto mejora el rendimiento en conjuntos de datos con grandes vocabularios combinados con ``min_df`` o ``max_df``. :pr:`15834` por :user:`Santiago M. Mola <smola>`.

source: |Enhancement| Added support for multioutput data in :class:`feature_selection.RFE` and :class:`feature_selection.RFECV`. :pr:`16103` by :user:`Divyaprabha M <divyaprabha123>`.
es_es: |Enhancement| Se añadió soporte para datos de salida múltiple en :class:`feature_selection.RFE` y :class:`feature_selection.RFECV`. :pr:`16103` por :user:`Divyaprabha M <divyaprabha123>`.

source: |API| Adds :class:`feature_selection.SelectorMixin` back to public API. :pr:`16132` by :user:`trimeta`.
es_es: |API| Añade :class:`feature_selection.SelectorMixin` de vuelta a la API pública. :pr:`16132` por :user:`trimeta`.

source: |Enhancement| :func:`gaussian_process.kernels.Matern` returns the RBF kernel when ``nu=np.inf``. :pr:`15503` by :user:`Sam Dixon <sam-dixon>`.
es_es: |Enhancement| :func:`gaussian_process.kernels.Matern` devuelve el kernel RBF cuando ``nu=np.inf``. :pr:`15503` por :user:`Sam Dixon <sam-dixon>`.

source: |Fix| Fixed bug in :class:`gaussian_process.GaussianProcessRegressor` that caused predicted standard deviations to only be between 0 and 1 when WhiteKernel is not used. :pr:`15782` by :user:`plgreenLIRU`.
es_es: |Fix| Se corrigió un error en :class:`gaussian_process.GaussianProcessRegressor` que provocaba que las desviaciones estándar predichas solo estuvieran entre 0 y 1 cuando no se utilizaba WhiteKernel. :pr:`15782` por :user:`plgreenLIRU`.

source: |Enhancement| :class:`impute.IterativeImputer` accepts both scalar and array-like inputs for ``max_value`` and ``min_value``. Array-like inputs allow a different max and min to be specified for each feature. :pr:`16403` by :user:`Narendra Mukherjee <narendramukherjee>`.
es_es: |Enhancement| :class:`impute.IterativeImputer` acepta entradas escalares y array-like para ``max_value`` y ``min_value``. Las entradas array-like permiten que se especifique un máximo y minuto diferente para cada característica. :pr:`16403` por :user:`Narendra Mukherjee <narendramukherjee>`.

source: |Enhancement| :class:`impute.SimpleImputer`, :class:`impute.KNNImputer`, and :class:`impute.IterativeImputer` accepts pandas' nullable integer dtype with missing values. :pr:`16508` by `Thomas Fan`_.
es_es: |Enhancement| :class:`impute.SimpleImputer`, :class:`impute.KNNImputer`, y :class:`impute.IterativeImputer` acepta el dtype entero anulable de pandas con valores faltantes. :pr:`16508` por `Thomas Fan`_.

source: |Feature| :func:`inspection.partial_dependence` and :func:`inspection.plot_partial_dependence` now support the fast 'recursion' method for :class:`ensemble.RandomForestRegressor` and :class:`tree.DecisionTreeRegressor`. :pr:`15864` by `Nicolas Hug`_.
es_es: |Feature| :func:`inspection.partial_dependence` y :func:`inspection.plot_partial_dependence` ahora soportan el método rápido de 'recursion' para :class:`ensemble.RandomForestRegressor` y :class:`tree.DecisionTreeRegressor`. :pr:`15864` por `Nicolas Hug`_.

source: |MajorFeature| Added generalized linear models (GLM) with non normal error distributions, including :class:`linear_model.PoissonRegressor`, :class:`linear_model.GammaRegressor` and :class:`linear_model.TweedieRegressor` which use Poisson, Gamma and Tweedie distributions respectively. :pr:`14300` by :user:`Christian Lorentzen <lorentzenchr>`, `Roman Yurchak`_, and `Olivier Grisel`_.
es_es: |MajorFeature| Añadidos modelos lineales generalizados (GLM) con distribuciones de error no normales, incluyendo :class:`linear_model.PoissonRegressor`, :class:`linear_model.GammaRegressor` y :class:`linear_model. TweedieRegressor` que utilizan las distribuciones Poisson, Gamma y Tweedie respectivamente. :pr:`14300` por :user:`Christian Lorentzen <lorentzenchr>`, `Roman Yurchak`_, y `Olivier Grisel`_.

source: |MajorFeature| Support of `sample_weight` in :class:`linear_model.ElasticNet` and :class:`linear_model.Lasso` for dense feature matrix `X`. :pr:`15436` by :user:`Christian Lorentzen <lorentzenchr>`.
es_es: |MajorFeature| Soporte de `sample_weight` en :class:`linear_model.ElasticNet` y :class:`linear_model.Lasso` para la matriz densa de características `X`. :pr:`15436` por :user:`Christian Lorentzen <lorentzenchr>`.

source: |Efficiency| :class:`linear_model.RidgeCV` and :class:`linear_model.RidgeClassifierCV` now does not allocate a potentially large array to store dual coefficients for all hyperparameters during its `fit`, nor an array to store all error or LOO predictions unless `store_cv_values` is `True`. :pr:`15652` by :user:`Jérôme Dockès <jeromedockes>`.
es_es: |Efficiency| :class:`linear_model.RidgeCV` y :class:`linear_model.RidgeClassifierCV` ahora no asigna un arreglo potencialmente grande para almacenar coeficientes duales para todos los hiperparámetros durante `fit`, ni un arreglo para almacenar todas las predicciones de error o LOO a menos que `store_cv_values` sea `True`. :pr:`15652` por :user:`Jérôme Dockès <jeromedockes>`.

source: |Enhancement| :class:`linear_model.LassoLars` and :class:`linear_model.Lars` now support a `jitter` parameter that adds random noise to the target. This might help with stability in some edge cases. :pr:`15179` by :user:`angelaambroz`.
es_es: |Enhancement| :class:`linear_model.LassoLars` y :class:`linear_model.Lars` ahora soportan un parámetro `jitter` que añade ruido aleatorio al objetivo. Esto puede ayudar a la estabilidad en algunos casos extremos. :pr:`15179` por :user:`angelaambroz`.

source: |Fix| Fixed a bug where if a `sample_weight` parameter was passed to the fit method of :class:`linear_model.RANSACRegressor`, it would not be passed to the wrapped `base_estimator` during the fitting of the final model. :pr:`15773` by :user:`Jeremy Alexandre <J-A16>`.
es_es: |Fix| Se corrigió un error donde si se pasaba un parámetro `sample_weight` al método fit de :class:`linear_model.RANSACRegressor`, no se pasaba al `base_estimator` incluido durante el ajuste del modelo final. :pr:`15773` por :user:`Jeremy Alexandre <J-A16>`.

source: |Fix| Add `best_score_` attribute to :class:`linear_model.RidgeCV` and :class:`linear_model.RidgeClassifierCV`. :pr:`15655` by :user:`Jérôme Dockès <jeromedockes>`.
es_es: |Fix| Añadir el atributo `best_score_` a :class:`linear_model.RidgeCV` y :class:`linear_model.RidgeClassifierCV`. :pr:`15655` por :user:`Jérôme Dockès <jeromedockes>`.

source: |Fix| Fixed a bug in :class:`linear_model.RidgeClassifierCV` to pass a specific scoring strategy. Before the internal estimator outputs score instead of predictions. :pr:`14848` by :user:`Venkatachalam N <venkyyuvy>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.RidgeClassifierCV` para pasar una estrategia de puntuación específica. Antes de que el estimador interno diera la puntuación en lugar de las predicciones. :pr:`14848` por :user:`Venkatachalam N <venkyyuvy>`.

source: |Fix| :class:`linear_model.LogisticRegression` will now avoid an unnecessary iteration when `solver='newton-cg'` by checking for inferior or equal instead of strictly inferior for maximum of `absgrad` and `tol` in `utils.optimize._newton_cg`. :pr:`16266` by :user:`Rushabh Vasani <rushabh-v>`.
es_es: |Fix| :class:`linear_model.LogisticRegression` evitará ahora una iteración innecesaria cuando `solver='newton-cg'` comprobando si es inferior o igual en lugar de estrictamente inferior para el máximo de `absgrad` y `tol` en `utils.optimize._newton_cg`. :pr:`16266` por :user:`Rushabh Vasani <rushabh-v>`.

source: |API| Deprecated public attributes `standard_coef_`, `standard_intercept_`, `average_coef_`, and `average_intercept_` in :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor`. :pr:`16261` by :user:`Carlos Brandt <chbrandt>`.
es_es: |API| Atributos públicos obsoletos `standard_coef_`, `standard_intercept_`, `average_coef_`, y `average_intercept_` en :class:`linear_model.SGDClassifier`, :class:`linear_model. SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor`. :pr:`16261` by :user:`Carlos Brandt <chbrandt>`.

source: |Fix| |Efficiency| :class:`linear_model.ARDRegression` is more stable and much faster when `n_samples > n_features`. It can now scale to hundreds of thousands of samples. The stability fix might imply changes in the number of non-zero coefficients and in the predicted output. :pr:`16849` by `Nicolas Hug`_.
es_es: |Fix| |Efficiency| :class:`linear_model.ARDRegression` es más estable y mucho más rápido cuando `n_samples > n_features`. Ahora puede escalar a cientos de miles de muestras. La corrección de la estabilidad puede implicar cambios en el número de coeficientes distintos de cero y en la salida predicha. :pr:`16849` por `Nicolas Hug`_.

source: |Fix| Fixed a bug in :class:`linear_model.ElasticNetCV`, :class:`linear_model.MultiTaskElasticNetCV`, :class:`linear_model.LassoCV` and :class:`linear_model.MultiTaskLassoCV` where fitting would fail when using joblib loky backend. :pr:`14264` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.ElasticNetCV`, :class:`linear_model.MultiTaskElasticNetCV`, :class:`linear_model.LassoCV` y :class:`linear_model.MultiTaskLassoCV` dondepor el que el ajuste fallaba cuando se utilizaba el backend loky de joblib. :pr:`14264` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Efficiency| Speed up :class:`linear_model.MultiTaskLasso`, :class:`linear_model.MultiTaskLassoCV`, :class:`linear_model.MultiTaskElasticNet`, :class:`linear_model.MultiTaskElasticNetCV` by avoiding slower BLAS Level 2 calls on small arrays :pr:`17021` by :user:`Alex Gramfort <agramfort>` and :user:`Mathurin Massias <mathurinm>`.
es_es: |Efficiency| Acelera :class:`linear_model.MultiTaskLasso`, :class:`linear_model.MultiTaskLassoCV`, :class:`linear_model.MultiTaskElasticNet`, :class:`linear_model. MultiTaskElasticNetCV` evitando las lentas llamadas a BLAS Nivel 2 en arreglos pequeñas :pr:`17021` por :user:`Alex Gramfort <agramfort>` y :user:`Mathurin Massias <mathurinm>`.

source: |Enhancement| :func:`metrics.pairwise.pairwise_distances_chunked` now allows its ``reduce_func`` to not have a return value, enabling in-place operations. :pr:`16397` by `Joel Nothman`_.
es_es: |Enhancement| :func:`metrics.pairwise.pairwise_distances_chunked` permite ahora que su ``reduce_func`` no tenga valor de retorno, permitiendo operaciones in place. :pr:`16397` por `Joel Nothman`_.

source: |Fix| Fixed a bug in :func:`metrics.mean_squared_error` to not ignore argument `squared` when argument `multioutput='raw_values'`. :pr:`16323` by :user:`Rushabh Vasani <rushabh-v>`
es_es: |Fix| Se corrigió un error en :func:`metrics.mean_squared_error` para no ignorar el argumento `squared` cuando el argumento `multioutput='raw_values'`. :pr:`16323` por :user:`Rushabh Vasani <rushabh-v>`

source: |Fix| Fixed a bug in :func:`metrics.mutual_info_score` where negative scores could be returned. :pr:`16362` by `Thomas Fan`_.
es_es: |Fix| Se corrigió un error en :func:`metrics.mutual_info_score` donde se pudieron devolver puntuaciones negativas. :pr:`16362` por `Thomas Fan`_.

source: |Fix| Fixed a bug in :func:`metrics.confusion_matrix` that would raise an error when `y_true` and `y_pred` were length zero and `labels` was not `None`. In addition, we raise an error when an empty list is given to the `labels` parameter. :pr:`16442` by :user:`Kyle Parsons <parsons-kyle-89>`.
es_es: |Fix| Se corrigió un error en :func:`metrics.confusion_matrix` que generaba un error cuando `y_true` y `y_pred` tenían longitud cero y `labels` no era `None`. Además, se produce un error cuando se da una lista vacía al parámetro `labels`. :pr:`16442` por :user:`Kyle Parsons <parsons-kyle-89>`.
