Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.23.po
Languages: es_es

source: |API| Changed the formatting of values in :meth:`metrics.ConfusionMatrixDisplay.plot` and :func:`metrics.plot_confusion_matrix` to pick the shorter format (either '2g' or 'd'). :pr:`16159` by :user:`Rick Mackenbach <Rick-Mackenbach>` and `Thomas Fan`_.
es_es: |API| Cambiado el formato de los valores en :meth:`metrics.ConfusionMatrixDisplay.plot` y :func:`metrics.plot_confusion_matrix` para escoger el formato más corto (ya sea '2g' o 'd'). :pr:`16159` por :user:`Rick Mackenbach <Rick-Mackenbach>` y `Thomas Fan`_.

source: |API| From version 0.25, :func:`metrics.pairwise.pairwise_distances` will no longer automatically compute the ``VI`` parameter for Mahalanobis distance and the ``V`` parameter for seuclidean distance if ``Y`` is passed. The user will be expected to compute this parameter on the training data of their choice and pass it to `pairwise_distances`. :pr:`16993` by `Joel Nothman`_.
es_es: |API| A partir de la versión 0.25, :func:`metrics.pairwise.pairwise_distances` ya no calculará automáticamente el parámetro ``VI`` para la distancia de Mahalanobis y el parámetro ``V`` para la distancia seuclidean (distancia euclidiana estandarizada) si se pasa ``Y``. El usuario deberá calcular este parámetro en los datos de entrenamiento de su elección y pasarlo a `pairwise_distances`. :pr:`16993` por `Joel Nothman`_.

source: |Enhancement| :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` yields stack trace information in fit failed warning messages in addition to previously emitted type and details. :pr:`15622` by :user:`Gregory Morse <GregoryMorse>`.
es_es: |Enhancement| :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` produce información de rastreo de pila en los mensajes de advertencia de fallos de ajuste, además del tipo y los detalles emitidos previamente. :pr:`15622` por :user:`Gregory Morse <GregoryMorse>`.

source: |Fix| :func:`model_selection.cross_val_predict` supports `method="predict_proba"` when `y=None`. :pr:`15918` by :user:`Luca Kubin <lkubin>`.
es_es: |Fix| :func:`model_selection.cross_val_predict` soporta `method="predict_proba"` cuando `y=None`. :pr:`15918` por :user:`Luca Kubin <lkubin>`.

source: |Fix| :func:`model_selection.fit_grid_point` is deprecated in 0.23 and will be removed in 0.25. :pr:`16401` by :user:`Arie Pratama Sutiono <ariepratama>`
es_es: |Fix| :func:`model_selection.fit_grid_point` está obsoleto en 0.23 y se eliminará en 0.25. :pr:`16401` por :user:`Arie Pratama Sutiono <ariepratama>`

source: |Feature| :func:`multioutput.MultiOutputRegressor.fit` and :func:`multioutput.MultiOutputClassifier.fit` now can accept `fit_params` to pass to the `estimator.fit` method of each step. :issue:`15953` :pr:`15959` by :user:`Ke Huang <huangk10>`.
es_es: |Feature| :func:`multioutput.MultiOutputRegressor.fit` y :func:`multioutput.MultiOutputClassifier.fit` ahora pueden aceptar `fit_params` para pasar al método `estimator.fit` de cada paso. :issue:`15953` :pr:`15959` por :user:`Ke Huang <huangk10>`.

source: |Enhancement| :class:`multioutput.RegressorChain` now supports `fit_params` for `base_estimator` during `fit`. :pr:`16111` by :user:`Venkatachalam N <venkyyuvy>`.
es_es: |Enhancement| :class:`multioutput.RegressorChain` ahora soporta `fit_params` para `base_estimator` durante `fit`. :pr:`16111` por :user:`Venkatachalam N <venkyyuvy>`.

source: |Fix| A correctly formatted error message is shown in :class:`naive_bayes.CategoricalNB` when the number of features in the input differs between `predict` and `fit`. :pr:`16090` by :user:`Madhura Jayaratne <madhuracj>`.
es_es: |Fix| Se muestra un mensaje de error correctamente formateado en :class:`naive_bayes.CategoricalNB` cuando el número de características en la entrada difiere entre `predict` y `fit`. :pr:`16090` por :user:`Madhura Jayaratne <madhuracj>`.

source: |Efficiency| :class:`neural_network.MLPClassifier` and :class:`neural_network.MLPRegressor` has reduced memory footprint when using stochastic solvers, `'sgd'` or `'adam'`, and `shuffle=True`. :pr:`14075` by :user:`meyer89`.
es_es: |Efficiency| :class:`neural_network.MLPClassifier` y :class:`neural_network.MLPRegressor` ha reducido la huella de memoria cuando se utilizan solucionadores estocásticos, `'sgd'` o `'adam'`, y `shuffle=True`. :pr:`14075` por :user:`meyer89`.

source: |Fix| Increases the numerical stability of the logistic loss function in :class:`neural_network.MLPClassifier` by clipping the probabilities. :pr:`16117` by `Thomas Fan`_.
es_es: |Fix| Aumenta la estabilidad numérica de la función de pérdida logística en :class:`neural_network.MLPClassifier` recortando las probabilidades. :pr:`16117` por `Thomas Fan`_.

source: |Enhancement| :class:`inspection.PartialDependenceDisplay` now exposes the deciles lines as attributes so they can be hidden or customized. :pr:`15785` by `Nicolas Hug`_
es_es: |Enhancement| :class:`inspection.PartialDependenceDisplay` ahora expone las líneas de deciles como atributos para que se puedan ocultar o personalizar. :pr:`15785` por `Nicolas Hug`_

source: |Feature| argument `drop` of :class:`preprocessing.OneHotEncoder` will now accept value 'if_binary' and will drop the first category of each feature with two categories. :pr:`16245` by :user:`Rushabh Vasani <rushabh-v>`.
es_es: |Feature| El argumento `drop` de :class:`preprocessing.OneHotEncoder` ahora aceptará el valor 'if_binary' y eliminará la primera categoría de cada característica con dos categorías. :pr:`16245` por :user:`Rushabh Vasani <rushabh-v>`.

source: |Enhancement| :class:`preprocessing.OneHotEncoder`'s `drop_idx_` ndarray can now contain `None`, where `drop_idx_[i] = None` means that no category is dropped for index `i`. :pr:`16585` by :user:`Chiara Marmo <cmarmo>`.
es_es: |Enhancement| El ndarray `drop_idx_` de :class:`preprocessing.OneHotEncoder` ahora puede contener `None`, donde `drop_idx_[i] = None` significa que no se elimina ninguna categoría para el índice `i`. :pr:`16585` por :user:`Chiara Marmo <cmarmo>`.

source: |Enhancement| :class:`preprocessing.MaxAbsScaler`, :class:`preprocessing.MinMaxScaler`, :class:`preprocessing.StandardScaler`, :class:`preprocessing.PowerTransformer`, :class:`preprocessing.QuantileTransformer`, :class:`preprocessing.RobustScaler` now supports pandas' nullable integer dtype with missing values. :pr:`16508` by `Thomas Fan`_.
es_es: |Enhancement| :class:`preprocessing.MaxAbsScaler`, :class:`preprocessing.MinMaxScaler`, :class:`preprocessing.StandardScaler`, :class:`preprocessing.PowerTransformer`, :class:`preprocessing.QuantileTransformer`, :class:`preprocessing.RobustScaler` ahora soporta el dtype entero anulable de pandas con valores faltantes. :pr:`16508` por `Thomas Fan`_.

source: |Efficiency| :class:`preprocessing.OneHotEncoder` is now faster at transforming. :pr:`15762` by `Thomas Fan`_.
es_es: |Efficiency| :class:`preprocessing.OneHotEncoder` es ahora más rápido en la transformación. :pr:`15762` por `Thomas Fan`_.

source: |Fix| Fix a bug in :class:`preprocessing.StandardScaler` which was incorrectly computing statistics when calling `partial_fit` on sparse inputs. :pr:`16466` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se corrigió un error en :class:`preprocessing.StandardScaler` que calculaba incorrectamente las estadísticas al llamar a `partial_fit` en entradas dispersas. :pr:`16466` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fix a bug in :class:`preprocessing.Normalizer` with norm='max', which was not taking the absolute value of the maximum values before normalizing the vectors. :pr:`16632` by :user:`Maura Pintor <Maupin1991>` and :user:`Battista Biggio <bbiggio>`.
es_es: |Fix| Se corrigió un error en :class:`preprocessing.Normalizer` con norm='max', que no tomaba el valor absoluto de los valores máximos antes de normalizar los vectores. :pr:`16632` por :user:`Maura Pintor <Maupin1991>` y :user:`Battista Biggio <bbiggio>`.

source: |Fix| :class:`semi_supervised.LabelSpreading` and :class:`semi_supervised.LabelPropagation` avoids divide by zero warnings when normalizing `label_distributions_`. :pr:`15946` by :user:`ngshya`.
es_es: |Fix| :class:`semi_supervised.LabelSpreading` y :class:`semi_supervised.LabelPropagation` evita las advertencias de división por cero al normalizar `label_distributions_`. :pr:`15946` por :user:`ngshya`.

source: |Fix| |Efficiency| Improved ``libsvm`` and ``liblinear`` random number generators used to randomly select coordinates in the coordinate descent algorithms. Platform-dependent C ``rand()`` was used, which is only able to generate numbers up to ``32767`` on windows platform (see this `blog post <https://codeforces.com/blog/entry/61587>`_) and also has poor randomization power as suggested by `this presentation <https://channel9.msdn.com/Events/GoingNative/2013/rand-Considered-Harmful>`_. It was replaced with C++11 ``mt19937``, a Mersenne Twister that correctly generates 31bits/63bits random numbers on all platforms. In addition, the crude "modulo" postprocessor used to get a random number in a bounded interval was replaced by the tweaked Lemire method as suggested by `this blog post <http://www.pcg-random.org/posts/bounded-rands.html>`_. Any model using the :func:`svm.libsvm` or the :func:`svm.liblinear` solver, including :class:`svm.LinearSVC`, :class:`svm.LinearSVR`, :class:`svm.NuSVC`, :class:`svm.NuSVR`, :class:`svm.OneClassSVM`, :class:`svm.SVC`, :class:`svm.SVR`, :class:`linear_model.LogisticRegression`, is affected. In particular users can expect a better convergence when the number of samples (LibSVM) or the number of features (LibLinear) is large. :pr:`13511` by :user:`Sylvain Marié <smarie>`.
es_es: |Fix| |Efficiency| Mejora de los generadores de números aleatorios ``libsvm`` y ``liblinear`` utilizados para seleccionar aleatoriamente las coordenadas en los algoritmos de descenso de coordenadas. Se utilizaba ``rand()`` dependiente de la plataforma C, que sólo es capaz de generar números hasta ``32767`` en la plataforma Windows (ver esta `entrada del blog <https://codeforces.com/blog/entry/61587>`_) y además tiene una pobre potencia de aleatorización como sugiere `esta presentación <https://channel9.msdn.com/Events/GoingNative/2013/rand-Considered-Harmful>`_. Fue reemplazado con C++11 ``mt19937``, un Mersenne Twister que genera correctamente números aleatorios de 31bits/63bits en todas las plataformas. Además, el crudo postprocesador "modulo" utilizado para obtener un número aleatorio en un intervalo acotado fue reemplazado por el método Lemire ajustado, como se sugiere en `esta entrada del blog <http://www.pcg-random.org/posts/bounded-rands.html>`_. Cualquier modelo que utilice el solucionador :func:`svm.libsvm` o :func:`svm.liblinear`, incluyendo :class:`svm.LinearSVC`, :class:`svm.LinearSVR`, :class:`svm.NuSVC`, :class:`svm.NuSVR`, :class:`svm.OneClassSVM`, :class:`svm.SVC`, :class:`svm.SVR`, :class:`linear_model.LogisticRegression`, está afectado. En particular, los usuarios pueden esperar una mejor convergencia cuando el número de muestras (LibSVM) o el número de características (LibLinear) es grande. :pr:`13511` by :user:`Sylvain Marié <smarie>`.

source: |Fix| Fix use of custom kernel not taking float entries such as string kernels in :class:`svm.SVC` and :class:`svm.SVR`. Note that custom kennels are now expected to validate their input where they previously received valid numeric arrays. :pr:`11296` by `Alexandre Gramfort`_ and :user:`Georgi Peev <georgipeev>`.
es_es: |Fix| Arreglado el uso de kernels personalizados que no toman entradas flotantes como los kernels de cadena en :class:`svm.SVC` y :class:`svm.SVR`. Ten en cuenta que ahora se espera que los kernels personalizados validen su entrada cuando antes recibían arreglos numéricos válidos. :pr:`11296` por `Alexandre Gramfort`_ y :user:`Georgi Peev <georgipeev>`.

source: |API| :class:`svm.SVR` and :class:`svm.OneClassSVM` attributes, `probA_` and `probB_`, are now deprecated as they were not useful. :pr:`15558` by `Thomas Fan`_.
es_es: |API| Los atributos `probA_` y `probB_` de :class:`svm.SVR` y :class:`svm.OneClassSVM` ahora están obsoletos ya que no eran útiles. :pr:`15558` por `Thomas Fan`_.

source: |Fix| :func:`tree.plot_tree` `rotate` parameter was unused and has been deprecated. :pr:`15806` by :user:`Chiara Marmo <cmarmo>`.
es_es: |Fix| El parámetro `rotate` de :func:`tree.plot_tree` no se utilizó y ha quedado obsoleto. :pr:`15806` por :user:`Chiara Marmo <cmarmo>`.

source: |Fix| Fix support of read-only float32 array input in ``predict``, ``decision_path`` and ``predict_proba`` methods of :class:`tree.DecisionTreeClassifier`, :class:`tree.ExtraTreeClassifier` and :class:`ensemble.GradientBoostingClassifier` as well as ``predict`` method of :class:`tree.DecisionTreeRegressor`, :class:`tree.ExtraTreeRegressor`, and :class:`ensemble.GradientBoostingRegressor`. :pr:`16331` by :user:`Alexandre Batisse <batalex>`.
es_es: |Fix| Corregido el soporte del arreglo de entrada float32 de sólo lectura en los métodos ``predict``, ``decision_path`` y ``predict_proba`` de :class:`tree.DecisionTreeClassifier`, :class:`tree.ExtraTreeClassifier` y :class:`ensemble.GradientBoostingClassifier` así como el método ``predict`` de :class:`tree.DecisionTreeRegressor`, :class:`tree.ExtraTreeRegressor` y :class:`ensemble.GradientBoostingRegressor`. :pr:`16331` por :user:`Alexandre Batisse <batalex>`.

source: |MajorFeature| Estimators can now be displayed with a rich html representation. This can be enabled in Jupyter notebooks by setting `display='diagram'` in :func:`~sklearn.set_config`. The raw html can be returned by using :func:`utils.estimator_html_repr`. :pr:`14180` by `Thomas Fan`_.
es_es: |MajorFeature| Los estimadores ahora pueden mostrarse con una representación html enriquecida. Esto se puede activar en los cuadernos de Jupyter estableciendo `display='diagram'` en :func:`~sklearn.set_config`. El html en bruto puede ser devuelto utilizando :func:`utils.estimator_html_repr`. :pr:`14180` por `Thomas Fan`_.

source: |Enhancement| improve error message in :func:`utils.validation.column_or_1d`. :pr:`15926` by :user:`Loïc Estève <lesteve>`.
es_es: |Enhancement| Mejora del mensaje de error en :func:`utils.validation.column_or_1d`. :pr:`15926` por :user:`Loïc Estève <lesteve>`.

source: |Enhancement| add warning in :func:`utils.check_array` for pandas sparse DataFrame. :pr:`16021` by :user:`Rushabh Vasani <rushabh-v>`.
es_es: |Enhancement| añadida advertencia en :func:`utils.check_array` para DataFrame disperso de pandas. :pr:`16021` por :user:`Rushabh Vasani <rushabh-v>`.

source: |Enhancement| :func:`utils.check_array` now constructs a sparse matrix from a pandas DataFrame that contains only `SparseArray` columns. :pr:`16728` by `Thomas Fan`_.
es_es: |Enhancement| :func:`utils.check_array` ahora construye una matriz dispersa a partir de un DataFrame de pandas que contiene solo columnas `SparseArray`. :pr:`16728` por `Thomas Fan`_.

source: |Enhancement| :func:`utils.validation.check_array` supports pandas' nullable integer dtype with missing values when `force_all_finite` is set to `False` or `'allow-nan'` in which case the data is converted to floating point values where `pd.NA` values are replaced by `np.nan`. As a consequence, all :mod:`sklearn.preprocessing` transformers that accept numeric inputs with missing values represented as `np.nan` now also accepts being directly fed pandas dataframes with `pd.Int* or `pd.Uint*` typed columns that use `pd.NA` as a missing value marker. :pr:`16508` by `Thomas Fan`_.
es_es: |Enhancement| :func:`utils.validation.check_array` soporta el tipo de dato entero anulable de pandas con valores faltantes cuando `force_all_finite` se establece como `False` o `'allow-nan'` en cuyo caso los datos se convierten a valores de punto flotante donde los valores `pd.NA` son reemplazados por `np.nan`. Como consecuencia, todos los transformadores :mod:`sklearn.preprocessing` que aceptan entradas numéricas con valores faltantes representados como `np.nan` ahora también aceptan ser suministrados directamente por dataframes de pandas con columnas de tipo `pd.Int*` o `pd.Uint*` que utilizan `pd.NA` como marcador de valores faltantes. :pr:`16508` por `Thomas Fan`_.

source: |API| Passing classes to :func:`utils.estimator_checks.check_estimator` and :func:`utils.estimator_checks.parametrize_with_checks` is now deprecated, and support for classes will be removed in 0.24. Pass instances instead. :pr:`17032` by `Nicolas Hug`_.
es_es: |API| Pasar clases a :func:`utils.estimator_checks.check_estimator` y :func:`utils.estimator_checks.parametrize_with_checks` está ahora obsoleto, y el soporte para las clases será eliminado en 0.24. Pase instancias en su lugar. :pr:`17032` por `Nicolas Hug`_.

source: |API| The private utility `_safe_tags` in `utils.estimator_checks` was removed, hence all tags should be obtained through `estimator._get_tags()`. Note that Mixins like `RegressorMixin` must come *before* base classes in the MRO for `_get_tags()` to work properly. :pr:`16950` by `Nicolas Hug`_.
es_es: |API| Se eliminó la utilidad privada `_safe_tags` en `utils.estimator_checks`, por lo tanto todas las etiquetas deben obtenerse a través de `estimator._get_tags()`. Ten en cuenta que los Mixins como `RegressorMixin` deben venir *antes* de las clases base en el MRO para que `_get_tags()` funcione correctamente. :pr:`16950` por `Nicolas Hug`_.

source: |FIX| :func:`utils.all_estimators` now only returns public estimators. :pr:`15380` by `Thomas Fan`_.
es_es: |FIX| :func:`utils.all_estimators` ahora sólo devuelve estimadores públicos. :pr:`15380` por `Thomas Fan`_.

source: |MajorFeature| Adds a HTML representation of estimators to be shown in a jupyter notebook or lab. This visualization is acitivated by setting the `display` option in :func:`sklearn.set_config`. :pr:`14180` by `Thomas Fan`_.
es_es: |MajorFeature| Añade una representación HTML de los estimadores para ser mostrados en un cuaderno de jupyter o jupyter lab. Esta visualización se activa estableciendo la opción `display` en :func:`sklearn.set_config`. :pr:`14180` por `Thomas Fan`_.

source: |Enhancement| ``scikit-learn`` now works with ``mypy`` without errors. :pr:`16726` by `Roman Yurchak`_.
es_es: |Enhancement| ``scikit-learn`` ahora funciona con ``mypy`` sin errores. :pr:`16726` por `Roman Yurchak`_.

source: |API| Most estimators now expose a `n_features_in_` attribute. This attribute is equal to the number of features passed to the `fit` method. See `SLEP010 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep010/proposal.html>`_ for details. :pr:`16112` by `Nicolas Hug`_.
es_es: |API| La mayoría de los estimadores ahora cuentan con un atributo `n_features_in_`. Este atributo es igual al número de características pasadas al método `fit`. Ver `SLEP010 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep010/proposal.html>`_ para más detalles. :pr:`16112` por `Nicolas Hug`_.

source: |API| Estimators now have a `requires_y` tags which is False by default except for estimators that inherit from `~sklearn.base.RegressorMixin` or `~sklearn.base.ClassifierMixin`. This tag is used to ensure that a proper error message is raised when y was expected but None was passed. :pr:`16622` by `Nicolas Hug`_.
es_es: |API| Los estimadores tienen ahora una etiqueta `requires_y` que es False por defecto excepto para los estimadores que heredan de `~sklearn.base.RegressorMixin` o `~sklearn.base.ClassifierMixin`. Esta etiqueta se utiliza para garantizar que se genere un mensaje de error adecuado cuando se esperaba y pero se pasó None. :pr:`16622` por `Nicolas Hug`_.

source: |API| The default setting `print_changed_only` has been changed from False to True. This means that the `repr` of estimators is now more concise and only shows the parameters whose default value has been changed when printing an estimator. You can restore the previous behaviour by using `sklearn.set_config(print_changed_only=False)`. Also, note that it is always possible to quickly inspect the parameters of any estimator using `est.get_params(deep=False)`. :pr:`17061` by `Nicolas Hug`_.
es_es: |API| La configuración por defecto `print_changed_only` se ha cambiado de False a True. Esto significa que el `repr` de los estimadores es ahora más conciso y sólo muestra los parámetros cuyo valor por defecto ha sido cambiado al imprimir un estimador. Puede restaurar el comportamiento anterior utilizando `sklearn.set_config(print_changed_only=False)`. Además, ten en cuenta que siempre es posible inspeccionar rápidamente los parámetros de cualquier estimador utilizando `est.get_params(deep=False)`. :pr:`17061` por `Nicolas Hug`_.

source: Code and Documentation Contributors
es_es: Colaboradores de código y documentación

source: Thanks to everyone who has contributed to the maintenance and improvement of the project since version 0.22, including:
es_es: Gracias a todos los que han contribuido al mantenimiento y la mejora del proyecto desde la versión 0.22, incluyendo:
