Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.21.po
Languages: es_es

source: Legend for changelogs
es_es: Leyenda para registros de cambios

source: |MajorFeature|: something big that you couldn't do before.
es_es: |MajorFeature|: algo grande que no podías hacer antes.

source: |Feature|: something that you couldn't do before.
es_es: |Feature|: algo que no podías hacer antes.

source: |Efficiency|: an existing feature now may not require as much computation or memory.
es_es: |Eficiency|: una característica existente ahora puede no requerir tanto cálculo o memoria.

source: |Enhancement|: a miscellaneous minor improvement.
es_es: |Enhancement|: una mejora menor variada.

source: |Fix|: something that previously didn't work as documentated -- or according to reasonable expectations -- should now work.
es_es: |Fix|: algo que anteriormente no funcionaba según lo documentado -- o según las expectativas razonables -- ahora debería funcionar.

source: |API|: you will need to change your code to have the same effect in the future; or a feature will be removed in the future.
es_es: |API|: tendrás que cambiar tu código para tener el mismo efecto en el futuro; o una característica será eliminada en el futuro.

source: **July 30, 2019**
es_es: **30 de julio de 2019**

source: Changed models
es_es: Modelos modificados

source: The following estimators and functions, when fit with the same data and parameters, may produce different models from the previous version. This often occurs due to changes in the modelling logic (bug fixes or enhancements), or in random sampling procedures.
es_es: Los siguientes estimadores y funciones, cuando se ajustan con los mismos datos y parámetros, pueden producir modelos diferentes de la versión anterior. Esto suele ocurrir debido a cambios en la lógica de modelado (corrección de errores o mejoras), o en los procedimientos de muestreo aleatorio.

source: The v0.20.0 release notes failed to mention a backwards incompatibility in :func:`metrics.make_scorer` when `needs_proba=True` and `y_true` is binary. Now, the scorer function is supposed to accept a 1D `y_pred` (i.e., probability of the positive class, shape `(n_samples,)`), instead of a 2D `y_pred` (i.e., shape `(n_samples, 2)`).
es_es: Las notas de publicación de la versión v0.20.0 no mencionan una incompatibilidad con versiones anteriores en :func:`metrics.make_scorer` cuando `needs_proba=True` y `y_true` es binario. Ahora, se supone que la función scorer acepta un `y_pred` 1D (es decir, la probabilidad de la clase positiva, de forma `(n_samples,)`), en lugar de un `y_pred` 2D (es decir, de forma `(n_samples, 2)`).

source: Changelog
es_es: Registro de cambios

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where computation with `init='random'` was single threaded for `n_jobs > 1` or `n_jobs = -1`. :pr:`12955` by :user:`Prabakaran Kumaresshan <nixphix>`.
es_es: |Fix| Se ha corregido un error en :class:`cluster.KMeans` por el que el cálculo con `init='random' era de un solo hilo cuando `n_jobs > 1` o `n_jobs = -1`. :pr:`12955` por :user:`Prabakaran Kumaresshan <nixphix>`.

source: |Fix| Fixed a bug in :class:`cluster.OPTICS` where users were unable to pass float `min_samples` and `min_cluster_size`. :pr:`14496` by :user:`Fabian Klopfer <someusername1>` and :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error en :class:`cluster.OPTICS` por el que los usuarios no podían pasar números de punto flotante (float) `min_samples` y `min_cluster_size`. :pr:`14496` por :user:`Fabian Klopfer <someusername1>` y :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where KMeans++ initialisation could rarely result in an IndexError. :issue:`11756` by `Joel Nothman`_.
es_es: |Fix| Se ha corregido un error en :class:`cluster.KMeans` por el que la inicialización de KMeans++ podía provocar raramente un IndexError. :issue:`11756` por `Joel Nothman`_.

source: |Fix| Fixed an issue in :class:`compose.ColumnTransformer` where using DataFrames whose column order differs between :func:``fit`` and :func:``transform`` could lead to silently passing incorrect columns to the ``remainder`` transformer. :pr:`14237` by `Andreas Schuderer <schuderer>`.
es_es: |Fix| Se ha corregido una incidencia en :class:`compose.ColumnTransformer` por el que el uso de DataFrames cuyo orden de columnas difiere entre :func:``fit`` y :func:``transform`` podía llevar a pasar silenciosamente columnas incorrectas al transformador ``remainder``. :pr:`14237` por `Andreas Schuderer <schuderer>`.

source: |Fix| :func:`datasets.fetch_california_housing`, :func:`datasets.fetch_covtype`, :func:`datasets.fetch_kddcup99`, :func:`datasets.fetch_olivetti_faces`, :func:`datasets.fetch_rcv1`, and :func:`datasets.fetch_species_distributions` try to persist the previously cache using the new ``joblib`` if the cached data was persisted using the deprecated ``sklearn.externals.joblib``. This behavior is set to be deprecated and removed in v0.23. :pr:`14197` by `Adrin Jalali`_.
es_es: |Fix| :func:`datasets.fetch_california_housing`, :func:`datasets.fetch_covtype`, :func:`datasets.fetch_kddcup99`, :func:`datasets.fetch_olivetti_faces`, :func:`datasets.fetch_rcv1`, y :func:`datasets.fetch_species_distributions` intentan conservar la caché anterior utilizando la nueva ``joblib`` si los datos almacenados en la caché se conservaron utilizando la obsoleta ``sklearn.externals.joblib``. Este comportamiento se establece como obsoleto y se elimina en la v0.23. :pr:`14197` por `Adrin Jalali`_.

source: |Fix| Fix zero division error in :func:`HistGradientBoostingClassifier` and :func:`HistGradientBoostingRegressor`. :pr:`14024` by `Nicolas Hug <NicolasHug>`.
es_es: |Fix| Se corrigió el error de división cero en :func:`HistGradientBoostingClassifier` y :func:`HistGradientBoostingRegressor`. :pr:`14024` por `Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug in :class:`impute.SimpleImputer` and :class:`impute.IterativeImputer` so that no errors are thrown when there are missing values in training data. :pr:`13974` by `Frank Hoang <fhoang7>`.
es_es: | Fijar | Se corrigió un error en :class:`impute.SimpleImputer` y en :class:`impute.IterativeImputer` para que no se produzcan errores cuando hay valores faltantes en los datos de entrenamiento. :pr:`13974` por `Frank Hoang <fhoang7>`.

source: |Fix| Fixed a bug in :func:`inspection.plot_partial_dependence` where ``target`` parameter was not being taken into account for multiclass problems. :pr:`14393` by :user:`Guillem G. Subies <guillemgsubies>`.
es_es: |Fix| Se ha corregido un error en :func:`inspection.plot_partial_dependence` por el que no se tenía en cuenta el parámetro ``target`` para los problemas multiclase. :pr:`14393` por :user:`Guillem G. Subies <guillemgsubies>`.

source: |Fix| Fixed a bug in :class:`linear_model.LogisticRegressionCV` where ``refit=False`` would fail depending on the ``'multiclass'`` and ``'penalty'`` parameters (regression introduced in 0.21). :pr:`14087` by `Nicolas Hug`_.
es_es: |Fix| Se ha corregido un error en :class:`linear_model.LogisticRegressionCV` donde ``refit=False`` fallaría dependiendo de los parámetros ``'multiclass'`` y ``'penalty'`` (regresión introducida en 0.21). :pr:`14087` por `Nicolas Hug`_.

source: |Fix| Compatibility fix for :class:`linear_model.ARDRegression` and Scipy>=1.3.0. Adapts to upstream changes to the default `pinvh` cutoff threshold which otherwise results in poor accuracy in some cases. :pr:`14067` by :user:`Tim Staley <timstaley>`.
es_es: |Fix| Corrección de compatibilidad para :class:`linear_model.ARDRegression` y Scipy>=1.3.0. Se adapta a los cambios en el umbral de corte predeterminado de `pinvh` que, de lo contrario, da lugar a una mala exactitud en algunos casos. :pr:`14067` por :user:`Tim Staley <timstaley>`.

source: |Fix| Fixed a bug in :class:`neighbors.NeighborhoodComponentsAnalysis` where the validation of initial parameters ``n_components``, ``max_iter`` and ``tol`` required too strict types. :pr:`14092` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se ha corregido un error en :class:`neighbors.NeighborhoodComponentsAnalysis` por el que la validación de los parámetros iniciales ``n_components``, ``max_iter`` y ``tol`` requería tipos demasiado estrictos. :pr:`14092` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed bug in :func:`tree.export_text` when the tree has one feature and a single feature name is passed in. :pr:`14053` by `Thomas Fan`.
es_es: |Fix| Corregido error en :func:`tree.export_text` cuando el árbol tiene una característica y se pasa un único nombre de característica. :pr:`14053` por `Thomas Fan`.

source: |Fix| Fixed an issue with :func:`plot_tree` where it displayed entropy calculations even for `gini` criterion in DecisionTreeClassifiers. :pr:`13947` by :user:`Frank Hoang <fhoang7>`.
es_es: |Fix| Se ha corregido un problema con :func:`plot_tree` en el que se mostraban los cálculos de entropía incluso para el criterio `gini` en DecisionTreeClassifiers. :pr:`13947` por :user:`Frank Hoang <fhoang7>`.

source: Version 0.21.2
es_es: Versión 0.21.2

source: **24 May 2019**
es_es: **24 de mayo de 2019**

source: |Fix| Fixed a bug in :class:`cross_decomposition.CCA` improving numerical stability when `Y` is close to zero. :pr:`13903` by `Thomas Fan`_.
es_es: |Fix| Se ha corregido un error en :class:`cross_decomposition.CCA` mejorando la estabilidad numérica cuando `Y` es cercano a cero. :pr:`13903` por `Thomas Fan`_.

source: |Fix| Fixed a bug in :func:`metrics.pairwise.euclidean_distances` where a part of the distance matrix was left un-instanciated for suffiently large float32 datasets (regression introduced in 0.21). :pr:`13910` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se ha corregido un error en :func:`metrics.pairwise.euclidean_distances` por el que una parte de la matriz de distancias se dejaba sin instanciar para conjuntos de datos float32 suficientemente grandes (regresión introducida en 0.21). :pr:`13910` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`preprocessing.OneHotEncoder` where the new `drop` parameter was not reflected in `get_feature_names`. :pr:`13894` by :user:`James Myatt <jamesmyatt>`.
es_es: |Fix| Se ha corregido un error en :class:`preprocessing.OneHotEncoder` por el que el nuevo parámetro `drop` no se reflejaba en `get_feature_names`. :pr:`13894` por :user:`James Myatt <jamesmyatt>`.

source: |Fix| Fixed a bug where :func:`min_max_axis` would fail on 32-bit systems for certain large inputs. This affects :class:`preprocessing.MaxAbsScaler`, :func:`preprocessing.normalize` and :class:`preprocessing.LabelBinarizer`. :pr:`13741` by :user:`Roddy MacSween <rlms>`.
es_es: |Fix| Se ha corregido un error por el que :func:`min_max_axis` fallaba en sistemas de 32 bits para ciertas entradas grandes. Esto afecta a :class:`preprocessing.MaxAbsScaler`, :func:`preprocessing.normalize` y :class:`preprocessing.LabelBinarizer`. :pr:`13741` por :user:`Roddy MacSween <rlms>`.

source: Version 0.21.1
es_es: Versión 0.21.1

source: **17 May 2019**
es_es: **17 de mayo de 2019**

source: This is a bug-fix release to primarily resolve some packaging issues in version 0.21.0. It also includes minor documentation improvements and some bug fixes.
es_es: Esta es una versión de corrección de errores para resolver principalmente algunos problemas de empaquetado de la versión 0.21.0. También incluye mejoras menores en la documentación y algunas correcciones de errores.

source: |Fix| Fixed a bug in :func:`inspection.partial_dependence` to only check classifier and not regressor for the multiclass-multioutput case. :pr:`14309` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se ha corregido un error en :func:`inspection.partial_dependence` para que sólo compruebe el clasificador y no el regresor para el caso de multiclase-multisalida. :pr:`14309` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`metrics.pairwise_distances` where it would raise ``AttributeError`` for boolean metrics when ``X`` had a boolean dtype and ``Y == None``. :issue:`13864` by :user:`Paresh Mathur <rick2047>`.
es_es: |Fix| Se ha corregido un error en :class:`metrics.pairwise_distances` por el que aparecía ``AttributeError`` para métricas booleanas cuando ``X`` tenía un dtype booleano y ``Y == None``. :issue:`13864` por :user:`Paresh Mathur <rick2047>`.

source: |Fix| Fixed two bugs in :class:`metrics.pairwise_distances` when ``n_jobs > 1``. First it used to return a distance matrix with same dtype as input, even for integer dtype. Then the diagonal was not zeros for euclidean metric when ``Y`` is ``X``. :issue:`13877` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se han corregido dos errores en :class:`metrics.pairwise_distances` cuando ``n_jobs > 1``. En primer lugar, solía devolver una matriz de distancias con el mismo tipo de entrada (dtype), incluso para un tipo de entrada entero. Luego la diagonal no era cero para la métrica euclidiana cuando ``Y`` es ``X``. :issue:`13877` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`neighbors.KernelDensity` which could not be restored from a pickle if ``sample_weight`` had been used. :issue:`13772` by :user:`Aditya Vyas <aditya1702>`.
es_es: |Fix| Se ha corregido un error en :class:`neighbors.KernelDensity` que no podía restaurarse desde un pickle si se había utilizado ``sample_weight``. :issue:`13772` por :user:`Aditya Vyas <aditya1702>`.

source: Version 0.21.0
es_es: Versión 0.21.0

source: **May 2019**
es_es: **Mayo de 2019**

source: :class:`discriminant_analysis.LinearDiscriminantAnalysis` for multiclass classification. |Fix|
es_es: :class:`discriminant_analysis.LinearDiscriminantAnalysis` para clasificación multiclase. |Fix|

source: :class:`discriminant_analysis.LinearDiscriminantAnalysis` with 'eigen' solver. |Fix|
es_es: :class:`discriminant_analysis.LinearDiscriminantAnalysis` con solucionador 'eigen'. |Fix|

source: Decision trees and derived ensembles when both `max_depth` and `max_leaf_nodes` are set. |Fix|
es_es: Árboles de decisión y ensembles derivados cuando se establecen tanto `max_depth` como `max_leaf_nodes`. |Fix|

source: :class:`linear_model.LogisticRegression` and :class:`linear_model.LogisticRegressionCV` with 'saga' solver. |Fix|
es_es: :class:`linear_model.LogisticRegression` y :class:`linear_model.LogisticRegressionCV` con solucionador 'saga'. |Fix|

source: :class:`sklearn.feature_extraction.text.HashingVectorizer`, :class:`sklearn.feature_extraction.text.TfidfVectorizer`, and :class:`sklearn.feature_extraction.text.CountVectorizer` |Fix|
es_es: :class:`sklearn.feature_extraction.text.HashingVectorizer`, :class:`sklearn.feature_extraction.text.TfidfVectorizer` y :class:`sklearn.feature_extraction.text.CountVectorizer` |Fix|

source: :func:`svm.SVC.decision_function` and :func:`multiclass.OneVsOneClassifier.decision_function`. |Fix|
es_es: :func:`svm.SVC.decision_function` y :func:`multiclass.OneVsOneClassifier.decision_function`. |Fix|

source: :class:`linear_model.SGDClassifier` and any derived classifiers. |Fix|
es_es: :class:`linear_model.SGDClassifier` y cualquier clasificador derivado. |Fix|

source: Any model using the :func:`linear_model._sag.sag_solver` function with a `0` seed, including :class:`linear_model.LogisticRegression`, :class:`linear_model.LogisticRegressionCV`, :class:`linear_model.Ridge`, and :class:`linear_model.RidgeCV` with 'sag' solver. |Fix|
es_es: Cualquier modelo que utilice la función :func:`linear_model._sag.sag_solver` con una semilla `0`, incluyendo :class:`linear_model.LogisticRegression`, :class:`linear_model.LogisticRegressionCV`, :class:`linear_model.Ridge`, y :class:`linear_model.RidgeCV` con el solucionador 'sag'. |Fix|

source: :class:`linear_model.RidgeCV` when using leave-one-out cross-validation with sparse inputs. |Fix|
es_es: :class:`linear_model.RidgeCV` cuando se utiliza la validación cruzada dejando uno fuera (leave-one-out) con entradas dispersas. |Fix|

source: Details are listed in the changelog below.
es_es: Los detalles se encuentran en el registro de cambios más abajo.

source: (While we are trying to better inform users by providing this information, we cannot assure that this list is complete.)
es_es: (Mientras intentamos informar mejor a los usuarios proporcionando esta información, no podemos asegurar que esta lista esté completa.)

source: Known Major Bugs
es_es: Mayores Errores Conocidos

source: The default `max_iter` for :class:`linear_model.LogisticRegression` is too small for many solvers given the default `tol`. In particular, we accidentally changed the default `max_iter` for the liblinear solver from 1000 to 100 iterations in :pr:`3591` released in version 0.16. In a future release we hope to choose better default `max_iter` and `tol` heuristically depending on the solver (see :pr:`13317`).
es_es: El valor predeterminado de `max_iter` para :class:`linear_model.LogisticRegression` es demasiado pequeño para muchos solucionadores dado el valor predeterminado de `tol`. En particular, cambiamos accidentalmente `max_iter` predeterminado para el solucionador liblinear de 1000 a 100 iteraciones en :pr:`3591` publicado en la versión 0.16. En una futura versión esperamos elegir mejor los valores predeterminados de `max_iter` y `tol` de forma heurística dependiendo del solucionador (ver :pr:`13317`).

source: Support for Python 3.4 and below has been officially dropped.
es_es: El soporte para Python 3.4 e inferior ha sido oficialmente eliminado.

source: |API| The R2 score used when calling ``score`` on a regressor will use ``multioutput='uniform_average'`` from version 0.23 to keep consistent with :func:`metrics.r2_score`. This will influence the ``score`` method of all the multioutput regressors (except for :class:`multioutput.MultiOutputRegressor`). :pr:`13157` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |API| La puntuación R2 utilizada cuando se llama a ``score`` en un regresor utilizará ``multioutput='uniform_average'`` desde la versión 0.23 para mantener la coherencia con :func:`metrics.r2_score`. Esto influirá en el método ``score`` de todos los regresores de salida múltiple (excepto en :class:`multioutput.MultiOutputRegressor`). :pr:`13157` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Enhancement| Added support to bin the data passed into :class:`calibration.calibration_curve` by quantiles instead of uniformly between 0 and 1. :pr:`13086` by :user:`Scott Cole <srcole>`.
es_es: |Enhancement| Se ha añadido soporte para dividir los datos pasados a :class:`calibration.calibration_curve` por cuantiles en lugar de uniformemente entre 0 y 1. :pr:`13086` por :user:`Scott Cole <srcole>`.

source: |Enhancement| Allow n-dimensional arrays as input for `calibration.CalibratedClassifierCV`. :pr:`13485` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |Enhancement| Se permiten arreglos n-dimensionales como entrada para `calibration.CalibratedClassifierCV`. :pr:`13485` by :user:`William de Vazelhes <wdevazelhes>`.

source: |MajorFeature| A new clustering algorithm: :class:`cluster.OPTICS`: an algorithm related to :class:`cluster.DBSCAN`, that has hyperparameters easier to set and that scales better, by :user:`Shane <espg>`, `Adrin Jalali`_, :user:`Erich Schubert <kno10>`, `Hanmin Qin`_, and :user:`Assia Benbihi <assiaben>`.
es_es: |MajorFeature| Un nuevo algoritmo de agrupamiento: :class:`cluster.OPTICS`: un algoritmo relacionado con :class:`cluster.DBSCAN`, que tiene hiperparámetros más fáciles de establecer y que escala mejor, por :user:`Shane <espg>`, `Adrin Jalali`_, :user:`Erich Schubert <kno10>`, `Hanmin Qin`_, y :user:`Assia Benbihi <assiaben>`.

source: |Fix| Fixed a bug where :class:`cluster.Birch` could occasionally raise an AttributeError. :pr:`13651` by `Joel Nothman`_.
es_es: |Fix| Se ha corregido un error por el que :class:`cluster.Birch` podía ocasionalmente lanzar un AttributeError. :pr:`13651` por `Joel Nothman`_.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where empty clusters weren't correctly relocated when using sample weights. :pr:`13486` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se ha corregido un error en :class:`cluster.KMeans` por el que los conglomerados vacíos no se reubicaban correctamente cuando se utilizaban ponderaciones de muestra. :pr:`13486` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |API| The ``n_components_`` attribute in :class:`cluster.AgglomerativeClustering` and :class:`cluster.FeatureAgglomeration` has been renamed to ``n_connected_components_``. :pr:`13427` by :user:`Stephane Couvreur <scouvreur>`.
es_es: |API| El atributo ``n_components_`` en :class:`cluster.AgglomerativeClustering` y :class:`cluster.FeatureAgglomeration` ha sido renombrado a ``n_connected_components_``. :pr:`13427` por :user:`Stephane Couvreur <scouvreur>`.

source: |Enhancement| :class:`cluster.AgglomerativeClustering` and :class:`cluster.FeatureAgglomeration` now accept a ``distance_threshold`` parameter which can be used to find the clusters instead of ``n_clusters``. :issue:`9069` by :user:`Vathsala Achar <VathsalaAchar>` and `Adrin Jalali`_.
es_es: |Enhancement| :class:`cluster.AgglomerativeClustering` y :class:`cluster.FeatureAgglomeration` ahora aceptan un parámetro ``distance_threshold`` que puede utilizarse para encontrar los conglomerados en lugar de ``n_clusters``. :issue:`9069` por :user:`Vathsala Achar <VathsalaAchar>` y `Adrin Jalali`_.

source: |API| :class:`compose.ColumnTransformer` is no longer an experimental feature. :pr:`13835` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |API| :class:`compose.ColumnTransformer` ya no es una función experimental. :pr:`13835` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Added support for 64-bit group IDs and pointers in SVMLight files. :pr:`10727` by :user:`Bryan K Woods <bryan-woods>`.
es_es: |Fix| Se ha añadido soporte para IDs de grupo de 64 bits y punteros en archivos SVMLight. :pr:`10727` por :user:`Bryan K Woods <bryan-woods>`.

source: |Fix| :func:`datasets.load_sample_images` returns images with a deterministic order. :pr:`13250` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |Fix| :func:`datasets.load_sample_images` devuelve imágenes con un orden determinístico. :pr:`13250` por :user:`Thomas Fan <thomasjpfan>`.

source: |Enhancement| :class:`decomposition.KernelPCA` now has deterministic output (resolved sign ambiguity in eigenvalue decomposition of the kernel matrix). :pr:`13241` by :user:`Aurélien Bellet <bellet>`.
es_es: |Enhancement| :class:`decomposition.KernelPCA` ahora tiene una salida determinista (resuelta la ambigüedad de signo en la descomposición de valores propios de la matriz kernel). :pr:`13241` por :user:`Aurélien Bellet <bellet>`.

source: |Fix| Fixed a bug in :class:`decomposition.KernelPCA`, `fit().transform()` now produces the correct output (the same as `fit_transform()`) in case of non-removed zero eigenvalues (`remove_zero_eig=False`). `fit_inverse_transform` was also accelerated by using the same trick as `fit_transform` to compute the transform of `X`. :pr:`12143` by :user:`Sylvain Marié <smarie>`
es_es: |Fix| Se ha corregido un error en :class:`decomposition.KernelPCA`, `fit().transform()` ahora produce la salida correcta (la misma que `fit_transform()`) en caso de autovalores no eliminados (`remove_zero_eig=False`). También se ha acelerado `fit_inverse_transform` utilizando el mismo truco que en `fit_transform` para calcular la transformada de `X`. :pr:`12143` por :user:`Sylvain Marié <smarie>`
