Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.23.po
Languages: es_es

source: Version 0.23.2
es_es: Versión 0.23.2

source: Changed models
es_es: Modelos cambiados

source: The following estimators and functions, when fit with the same data and parameters, may produce different models from the previous version. This often occurs due to changes in the modelling logic (bug fixes or enhancements), or in random sampling procedures.
es_es: Los siguientes estimadores y funciones, cuando se ajustan con los mismos datos y parámetros, pueden producir modelos diferentes de la versión anterior. Esto suele ocurrir debido a cambios en la lógica de modelización (corrección de errores o mejoras), o en los procedimientos de muestreo aleatorio.

source: |Fix| ``inertia_`` attribute of :class:`cluster.KMeans` and :class:`cluster.MiniBatchKMeans`.
es_es: |Fix| atributo ``inertia_`` de :class:`cluster.KMeans` y :class:`cluster.MiniBatchKMeans`.

source: Details are listed in the changelog below.
es_es: Los detalles están listados en el registro de cambios a continuación.

source: (While we are trying to better inform users by providing this information, we cannot assure that this list is complete.)
es_es: (Mientras intentamos informar mejor a los usuarios proporcionando esta información, no podemos asegurar que esta lista esté completa.)

source: Changelog
es_es: Registro de cambios

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where rounding errors could prevent convergence to be declared when `tol=0`. :pr:`17959` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.KMeans` donde los errores de redondeo podían impedir que se declarara la convergencia cuando `tol=0`. :pr:`17959` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` and :class:`cluster.MiniBatchKMeans` where the reported inertia was incorrectly weighted by the sample weights. :pr:`17848` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.KMeans` y :class:`cluster.MiniBatchKMeans` donde la inercia informada se ponderaba incorrectamente por los pesos de la muestra. :pr:`17848` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`cluster.MeanShift` with `bin_seeding=True`. When the estimated bandwidth is 0, the behavior is equivalent to `bin_seeding=False`. :pr:`17742` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.MeanShift` con `bin_seeding=True`. Cuando el ancho de banda estimado es 0, el comportamiento es equivalente a `bin_seeding=False`. :pr:`17742` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`cluster.AffinityPropagation`, that gives incorrect clusters when the array dtype is float32. :pr:`17995` by :user:`Thomaz Santana <Wikilicious>` and :user:`Amanda Dsouza <amy12xx>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.AffinityPropagation`, que da conglomerados(clusters) incorrectos cuando el dtype del arreglo es float32. :pr:`17995` por :user:`Thomaz Santana <Wikilicious>` y :user:`Amanda Dsouza <amy12xx>`.

source: |Fix| Fixed a bug in :func:`decomposition.MiniBatchDictionaryLearning.partial_fit` which should update the dictionary by iterating only once over a mini-batch. :pr:`17433` by :user:`Chiara Marmo <cmarmo>`.
es_es: |Fix| Se corrigió un error en :func:`decomposition.MiniBatchDictionaryLearning.partial_fit` que debería actualizar el diccionario iterando solo una vez sobre un minilote. :pr:`17433` por :user:`Chiara Marmo <cmarmo>`.

source: |Fix| Avoid overflows on Windows in :func:`decomposition.IncrementalPCA.partial_fit` for large ``batch_size`` and ``n_samples`` values. :pr:`17985` by :user:`Alan Butler <aldee153>` and :user:`Amanda Dsouza <amy12xx>`.
es_es: |Fix| Evita desbordamientos en Windows en :func:`decomposition.IncrementalPCA.partial_fit` para valores grandes de ``batch_size`` y ``n_samples``. :pr:`17985` por :user:`Alan Butler <aldee153>` y :user:`Amanda Dsouza <amy12xx>`.

source: |Fix| Fixed bug in :class:`ensemble.MultinomialDeviance` where the average of logloss was incorrectly calculated as sum of logloss. :pr:`17694` by :user:`Markus Rempfler <rempfler>` and :user:`Tsutomu Kusanagi <t-kusanagi2>`.
es_es: |Fix| Se corrigió un error en :class:`ensemble.MultinomialDeviance` donde el promedio de la pérdida logarítmica se calculaba incorrectamente como suma de pérdidas logarítmicas. :pr:`17694` por :user:`Markus Rempfler <rempfler>` y :user:`Tsutomu Kusanagi <t-kusanagi2>`.

source: |Fix| Fixes :class:`ensemble.StackingClassifier` and :class:`ensemble.StackingRegressor` compatibility with estimators that do not define `n_features_in_`. :pr:`17357` by `Thomas Fan`_.
es_es: |Fix| Corregida la compatibilidad de :class:`ensemble.StackingClassifier` y :class:`ensemble.StackingRegressor` con los estimadores que no definen `n_features_in_`. :pr:`17357` por `Thomas Fan`_.

source: |Fix| Fixes bug in :class:`feature_extraction.text.CountVectorizer` where sample order invariance was broken when `max_features` was set and features had the same count. :pr:`18016` by `Thomas Fan`_, `Roman Yurchak`_, and `Joel Nothman`_.
es_es: |Fix| Corregido un error en :class:`feature_extraction.text.CountVectorizer` donde la invarianza del orden de las muestras se rompía cuando se establecía `max_features` y las características tenían el mismo conteo. :pr:`18016` por `Thomas Fan`_, `Roman Yurchak`_, y `Joel Nothman`_.

source: |Fix| :func:`linear_model.lars_path` does not overwrite `X` when `X_copy=True` and `Gram='auto'`. :pr:`17914` by `Thomas Fan`_.
es_es: |Fix| :func:`linear_model.lars_path` no sobrescribe `X` cuando `X_copy=True` y `Gram='auto'`. :pr:`17914` por `Thomas Fan`_.

source: |Fix| Fixed a bug where :func:`metrics.pairwise_distances` would raise an error if ``metric='seuclidean'`` and ``X`` is not type ``np.float64``. :pr:`15730` by :user:`Forrest Koch <ForrestCKoch>`.
es_es: |Fix| Se corrigió un error donde :func:`metrics.pairwise_distances` daba lugar a un error si ``metric='seuclidean'`` y ``X`` no es del tipo ``np.float64``. :pr:`15730` por :user:`Forrest Koch <ForrestCKoch>`.

source: |Fix| Fixed a bug in :func:`metrics.mean_squared_error` where the average of multiple RMSE values was incorrectly calculated as the root of the average of multiple MSE values. :pr:`17309` by :user:`Swier Heeres <swierh>`.
es_es: |Fix| Se corrigió un error en :func:`metrics.mean_squared_error` donde el promedio de múltiples valores RMSE se calculaba incorrectamente como la raíz del promedio de múltiples valores MSE. :pr:`17309` por :user:`Swier Heeres <swierh>`.

source: |Fix| :class:`pipeline.FeatureUnion` raises a deprecation warning when `None` is included in `transformer_list`. :pr:`17360` by `Thomas Fan`_.
es_es: |Fix| :class:`pipeline.FeatureUnion` genera una advertencia de obsolescencia cuando se incluye `None` en `transformer_list`. :pr:`17360` por `Thomas Fan`_.

source: |Fix| Fix :func:`utils.estimator_checks.check_estimator` so that all test cases support the `binary_only` estimator tag. :pr:`17812` by :user:`Bruno Charron <brcharron>`.
es_es: |Fix| Corregida :func:`utils.estimator_checks.check_estimator` para que todos los casos de prueba soporten la etiqueta de estimador `binary_only`. :pr:`17812` por :user:`Bruno Charron <brcharron>`.

source: Version 0.23.1
es_es: Versión 0.23.1

source: **May 18 2020**
es_es: **18 de mayo de 2020**

source: |Efficiency| :class:`cluster.KMeans` efficiency has been improved for very small datasets. In particular it cannot spawn idle threads any more. :pr:`17210` and :pr:`17235` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Efficiency| Se ha mejorado la eficiencia de :class:`cluster.KMeans` para conjuntos de datos muy pequeños. En particular, ya no puede generar hilos inactivos. :pr:`17210` y :pr:`17235` por :user:`Jeremie du Boisberranger <jeremiedbb>.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where the sample weights provided by the user were modified in place. :pr:`17204` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.KMeans` donde las ponderaciones de la muestra proporcionadas por el usuario se modificaban en su lugar. :pr:`17204` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: Miscellaneous
es_es: Varios

source: |Fix| Fixed a bug in the `repr` of third-party estimators that use a `**kwargs` parameter in their constructor, when `changed_only` is True which is now the default. :pr:`17205` by `Nicolas Hug`_.
es_es: |Fix| Se corrigió un error en el `repr` de los estimadores de terceros que utilizan un parámetro `**kwargs` en su constructor, cuando `changed_only` es True que es ahora el valor por defecto. :pr:`17205` por `Nicolas Hug`_.

source: Version 0.23.0
es_es: Versión 0.23.0

source: **May 12 2020**
es_es: **12 de mayo de 2020**

source: For a short description of the main highlights of the release, please refer to :ref:`sphx_glr_auto_examples_release_highlights_plot_release_highlights_0_23_0.py`.
es_es: Para una breve descripción de los principales aspectos de la versión, consulta :ref:`sphx_glr_auto_examples_release_highlights_plot_release_highlights_0_23_0.py`.

source: Legend for changelogs
es_es: Leyenda para registros de cambios

source: |MajorFeature|: something big that you couldn't do before.
es_es: |MajorFeature|: algo grande que antes no podías hacer.

source: |Feature|: something that you couldn't do before.
es_es: |Feature|: algo que antes no podías hacer.

source: |Efficiency|: an existing feature now may not require as much computation or memory.
es_es: |Efficiency|: una característica existente ahora puede no requerir tanto cálculo o memoria.

source: |Enhancement|: a miscellaneous minor improvement.
es_es: |Enhancement|: una mejora menor variada.

source: |Fix|: something that previously didn't work as documentated -- or according to reasonable expectations -- should now work.
es_es: |Fix|: algo que anteriormente no funcionaba según lo documentado -- o según las expectativas razonables -- ahora debería funcionar.

source: |API|: you will need to change your code to have the same effect in the future; or a feature will be removed in the future.
es_es: |API|: tendrás que cambiar tu código para tener el mismo efecto en el futuro; o una característica será eliminada en el futuro.

source: Enforcing keyword-only arguments
es_es: Aplicación de argumentos basados en palabras clave

source: In an effort to promote clear and non-ambiguous use of the library, most constructor and function parameters are now expected to be passed as keyword arguments (i.e. using the `param=value` syntax) instead of positional. To ease the transition, a `FutureWarning` is raised if a keyword-only parameter is used as positional. In version 1.0 (renaming of 0.25), these parameters will be strictly keyword-only, and a `TypeError` will be raised. :issue:`15005` by `Joel Nothman`_, `Adrin Jalali`_, `Thomas Fan`_, and `Nicolas Hug`_. See `SLEP009 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep009/proposal.html>`_ for more details.
es_es: En un esfuerzo por promover un uso claro y no ambiguo de la biblioteca, se espera que la mayoría de los parámetros de constructores y funciones se pasen como argumentos de palabra clave (es decir, utilizando la sintaxis `param=valor`) en lugar de posicionales. Para facilitar la transición, se genera un `FutureWarning` si un parámetro de palabra clave se utiliza como posicional. En la versión 1.0 (cambio de nombre de la 0.25), estos parámetros serán estrictamente de palabra clave, y se generará un `TypeError`. :issue:`15005` por `Joel Nothman`_, `Adrin Jalali`_, `Thomas Fan`_, y `Nicolas Hug`_. Ver `SLEP009 <https://scikit-learn-enhancement-proposals.readthedocs.io/en/latest/slep009/proposal.html>`_ para más detalles.

source: |Fix| :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor`, and :class:`ensemble.IsolationForest`.
es_es: |Fix| :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor`, y :class:`ensemble.IsolationForest`.

source: |Fix| :class:`cluster.KMeans` with ``algorithm="elkan"`` and ``algorithm="full"``.
es_es: |Fix| :class:`cluster.KMeans` con ``algorithm="elkan"`` y ``algorithm="full"``.

source: |Fix| :class:`decomposition.PCA` with `n_components='mle'`
es_es: |Fix| :class:`decomposition.PCA` con `n_components='mle'`

source: |Enhancement| :class:`decomposition.NMF` and :func:`decomposition.non_negative_factorization` with float32 dtype input.
es_es: |Enhancement| :class:`decomposition.NMF` y :func:`decomposition.non_negative_factorization` con entrada de tipo float32.

source: |API| :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor`
es_es: |API| :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor`

source: |Fix| ``estimator_samples_`` in :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` and :class:`ensemble.IsolationForest`
es_es: |Fix| ``estimator_samples_`` en :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` y :class:`ensemble.IsolationForest`

source: |Fix| :class:`ensemble.StackingClassifier` and :class:`ensemble.StackingRegressor` with `sample_weight`
es_es: |Fix| :class:`ensemble.StackingClassifier` y :class:`ensemble.StackingRegressor` con `sample_weight`

source: |Fix| :class:`linear_model.RANSACRegressor` with ``sample_weight``.
es_es: |Fix| :class:`linear_model.RANSACRegressor` con ``sample_weight``.

source: |Fix| :func:`metrics.mean_squared_error` with `squared` and `multioutput='raw_values'`.
es_es: |Fix| :func:`metrics.mean_squared_error` con `squared` y `multioutput='raw_values'`.

source: |Fix| :func:`metrics.mutual_info_score` with negative scores.
es_es: |Fix| :func:`metrics.mutual_info_score` con puntuaciones negativas.

source: |Fix| :func:`metrics.confusion_matrix` with zero length `y_true` and `y_pred`
es_es: |Fix| :func:`metrics.confusion_matrix` con longitud cero `y_true` y `y_pred`

source: |Fix| :class:`preprocessing.StandardScaler` with `partial_fit` and sparse input.
es_es: |Fix| :class:`preprocessing.StandardScaler` con `partial_fit` y entrada dispersa.

source: |Fix| :class:`preprocessing.Normalizer` with norm='max'
es_es: |Fix| :class:`preprocessing.Normalizer` con norm='max'

source: |Fix| Any model using the :func:`svm.libsvm` or the :func:`svm.liblinear` solver, including :class:`svm.LinearSVC`, :class:`svm.LinearSVR`, :class:`svm.NuSVC`, :class:`svm.NuSVR`, :class:`svm.OneClassSVM`, :class:`svm.SVC`, :class:`svm.SVR`, :class:`linear_model.LogisticRegression`.
es_es: |Fix| Cualquier modelo que utilice el solucionador :func:`svm.libsvm` o :func:`svm.liblinear`, incluyendo :class:`svm.LinearSVC`, :class:`svm.LinearSVR`, :class:`svm.NuSVC`, :class:`svm.NuSVR`, :class:`svm.OneClassSVM`, :class:`svm.SVC`, :class:`svm.SVR`, :class:`linear_model.LogisticRegression`.

source: |Fix| :class:`tree.DecisionTreeClassifier`, :class:`tree.ExtraTreeClassifier` and :class:`ensemble.GradientBoostingClassifier` as well as ``predict`` method of :class:`tree.DecisionTreeRegressor`, :class:`tree.ExtraTreeRegressor`, and :class:`ensemble.GradientBoostingRegressor` and read-only float32 input in ``predict``, ``decision_path`` and ``predict_proba``.
es_es: |Fix| :class:`tree.DecisionTreeClassifier`, :class:`tree.ExtraTreeClassifier` y :class:`ensemble.GradientBoostingClassifier` así como el método ``predict`` de :class:`tree.DecisionTreeRegressor`, :class:`tree.ExtraTreeRegressor`, y :class:`ensemble.GradientBoostingRegressor` y la entrada de sólo lectura float32 en ``predict``, ``decision_path`` y ``predict_proba``.

source: |Efficiency| :class:`cluster.Birch` implementation of the predict method avoids high memory footprint by calculating the distances matrix using a chunked scheme. :pr:`16149` by :user:`Jeremie du Boisberranger <jeremiedbb>` and :user:`Alex Shacked <alexshacked>`.
es_es: |Efficiency| :class:`cluster.Birch` la implementación del método de predicción evita un alto consumo de memoria calculando la matriz de distancias utilizando un esquema en porciones. :pr:`16149` por :user:`Jeremie du Boisberranger <jeremiedbb>` y :user:`Alex Shacked <alexshacked>`.

source: |Efficiency| |MajorFeature| The critical parts of :class:`cluster.KMeans` have a more optimized implementation. Parallelism is now over the data instead of over initializations allowing better scalability. :pr:`11950` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Efficiency| |MajorFeature| Las partes críticas de :class:`cluster.KMeans` tienen una implementación más optimizada. El paralelismo es ahora sobre los datos en lugar de sobre las inicializaciones permitiendo una mejor escalabilidad. :pr:`11950` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Enhancement| :class:`cluster.KMeans` now supports sparse data when `solver = "elkan"`. :pr:`11950` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Enhancement| :class:`cluster.KMeans` ahora soporta datos dispersos cuando `solver = "elkan"`. :pr:`11950` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Enhancement| :class:`cluster.AgglomerativeClustering` has a faster and more memory efficient implementation of single linkage clustering. :pr:`11514` by :user:`Leland McInnes <lmcinnes>`.
es_es: |Enhancement| :class:`cluster.AgglomerativeClustering` tiene una implementación más rápida y eficiente en memoria de la agrupación de enlazamiento único. :pr:`11514` por :user:`Leland McInnes <lmcinnes>`.

source: |Fix| :class:`cluster.KMeans` with ``algorithm="elkan"`` now converges with ``tol=0`` as with the default ``algorithm="full"``. :pr:`16075` by :user:`Erich Schubert <kno10>`.
es_es: |Fix| :class:`cluster.KMeans` con ``algorithm="elkan"`` ahora converge con ``tol=0`` como con el ``algorithm="full"`` por defecto. :pr:`16075` por :user:`Erich Schubert <kno10>`.

source: |Fix| Fixed a bug in :class:`cluster.Birch` where the `n_clusters` parameter could not have a `np.int64` type. :pr:`16484` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :class:`cluster.Birch` donde el parámetro `n_clusters` no podía tener un tipo `np.int64`. :pr:`16484` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Fix| :class:`cluster.AgglomerativeCluClustering` add specific error when distance matrix is not square and `affinity=precomputed`. :pr:`16257` by :user:`Simona Maggio <simonamaggio>`.
es_es: |Fix| :class:`cluster.AgglomerativeCluClustering` añadir error específico cuando la matriz de distancia no es cuadrada y `affinity=precomputed`. :pr:`16257` por :user:`Simona Maggio <simonamaggio>`.

source: |API| The ``n_jobs`` parameter of :class:`cluster.KMeans`, :class:`cluster.SpectralCoclustering` and :class:`cluster.SpectralBiclustering` is deprecated. They now use OpenMP based parallelism. For more details on how to control the number of threads, please refer to our :ref:`parallelism` notes. :pr:`11950` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |API| El parámetro ``n_jobs`` de :class:`cluster.KMeans`, :class:`cluster.SpectralCoclustering` y :class:`cluster.SpectralBiclustering` está obsoleto. Ahora utilizan el paralelismo basado en OpenMP. Para más detalles sobre cómo controlar el número de hilos, consulte nuestras notas sobre :ref:`parallelism`. :pr:`11950` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |API| The ``precompute_distances`` parameter of :class:`cluster.KMeans` is deprecated. It has no effect. :pr:`11950` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |API| El parámetro ``precompute_distances`` de :class:`cluster.KMeans` está obsoleto. No tiene ningún efecto. :pr:`11950` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |API| The ``random_state`` parameter has been added to :class:`cluster.AffinityPropagation`. :pr:`16801` by :user:`rcwoolston` and :user:`Chiara Marmo <cmarmo>`.
es_es: |API| El parámetro ``random_state`` ha sido añadido a :class:`cluster.AffinityPropagation`. :pr:`16801` por :user:`rcwoolston` y :user:`Chiara Marmo <cmarmo>`.

source: |Efficiency| :class:`compose.ColumnTransformer` is now faster when working with dataframes and strings are used to specific subsets of data for transformers. :pr:`16431` by `Thomas Fan`_.
es_es: |Efficiency| :class:`compose.ColumnTransformer` es ahora más rápido cuando se trabaja con dataframes y se utilizan cadenas de caracteres para subconjuntos específicos de datos para transformadores. :pr:`16431` por `Thomas Fan`_.

source: |Enhancement| :class:`compose.ColumnTransformer` method ``get_feature_names`` now supports `'passthrough'` columns, with the feature name being either the column name for a dataframe, or `'xi'` for column index `i`. :pr:`14048` by :user:`Lewis Ball <lrjball>`.
es_es: |Enhancement| El método ``get_feature_names`` de :class:`compose.ColumnTransformer` ahora soporta columnas `'passthrough'', siendo el nombre de la característica el nombre de la columna para un dataframe, o `'xi'` para el índice de la columna `i`. :pr:`14048` por :user:`Lewis Ball <lrjball>`.

source: |Fix| :class:`compose.ColumnTransformer` method ``get_feature_names`` now returns correct results when one of the transformer steps applies on an empty list of columns :pr:`15963` by `Roman Yurchak`_.
es_es: |Fix| El método ``get_feature_names`` de :class:`compose.ColumnTransformer` ahora devuelve resultados correctos cuando uno de los pasos del transformador se aplica en una lista vacía de columnas :pr:`15963` por `Roman Yurchak`_.

source: |Fix| :func:`compose.ColumnTransformer.fit` will error when selecting a column name that is not unique in the dataframe. :pr:`16431` by `Thomas Fan`_.
es_es: |Fix| :func:`compose.ColumnTransformer.fit` dará error al seleccionar un nombre de columna que no es único en el dataframe. :pr:`16431` por `Thomas Fan`_.

source: |Efficiency| :func:`datasets.fetch_openml` has reduced memory usage because it no longer stores the full dataset text stream in memory. :pr:`16084` by `Joel Nothman`_.
es_es: |Efficiency| :func:`datasets.fetch_openml` ha reducido el uso de memoria porque ya no almacena el flujo de texto completo del conjunto de datos en memoria. :pr:`16084` por `Joel Nothman`_.

source: |Feature| :func:`datasets.fetch_california_housing` now supports heterogeneous data using pandas by setting `as_frame=True`. :pr:`15950` by :user:`Stephanie Andrews <gitsteph>` and :user:`Reshama Shaikh <reshamas>`.
es_es: |Feature| :func:`datasets.fetch_california_housing` ahora soporta datos heterogéneos utilizando pandas al establecer `as_frame=True`. :pr:`15950` por :user:`Stephanie Andrews <gitsteph>` y :user:`Reshama Shaikh <reshamas>`.

source: |Feature| embedded dataset loaders :func:`load_breast_cancer`, :func:`load_diabetes`, :func:`load_digits`, :func:`load_iris`, :func:`load_linnerud` and :func:`load_wine` now support loading as a pandas ``DataFrame`` by setting `as_frame=True`. :pr:`15980` by :user:`wconnell` and :user:`Reshama Shaikh <reshamas>`.
es_es: |Feature| Los cargadores de conjuntos de datos incrustados(embedded ) :func:`load_breast_cancer`, :func:`load_diabetes`, :func:`load_digits`, :func:`load_iris`, :func:`load_linnerud` y :func:`load_wine` ahora soportan la carga como un ``DataFrame`` de pandas estableciendo `as_frame=True`. :pr:`15980` por :user:`wconnell` y :user:`Reshama Shaikh <reshamas>`.
