Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.21.po
Languages: es_es

source: |Fix| Fixed a bug in :class:`decomposition.NMF` where `init = 'nndsvd'`, `init = 'nndsvda'`, and `init = 'nndsvdar'` are allowed when `n_components < n_features` instead of `n_components <= min(n_samples, n_features)`. :pr:`11650` by :user:`Hossein Pourbozorg <hossein-pourbozorg>` and :user:`Zijie (ZJ) Poh <zjpoh>`.
es_es: |Fix| Se ha corregido un error en :class:`decomposition.NMF` donde `init = 'nndsvd'`, `init = 'nndsvda'`, y `init = 'nndsvdar'` se permiten cuando `n_components < n_features` en lugar de `n_components <= min(n_samples, n_features)`. :pr:`11650` por :user:`Hossein Pourbozorg <hossein-pourbozorg>` y :user:`Zijie (ZJ) Poh <zjpoh>`.

source: |API| The default value of the :code:`init` argument in :func:`decomposition.non_negative_factorization` will change from :code:`random` to :code:`None` in version 0.23 to make it consistent with :class:`decomposition.NMF`. A FutureWarning is raised when the default value is used. :pr:`12988` by :user:`Zijie (ZJ) Poh <zjpoh>`.
es_es: |API| El valor predeterminado del argumento :code:`init` en :func:`decomposition.non_negative_factorization` cambiará de :code:`random` a :code:`None` en la versión 0.23 para hacerlo consistente con :class:`decomposition.NMF`. Se genera un FutureWarning cuando se utiliza el valor predeterminado. :pr:`12988` por :user:`Zijie (ZJ) Poh <zjpoh>`.

source: |Enhancement| :class:`discriminant_analysis.LinearDiscriminantAnalysis` now preserves ``float32`` and ``float64`` dtypes. :pr:`8769` and :pr:`11000` by :user:`Thibault Sejourne <thibsej>`
es_es: |Enhancement| :class:`discriminant_analysis.LinearDiscriminantAnalysis` ahora preserva los dtypes ``float32`` y ``float64``. :pr:`8769` y :pr:`11000` por :user:`Thibault Sejourne <thibsej>`

source: |Fix| A ``ChangedBehaviourWarning`` is now raised when :class:`discriminant_analysis.LinearDiscriminantAnalysis` is given as parameter ``n_components > min(n_features, n_classes - 1)``, and ``n_components`` is changed to ``min(n_features, n_classes - 1)`` if so. Previously the change was made, but silently. :pr:`11526` by :user:`William de Vazelhes<wdevazelhes>`.
es_es: |Fix| Ahora se genera un ``ChangedBehaviourWarning`` cuando :class:`discriminant_analysis.LinearDiscriminantAnalysis` se da como parámetro ``n_components > min(n_features, n_classes - 1)``, y ``n_components`` se cambia a ``min(n_features, n_classes - 1)`` si es así. Anteriormente el cambio se hizo, pero en silencio. :pr:`11526` por :user:`William de Vazelhes <wdevazelhes>`.

source: |Fix| Fixed a bug in :class:`discriminant_analysis.LinearDiscriminantAnalysis` where the predicted probabilities would be incorrectly computed in the multiclass case. :pr:`6848`, by :user:`Agamemnon Krasoulis <agamemnonc>` and `Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se ha corregido un error en :class:`discriminant_analysis.LinearDiscriminantAnalysis` por el que las probabilidades predichas se calculaban incorrectamente en el caso multiclase. :pr:`6848`, por :user:`Agamemnon Krasoulis <agamemnonc>` y `Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`discriminant_analysis.LinearDiscriminantAnalysis` where the predicted probabilities would be incorrectly computed with ``eigen`` solver. :pr:`11727`, by :user:`Agamemnon Krasoulis <agamemnonc>`.
es_es: |Fix| Se ha corregido un error en :class:`discriminant_analysis.LinearDiscriminantAnalysis` por el que las probabilidades predichas se calculaban incorrectamente con el solucionador ``eigen``. :pr:`11727`, por :user:`Agamemnon Krasoulis <agamemnonc>`.

source: |Fix| Fixed a bug in :class:`dummy.DummyClassifier` where the ``predict_proba`` method was returning int32 array instead of float64 for the ``stratified`` strategy. :pr:`13266` by :user:`Christos Aridas<chkoar>`.
es_es: |Fix| Se ha corregido un error en :class:`dummy.DummyClassifier` por el que el método ``predict_proba`` devolvía un arreglo de int32 en lugar de float64 para la estrategia ``stratified``. :pr:`13266` por :user:`Christos Aridas <chkoar>`.

source: |Fix| Fixed a bug in :class:`dummy.DummyClassifier` where it was throwing a dimension mismatch error in prediction time if a column vector ``y`` with ``shape=(n, 1)`` was given at ``fit`` time. :pr:`13545` by :user:`Nick Sorros <nsorros>` and `Adrin Jalali`_.
es_es: |Fix| Se ha corregido un error en :class:`dummy.DummyClassifier` por el que se generaba un error de desajuste de dimensiones en el tiempo de predicción si se daba un vector columna ``y`` con ``shape=(n, 1)`` en tiempo de ``fit``. :pr:`13545` por :user:`Nick Sorros <nsorros>` y `Adrin Jalali`_.

source: |MajorFeature| Add two new implementations of gradient boosting trees: :class:`ensemble.HistGradientBoostingClassifier` and :class:`ensemble.HistGradientBoostingRegressor`. The implementation of these estimators is inspired by `LightGBM <https://github.com/Microsoft/LightGBM>`_ and can be orders of magnitude faster than :class:`ensemble.GradientBoostingRegressor` and :class:`ensemble.GradientBoostingClassifier` when the number of samples is larger than tens of thousands of samples. The API of these new estimators is slightly different, and some of the features from :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` are not yet supported.
es_es: |MajorFeature| Se añaden dos nuevas implementaciones de árboles de potenciación del gradiente: :class:`ensemble.HistGradientBoostingClassifier` y :class:`ensemble.HistGradientBoostingRegressor`. La implementación de estos estimadores está inspirada en `LightGBM <https://github.com/Microsoft/LightGBM>`_ y puede ser órdenes de magnitud más rápida que :class:`ensemble.GradientBoostingRegressor` y :class:`ensemble.GradientBoostingClassifier` cuando el número de muestras es mayor que decenas de miles de muestras. La API de estos nuevos estimadores es ligeramente diferente, y algunas de las características de :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` aún no son compatibles.

source: These new estimators are experimental, which means that their results or their API might change without any deprecation cycle. To use them, you need to explicitly import ``enable_hist_gradient_boosting``::
es_es: Estos nuevos estimadores son experimentales, lo que significa que sus resultados o su API podrían cambiar sin ningún ciclo de obsolescencia. Para utilizarlos, es necesario importar explícitamente ``enable_hist_gradient_boosting``::

source: :pr:`12807` by :user:`Nicolas Hug<NicolasHug>`.
es_es: :pr:`12807` por :user:`Nicolas Hug <NicolasHug>`.

source: |Feature| Add :class:`ensemble.VotingRegressor` which provides an equivalent of :class:`ensemble.VotingClassifier` for regression problems. :pr:`12513` by :user:`Ramil Nugmanov <stsouko>` and :user:`Mohamed Ali Jamaoui <mohamed-ali>`.
es_es: |Feature| Se añade :class:`ensemble.VotingRegressor` que proporciona un equivalente de :class:`ensemble.VotingClassifier` para problemas de regresión. :pr:`12513` por :user:`Ramil Nugmanov <stsouko>` y :user:`Mohamed Ali Jamaoui <mohamed-ali>`.

source: |Efficiency| Make :class:`ensemble.IsolationForest` prefer threads over processes when running with ``n_jobs > 1`` as the underlying decision tree fit calls do release the GIL. This changes reduces memory usage and communication overhead. :pr:`12543` by :user:`Isaac Storch <istorch>` and `Olivier Grisel`_.
es_es: |Efficiency| Se hace que :class:`ensemble.IsolationForest` prefiera los hilos sobre los procesos cuando se ejecuta con ``n_jobs > 1`` ya que las llamadas de ajuste del árbol de decisión subyacente liberan el GIL. Este cambio reduce el uso de memoria y la sobrecarga de comunicación. :pr:`12543` por :user:`Isaac Storch <istorch>` y `Olivier Grisel`_.

source: |Efficiency| Make :class:`ensemble.IsolationForest` more memory efficient by avoiding keeping in memory each tree prediction. :pr:`13260` by `Nicolas Goix`_.
es_es: |Efficiency| Se hace más eficiente la memoria de :class:`ensemble.IsolationForest` evitando mantener en memoria cada predicción del árbol. :pr:`13260` por `Nicolas Goix`_.

source: |Efficiency| :class:`ensemble.IsolationForest` now uses chunks of data at prediction step, thus capping the memory usage. :pr:`13283` by `Nicolas Goix`_.
es_es: |Efficiency| :class:`ensemble.IsolationForest` ahora utiliza porciones de datos en el paso de predicción, limitando así el uso de memoria. :pr:`13283` por `Nicolas Goix`_.

source: |Efficiency| :class:`sklearn.ensemble.GradientBoostingClassifier` and :class:`sklearn.ensemble.GradientBoostingRegressor` now keep the input ``y`` as ``float64`` to avoid it being copied internally by trees. :pr:`13524` by `Adrin Jalali`_.
es_es: |Efficiency| Ahora :class:`sklearn.ensemble.GradientBoostingClassifier` y :class:`sklearn.ensemble.GradientBoostingRegressor` mantienen la entrada ``y`` como ``float64`` para evitar que sea copiada internamente por los árboles. :pr:`13524` por `Adrin Jalali`_.

source: |Enhancement| Minimized the validation of X in :class:`ensemble.AdaBoostClassifier` and :class:`ensemble.AdaBoostRegressor` :pr:`13174` by :user:`Christos Aridas <chkoar>`.
es_es: |Enhancement| Se ha minimizado la validación de X en :class:`ensemble.AdaBoostClassifier` y :class:`ensemble.AdaBoostRegressor` :pr:`13174` por :user:`Christos Aridas <chkoar>`.

source: |Enhancement| :class:`ensemble.IsolationForest` now exposes ``warm_start`` parameter, allowing iterative addition of trees to an isolation forest. :pr:`13496` by :user:`Peter Marko <petibear>`.
es_es: |Enhancement| :class:`ensemble.IsolationForest` ahora expone el parámetro ``warm_start``, permitiendo la adición iterativa de árboles a un bosque de aislamiento. :pr:`13496` por :user:`Peter Marko <petibear>`.

source: |Fix| The values of ``feature_importances_`` in all random forest based models (i.e. :class:`ensemble.RandomForestClassifier`, :class:`ensemble.RandomForestRegressor`, :class:`ensemble.ExtraTreesClassifier`, :class:`ensemble.ExtraTreesRegressor`, :class:`ensemble.RandomTreesEmbedding`, :class:`ensemble.GradientBoostingClassifier`, and :class:`ensemble.GradientBoostingRegressor`) now:
es_es: |Fix| Los valores de ``feature_importances_`` en todos los modelos basados en bosques aleatorios (es decir, :class:`ensemble.RandomForestClassifier`, :class:`ensemble.RandomForestRegressor`, :class:`ensemble. ExtraTreesClassifier`, :class:`ensemble.ExtraTreesRegressor`, :class:`ensemble.RandomTreesEmbedding`, :class:`ensemble.GradientBoostingClassifier`, y :class:`ensemble.GradientBoostingRegressor`) ahora:

source: sum up to ``1``
es_es: suma hasta ``1``

source: all the single node trees in feature importance calculation are ignored
es_es: se ignoran todos los árboles de un solo nodo en el cálculo de la importancia de las características

source: in case all trees have only one single node (i.e. a root node), feature importances will be an array of all zeros.
es_es: en caso de que todos los árboles tengan un solo nodo (es decir, un nodo raíz), las importancias de las características serán un arreglo de todos los ceros.

source: :pr:`13636` and :pr:`13620` by `Adrin Jalali`_.
es_es: :pr:`13636` y :pr:`13620` por `Adrin Jalali`_.

source: |Fix| Fixed a bug in :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor`, which didn't support scikit-learn estimators as the initial estimator. Also added support of initial estimator which does not support sample weights. :pr:`12436` by :user:`Jérémie du Boisberranger <jeremiedbb>` and :pr:`12983` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor`, que no admitían los estimadores de scikit-learn como estimador inicial. También se ha añadido soporte para el estimador inicial que no admitía ponderaciones de muestra. :pr:`12436` por :user:`Jérémie du Boisberranger <jeremiedbb>` y :pr:`12983` por :user:`Nicolas Hug<NicolasHug>`.

source: |Fix| Fixed the output of the average path length computed in :class:`ensemble.IsolationForest` when the input is either 0, 1 or 2. :pr:`13251` by :user:`Albert Thomas <albertcthomas>` and :user:`joshuakennethjones <joshuakennethjones>`.
es_es: |Fix| Corregida la salida de la longitud promedio del camino calculada en :class:`ensemble.IsolationForest` cuando la entrada es 0, 1 o 2. :pr:`13251` por :user:`Albert Thomas <albertcthomas>` y :user:`joshuakennethjones <joshuakennethjones>`.

source: |Fix| Fixed a bug in :class:`ensemble.GradientBoostingClassifier` where the gradients would be incorrectly computed in multiclass classification problems. :pr:`12715` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.GradientBoostingClassifier` por el que los gradientes se calculaban incorrectamente en problemas de clasificación multiclase. :pr:`12715` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug in :class:`ensemble.GradientBoostingClassifier` where validation sets for early stopping were not sampled with stratification. :pr:`13164` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.GradientBoostingClassifier` por el que los conjuntos de validación para la parada temprana no se muestreaban con estratificación. :pr:`13164` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug in :class:`ensemble.GradientBoostingClassifier` where the default initial prediction of a multiclass classifier would predict the classes priors instead of the log of the priors. :pr:`12983` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.GradientBoostingClassifier` por el que la predicción inicial por defecto de un clasificador multiclase predecía las clases a priori en lugar del logaritmo de las mismas. :pr:`12983` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug in :class:`ensemble.RandomForestClassifier` where the ``predict`` method would error for multiclass multioutput forests models if any targets were strings. :pr:`12834` by :user:`Elizabeth Sander <elsander>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.RandomForestClassifier` por el que el método ``predict`` daba un error en los modelos de bosques multiclase multisalida si algún objetivo era una cadena. :pr:`12834` por :user:`Elizabeth Sander <elsander>`.

source: |Fix| Fixed a bug in :class:`ensemble.gradient_boosting.LossFunction` and :class:`ensemble.gradient_boosting.LeastSquaresError` where the default value of ``learning_rate`` in ``update_terminal_regions`` is not consistent with the document and the caller functions. Note however that directly using these loss functions is deprecated. :pr:`6463` by :user:`movelikeriver <movelikeriver>`.
es_es: |Fix| Se ha corregido un error en :class:`ensemble.gradient_boosting.LossFunction` y :class:`ensemble.gradient_boosting.LeastSquaresError` donde el valor predeterminado de ``learning_rate`` en ``update_terminal_regions`` no es consistente con el documento y las funciones de llamada. Ten en cuenta, sin embargo, que el uso directo de estas funciones de pérdida está obsoleto. :pr:`6463` by :user:`movelikeriver <movelikeriver>`.

source: |Fix| :func:`ensemble.partial_dependence` (and consequently the new version :func:`sklearn.inspection.partial_dependence`) now takes sample weights into account for the partial dependence computation when the gradient boosting model has been trained with sample weights. :pr:`13193` by :user:`Samuel O. Ronsin <samronsin>`.
es_es: |Fix| :func:`ensemble.partial_dependence` (y en consecuencia la nueva versión :func:`sklearn.inspection.partial_dependence`) ahora tiene en cuenta las ponderaciones de la muestra para el cálculo de la dependencia parcial cuando el modelo de potenciación del gradiente ha sido entrenado con ponderaciones de la muestra. :pr:`13193` por :user:`Samuel O. Ronsin <samronsin>`.

source: |API| :func:`ensemble.partial_dependence` and :func:`ensemble.plot_partial_dependence` are now deprecated in favor of :func:`inspection.partial_dependence<sklearn.inspection.partial_dependence>` and :func:`inspection.plot_partial_dependence<sklearn.inspection.plot_partial_dependence>`. :pr:`12599` by :user:`Trevor Stephens<trevorstephens>` and :user:`Nicolas Hug<NicolasHug>`.
es_es: |API| :func:`ensemble.partial_dependence` y :func:`ensemble.plot_partial_dependence` están ahora obsoletos en favor de :func:`inspection.partial_dependence <sklearn.inspection. partial_dependence>` y :func:`inspection.plot_partial_dependence <sklearn.inspection.plot_partial_dependence>`. :pr:`12599` por :user:`Trevor Stephens <trevorstephens>` y :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| :class:`ensemble.VotingClassifier` and :class:`ensemble.VotingRegressor` were failing during ``fit`` in one of the estimators was set to ``None`` and ``sample_weight`` was not ``None``. :pr:`13779` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| :class:`ensemble.VotingClassifier` y :class:`ensemble.VotingRegressor` fallaban durante ``fit`` en uno de los estimadores se establecía como ``None`` y ``sample_weight`` no era ``None``. :pr:`13779` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |API| :class:`ensemble.VotingClassifier` and :class:`ensemble.VotingRegressor` accept ``'drop'`` to disable an estimator in addition to ``None`` to be consistent with other estimators (i.e., :class:`pipeline.FeatureUnion` and :class:`compose.ColumnTransformer`). :pr:`13780` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |API| :class:`ensemble.VotingClassifier` y :class:`ensemble.VotingRegressor` aceptan ``'drop'`` para desactivar un estimador además de ``None`` para ser consistentes con otros estimadores (es decir, :class:`pipeline.FeatureUnion` y :class:`compose.ColumnTransformer`). :pr:`13780` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |API| Deprecated :mod:`externals.six` since we have dropped support for Python 2.7. :pr:`12916` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |API| Se ha eliminado :mod:`externals.six` ya que se ha dejado de dar soporte a Python 2.7. :pr:`12916` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| If ``input='file'`` or ``input='filename'``, and a callable is given as the ``analyzer``, :class:`sklearn.feature_extraction.text.HashingVectorizer`, :class:`sklearn.feature_extraction.text.TfidfVectorizer`, and :class:`sklearn.feature_extraction.text.CountVectorizer` now read the data from the file(s) and then pass it to the given ``analyzer``, instead of passing the file name(s) or the file object(s) to the analyzer. :pr:`13641` by `Adrin Jalali`_.
es_es: |Fix| Si ``input='file'`` o ``input='filename'``, y se da un invocable como ``analyzer``, :class:`sklearn.feature_extraction.text.HashingVectorizer`, :class:`sklearn.feature_extraction.text.TfidfVectorizer`, y :class:`sklearn. feature_extraction.text.CountVectorizer` ahora leen los datos del o de los archivos y los pasan al ``analyzer`` dado, en lugar de pasar el nombre del o de los archivo o el(los) objeto(s) del archivo al analyzer. :pr:`13641` por `Adrin Jalali`_.

source: |MajorFeature| Added :class:`impute.IterativeImputer`, which is a strategy for imputing missing values by modeling each feature with missing values as a function of other features in a round-robin fashion. :pr:`8478` and :pr:`12177` by :user:`Sergey Feldman <sergeyf>` and :user:`Ben Lawson <benlawson>`.
es_es: |MajorFeature| Se ha añadido :class:`impute.IterativeImputer`, que es una estrategia para la imputación de valores faltantes mediante el modelado de cada característica con valores faltantes en función de otras características de forma round-robin. :pr:`8478` y :pr:`12177` por :user:`Sergey Feldman <sergeyf>` y :user:`Ben Lawson <benlawson>`.

source: The API of IterativeImputer is experimental and subject to change without any deprecation cycle. To use them, you need to explicitly import ``enable_iterative_imputer``::
es_es: La API de IterativeImputer es experimental y está sujeta a cambios sin ningún ciclo de obsolescencia. Para utilizarlas, es necesario importar explícitamente ``enable_iterative_imputer``::

source: |Feature| The :class:`impute.SimpleImputer` and :class:`impute.IterativeImputer` have a new parameter ``'add_indicator'``, which simply stacks a :class:`impute.MissingIndicator` transform into the output of the imputer's transform. That allows a predictive estimator to account for missingness. :pr:`12583`, :pr:`13601` by :user:`Danylo Baibak <DanilBaibak>`.
es_es: |Feature| Los :class:`impute.SimpleImputer` y :class:`impute.IterativeImputer` tienen un nuevo parámetro ``'add_indicator``, que simplemente apila una transformación :class:`impute.MissingIndicator` en la salida de la transformación del imputador. Esto permite que un estimador predictivo tenga en cuenta la falta de datos. :pr:`12583`, :pr:`13601` por :user:`Danylo Baibak <DanilBaibak>`.

source: |Fix| In :class:`impute.MissingIndicator` avoid implicit densification by raising an exception if input is sparse add `missing_values` property is set to 0. :pr:`13240` by :user:`Bartosz Telenczuk <btel>`.
es_es: |Fix| En :class:`impute.MissingIndicator` se evita la densificación implícita generando una excepción si la entrada es dispersa y la propiedad `missing_values` se establece en 0. :pr:`13240` por :user:`Bartosz Telenczuk <btel>`.

source: |Fix| Fixed two bugs in :class:`impute.MissingIndicator`. First, when ``X`` is sparse, all the non-zero non missing values used to become explicit False in the transformed data. Then, when ``features='missing-only'``, all features used to be kept if there were no missing values at all. :pr:`13562` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se han corregido dos errores en :class:`impute.MissingIndicator`. En primer lugar, cuando ``X`` es disperso, todos los valores no nulos no faltantes solían convertirse en Falso explícito en los datos transformados. Luego, cuando ``features='missing-only'``, todas las características solían mantenerse si no había ningún valor faltante. :pr:`13562` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: (new subpackage)
es_es: (nuevo subpaquete)

source: |Feature| Partial dependence plots (:func:`inspection.plot_partial_dependence`) are now supported for any regressor or classifier (provided that they have a `predict_proba` method). :pr:`12599` by :user:`Trevor Stephens <trevorstephens>` and :user:`Nicolas Hug <NicolasHug>`.
es_es: |Feature| Los gráficos de dependencia parcial (:func:`inspection.plot_partial_dependence`) ahora son compatibles con cualquier regresor o clasificador (siempre que tengan un método `predict_proba`). :pr:`12599` por :user:`Trevor Stephens <trevorstephens>` y :user:`Nicolas Hug <NicolasHug>`.

source: |Feature| Allow different dtypes (such as float32) in :class:`isotonic.IsotonicRegression`. :pr:`8769` by :user:`Vlad Niculae <vene>`
es_es: |Feature| Se han permitido diferentes dtypes (como float32) en :class:`isotonic.IsotonicRegression`. :pr:`8769` por :user:`Vlad Niculae <vene>`

source: |Enhancement| :class:`linear_model.Ridge` now preserves ``float32`` and ``float64`` dtypes. :issue:`8769` and :issue:`11000` by :user:`Guillaume Lemaitre <glemaitre>`, and :user:`Joan Massich <massich>`
es_es: |Enhancement| :class:`linear_model.Ridge` ahora preserva los dtypes ``float32`` y ``float64``. :issue:`8769` y :issue:`11000` por :user:`Guillaume Lemaitre <glemaitre>`, y :user:`Joan Massich <massich>`
