Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: Version 0.20.4
es_es: Versión 0.20.4

source: **July 30, 2019**
es_es: **30 de julio de 2019**

source: This is a bug-fix release with some bug fixes applied to version 0.20.3.
es_es: Esta es una versión de corrección de errores con algunas correcciones aplicadas a la versión 0.20.3.

source: Changelog
es_es: Registro de cambios

source: The bundled version of joblib was upgraded from 0.13.0 to 0.13.2.
es_es: La versión empaquetada de joblib se actualizó de 0.13.0 a 0.13.2.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where KMeans++ initialisation could rarely result in an IndexError. :issue:`11756` by `Joel Nothman`_.
es_es: |Fix| Se ha corregido un error en :class:`cluster.KMeans` por el que la inicialización de KMeans++ podía provocar raramente un IndexError. :issue:`11756` por `Joel Nothman`_.

source: |Fix| Fixed an issue in :class:`compose.ColumnTransformer` where using DataFrames whose column order differs between :func:``fit`` and :func:``transform`` could lead to silently passing incorrect columns to the ``remainder`` transformer. :pr:`14237` by `Andreas Schuderer <schuderer>`.
es_es: |Fix| Se ha corregido un problema en :class:`compose.ColumnTransformer` por el que el uso de DataFrames cuyo orden de columnas difiere entre :func:``fit`` y :func:``transform`` podía llevar a pasar silenciosamente columnas incorrectas al transformador ``remainder``. :pr:`14237` por `Andreas Schuderer <schuderer>`.

source: |Fix| Fixed a bug in :class:`cross_decomposition.CCA` improving numerical stability when `Y` is close to zero. :pr:`13903` by `Thomas Fan`_.
es_es: |Fix| Se ha corregido un error en :class:`cross_decomposition.CCA` mejorando la estabilidad numérica cuando `Y` es cercano a cero. :pr:`13903` por `Thomas Fan`_.

source: |Fix| Fixed a bug where :class:`model_selection.StratifiedKFold` shuffles each class's samples with the same ``random_state``, making ``shuffle=True`` ineffective. :issue:`13124` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error por el que :class:`model_selection.StratifiedKFold` baraja las muestras de cada clase con el mismo ``random_state``, haciendo que ``shuffle=True`` sea ineficaz. :issue:`13124` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :class:`neighbors.KernelDensity` which could not be restored from a pickle if ``sample_weight`` had been used. :issue:`13772` by :user:`Aditya Vyas <aditya1702>`.
es_es: |Fix| Se ha corregido un error en :class:`neighbors.KernelDensity` que no podía restaurarse desde un pickle si se había utilizado ``sample_weight``. :issue:`13772` por :user:`Aditya Vyas <aditya1702>`.

source: Version 0.20.3
es_es: Versión 0.23

source: **March 1, 2019**
es_es: **1 de marzo de 2019**

source: This is a bug-fix release with some minor documentation improvements and enhancements to features released in 0.20.0.
es_es: Esta es una versión de corrección de errores con algunas mejoras menores en la documentación y en las características lanzadas en 0.20.0.

source: |Fix| Fixed a bug in :class:`cluster.KMeans` where computation was single threaded when `n_jobs > 1` or `n_jobs = -1`. :issue:`12949` by :user:`Prabakaran Kumaresshan <nixphix>`.
es_es: |Fix| Se ha corregido un error en :class:`cluster.KMeans` por el que el cálculo era de un solo hilo cuando `n_jobs > 1` o `n_jobs = -1`. :issue:`12949` por :user:`Prabakaran Kumaresshan <nixphix>`.

source: |Fix| Fixed a bug in :class:`compose.ColumnTransformer` to handle negative indexes in the columns list of the transformers. :issue:`12946` by :user:`Pierre Tallotte <pierretallotte>`.
es_es: |Fix| Corregido un error en :class:`compose.ColumnTransformer` para manejar índices negativos en la lista de columnas de los transformadores. :issue:`12946` por :user:`Pierre Tallotte <pierretallotte>`.

source: |Fix| Fixed a regression in :func:`covariance.graphical_lasso` so that the case `n_features=2` is handled correctly. :issue:`13276` by :user:`Aurélien Bellet <bellet>`.
es_es: |Fix| Corregida una regresión en :func:`covariance.graphical_lasso` para que el caso `n_features=2` sea tratado correctamente. :issue:`13276` por :user:`Aurélien Bellet <bellet>`.

source: |Fix| Fixed a bug in :func:`decomposition.sparse_encode` where computation was single threaded when `n_jobs > 1` or `n_jobs = -1`. :issue:`13005` by :user:`Prabakaran Kumaresshan <nixphix>`.
es_es: |Fix| Se corrigió un error en :func:`decomposition.sparse_encode` donde el cálculo era un solo hilo cuando `n_jobs > 1` o `n_jobs = -1`. :issue:`13005` por :user:`Prabakaran Kumaresshan <nixphix>`.

source: |Efficiency| :func:`sklearn.datasets.fetch_openml` now loads data by streaming, avoiding high memory usage. :issue:`13312` by `Joris Van den Bossche`_.
es_es: |Efficiency| :func:`sklearn.datasets.fetch_openml` ahora carga los datos por streaming, evitando un alto uso de memoria. :issue:`13312` por `Joris Van den Bossche`_.

source: |Fix| Fixed a bug in :class:`feature_extraction.text.CountVectorizer` which would result in the sparse feature matrix having conflicting `indptr` and `indices` precisions under very large vocabularies. :issue:`11295` by :user:`Gabriel Vacaliuc <gvacaliuc>`.
es_es: |Fix| Se ha corregido un error en :class:`feature_extraction.text.CountVectorizer` que provocaba que la matriz de rasgos dispersos tuviera precisiones de `indptr` e `indices` contradictorias bajo vocabularios muy grandes. :issue:`11295` por :user:`Gabriel Vacaliuc <gvacaliuc>`.

source: |Fix| add support for non-numeric data in :class:`sklearn.impute.MissingIndicator` which was not supported while :class:`sklearn.impute.SimpleImputer` was supporting this for some imputation strategies. :issue:`13046` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| añadir soporte para datos no numéricos en :class:`sklearn.impute.MissingIndicator` que no era soportado mientras :class:`sklearn.impute.SimpleImputer` lo soportaba para algunas estrategias de imputación. :issue:`13046` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`linear_model.MultiTaskElasticNet` and :class:`linear_model.MultiTaskLasso` which were breaking when ``warm_start = True``. :issue:`12360` by :user:`Aakanksha Joshi <joaak>`.
es_es: |Fix| Corregido un error en :class:`linear_model.MultiTaskElasticNet` y :class:`linear_model.MultiTaskLasso` que se rompía cuando ``warm_start = True``. :issue:`12360` por :user:`Aakanksha Joshi <joaak>`.

source: |Fix| Fixed a bug in :class:`preprocessing.KBinsDiscretizer` where ``strategy='kmeans'`` fails with an error during transformation due to unsorted bin edges. :issue:`13134` by :user:`Sandro Casagrande <SandroCasagrande>`.
es_es: |Fix| Se ha corregido un error en :class:`preprocessing.KBinsDiscretizer` en el que ``strategy='kmeans'`` falla con un error durante la transformación debido a bordes de recipientes sin clasificar. :issue:`13134` por :user:`Sandro Casagrande <SandroCasagrande>`.

source: |Fix| Fixed a bug in :class:`preprocessing.OneHotEncoder` where the deprecation of ``categorical_features`` was handled incorrectly in combination with ``handle_unknown='ignore'``. :issue:`12881` by `Joris Van den Bossche`_.
es_es: |Fix| Se ha corregido un error en :class:`preprocessing.OneHotEncoder` por el que la depreciación de ``categorical_features`` se manejaba incorrectamente en combinación con ``handle_unknown='ignore'``. :issue:`12881` por `Joris Van den Bossche`_.

source: |Fix| Bins whose width are too small (i.e., <= 1e-8) are removed with a warning in :class:`preprocessing.KBinsDiscretizer`. :issue:`13165` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Los bins cuyo ancho es demasiado pequeño (es decir, <= 1e-8) se eliminan con una advertencia en :class:`preprocessing.KBinsDiscretizer`. :issue:`13165` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |FIX| Fixed a bug in :class:`svm.SVC`, :class:`svm.NuSVC`, :class:`svm.SVR`, :class:`svm.NuSVR` and :class:`svm.OneClassSVM` where the ``scale`` option of parameter ``gamma`` is erroneously defined as ``1 / (n_features * X.std())``. It's now defined as ``1 / (n_features * X.var())``. :issue:`13221` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |FIX| Se ha corregido un error en :class:`svm.SVC`, :class:`svm.NuSVC`, :class:`svm.SVR`, :class:`svm.NuSVR` y :class:`svm.OneClassSVM` en el que la opción ``scale`` del parámetro ``gamma`` se define erróneamente como ``1 / (n_características * X.std())``. Ahora se define como ``1 / (n_características * X.var())``. :issue:`13221` by :user:`Hanmin Qin <qinhanmin2014>`.

source: Code and Documentation Contributors
es_es: Colaboradores de código y documentación

source: With thanks to:
es_es: Con agradecimiento a:

source: Version 0.20.2
es_es: Versión 0.20.2

source: **December 20, 2018**
es_es: **20 de diciembre de 2018**

source: Changed models
es_es: Modelos modificados

source: The following estimators and functions, when fit with the same data and parameters, may produce different models from the previous version. This often occurs due to changes in the modelling logic (bug fixes or enhancements), or in random sampling procedures.
es_es: Los siguientes estimadores y funciones, cuando se ajustan con los mismos datos y parámetros, pueden producir modelos diferentes de la versión anterior. Esto suele ocurrir debido a cambios en la lógica de modelado (corrección de errores o mejoras), o en los procedimientos de muestreo aleatorio.

source: use of ``'seuclidean'`` or ``'mahalanobis'`` metrics in some cases (bug fix)
es_es: uso de métricas ``'seuclidean'`` o ``'mahalanobis'` en algunos casos (corrección de errores)

source: |Fix| Fixed an issue in :func:`compose.make_column_transformer` which raises unexpected error when columns is pandas Index or pandas Series. :issue:`12704` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un problema en :func:`compose.make_column_transformer` que genera un error inesperado cuando las columnas son pandas Index o pandas Series. :issue:`12704` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :func:`metrics.pairwise_distances` and :func:`metrics.pairwise_distances_chunked` where parameters ``V`` of ``"seuclidean"`` and ``VI`` of ``"mahalanobis"`` metrics were computed after the data was split into chunks instead of being pre-computed on whole data. :issue:`12701` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se ha corregido un error en :func:`metrics.pairwise_distances` y :func:`metrics.pairwise_distances_chunked` donde los parámetros ``V`` de las métricas ``"seuclidianas"`` y ``VI`` de las métricas ``"mahalanobis"`` se calculaban después de dividir los datos en trozos en lugar de calcularse previamente en los datos completos. :issue:`12701` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed :class:`sklearn.neighbors.DistanceMetric` jaccard distance function to return 0 when two all-zero vectors are compared. :issue:`12685` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |Fix| Se ha corregido la función de distancia jaccard :class:`sklearn.neighbors.DistanceMetric` para que devuelva 0 cuando se comparan dos vectores totalmente nulos. :issue:`12685` por :user:`Thomas Fan <thomasjpfan>`.

source: |Fix| Calling :func:`utils.check_array` on `pandas.Series` with categorical data, which raised an error in 0.20.0, now returns the expected output again. :issue:`12699` by `Joris Van den Bossche`_.
es_es: |Fix| La llamada a :func:`utils.check_array` en `pandas.Series` con datos categóricos, que daba un error en 0.20.0, ahora devuelve de nuevo la salida esperada. :issue:`12699` por `Joris Van den Bossche`_.

source: Version 0.20.1
es_es: Versión 0.20.1

source: **November 21, 2018**
es_es: **21 de noviembre de 2018**

source: This is a bug-fix release with some minor documentation improvements and enhancements to features released in 0.20.0. Note that we also include some API changes in this release, so you might get some extra warnings after updating from 0.20.0 to 0.20.1.
es_es: Esta es una versión de corrección de errores con algunas mejoras menores de documentación y mejoras a las características publicadas en 0.20.0. Ten en cuenta que también incluimos algunos cambios de API en esta versión, así que puedes obtener algunas advertencias adicionales después de actualizar de 0.20.0 a 0.20.1.

source: |Efficiency| make :class:`cluster.MeanShift` no longer try to do nested parallelism as the overhead would hurt performance significantly when ``n_jobs > 1``. :issue:`12159` by :user:`Olivier Grisel <ogrisel>`.
es_es: |Efficiency| hacer que :class:`cluster.MeanShift` ya no intente hacer paralelismo anidado ya que la sobrecarga perjudicaría el rendimiento significativamente cuando ``n_jobs > 1``. :issue:`12159` por :user:`Olivier Grisel <ogrisel>`.

source: |Fix| Fixed a bug in :class:`cluster.DBSCAN` with precomputed sparse neighbors graph, which would add explicitly zeros on the diagonal even when already present. :issue:`12105` by `Tom Dupre la Tour`_.
es_es: |Fix| Se ha corregido un error en :class:`cluster.DBSCAN` con el gráfico de vecinos dispersos precalculado, que añadía explícitamente ceros en la diagonal incluso cuando ya estaban presentes. :issue:`12105` por `Tom Dupre la Tour`_.

source: |Fix| Fixed an issue in :class:`compose.ColumnTransformer` when stacking columns with types not convertible to a numeric. :issue:`11912` by :user:`Adrin Jalali <adrinjalali>`.
es_es: |Fix| Se ha corregido un problema en :class:`compose.ColumnTransformer` al apilar columnas con tipos no convertibles a numérico. :issue:`11912` por :user:`Adrin Jalali <adrinjalali>`.

source: |API| :class:`compose.ColumnTransformer` now applies the ``sparse_threshold`` even if all transformation results are sparse. :issue:`12304` by `Andreas Müller`_.
es_es: |API| :class:`compose.ColumnTransformer` ahora aplica el ``sparse_returhold`` incluso si todos los resultados de la transformación son esparcidos. :issue:`12304` por `Andreas Muñller`_.

source: |API| :func:`compose.make_column_transformer` now expects ``(transformer, columns)`` instead of ``(columns, transformer)`` to keep consistent with :class:`compose.ColumnTransformer`. :issue:`12339` by :user:`Adrin Jalali <adrinjalali>`.
es_es: |API| :func:`compose.make_column_transformer` ahora espera ``(transformer, columnas)`` en lugar de ``(columns, transformer)`` para mantener consistente con :class:`compose.ColumnTransformer`. :issue:`12339` por :user:`Adrin Jalali <adrinjalali>`.

source: |Fix| :func:`datasets.fetch_openml` to correctly use the local cache. :issue:`12246` by :user:`Jan N. van Rijn <janvanrijn>`.
es_es: |Fix| :func:`datasets.fetch_openml` para usar correctamente la caché local. :issue:`12246` por :user:`Jan N. van Rijn <janvanrijn>`.

source: |Fix| :func:`datasets.fetch_openml` to correctly handle ignore attributes and row id attributes. :issue:`12330` by :user:`Jan N. van Rijn <janvanrijn>`.
es_es: |Fix| :func:`datasets.fetch_openml` para manejar correctamente los atributos ignorados y los atributos de identificación de fila. :issue:`12330` por :user:`Jan N. van Rijn <janvanrijn>`.

source: |Fix| Fixed integer overflow in :func:`datasets.make_classification` for values of ``n_informative`` parameter larger than 64. :issue:`10811` by :user:`Roman Feldbauer <VarIr>`.
es_es: |Fix| Se ha corregido el desbordamiento de enteros en :func:`datasets.make_classification` para valores del parámetro ``n_informative`` mayores de 64. :issue:`10811` por :user:`Roman Feldbauer <VarIr>`.

source: |Fix| Fixed olivetti faces dataset ``DESCR`` attribute to point to the right location in :func:`datasets.fetch_olivetti_faces`. :issue:`12441` by :user:`Jérémie du Boisberranger <jeremiedbb>`
es_es: |Fix| Se ha corregido el atributo ``DESCR`` del conjunto de datos de olivetti para que apunte a la ubicación correcta en :func:`datasets.fetch_olivetti_faces`. :issue:`12441` por :user:`Jérémie du Boisberranger <jeremiedbb>`

source: |Fix| :func:`datasets.fetch_openml` to retry downloading when reading from local cache fails. :issue:`12517` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |Fix| :func:`datasets.fetch_openml` para volver a intentar descargar cuando la lectura de caché local falla. :issue:`12517` por :user:`Thomas Fan <thomasjpfan>`.

source: |Fix| Fixed a regression in :class:`decomposition.IncrementalPCA` where 0.20.0 raised an error if the number of samples in the final batch for fitting IncrementalPCA was smaller than n_components. :issue:`12234` by :user:`Ming Li <minggli>`.
es_es: |Fix| Se corrigió una regresión en :class:`decomposition.IncrementalPCA` donde 0.20.0 produjo un error si el número de muestras en el lote final para ajustar IncrementalPCA era menor que n_components. :issue:`12234` por :user:`Ming Li <minggli>`.

source: |Fix| Fixed a bug mostly affecting :class:`ensemble.RandomForestClassifier` where ``class_weight='balanced_subsample'`` failed with more than 32 classes. :issue:`12165` by `Joel Nothman`_.
es_es: |Fix| Se ha corregido un error que afectaba mayormente a :class:`ensemble.RandomForestClassifier` donde ``class_weight='balanced_subsample'` falló con más de 32 clases. :issue:`12165` por `Joel Nothman`_.

source: |Fix| Fixed a bug affecting :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` and :class:`ensemble.IsolationForest`, where ``max_features`` was sometimes rounded down to zero. :issue:`12388` by :user:`Connor Tann <Connossor>`.
es_es: |Fix| Se corrigió un error que afectaba a :class:`ensemble.BaggingClassifier`, :class:`ensemble.BaggingRegressor` y :class:`ensemble.IsolationForest`, donde ``max_features`` a veces fue redondeado a cero. :issue:`12388` por :user:`Connor Tann <Connossor>`.

source: |Fix| Fixed a regression in v0.20.0 where :func:`feature_extraction.text.CountVectorizer` and other text vectorizers could error during stop words validation with custom preprocessors or tokenizers. :issue:`12393` by `Roman Yurchak`_.
es_es: |Fix| Se corrigió una regresión en v0.20.0 donde :func:`feature_extraction.text.CountVectorizer` y otros vectorizadores de texto podían error durante la validación de palabras de parada con preprocesadores o tokenizadores personalizados. :issue:`12393` por `Roman Yurchak`_.

source: |Fix| :class:`linear_model.SGDClassifier` and variants with ``early_stopping=True`` would not use a consistent validation split in the multiclass case and this would cause a crash when using those estimators as part of parallel parameter search or cross-validation. :issue:`12122` by :user:`Olivier Grisel <ogrisel>`.
es_es: |Fix| :class:`linear_model.SGDClassifier` y variantes con ``early_stopping=True`` no usarían una división de validación consistente en el caso multiclase, y esto causaría un fallo al usar esos estimadores como parte de la búsqueda de parámetros paralelos o la validación cruzada. :issue:`12122` por :user:`Olivier Grisel <ogrisel>`.

source: |Fix| Fixed a bug affecting :class:`SGDClassifier` in the multiclass case. Each one-versus-all step is run in a :class:`joblib.Parallel` call and mutating a common parameter, causing a segmentation fault if called within a backend using processes and not threads. We now use ``require=sharedmem`` at the :class:`joblib.Parallel` instance creation. :issue:`12518` by :user:`Pierre Glaser <pierreglaser>` and :user:`Olivier Grisel <ogrisel>`.
es_es: |Fix| Se ha corregido un error que afectaba a :class:`SGDClassifier` en el caso multiclase. Cada paso uno contra todos (one-versus-all) se ejecuta en una llamada a :class:`joblib.Parallel` y mutando un parámetro común, causando un fallo de segmentación si se llama dentro de un backend utilizando procesos y no hilos. Ahora usamos ``require=sharedmem`` en la creación de instancia de :class:`joblib.Parallel`. :issue:`12518` por :user:`Pierre Glaser <pierreglaser>` y :user:`Olivier Grisel <ogrisel>`.

source: |Fix| Fixed a bug in :func:`metrics.pairwise.pairwise_distances_argmin_min` which returned the square root of the distance when the metric parameter was set to "euclidean". :issue:`12481` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se corrigió un error en :func:`metrics.pairwise.pairwise_distances_argmin_min` que devolvió la raíz cuadrada de la distancia cuando el parámetro métrico se estableció en "euclidean". :issue:`12481` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :func:`metrics.pairwise.pairwise_distances_chunked` which didn't ensure the diagonal is zero for euclidean distances. :issue:`12612` by :user:`Andreas Müller <amueller>`.
es_es: |Fix| Se ha corregido un error en :func:`metrics.pairwise.pairwise_distances_chunked` que no se aseguró de que el diagonal es cero para las distancias euclidanas. :issue:`12612` por :user:`Andreas Muller <amueller>`.

source: |API| The :func:`metrics.calinski_harabaz_score` has been renamed to :func:`metrics.calinski_harabasz_score` and will be removed in version 0.23. :issue:`12211` by :user:`Lisa Thomas <LisaThomas9>`, :user:`Mark Hannel <markhannel>` and :user:`Melissa Ferrari <mferrari3>`.
es_es: |API| La :func:`metrics.calinski_harabaz_score` ha sido renombrada a :func:`metrics.calinski_harabasz_score` y será eliminada en la versión 0. 3. :issue:`12211` por :user:`Lisa Thomas <LisaThomas9>`, :user:`Mark Hannel <markhannel>` y :user:`Melissa Ferrari <mferrari3>`.

source: |Fix| Ensure that the ``fit_predict`` method of :class:`mixture.GaussianMixture` and :class:`mixture.BayesianGaussianMixture` always yield assignments consistent with ``fit`` followed by ``predict`` even if the convergence criterion is too loose or not met. :issue:`12451` by :user:`Olivier Grisel <ogrisel>`.
es_es: |Fix| Asegúrate de que el método ``fit_predict`` de :class:`mixture.GaussianMixture` y :class:`mixture.BayesianGaussianMixture` siempre rinden asignaciones consistentes con ``ajustado`` seguido de ``predice`` incluso si el criterio de convergencia es demasiado suelto o no cumplido. :issue:`12451` por :user:`Olivier Grisel <ogrisel>`.

source: |Fix| force the parallelism backend to :code:`threading` for :class:`neighbors.KDTree` and :class:`neighbors.BallTree` in Python 2.7 to avoid pickling errors caused by the serialization of their methods. :issue:`12171` by :user:`Thomas Moreau <tomMoral>`.
es_es: |Fix| forzar el backend de paralelismo a :code:`threading` para :class:`neighbors.KDTree` y :class:`neighbors.BallTree` en Python 2.7 para evitar errores de decapado causados por la serialización de sus métodos. :issue:`12171` por :user:`Thomas Moreau <tomMoral>`.

source: |Fix| Fixed bug in :class:`preprocessing.OrdinalEncoder` when passing manually specified categories. :issue:`12365` by `Joris Van den Bossche`_.
es_es: |Fix| Se ha corregido error en :class:`preprocessing.OrdinalEncoder` al pasar las categorías especificadas manualmente. :issue:`12365` por `Joris Van den Bossche`_.

source: |Fix| Fixed bug in :class:`preprocessing.KBinsDiscretizer` where the ``transform`` method mutates the ``_encoder`` attribute. The ``transform`` method is now thread safe. :issue:`12514` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error en :class:`preprocessing.KBinsDiscretizer` donde el método ``transform`` muta el atributo ``_encoder``. El método ``transform`` es ahora seguro para los hilos. :issue:`12514` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :class:`preprocessing.PowerTransformer` where the Yeo-Johnson transform was incorrect for lambda parameters outside of `[0, 2]` :issue:`12522` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`preprocessing.PowerTransformer` donde la transformación de Yeo-Johnson era incorrecta para los parámetros de lambda fuera de `[0, 2]` :issue:`12522` por :user:`Nicolas Hug<NicolasHug>`.
