Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: |Feature| |Fix| :class:`decomposition.SparsePCA` now exposes ``normalize_components``. When set to True, the train and test data are centered with the train mean respectively during the fit phase and the transform phase. This fixes the behavior of SparsePCA. When set to False, which is the default, the previous abnormal behaviour still holds. The False value is for backward compatibility and should not be used. :issue:`11585` by :user:`Ivan Panico <FollowKenny>`.
es_es: |Feature| |Fix| :class:`decomposition.SparsePCA` ahora expone ``normalize_components``. Cuando se establece como True, los datos de tren y de prueba se centran con la media del tren respectivamente durante la fase de ajuste y la fase de transformación. Esto corrige el comportamiento de SparsePCA. Cuando se establece en False, que es el valor por defecto, el comportamiento anormal anterior todavía se mantiene. El valor False es por compatibilidad con versiones anteriores y no debe utilizarse. :issue:`11585` por :user:`Ivan Panico <FollowKenny>`.

source: |Efficiency| Efficiency improvements in :func:`decomposition.dict_learning`. :issue:`11420` and others by :user:`John Kirkham <jakirkham>`.
es_es: |Efficiency| Mejoras de eficiencia en :func:`decomposition.dict_learning`. :issue:`11420` y otros por :user:`John Kirkham <jakirkham>`.

source: |Fix| Fix for uninformative error in :class:`decomposition.IncrementalPCA`: now an error is raised if the number of components is larger than the chosen batch size. The ``n_components=None`` case was adapted accordingly. :issue:`6452`. By :user:`Wally Gauze <wallygauze>`.
es_es: |Fix| Corregir para error no informativo en :class:`descomposición.IncrementalPCA`: ahora se produce un error si el número de componentes es mayor que el tamaño del lote elegido. El caso ``n_components=None`` fue adaptado en consecuencia. :issue:`6452`. Por :user:`Wally Gauze <wallygauze>`.

source: |Fix| Fixed a bug where the ``partial_fit`` method of :class:`decomposition.IncrementalPCA` used integer division instead of float division on Python 2. :issue:`9492` by :user:`James Bourbeau <jrbourbeau>`.
es_es: |Fix| Se corrigió un error donde el método ``partial_fit`` de :class:`descomposición.IncrementalPCA` usó división entera en lugar de división float en Python 2. :issue:`9492` por :user:`James Bourbeau <jrbourbeau>`.

source: |Fix| In :class:`decomposition.PCA` selecting a n_components parameter greater than the number of samples now raises an error. Similarly, the ``n_components=None`` case now selects the minimum of ``n_samples`` and ``n_features``. :issue:`8484` by :user:`Wally Gauze <wallygauze>`.
es_es: |Fix| En :class:`decomposition.PCA` seleccionando un parámetro n_components mayor que el número de muestras ahora provoca un error. Del mismo modo, el caso ``n_components=None`` ahora selecciona el mínimo de ``n_samples`` y ``n_features``. :issue:`8484` por :user:`Wally Gauze <wallygauze>`.

source: |Fix| Fixed a bug in :class:`decomposition.PCA` where users will get unexpected error with large datasets when ``n_components='mle'`` on Python 3 versions. :issue:`9886` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se corrigió un error en :class:`decomposition.PCA` donde los usuarios obtendrán un error inesperado con conjuntos de datos grandes cuando ``n_components='mle'`` en versiones de Python 3. :issue:`9886` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed an underflow in calculating KL-divergence for :class:`decomposition.NMF` :issue:`10142` by `Tom Dupre la Tour`_.
es_es: |Fix| Se corrigió un bajo flujo en el cálculo de KL-divergence para :class:`decomposition.NMF` :issue:`10142` por `Tom Dupre la Tour`_.

source: |Fix| Fixed a bug in :class:`decomposition.SparseCoder` when running OMP sparse coding in parallel using read-only memory mapped datastructures. :issue:`5956` by :user:`Vighnesh Birodkar <vighneshbirodkar>` and :user:`Olivier Grisel <ogrisel>`.
es_es: |Fix| Se corrigió un error en :class:`decomposition.SparseCoder` al ejecutar la codificación OMP en paralelo usando estructuras de datos asignadas de solo lectura. :issue:`5956` por :user:`Vighnesh Birodkar <vighneshbirodkar>` y :user:`Olivier Grisel <ogrisel>`.

source: |Efficiency| Memory usage improvement for :func:`_class_means` and :func:`_class_cov` in :mod:`discriminant_analysis`. :issue:`10898` by :user:`Nanxin Chen <bobchennan>`.
es_es: |Efficiency| Mejora de uso de memoria para :func:`_class_means` y :func:`_class_cov` en :mod:`discriminant_analysis`. :issue:`10898` por :user:`Nanxin Chen <bobchennan>`.

source: |Feature| :class:`dummy.DummyRegressor` now has a ``return_std`` option in its ``predict`` method. The returned standard deviations will be zeros.
es_es: |Feature| :class:`dummy.DummyRegressor` ahora tiene una opción ``return_std`` en su método ``predict``. Las desviaciones estándar devueltas serán ceros.

source: |Feature| :class:`dummy.DummyClassifier` and :class:`dummy.DummyRegressor` now only require X to be an object with finite length or shape. :issue:`9832` by :user:`Vrishank Bhardwaj <vrishank97>`.
es_es: |Feature| :class:`dummy.DummyClassifier` y :class:`dummy.DummyRegressor` ahora solo requiere que X sea un objeto con longitud o forma finita. :issue:`9832` por :user:`Vrishank Bhardwaj <vrishank97>`.

source: |Feature| :class:`dummy.DummyClassifier` and :class:`dummy.DummyRegressor` can now be scored without supplying test samples. :issue:`11951` by :user:`Rüdiger Busche <JarnoRFB>`.
es_es: |Feature| :class:`dummy.DummyClassifier` y :class:`dummy.DummyRegressor` ahora pueden ser anotados sin proporcionar muestras de prueba. :issue:`11951` de :user:`Rüdiger Busche <JarnoRFB>`.

source: |Feature| :class:`ensemble.BaggingRegressor` and :class:`ensemble.BaggingClassifier` can now be fit with missing/non-finite values in X and/or multi-output Y to support wrapping pipelines that perform their own imputation. :issue:`9707` by :user:`Jimmy Wan <jimmywan>`.
es_es: |Feature| :class:`ensemble.BaggingRegressor` y :class:`ensemble.BaggingClassifier` ahora puede encajar con valores faltantes/no finitos en X y/o multi-salida Y para soportar tuberías de envoltura que realizan su propia imputación. :issue:`9707` por :user:`Jimmy Wan <jimmywan>`.

source: |Feature| :class:`ensemble.GradientBoostingClassifier` and :class:`ensemble.GradientBoostingRegressor` now support early stopping via ``n_iter_no_change``, ``validation_fraction`` and ``tol``. :issue:`7071` by `Raghav RV`_
es_es: |Feature| :class:`ensemble.GradientBoostingClassifier` y :class:`ensemble.GradientBoostingRegressor` ahora soportan detenerse temprano a través de ``n_iter_no_change``, ``validation_fraction`` y ``tol``. :issue:`7071` por `Raghav RV`_

source: |Feature| Added ``named_estimators_`` parameter in :class:`ensemble.VotingClassifier` to access fitted estimators. :issue:`9157` by :user:`Herilalaina Rakotoarison <herilalaina>`.
es_es: |Feature| Se añadió el parámetro ``named_estimators_`` en :class:`ensemble.VotingClassifier` para acceder a estimadores equipados. :issue:`9157` por :user:`Herilalaina Rakotoarison <herilalaina>`.

source: |Fix| Fixed a bug when fitting :class:`ensemble.GradientBoostingClassifier` or :class:`ensemble.GradientBoostingRegressor` with ``warm_start=True`` which previously raised a segmentation fault due to a non-conversion of CSC matrix into CSR format expected by ``decision_function``. Similarly, Fortran-ordered arrays are converted to C-ordered arrays in the dense case. :issue:`9991` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se corrigió un error al ajustar :class:`ensemble.GradientBoostingClassifier` o :class:`ensemble.GradientBoostingRegressor` con ``warm_start=True`` que previamente aumentó un fallo de segmentación debido a una no conversión de la matriz CSC en formato CSR esperada por ``decisión_función``. Del mismo modo, los arreglos ordenados por Fortrans se convierten en arreglos ordenados por C en un caso dado. :issue:`9991` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`ensemble.GradientBoostingRegressor` and :class:`ensemble.GradientBoostingClassifier` to have feature importances summed and then normalized, rather than normalizing on a per-tree basis. The previous behavior over-weighted the Gini importance of features that appear in later stages. This issue only affected feature importances. :issue:`11176` by :user:`Gil Forsyth <gforsyth>`.
es_es: |Fix| Se corrigió un error en :class:`ensemble.GradientBoostingRegressor` y :class:`ensemble.GradientBoostingClassifier` para tener importancia de características resumidas y luego normalizadas, en lugar de normalizar sobre una base por árbol. El comportamiento anterior sobreponderó la importancia de Gini de las características que aparecen en etapas posteriores. Este problema solo afectó a las importaciones de características. :issue:`11176` por :user:`Gil Forsyth <gforsyth>`.

source: |API| The default value of the ``n_estimators`` parameter of :class:`ensemble.RandomForestClassifier`, :class:`ensemble.RandomForestRegressor`, :class:`ensemble.ExtraTreesClassifier`, :class:`ensemble.ExtraTreesRegressor`, and :class:`ensemble.RandomTreesEmbedding` will change from 10 in version 0.20 to 100 in 0.22. A FutureWarning is raised when the default value is used. :issue:`11542` by :user:`Anna Ayzenshtat <annaayzenshtat>`.
es_es: |API| El valor predeterminado del parámetro ``n_estimators`` de :class:`ensemble.RandomForestClassifier`, :class:`ensemble.RandomForestRegressor`, :class:`ensemble.ExtraTreesClassifier`, :class:`ensemble.ExtraTreesRegressor`, y :class:`ensemble.RandomTreesEmbedding` cambiarán de 10 en la versión 0.20 a 100 en 0.22. Se eleva un FutureWarning cuando se utiliza el valor predeterminado. :issue:`11542` por :user:`Anna Ayzenshtat <annaayzenshtat>`.

source: |API| Classes derived from :class:`ensemble.BaseBagging`. The attribute ``estimators_samples_`` will return a list of arrays containing the indices selected for each bootstrap instead of a list of arrays containing the mask of the samples selected for each bootstrap. Indices allows to repeat samples while mask does not allow this functionality. :issue:`9524` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |API| Clases derivadas de :class:`ensemble.BaseBagging`. El atributo ``estimators_samples_`` devolverá una lista de arreglos con los índices seleccionados para cada bootstrap en lugar de una lista de arreglos con la máscara de las muestras seleccionadas para cada bootstrap. Los índices permiten repetir las muestras mientras que la máscara no permite esta funcionalidad. :issue:`9524` by :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| :class:`ensemble.BaseBagging` where one could not deterministically reproduce ``fit`` result using the object attributes when ``random_state`` is set. :issue:`9723` by :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| :class:`ensemble.BaseBagging` donde no se podía reproducir de forma determinista el resultado de ``fit`` utilizando los atributos del objeto cuando se establece ``random_state``. :issue:`9723` por :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| Enable the call to :term:`get_feature_names` in unfitted :class:`feature_extraction.text.CountVectorizer` initialized with a vocabulary. :issue:`10908` by :user:`Mohamed Maskani <maskani-moh>`.
es_es: |Feature| Habilitar la llamada a :term:`get_feature_names` en :class:`feature_extraction.text.CountVectorizer` no adaptada e inicializada con un vocabulario. :issue:`10908` por :user:`Mohamed Maskani <maskani-moh>`.

source: |Enhancement| ``idf_`` can now be set on a :class:`feature_extraction.text.TfidfTransformer`. :issue:`10899` by :user:`Sergey Melderis <serega>`.
es_es: |Enhancement| ``idf_`` ahora se puede establecer en un :class:`feature_extraction.text.TfidfTransformer`. :issue:`10899` por :user:`Sergey Melderis <serega>`.

source: |Fix| Fixed a bug in :func:`feature_extraction.image.extract_patches_2d` which would throw an exception if ``max_patches`` was greater than or equal to the number of all possible patches rather than simply returning the number of possible patches. :issue:`10101` by :user:`Varun Agrawal <varunagrawal>`
es_es: |Fix| Se ha corregido un error en :func:`feature_extraction.image.extract_patches_2d` que lanzaba una excepción si ``max_patches`` era mayor o igual que el número de todos los parches posibles en lugar de devolver simplemente el número de parches posibles. :issue:`10101` por :user:`Varun Agrawal <varunagrawal>`

source: |Fix| Fixed a bug in :class:`feature_extraction.text.CountVectorizer`, :class:`feature_extraction.text.TfidfVectorizer`, :class:`feature_extraction.text.HashingVectorizer` to support 64 bit sparse array indexing necessary to process large datasets with more than 2·10⁹ tokens (words or n-grams). :issue:`9147` by :user:`Claes-Fredrik Mannby <mannby>` and `Roman Yurchak`_.
es_es: |Fix| Se ha corregido un error en :class:`feature_extraction.text.CountVectorizer`, :class:`feature_extraction.text.TfidfVectorizer`, :class:`feature_extraction.text. HashingVectorizer` para soportar la indexación de matrices dispersas de 64 bits necesaria para procesar grandes conjuntos de datos con más de 2-10⁹ tokens (palabras o n-gramas). :issue:`9147` por :user:`Claes-Fredrik Mannby <mannby>` y `Roman Yurchak`_.

source: |Fix| Fixed bug in :class:`feature_extraction.text.TfidfVectorizer` which was ignoring the parameter ``dtype``. In addition, :class:`feature_extraction.text.TfidfTransformer` will preserve ``dtype`` for floating and raise a warning if ``dtype`` requested is integer. :issue:`10441` by :user:`Mayur Kulkarni <maykulkarni>` and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se ha corregido un error en :class:`feature_extraction.text.TfidfVectorizer` que ignoraba el parámetro ``dtype``. Además, :class:`feature_extraction.text.TfidfTransformer` preservará ``dtype`` para flotantes y lanzará una advertencia si ``dtype`` solicitado es entero. :issue:`10441` por :user:`Mayur Kulkarni <maykulkarni>` y :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| Added select K best features functionality to :class:`feature_selection.SelectFromModel`. :issue:`6689` by :user:`Nihar Sheth <nsheth12>` and :user:`Quazi Rahman <qmaruf>`.
es_es: |Feature| Añadida la funcionalidad de seleccionar K mejores características a :class:`feature_selection.SelectFromModel`. :issue:`6689` por :user:`Nihar Sheth <nsheth12>` y :user:`Quazi Rahman <qmaruf>`.

source: |Feature| Added ``min_features_to_select`` parameter to :class:`feature_selection.RFECV` to bound evaluated features counts. :issue:`11293` by :user:`Brent Yi <brentyi>`.
es_es: |Feature| Añadido el parámetro ``min_features_to_select`` a :class:`feature_selection.RFECV` para limitar el número de características evaluadas. :issue:`11293` por :user:`Brent Yi <brentyi>`.

source: |Fix| Fixed computation of ``n_features_to_compute`` for edge case with tied CV scores in :class:`feature_selection.RFECV`. :issue:`9222` by :user:`Nick Hoh <nickypie>`.
es_es: |Fix| Cálculo fijo de ``n_features_to_compute`` para caso de borde con puntuaciones de CV empatadas en :class:`feature_selection.RFECV`. :issue:`9222` por :user:`Nick Hoh <nickypie>`.

source: |Efficiency| In :class:`gaussian_process.GaussianProcessRegressor`, method ``predict`` is faster when using ``return_std=True`` in particular more when called several times in a row. :issue:`9234` by :user:`andrewww <andrewww>` and :user:`Minghui Liu <minghui-liu>`.
es_es: |Efficiency| En :class:`gaussian_process.GaussianProcessRegressor`, el método ``predict`` es más rápido cuando se utiliza ``return_std=True`` en particular cuando se llama varias veces seguidas. :issue:`9234` por :user:`andrewww <andrewww>` y :user:`Minghui Liu <minghui-liu>`.

source: New module, adopting ``preprocessing.Imputer`` as :class:`impute.SimpleImputer` with minor changes (see under preprocessing below).
es_es: Nuevo módulo, adoptando ``preprocessing.Imputer`` como :class:`impute.SimpleImputer` con cambios menores (ver bajo preprocesamiento abajo).

source: |MajorFeature| Added :class:`impute.MissingIndicator` which generates a binary indicator for missing values. :issue:`8075` by :user:`Maniteja Nandana <maniteja123>` and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |MajorFeature| Añadido :class:`impute.MissingIndicator` que genera un indicador binario para valores faltantes. :issue:`8075` por :user:`Maniteja Nandana <maniteja123>` y :user:`Guillaume Lemaitre <glemaitre>`.

source: |Feature| The :class:`impute.SimpleImputer` has a new strategy, ``'constant'``, to complete missing values with a fixed one, given by the ``fill_value`` parameter. This strategy supports numeric and non-numeric data, and so does the ``'most_frequent'`` strategy now. :issue:`11211` by :user:`Jeremie du Boisberranger <jeremiedbb>`.
es_es: |Feature| El :class:`impute.SimpleImputer` tiene una nueva estrategia, ``'constant'``, para completar los valores faltantes con uno fijo, dado por el parámetro ``fill_value``. Esta estrategia soporta datos numéricos y no numéricos, al igual que la estrategia ``'most_frequent'`` ahora. :issue:`11211` por :user:`Jeremie du Boisberranger <jeremiedbb>`.

source: |Fix| Fixed a bug in :class:`isotonic.IsotonicRegression` which incorrectly combined weights when fitting a model to data involving points with identical X values. :issue:`9484` by :user:`Dallas Card <dallascard>`
es_es: |Fix| Se ha corregido un error en :class:`isotonic.IsotonicRegression` que combinaba incorrectamente las ponderaciones cuando se ajustaba un modelo a datos que incluían puntos con valores X idénticos. :issue:`9484` por :user:`Dallas Card <dallascard>`

source: |Feature| :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` and :class:`linear_model.Perceptron` now expose ``early_stopping``, ``validation_fraction`` and ``n_iter_no_change`` parameters, to stop optimization monitoring the score on a validation set. A new learning rate ``"adaptive"`` strategy divides the learning rate by 5 each time ``n_iter_no_change`` consecutive epochs fail to improve the model. :issue:`9043` by `Tom Dupre la Tour`_.
es_es: |Feature| :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` y :class:`linear_model.Perceptron` ahora expone los parámetros ``early_stopping``, ``validation_fraction`` y ``n_iter_no_change``, para detener el monitoreo de optimización de la puntuación en un conjunto de validación. Una nueva estrategia de aprendizaje ``"adaptativa"`` divide la tasa de aprendizaje entre 5 cada vez que los epoches consecutivos ``n_iter_no_change`` fallan al mejorar el modelo. :issue:`9043` por `Tom Dupre la Tour`_.

source: |Feature| Add `sample_weight` parameter to the fit method of :class:`linear_model.BayesianRidge` for weighted linear regression. :issue:`10112` by :user:`Peter St. John <pstjohn>`.
es_es: |Feature| Añade el parámetro `sample_weight` al método de ajuste de :class:`linear_model.BayesianRidge` para la regresión lineal ponderada. :issue:`10112` por :user:`Peter St. Juan <pstjohn>`.

source: |Fix| Fixed a bug in :func:`logistic.logistic_regression_path` to ensure that the returned coefficients are correct when ``multiclass='multinomial'``. Previously, some of the coefficients would override each other, leading to incorrect results in :class:`linear_model.LogisticRegressionCV`. :issue:`11724` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :func:`logistic.logistic_regression_path` para asegurarse de que los coeficientes devueltos son correctos cuando ``multiclass='multinomial'``. Anteriormente, algunos de los coeficientes se anularían entre sí, lo que provocaría resultados incorrectos en :class:`linear_model.LogisticRegressionCV`. :issue:`11724` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug in :class:`linear_model.LogisticRegression` where when using the parameter ``multi_class='multinomial'``, the ``predict_proba`` method was returning incorrect probabilities in the case of binary outcomes. :issue:`9939` by :user:`Roger Westover <rwolst>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.LogisticRegression` donde al usar el parámetro ``multi_class='multinomial'``, el método ``predict_proba`` estaba devolviendo probabilidades incorrectas en el caso de resultados binarios. :issue:`9939` por :user:`Roger Westover <rwolst>`.

source: |Fix| Fixed a bug in :class:`linear_model.LogisticRegressionCV` where the ``score`` method always computes accuracy, not the metric given by the ``scoring`` parameter. :issue:`10998` by :user:`Thomas Fan <thomasjpfan>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.LogisticRegressionCV` donde el método ``score`` siempre calcula la precisión, no la métrica dada por el parámetro ``scoring``. :issue:`10998` por :user:`Thomas Fan <thomasjpfan>`.

source: |Fix| Fixed a bug in :class:`linear_model.LogisticRegressionCV` where the 'ovr' strategy was always used to compute cross-validation scores in the multiclass setting, even if ``'multinomial'`` was set. :issue:`8720` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.LogisticRegressionCV` donde la estrategia 'ovr' siempre se utilizó para calcular las puntuaciones de validación cruzada en la configuración de múltiples clases, incluso si se estableció ``'multinomial'``. :issue:`8720` por :user:`William de Vazelhes <wdevazelhes>`.

source: |Fix| Fixed a bug in :class:`linear_model.OrthogonalMatchingPursuit` that was broken when setting ``normalize=False``. :issue:`10071` by `Alexandre Gramfort`_.
es_es: |Fix| Se corrigió un error en :class:`linear_model.OrthogonalMatchingPursuit` que se rompió al configurar ``normalize=False``. :issue:`10071` por `Alexandre Gramfort`_.

source: |Fix| Fixed a bug in :class:`linear_model.ARDRegression` which caused incorrectly updated estimates for the standard deviation and the coefficients. :issue:`10153` by :user:`Jörg Döpfert <jdoepfert>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.ARDRegression` que causó estimaciones incorrectamente actualizadas para la desviación estándar y los coeficientes. :issue:`10153` por :user:`Jörg Döpfert <jdoepfert>`.

source: |Fix| Fixed a bug in :class:`linear_model.ARDRegression` and :class:`linear_model.BayesianRidge` which caused NaN predictions when fitted with a constant target. :issue:`10095` by :user:`Jörg Döpfert <jdoepfert>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.ARDRegression` y :class:`linear_model.BayesianRidge` que causó predicciones de NaN al encajar con un objetivo constante. :issue:`10095` por :user:`Jörg Döpfert <jdoepfert>`.

source: |Fix| Fixed a bug in :class:`linear_model.RidgeClassifierCV` where the parameter ``store_cv_values`` was not implemented though it was documented in ``cv_values`` as a way to set up the storage of cross-validation values for different alphas. :issue:`10297` by :user:`Mabel Villalba-Jiménez <mabelvj>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.RidgeClassifierCV` donde el parámetro ``store_cv_values`` no fue implementado aunque fue documentado en ``cv_values`` como una manera de configurar el almacenamiento de valores de validación cruzada para diferentes alfas. :issue:`10297` por :user:`Mabel Villalba-Jiménez <mabelvj>`.
