Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.20.po
Languages: es_es

source: |Fix| Fixed a bug in :class:`linear_model.ElasticNet` which caused the input to be overridden when using parameter ``copy_X=True`` and ``check_input=False``. :issue:`10581` by :user:`Yacine Mazari <ymazari>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.ElasticNet` que causaba que la entrada fuera anulada cuando se usaba el parámetro ``copy_X=True`` y ``check_input=False``. :issue:`10581` por :user:`Yacine Mazari <ymazari>`.

source: |Fix| Fixed a bug in :class:`sklearn.linear_model.Lasso` where the coefficient had wrong shape when ``fit_intercept=False``. :issue:`10687` by :user:`Martin Hahn <martin-hahn>`.
es_es: |Fix| Se corrigió un error en :class:`sklearn.linear_model.Lasso` donde el coeficiente tenía una forma incorrecta cuando ``fit_intercept=False``. :issue:`10687` por :user:`Martin Hahn <martin-hahn>`.

source: |Fix| Fixed a bug in :func:`sklearn.linear_model.LogisticRegression` where the ``multi_class='multinomial'`` with binary output ``with warm_start=True`` :issue:`10836` by :user:`Aishwarya Srinivasan <aishgrt1>`.
es_es: |Fix| Se corrigió un error en :func:`sklearn.linear_model.LogisticRegression` donde el ``multi_class='multinomial'`` con salida binaria ``con warm_start=True`` :issue:`10836` por :user:`Aishwarya Srinivasan <aishgrt1>`.

source: |Fix| Fixed a bug in :class:`linear_model.RidgeCV` where using integer ``alphas`` raised an error. :issue:`10397` by :user:`Mabel Villalba-Jiménez <mabelvj>`.
es_es: |Fix| Se corrigió un error en :class:`linear_model.RidgeCV` donde el uso de entero ``alphas`` planteó un error. :issue:`10397` por :user:`Mabel Villalba-Jiménez <mabelvj>`.

source: |Fix| Fixed condition triggering gap computation in :class:`linear_model.Lasso` and :class:`linear_model.ElasticNet` when working with sparse matrices. :issue:`10992` by `Alexandre Gramfort`_.
es_es: |Fix| Se corrigió la condición que desencadena el cálculo de huecos (gap) en :class:`linear_model.Lasso` y :class:`linear_model.ElasticNet` cuando se trabaja con matrices dispersas. :issue:`10992` por `Alexandre Gramfort`_.

source: |Fix| Fixed a bug in :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` and :class:`linear_model.Perceptron`, where the stopping criterion was stopping the algorithm before convergence. A parameter ``n_iter_no_change`` was added and set by default to 5. Previous behavior is equivalent to setting the parameter to 1. :issue:`9043` by `Tom Dupre la Tour`_.
es_es: |Fix| Se corrigió un error en :class:`linear_model.SGDClassifier`, :class:`linear_model.SGDRegressor`, :class:`linear_model.PassiveAggressiveClassifier`, :class:`linear_model.PassiveAggressiveRegressor` y :class:`linear_model.Perceptron`, donde el criterio de parada estaba deteniendo el algoritmo antes de la convergencia. Un parámetro ``n_iter_no_change`` fue añadido y establecido por defecto a 5. El comportamiento anterior es equivalente a ajustar el parámetro a 1. :issue:`9043` por `Tom Dupre la Tour`_.

source: |Fix| Fixed a bug where liblinear and libsvm-based estimators would segfault if passed a scipy.sparse matrix with 64-bit indices. They now raise a ValueError. :issue:`11327` by :user:`Karan Dhingra <kdhingra307>` and `Joel Nothman`_.
es_es: |Fix| Se ha corregido un error por el que los estimadores en liblinear y libsvm-based fallaban si se les pasaba una matriz scipy.sparse con índices de 64 bits. Ahora lanzan un ValueError. :issue:`11327` por :user:`Karan Dhingra <kdhingra307>` y `Joel Nothman`_.

source: |API| The default values of the ``solver`` and ``multi_class`` parameters of :class:`linear_model.LogisticRegression` will change respectively from ``'liblinear'`` and ``'ovr'`` in version 0.20 to ``'lbfgs'`` and ``'auto'`` in version 0.22. A FutureWarning is raised when the default values are used. :issue:`11905` by `Tom Dupre la Tour`_ and `Joel Nothman`_.
es_es: |API| Los valores por defecto de los parámetros ``solver`` y ``multi_class`` de :class:`linear_model.LogisticRegression` cambiará respectivamente de ``'liblinear'`` y ``'ovr'`` en la versión 0. 0 a ``'lbfgs'`` y ``'auto'`` en la versión 0.22. Se eleva un FutureWarning cuando se utilizan los valores por defecto. :issue:`11905` por `Tom Dupre la Tour`_ y `Joel Nothman`_.

source: |API| Deprecate ``positive=True`` option in :class:`linear_model.Lars` as the underlying implementation is broken. Use :class:`linear_model.Lasso` instead. :issue:`9837` by `Alexandre Gramfort`_.
es_es: |API| Desaprobar la opción ``positive=True`` en :class:`linear_model.Lars` ya que la implementación subyacente está rota. Utiliza :class:`linear_model.Lasso` en su lugar. :issue:`9837` por `Alexandre Gramfort`_.

source: |API| ``n_iter_`` may vary from previous releases in :class:`linear_model.LogisticRegression` with ``solver='lbfgs'`` and :class:`linear_model.HuberRegressor`. For Scipy <= 1.0.0, the optimizer could perform more than the requested maximum number of iterations. Now both estimators will report at most ``max_iter`` iterations even if more were performed. :issue:`10723` by `Joel Nothman`_.
es_es: |API| ``n_iter_`` puede variar de las versiones anteriores en :class:`linear_model.LogisticRegression` con ``solver='lbfgs'`` y :class:`linear_model.HuberRegressor`. Para Scipy <= 1.0. , el optimizador puede realizar más del número máximo de iteraciones solicitadas. Ahora ambos estimadores reportarán como mucho iteraciones ``max_iter`` incluso si se realizaron más. :issue:`10723` por `Joel Nothman`_.

source: |Efficiency| Speed improvements for both 'exact' and 'barnes_hut' methods in :class:`manifold.TSNE`. :issue:`10593` and :issue:`10610` by `Tom Dupre la Tour`_.
es_es: |Efficiency| Mejoras de velocidad tanto para los métodos 'exact' como 'barnes_hut' en :class:`manifold.TSNE`. :issue:`10593` y :issue:`10610` por `Tom Dupre la Tour`_.

source: |Feature| Support sparse input in :meth:`manifold.Isomap.fit`. :issue:`8554` by :user:`Leland McInnes <lmcinnes>`.
es_es: |Feature| Sparse input en :meth:`manifold.Isomap.fit`. :issue:`8554` por :user:`Leland McInnes <lmcinnes>`.

source: |Feature| :func:`manifold.t_sne.trustworthiness` accepts metrics other than Euclidean. :issue:`9775` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |Feature| :func:`manifold.t_sne.trustworthiness` acepta métricas distintas de Euclidean. :issue:`9775` por :user:`William de Vazelhes <wdevazelhes>`.

source: |Fix| Fixed a bug in :func:`manifold.spectral_embedding` where the normalization of the spectrum was using a division instead of a multiplication. :issue:`8129` by :user:`Jan Margeta <jmargeta>`, :user:`Guillaume Lemaitre <glemaitre>`, and :user:`Devansh D. <devanshdalal>`.
es_es: |Fix| Se corrigió un error en :func:`manifold.spectral_embedding` donde la normalización del espectro estaba utilizando una división en lugar de una multiplicación. :issue:`8129` por :user:`Jan Margeta <jmargeta>`, :user:`Guillaume Lemaitre <glemaitre>`, y :user:`Devansh D. <devanshdalal>`.

source: |API| |Feature| Deprecate ``precomputed`` parameter in function :func:`manifold.t_sne.trustworthiness`. Instead, the new parameter ``metric`` should be used with any compatible metric including 'precomputed', in which case the input matrix ``X`` should be a matrix of pairwise distances or squared distances. :issue:`9775` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |API| |Feature| Desaprobar el parámetro ``precomputed`` en la función :func:`manifold.t_sne.trustworthiness`. En su lugar, el nuevo parámetro ``metric`` debe utilizarse con cualquier métrica compatible incluyendo 'precomputed', en cuyo caso la matriz de entrada ``X`` debería ser una matriz de distancias paralelas o distancias cuadradas. :issue:`9775` por :user:`William de Vazelhes <wdevazelhes>`.

source: |API| Deprecate ``precomputed`` parameter in function :func:`manifold.t_sne.trustworthiness`. Instead, the new parameter ``metric`` should be used with any compatible metric including 'precomputed', in which case the input matrix ``X`` should be a matrix of pairwise distances or squared distances. :issue:`9775` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |API| Desaprobar el parámetro ``precomputed`` en la función :func:`manifold.t_sne.trustworthiness`. En su lugar, el nuevo parámetro ``metric`` debe utilizarse con cualquier métrica compatible incluyendo 'precomputed', en cuyo caso la matriz de entrada ``X`` debería ser una matriz de distancias paralelas o distancias cuadradas. :issue:`9775` por :user:`William de Vazelhes <wdevazelhes>`.

source: |MajorFeature| Added the :func:`metrics.davies_bouldin_score` metric for evaluation of clustering models without a ground truth. :issue:`10827` by :user:`Luis Osa <logc>`.
es_es: |MajorFeature| Se añadió la métrica :func:`metrics.davies_bouldin_score` para la evaluación de los modelos de clúster sin una verdad terrenal. :issue:`10827` por :user:`Luis Osa <logc>`.

source: |MajorFeature| Added the :func:`metrics.balanced_accuracy_score` metric and a corresponding ``'balanced_accuracy'`` scorer for binary and multiclass classification. :issue:`8066` by :user:`xyguo` and :user:`Aman Dalmia <dalmia>`, and :issue:`10587` by `Joel Nothman`_.
es_es: |MajorFeature| Se añadió la métrica :func:`metrics.balanced_accuracy_score` y una puntuación ``'balanced_accuracy'`` correspondiente para la clasificación binaria y multiclase. :issue:`8066` por :user:`xyguo` y :user:`Aman Dalmia <dalmia>`, y :issue:`10587` por `Joel Nothman`_.

source: |Feature| Partial AUC is available via ``max_fpr`` parameter in :func:`metrics.roc_auc_score`. :issue:`3840` by :user:`Alexander Niederbühl <Alexander-N>`.
es_es: |Feature| La AUC parcial está disponible a través del parámetro ``max_fpr`` en :func:`metrics.roc_auc_score`. :issue:`3840` por :user:`Alexander Niederbühl <Alexander-N>`.

source: |Feature| A scorer based on :func:`metrics.brier_score_loss` is also available. :issue:`9521` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Feature| Una puntuación basada en :func:`metrics.brier_score_loss` también está disponible. :issue:`9521` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Feature| Added control over the normalization in :func:`metrics.normalized_mutual_info_score` and :func:`metrics.adjusted_mutual_info_score` via the ``average_method`` parameter. In version 0.22, the default normalizer for each will become the *arithmetic* mean of the entropies of each clustering. :issue:`11124` by :user:`Arya McCarthy <aryamccarthy>`.
es_es: |Feature| Se ha añadido un control sobre la normalización en :func:`metrics.normalized_mutual_info_score` y :func:`metrics.adjusted_mutual_info_score` mediante el parámetro ``average_method``. En la versión 0.22, el normalizador por defecto para cada uno se convertirá en la media *aritmética* de las entradas de cada clustering. :issue:`11124` por :user:`Arya McCarthy <aryamccarthy>`.

source: |Feature| Added ``output_dict`` parameter in :func:`metrics.classification_report` to return classification statistics as dictionary. :issue:`11160` by :user:`Dan Barkhorn <danielbarkhorn>`.
es_es: |Feature| Se ha añadido el parámetro ``output_dict`` en :func:`metrics.classification_report` para devolver las estadísticas de clasificación como diccionario. :issue:`11160` por :user:`Dan Barkhorn <danielbarkhorn>`.

source: |Feature| :func:`metrics.classification_report` now reports all applicable averages on the given data, including micro, macro and weighted average as well as samples average for multilabel data. :issue:`11679` by :user:`Alexander Pacha <apacha>`.
es_es: |Feature| :func:`métricas.classification_report` ahora reporta todos los promedios aplicables sobre los datos dados, incluyendo el promedio micro, macro y ponderado, así como muestras promedio para los datos multietiqueta. :issue:`11679` por :user:`Alexander Pacha <apacha>`.

source: |Feature| :func:`metrics.average_precision_score` now supports binary ``y_true`` other than ``{0, 1}`` or ``{-1, 1}`` through ``pos_label`` parameter. :issue:`9980` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Feature| :func:`metrics.average_precision_score` ahora soporta el binario ``y_true`` distinto de ``{0, 1}`` o ``{-1, 1}`` a través del parámetro ``pos_label``. :issue:`9980` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Feature| :func:`metrics.label_ranking_average_precision_score` now supports ``sample_weight``. :issue:`10845` by :user:`Jose Perez-Parras Toledano <jopepato>`.
es_es: |Feature| :func:`metrics.label_ranking_average_precision_score` ahora soporta ``sample_weight``. :issue:`10845` por :user:`Jose Perez-Parras Toledano <jopepato>`.

source: |Feature| Add ``dense_output`` parameter to :func:`metrics.pairwise.linear_kernel`. When False and both inputs are sparse, will return a sparse matrix. :issue:`10999` by :user:`Taylor G Smith <tgsmith61591>`.
es_es: |Feature| Añadir parámetro ``dense_output`` a :func:`metrics.pairwise.linear_kernel`. Cuando False y ambas entradas sean dispersas, devolverán una matriz dispersa. :issue:`10999` por :user:`Taylor G Smith <tgsmith61591>`.

source: |Efficiency| :func:`metrics.silhouette_score` and :func:`metrics.silhouette_samples` are more memory efficient and run faster. This avoids some reported freezes and MemoryErrors. :issue:`11135` by `Joel Nothman`_.
es_es: |Efficiency| :func:`metrics.silhouette_score` y :func:`metrics.silhouette_samples` son más eficientes en memoria y se ejecutan más rápido. Esto evita algunos bloqueos y MemoryErrors reportados. :issue:`11135` por `Joel Nothman`_.

source: |Fix| Fixed a bug in :func:`metrics.precision_recall_fscore_support` when truncated `range(n_labels)` is passed as value for `labels`. :issue:`10377` by :user:`Gaurav Dhingra <gxyd>`.
es_es: |Fix| Se ha corregido un error en :func:`metrics.precision_recall_fscore_support` cuando `range(n_labels)` truncado es pasado como valor para `labels`. :issue:`10377` por :user:`Gaurav Dhingra <gxyd>`.

source: |Fix| Fixed a bug due to floating point error in :func:`metrics.roc_auc_score` with non-integer sample weights. :issue:`9786` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se corrigió un error debido a un error de punto flotante en :func:`metrics.roc_auc_score` con pesos no enteros. :issue:`9786` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug where :func:`metrics.roc_curve` sometimes starts on y-axis instead of (0, 0), which is inconsistent with the document and other implementations. Note that this will not influence the result from :func:`metrics.roc_auc_score` :issue:`10093` by :user:`alexryndin <alexryndin>` and :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se corrigió un error en el que :func:`metrics.roc_curve` a veces comienza en el eje Y en lugar de (0, 0), lo cual es inconsistente con el documento y otras implementaciones. Ten en cuenta que esto no influirá en el resultado de :func:`métricas.roc_auc_score` :issue:`10093` por :user:`alexryndin <alexryndin>` y :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug to avoid integer overflow. Casted product to 64 bits integer in :func:`metrics.mutual_info_score`. :issue:`9772` by :user:`Kumar Ashutosh <thechargedneutron>`.
es_es: |Fix| Se ha corregido un error para evitar el desbordamiento de enteros. Producto lanzado a 64 bits enteros en :func:`metrics.mutual_info_score`. :issue:`9772` por :user:`Kumar Ashutosh <thechargedneutron>`.

source: |Fix| Fixed a bug where :func:`metrics.average_precision_score` will sometimes return ``nan`` when ``sample_weight`` contains 0. :issue:`9980` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error donde :func:`metrics.average_precision_score` a veces devuelve ``nan`` cuando ``sample_weight`` contiene 0. :issue:`9980` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :func:`metrics.fowlkes_mallows_score` to avoid integer overflow. Casted return value of `contingency_matrix` to `int64` and computed product of square roots rather than square root of product. :issue:`9515` by :user:`Alan Liddell <aliddell>` and :user:`Manh Dao <manhdao>`.
es_es: |Fix| Se corrigió un error en :func:`metrics.fowlkes_mallows_score` para evitar el desbordamiento de enteros. Se emitió valor de retorno de `contingency_matrix` a `int64` y producto computado de raíces cuadradas en lugar de raíz cuadrada del producto. :issue:`9515` por :user:`Alan Liddell <aliddell>` y :user:`Manh Dao <manhdao>`.

source: |API| Deprecate ``reorder`` parameter in :func:`metrics.auc` as it's no longer required for :func:`metrics.roc_auc_score`. Moreover using ``reorder=True`` can hide bugs due to floating point error in the input. :issue:`9851` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |API| Desaprobar el parámetro ``reorder`` en :func:`metrics.auc` ya que ya no es requerido para :func:`metrics.roc_auc_score`. Además, el uso de ``reorder=True`` puede ocultar errores debido a un error de punto flotante en la entrada. :issue:`9851` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |API| In :func:`metrics.normalized_mutual_info_score` and :func:`metrics.adjusted_mutual_info_score`, warn that ``average_method`` will have a new default value. In version 0.22, the default normalizer for each will become the *arithmetic* mean of the entropies of each clustering. Currently, :func:`metrics.normalized_mutual_info_score` uses the default of ``average_method='geometric'``, and :func:`metrics.adjusted_mutual_info_score` uses the default of ``average_method='max'`` to match their behaviors in version 0.19. :issue:`11124` by :user:`Arya McCarthy <aryamccarthy>`.
es_es: |API| En :func:`metrics.normalized_mutual_info_score` y :func:`metrics.adjusted_mutual_info_score`, se advierte que ``average_method`` tendrá un nuevo valor por defecto. En la versión 0.22, el normalizador por defecto para cada uno se convertirá en la media *aritmética* de las entropías de cada agrupación. Actualmente, :func:`metrics.normalized_mutual_info_score` utiliza el valor por defecto de ``método_de_promedio='geométrico'``, y :func:`metrics.adjusted_mutual_info_score` utiliza el valor por defecto de ``método_de_promedio='máximo'`` para coincidir con sus comportamientos en la versión 0.19. :issue:`11124` por :user:`Arya McCarthy <aryamccarthy>`.

source: |API| The ``batch_size`` parameter to :func:`metrics.pairwise_distances_argmin_min` and :func:`metrics.pairwise_distances_argmin` is deprecated to be removed in v0.22. It no longer has any effect, as batch size is determined by global ``working_memory`` config. See :ref:`working_memory`. :issue:`10280` by `Joel Nothman`_ and :user:`Aman Dalmia <dalmia>`.
es_es: |API| El parámetro ``batch_size`` para :func:`metrics.pairwise_distances_argmin_min` y :func:`metrics.pairwise_distances_argmin` está obsoleto para ser eliminado en la v0.22. Ya no tiene ningún efecto, ya que el tamaño del lote está determinado por la configuración global de ``working_memory``. Ver :ref:`working_memory`. :issue:`10280` por `Joel Nothman`_ y :user:`Aman Dalmia <dalmia>`.

source: |Feature| Added function :term:`fit_predict` to :class:`mixture.GaussianMixture` and :class:`mixture.GaussianMixture`, which is essentially equivalent to calling :term:`fit` and :term:`predict`. :issue:`10336` by :user:`Shu Haoran <haoranShu>` and :user:`Andrew Peng <Andrew-peng>`.
es_es: |Feature| Añadida la función :term:`fit_predict` a :class:`mixture.GaussianMixture` y :class:`mixture.GaussianMixture`, que es esencialmente equivalente a llamar a :term:`fit` y :term:`predict`. :issue:`10336` por :user:`Shu Haoran <haoranShu>` y :user:`Andrew Peng <Andrew-peng>`.

source: |Fix| Fixed a bug in :class:`mixture.BaseMixture` where the reported `n_iter_` was missing an iteration. It affected :class:`mixture.GaussianMixture` and :class:`mixture.BayesianGaussianMixture`. :issue:`10740` by :user:`Erich Schubert <kno10>` and :user:`Guillaume Lemaitre <glemaitre>`.
es_es: |Fix| Se ha corregido un error en :class:`mixture.BaseMixture` por el que al informe `n_iter_` le faltaba una iteración. Afectaba a :class:`mixture.GaussianMixture` y :class:`mixture.BayesianGaussianMixture`. :issue:`10740` por :user:`Erich Schubert <kno10>` y :user:`Guillaume Lemaitre <glemaitre>`.

source: |Fix| Fixed a bug in :class:`mixture.BaseMixture` and its subclasses :class:`mixture.GaussianMixture` and :class:`mixture.BayesianGaussianMixture` where the ``lower_bound_`` was not the max lower bound across all initializations (when ``n_init > 1``), but just the lower bound of the last initialization. :issue:`10869` by :user:`Aurélien Géron <ageron>`.
es_es: |Fix| Se ha corregido un error en :class:`mixture.BaseMixture` y sus subclases :class:`mixture.GaussianMixture` y :class:`mixture.BayesianGaussianMixture` donde el ``lower_bound_`` no era el límite inferior máximo de todas las inicializaciones (cuando ``n_init > 1``), sino sólo el límite inferior de la última inicialización. :issue:`10869` por :user:`Aurélien Géron <ageron>`.

source: |Feature| Add `return_estimator` parameter in :func:`model_selection.cross_validate` to return estimators fitted on each split. :issue:`9686` by :user:`Aurélien Bellet <bellet>`.
es_es: |Feature| Añadir el parámetro `return_estimator` en :func:`model_selection.cross_validate` para devolver los estimadores ajustados en cada división. :issue:`9686` por :user:`Aurélien Bellet <bellet>`.

source: |Feature| New ``refit_time_`` attribute will be stored in :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` if ``refit`` is set to ``True``. This will allow measuring the complete time it takes to perform hyperparameter optimization and refitting the best model on the whole dataset. :issue:`11310` by :user:`Matthias Feurer <mfeurer>`.
es_es: |Feature| El nuevo atributo ``refit_time_`` se almacenará en :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` si ``refit`` se establece como ``True``. Esto permitirá medir el tiempo completo que se tarda en realizar la optimización de los hiperparámetros y el reajuste del mejor modelo en todo el conjunto de datos. :issue:`11310` by :user:`Matthias Feurer <mfeurer>`.

source: |Feature| Expose `error_score` parameter in :func:`model_selection.cross_validate`, :func:`model_selection.cross_val_score`, :func:`model_selection.learning_curve` and :func:`model_selection.validation_curve` to control the behavior triggered when an error occurs in :func:`model_selection._fit_and_score`. :issue:`11576` by :user:`Samuel O. Ronsin <samronsin>`.
es_es: |Feature| Exponer el parámetro `error_score` en :func:`model_selection.cross_validate`, :func:`model_selection.cross_val_score`, :func:`model_selection.learning_curve` y :func:`model_selection.validation_curve` para controlar el comportamiento que se desencadena cuando se produce un error en :func:`model_selection._fit_and_score`. :issue:`11576` by :user:`Samuel O. Ronsin <samronsin>`.

source: |Feature| `BaseSearchCV` now has an experimental, private interface to support customized parameter search strategies, through its ``_run_search`` method. See the implementations in :class:`model_selection.GridSearchCV` and :class:`model_selection.RandomizedSearchCV` and please provide feedback if you use this. Note that we do not assure the stability of this API beyond version 0.20. :issue:`9599` by `Joel Nothman`_
es_es: |Feature| `BaseSearchCV` tiene ahora una interfaz experimental y privada para soportar estrategias de búsqueda de parámetros personalizados, a través de su método ``_run_search``. Vea las implementaciones en :class:`model_selection.GridSearchCV` y :class:`model_selection.RandomizedSearchCV` y, por favor, proporcione su opinión si lo utiliza. Tenga en cuenta que no aseguramos la estabilidad de esta API más allá de la versión 0.20. :issue:`9599` by `Joel Nothman`_
