Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.21.po
Languages: es_es

source: |Feature| :class:`linear_model.LogisticRegression` and :class:`linear_model.LogisticRegressionCV` now support Elastic-Net penalty, with the 'saga' solver. :pr:`11646` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |Feature| :class:`linear_model.LogisticRegression` y :class:`linear_model.LogisticRegressionCV` ahora admiten la penalización Elastic-Net, con el solucionador 'saga'. :pr:`11646` por :user:`Nicolas Hug <NicolasHug>`.

source: |Feature| Added :class:`linear_model.lars_path_gram`, which is :class:`linear_model.lars_path` in the sufficient stats mode, allowing users to compute :class:`linear_model.lars_path` without providing ``X`` and ``y``. :pr:`11699` by :user:`Kuai Yu <yukuairoy>`.
es_es: |Feature| Se ha añadido :class:`linear_model.lars_path_gram`, que es :class:`linear_model.lars_path` en el modo de estadísticas suficientes, permitiendo a los usuarios calcular :class:`linear_model.lars_path` sin proporcionar ``X`` e ``y``. :pr:`11699` por :user:`Kuai Yu <yukuairoy>`.

source: |Efficiency| :func:`linear_model.make_dataset` now preserves ``float32`` and ``float64`` dtypes, reducing memory consumption in stochastic gradient, SAG and SAGA solvers. :pr:`8769` and :pr:`11000` by :user:`Nelle Varoquaux <NelleV>`, :user:`Arthur Imbert <Henley13>`, :user:`Guillaume Lemaitre <glemaitre>`, and :user:`Joan Massich <massich>`
es_es: |Efficiency| :func:`linear_model.make_dataset` ahora preserva los dtypes ``float32`` y ``float64``, reduciendo el consumo de memoria en los solucionadores de gradiente estocástico, SAG y SAGA. :pr:`8769` y :pr:`11000` por :user:`Nelle Varoquaux <NelleV>`, :user:`Arthur Imbert <Henley13>`, :user:`Guillaume Lemaitre <glemaitre>`, y :user:`Joan Massich <massich>`

source: |Enhancement| :class:`linear_model.LogisticRegression` now supports an unregularized objective when ``penalty='none'`` is passed. This is equivalent to setting ``C=np.inf`` with l2 regularization. Not supported by the liblinear solver. :pr:`12860` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |Enhancement| :class:`linear_model.LogisticRegression` ahora admite un objetivo no regularizado cuando se pasa ``penalty='none'``. Esto es equivalente a establecer ``C=np.inf`` con regularización l2. No es compatible con el solucionador liblinear. :pr:`12860` por :user:`Nicolas Hug <NicolasHug>`.

source: |Enhancement| `sparse_cg` solver in :class:`linear_model.Ridge` now supports fitting the intercept (i.e. ``fit_intercept=True``) when inputs are sparse. :pr:`13336` by :user:`Bartosz Telenczuk <btel>`.
es_es: |Enhancement| El solucionador `sparse_cg` en :class:`linear_model.Ridge` ahora soporta el ajuste del intercepto (es decir, ``fit_intercept=True``) cuando las entradas son dispersas. :pr:`13336` por :user:`Bartosz Telenczuk <btel>`.

source: |Enhancement| The coordinate descent solver used in `Lasso`, `ElasticNet`, etc. now issues a `ConvergenceWarning` when it completes without meeting the desired toleranbce. :pr:`11754` and :pr:`13397` by :user:`Brent Fagan <brentfagan>` and :user:`Adrin Jalali <adrinjalali>`.
es_es: |Enhancement| El solucionador de descenso coordinado utilizado en `Lasso`, `ElasticNet`, etc. ahora emite un `ConvergenceWarning` cuando se completa sin cumplir la tolerancia deseada. :pr:`11754` y :pr:`13397` por :user:`Brent Fagan <brentfagan>` y :user:`Adrin Jalali <adrinjalali>`.

source: |Fix| Fixed a bug in :class:`linear_model.LogisticRegression` and :class:`linear_model.LogisticRegressionCV` with 'saga' solver, where the weights would not be correctly updated in some cases. :pr:`11646` by `Tom Dupre la Tour`_.
es_es: |Fix| Se ha corregido un error en :class:`linear_model.LogisticRegression` y :class:`linear_model.LogisticRegressionCV` con el solucionador 'saga', donde las ponderaciones no se actualizaban correctamente en algunos casos. :pr:`11646` por `Tom Dupre la Tour`_.

source: |Fix| Fixed the posterior mean, posterior covariance and returned regularization parameters in :class:`linear_model.BayesianRidge`. The posterior mean and the posterior covariance were not the ones computed with the last update of the regularization parameters and the returned regularization parameters were not the final ones. Also fixed the formula of the log marginal likelihood used to compute the score when `compute_score=True`. :pr:`12174` by :user:`Albert Thomas <albertcthomas>`.
es_es: |Fix| Se ha corregido la media posterior, la covarianza posterior y los parámetros de regularización devueltos en :class:`linear_model.BayesianRidge`. La media posterior y la covarianza posterior no eran las calculadas con la última actualización de los parámetros de regularización y los parámetros de regularización devueltos no eran los finales. También se ha corregido la fórmula de la probabilidad marginal logarítmica utilizada para calcular la puntuación cuando `compute_score=True`. :pr:`12174` por :user:`Albert Thomas <albertcthomas>`.

source: |Fix| Fixed a bug in :class:`linear_model.LassoLarsIC`, where user input ``copy_X=False`` at instance creation would be overridden by default parameter value ``copy_X=True`` in ``fit``. :pr:`12972` by :user:`Lucio Fernandez-Arjona <luk-f-a>`
es_es: |Fix| Se ha corregido un error en :class:`linear_model.LassoLarsIC`, por el que la entrada del usuario ``copy_X=False`` en la creación de la instancia era sobreescrita por el valor del parámetro por defecto ``copy_X=True`` en ``fit`. :pr:`12972` por :user:`Lucio Fernandez-Arjona <luk-f-a>`

source: |Fix| Fixed a bug in :class:`linear_model.LinearRegression` that was not returning the same coeffecients and intercepts with ``fit_intercept=True`` in sparse and dense case. :pr:`13279` by `Alexandre Gramfort`_
es_es: |Fix| Se ha corregido un error en :class:`linear_model.LinearRegression` que no devolvía los mismos coeficientes e interceptos con ``fit_intercept=True`` en casos dispersos y densos. :pr:`13279` por `Alexandre Gramfort`_

source: |Fix| Fixed a bug in :class:`linear_model.HuberRegressor` that was broken when ``X`` was of dtype bool. :pr:`13328` by `Alexandre Gramfort`_.
es_es: |Fix| Se ha corregido un error en :class:`linear_model.HuberRegressor` que se rompía cuando ``X`` era de tipo (dtype) bool. :pr:`13328` por `Alexandre Gramfort`_.

source: |Fix| Fixed a performance issue of ``saga`` and ``sag`` solvers when called in a :class:`joblib.Parallel` setting with ``n_jobs > 1`` and ``backend="threading"``, causing them to perform worse than in the sequential case. :pr:`13389` by :user:`Pierre Glaser <pierreglaser>`.
es_es: |Fix| Se ha corregido un problema de rendimiento de los solucionadores ``saga`` y ``sag`` cuando se invocan en una configuración :class:`joblib.Parallel` con ``n_jobs > 1`` y ``backend="threading"``, lo que provocaba un peor rendimiento que en el caso secuencial. :pr:`13389` por :user:`Pierre Glaser <pierreglaser>`.

source: |Fix| Fixed a bug in :class:`linear_model.stochastic_gradient.BaseSGDClassifier` that was not deterministic when trained in a multi-class setting on several threads. :pr:`13422` by :user:`Clément Doumouro <ClemDoum>`.
es_es: |Fix| Se ha corregido un error en :class:`linear_model.stochastic_gradient.BaseSGDClassifier` que no era determinístico cuando se entrenaba en un entorno multiclase en varios hilos. :pr:`13422` por :user:`Clément Doumouro <ClemDoum>`.

source: |Fix| Fixed bug in :func:`linear_model.ridge_regression`, :class:`linear_model.Ridge` and :class:`linear_model.RidgeClassifier` that caused unhandled exception for arguments ``return_intercept=True`` and ``solver=auto`` (default) or any other solver different from ``sag``. :pr:`13363` by :user:`Bartosz Telenczuk <btel>`
es_es: |Fix| Se ha corregido un error en :func:`linear_model.ridge_regression`, :class:`linear_model.Ridge` y :class:`linear_model.RidgeClassifier` que provocaba una excepción no controlada para los argumentos ``return_intercept=True`` y ``solver=auto`` (por defecto) o cualquier otro solucionador diferente de ``sag``. :pr:`13363` por :user:`Bartosz Telenczuk <btel>`

source: |Fix| :func:`linear_model.ridge_regression` will now raise an exception if ``return_intercept=True`` and solver is different from ``sag``. Previously, only warning was issued. :pr:`13363` by :user:`Bartosz Telenczuk <btel>`
es_es: |Fix| :func:`linear_model.ridge_regression` ahora generará una excepción si ``return_intercept=True`` y el solucionador es diferente de ``sag``. Anteriormente, sólo se emitía una advertencia. :pr:`13363` by :user:`Bartosz Telenczuk <btel>`

source: |Fix| :func:`linear_model.ridge_regression` will choose ``sparse_cg`` solver for sparse inputs when ``solver=auto`` and ``sample_weight`` is provided (previously `cholesky` solver was selected). :pr:`13363` by :user:`Bartosz Telenczuk <btel>`
es_es: |Fix| :func:`linear_model.ridge_regression` elegirá el solucionador ``sparse_cg`` para entradas dispersas cuando se proporcione ``solver=auto`` y ``sample_weight`` (anteriormente se seleccionaba el solucionador `cholesky`). :pr:`13363` by :user:`Bartosz Telenczuk <btel>`

source: |API| The use of :class:`linear_model.lars_path` with ``X=None`` while passing ``Gram`` is deprecated in version 0.21 and will be removed in version 0.23. Use :class:`linear_model.lars_path_gram` instead. :pr:`11699` by :user:`Kuai Yu <yukuairoy>`.
es_es: |API| El uso de :class:`linear_model.lars_path` con ``X=None`` al pasar ``Gram`` está obsoleto en la versión 0.21 y se eliminará en la versión 0.23. Utiliza :class:`linear_model.lars_path_gram` en su lugar. :pr:`11699` por :user:`Kuai Yu <yukuairoy>`.

source: |API| :func:`linear_model.logistic_regression_path` is deprecated in version 0.21 and will be removed in version 0.23. :pr:`12821` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |API| :func:`linear_model.logistic_regression_path` está obsoleto en la versión 0.21 y se eliminará en la versión 0.23. :pr:`12821` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| :class:`linear_model.RidgeCV` with leave-one-out cross-validation now correctly fits an intercept when ``fit_intercept=True`` and the design matrix is sparse. :issue:`13350` by :user:`Jérôme Dockès <jeromedockes>`
es_es: |Fix| :class:`linear_model.RidgeCV` con validación cruzada dejando uno fuera (leave-one-out) ahora ajusta correctamente un intercepto cuando ``fit_intercept=True`` y la matriz de diseño es dispersa. :issue:`13350` by :user:`Jérôme Dockès <jeromedockes>`

source: |Efficiency| Make :func:`manifold.tsne.trustworthiness` use an inverted index instead of an `np.where` lookup to find the rank of neighbors in the input space. This improves efficiency in particular when computed with lots of neighbors and/or small datasets. :pr:`9907` by :user:`William de Vazelhes <wdevazelhes>`.
es_es: |Efficiency| Se hace que :func:`manifold.tsne.trustworthiness` utilice un índice invertido en lugar de una búsqueda `np.where` para encontrar el rango de vecinos en el espacio de entrada. Esto mejora la eficiencia en particular cuando se calcula con muchos vecinos y/o conjuntos de datos pequeños. :pr:`9907` por :user:`William de Vazelhes <wdevazelhes>`.

source: |Feature| Added the :func:`metrics.max_error` metric and a corresponding ``'max_error'`` scorer for single output regression. :pr:`12232` by :user:`Krishna Sangeeth <whiletruelearn>`.
es_es: |Feature| Se ha añadido la métrica :func:`metrics.max_error` y el correspondiente puntuador ``'max_error'`` para la regresión de salida única. :pr:`12232` por :user:`Krishna Sangeeth <whiletruelearn>`.

source: |Feature| Add :func:`metrics.multilabel_confusion_matrix`, which calculates a confusion matrix with true positive, false positive, false negative and true negative counts for each class. This facilitates the calculation of set-wise metrics such as recall, specificity, fall out and miss rate. :pr:`11179` by :user:`Shangwu Yao <ShangwuYao>` and `Joel Nothman`_.
es_es: |Feature| Se añade :func:`metrics.multilabel_confusion_matrix`, que calcula una matriz de confusión con recuentos de verdaderos positivos, falsos positivos, falsos negativos y verdaderos negativos para cada clase. Esto facilita el cálculo de las métricas por conjuntos, como la exhaustividad, la especificidad, la caída y la tasa de fallos. :pr:`11179` por :user:`Shangwu Yao <ShangwuYao>` y `Joel Nothman`_.

source: |Feature| :func:`metrics.jaccard_score` has been added to calculate the Jaccard coefficient as an evaluation metric for binary, multilabel and multiclass tasks, with an interface analogous to :func:`metrics.f1_score`. :pr:`13151` by :user:`Gaurav Dhingra <gxyd>` and `Joel Nothman`_.
es_es: |Feature| Se ha añadido :func:`metrics.jaccard_score` para calcular el coeficiente de Jaccard como métrica de evaluación para tareas binarias, multietiqueta y multiclase, con una interfaz análoga a la de :func:`metrics.f1_score`. :pr:`13151` por :user:`Gaurav Dhingra <gxyd>` y `Joel Nothman`_.

source: |Feature| Added :func:`metrics.pairwise.haversine_distances` which can be accessed with `metric='pairwise'` through :func:`metrics.pairwise_distances` and estimators. (Haversine distance was previously available for nearest neighbors calculation.) :pr:`12568` by :user:`Wei Xue <xuewei4d>`, :user:`Emmanuel Arias <eamanu>` and `Joel Nothman`_.
es_es: |Feature| Se ha añadido :func:`metrics.pairwise.haversine_distances` a la que se puede acceder con `metric='pairwise'` a través de :func:`metrics.pairwise_distances` y los estimadores. (La distancia de Haversine estaba disponible anteriormente para el cálculo de vecinos más cercanos). :pr:`12568` por :user:`Wei Xue <xuewei4d>`, :user:`Emmanuel Arias <eamanu>` y `Joel Nothman`_.

source: |Efficiency| Faster :func:`metrics.pairwise_distances` with `n_jobs` > 1 by using a thread-based backend, instead of process-based backends. :pr:`8216` by :user:`Pierre Glaser <pierreglaser>` and :user:`Romuald Menuet <zanospi>`
es_es: |Efficiency| :func:`metrics.pairwise_distances` más rápido con `n_jobs` > 1 utilizando un backend basado en hilos, en lugar de backends basados en procesos. :pr:`8216` por :user:`Pierre Glaser <pierreglaser>` y :user:`Romuald Menuet <zanospi>`

source: |Efficiency| The pairwise manhattan distances with sparse input now uses the BLAS shipped with scipy instead of the bundled BLAS. :pr:`12732` by :user:`Jérémie du Boisberranger <jeremiedbb>`
es_es: |Efficiency| Las distancias de manhattan por pares con entrada dispersa ahora utiliza el BLAS enviado con scipy en lugar del BLAS incluido. :pr:`12732` por :user:`Jérémie du Boisberranger <jeremiedbb>`

source: |Enhancement| Use label `accuracy` instead of `micro-average` on :func:`metrics.classification_report` to avoid confusion. `micro-average` is only shown for multi-label or multi-class with a subset of classes because it is otherwise identical to accuracy. :pr:`12334` by :user:`Emmanuel Arias <eamanu@eamanu.com>`, `Joel Nothman`_ and `Andreas Müller`_
es_es: |Enhancement| Se usa la etiqueta `accuracy` en lugar de `micro-average` en :func:`metrics.classification_report` para evitar confusiones. `micro-average` sólo se muestra para multietiqueta o para multiclase con un subconjunto de clases, ya que, por lo demás, es idéntica a la exactitud. :pr:`12334` by :user:`Emmanuel Arias <eamanu@eamanu.com>`, `Joel Nothman`_ and `Andreas Müller`_

source: |Enhancement| Added `beta` parameter to :func:`metrics.homogeneity_completeness_v_measure` and :func:`metrics.v_measure_score` to configure the tradeoff between homogeneity and completeness. :pr:`13607` by :user:`Stephane Couvreur <scouvreur>` and and :user:`Ivan Sanchez <ivsanro1>`.
es_es: |Enhancement| Se ha añadido el parámetro `beta` a :func:`metrics.homogeneity_completeness_v_measure` y :func:`metrics.v_measure_score` para configurar la compensación entre homogeneidad y completitud. :pr:`13607` por :user:`Stephane Couvreur <scouvreur>` y y :user:`Ivan Sanchez <ivsanro1>`.

source: |Fix| The metric :func:`metrics.r2_score` is degenerate with a single sample and now it returns NaN and raises :class:`exceptions.UndefinedMetricWarning`. :pr:`12855` by :user:`Pawel Sendyk <psendyk>`.
es_es: |Fix| La métrica :func:`metrics.r2_score` está degenerada con una sola muestra y ahora devuelve NaN y genera :class:`exceptions.UndefinedMetricWarning`. :pr:`12855` por :user:`Pawel Sendyk <psendyk>`.

source: |Fix| Fixed a bug where :func:`metrics.brier_score_loss` will sometimes return incorrect result when there's only one class in ``y_true``. :pr:`13628` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error por el que :func:`metrics.brier_score_loss` devolvía a veces un resultado incorrecto cuando sólo había una clase en ``y_true``. :pr:`13628` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Fixed a bug in :func:`metrics.label_ranking_average_precision_score` where sample_weight wasn't taken into account for samples with degenerate labels. :pr:`13447` by :user:`Dan Ellis <dpwe>`.
es_es: |Fix| Se ha corregido un error en :func:`metrics.label_ranking_average_precision_score` por el que no se tenía en cuenta sample_weight para las muestras con etiquetas degeneradas. :pr:`13447` por :user:`Dan Ellis <dpwe>`.

source: |API| The parameter ``labels`` in :func:`metrics.hamming_loss` is deprecated in version 0.21 and will be removed in version 0.23. :pr:`10580` by :user:`Reshama Shaikh <reshamas>` and :user:`Sandra Mitrovic <SandraMNE>`.
es_es: |API| El parámetro ``labels`` en :func:`metrics.hamming_loss` está obsoleto en la versión 0.21 y se eliminará en la versión 0.23. :pr:`10580` por :user:`Reshama Shaikh <reshamas>` y :user:`Sandra Mitrovic <SandraMNE>`.

source: |Fix| The function :func:`metrics.pairwise.euclidean_distances`, and therefore several estimators with ``metric='euclidean'``, suffered from numerical precision issues with ``float32`` features. Precision has been increased at the cost of a small drop of performance. :pr:`13554` by :user:`Celelibi` and :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| La función :func:`metrics.pairwise.euclidean_distances`, y por tanto varios estimadores con ``metric='euclidean'``, sufrían problemas de precisión numérica con las características ``float32``. Se ha aumentado la precisión a costa de una pequeña caída del rendimiento. :pr:`13554` por :user:`Celelibi` y :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |API| :func:`metrics.jaccard_similarity_score` is deprecated in favour of the more consistent :func:`metrics.jaccard_score`. The former behavior for binary and multiclass targets is broken. :pr:`13151` by `Joel Nothman`_.
es_es: |API| :func:`metrics.jaccard_similarity_score` queda obsoleto en favor de :func:`metrics.jaccard_score`, más coherente. El comportamiento anterior para objetivos binarios y multiclase no funciona. :pr:`13151` por `Joel Nothman`_.

source: |Fix| Fixed a bug in :class:`mixture.BaseMixture` and therefore on estimators based on it, i.e. :class:`mixture.GaussianMixture` and :class:`mixture.BayesianGaussianMixture`, where ``fit_predict`` and ``fit.predict`` were not equivalent. :pr:`13142` by :user:`Jérémie du Boisberranger <jeremiedbb>`.
es_es: |Fix| Se ha corregido un error en :class:`mixture.BaseMixture` y, por tanto, en los estimadores basados en ella, es decir, :class:`mixture.GaussianMixture` y :class:`mixture.BayesianGaussianMixture`, donde ``fit_predict`` y ``fit.predict`` no eran equivalentes. :pr:`13142` por :user:`Jérémie du Boisberranger <jeremiedbb>`.

source: |Feature| Classes :class:`~model_selection.GridSearchCV` and :class:`~model_selection.RandomizedSearchCV` now allow for refit=callable to add flexibility in identifying the best estimator. See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_refit_callable.py`. :pr:`11354` by :user:`Wenhao Zhang <wenhaoz@ucla.edu>`, `Joel Nothman`_ and :user:`Adrin Jalali <adrinjalali>`.
es_es: |Feature| Las clases :class:`~model_selection.GridSearchCV` y :class:`~model_selection.RandomizedSearchCV` ahora permiten refit=callable para añadir flexibilidad en la identificación del mejor estimador. Ver :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_refit_callable.py`. :pr:`11354` por :user:`Wenhao Zhang <wenhaoz@ucla.edu>`, `Joel Nothman`_ y :user:`Adrin Jalali <adrinjalali>`.

source: |Enhancement| Classes :class:`~model_selection.GridSearchCV`, :class:`~model_selection.RandomizedSearchCV`, and methods :func:`~model_selection.cross_val_score`, :func:`~model_selection.cross_val_predict`, :func:`~model_selection.cross_validate`, now print train scores when `return_train_scores` is True and `verbose` > 2. For :func:`~model_selection.learning_curve`, and :func:`~model_selection.validation_curve` only the latter is required. :pr:`12613` and :pr:`12669` by :user:`Marc Torrellas <marctorrellas>`.
es_es: |Enhancement| Las clases :class:`~model_selection.GridSearchCV`, :class:`~model_selection.RandomizedSearchCV`, y los métodos :func:`~model_selection.cross_val_score`, :func:`~model_selection.cross_val_predict`, :func:`~model_selection.cross_validate`, ahora imprimen las puntuaciones del entrenamiento cuando `return_train_scores` es True y `verbose` > 2. Para :func:`~model_selection.learning_curve`, y :func:`~model_selection.validation_curve` sólo se requiere esta última. :pr:`12613` y :pr:`12669` por :user:`Marc Torrellas <marctorrellas>`.

source: |Enhancement| Some :term:`CV splitter` classes and `model_selection.train_test_split` now raise ``ValueError`` when the resulting training set is empty. :pr:`12861` by :user:`Nicolas Hug <NicolasHug>`.
es_es: |Enhancement| Algunas clases de :term:`separador de CV` y `model_selection.train_test_split` ahora producen un ``ValueError`` cuando el conjunto de entrenamiento resultante está vacío. :pr:`12861` por :user:`Nicolas Hug <NicolasHug>`.

source: |Fix| Fixed a bug where :class:`model_selection.StratifiedKFold` shuffles each class's samples with the same ``random_state``, making ``shuffle=True`` ineffective. :pr:`13124` by :user:`Hanmin Qin <qinhanmin2014>`.
es_es: |Fix| Se ha corregido un error por el que :class:`model_selection.StratifiedKFold` revuelve las muestras de cada clase con el mismo ``random_state``, haciendo que ``shuffle=True`` sea ineficaz. :pr:`13124` por :user:`Hanmin Qin <qinhanmin2014>`.

source: |Fix| Added ability for :func:`model_selection.cross_val_predict` to handle multi-label (and multioutput-multiclass) targets with ``predict_proba``-type methods. :pr:`8773` by :user:`Stephen Hoover <stephen-hoover>`.
es_es: |Fix| Se ha añadido la posibilidad de que :func:`model_selection.cross_val_predict` maneje objetivos multietiqueta (y multisalida-multiclase) con métodos de tipo ``predict_proba``. :pr:`8773` por :user:`Stephen Hoover <stephen-hoover>`.

source: |Fix| Fixed an issue in :func:`~model_selection.cross_val_predict` where `method="predict_proba"` returned always `0.0` when one of the classes was excluded in a cross-validation fold. :pr:`13366` by :user:`Guillaume Fournier <gfournier>`
es_es: |Fix| Se ha corregido un problema en :func:`~model_selection.cross_val_predict` por el que `method="predict_proba"` devolvía siempre `0.0` cuando se excluía una de las clases en un pliegue de validación cruzada. :pr:`13366` por :user:`Guillaume Fournier <gfournier>`
