Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/whats_new/v0.21.po
Languages: es_es

source: |Fix| Fixed an issue in :func:`multiclass.OneVsOneClassifier.decision_function` where the decision_function value of a given sample was different depending on whether the decision_function was evaluated on the sample alone or on a batch containing this same sample due to the scaling used in decision_function. :pr:`10440` by :user:`Jonathan Ohayon <Johayon>`.
es_es: |Fix| Se ha corregido un problema en :func:`multiclass.OneVsOneClassifier.decision_function` por el que el valor de decision_function de una muestra dada era diferente dependiendo de si decision_function se evaluaba en la muestra sola o en un lote que contenía esta misma muestra debido al escalamiento utilizado en decision_function. :pr:`10440` por :user:`Jonathan Ohayon <Johayon>`.

source: |Fix| Fixed a bug in :class:`multioutput.MultiOutputClassifier` where the `predict_proba` method incorrectly checked for `predict_proba` attribute in the estimator object. :pr:`12222` by :user:`Rebekah Kim <rebekahkim>`
es_es: |Fix| Se ha corregido un error en :class:`multioutput.MultiOutputClassifier` por el que el método `predict_proba` comprobaba incorrectamente el atributo `predict_proba` en el objeto estimador (estimator). :pr:`12222` por :user:`Rebekah Kim <rebekahkim>`

source: |MajorFeature| Added :class:`neighbors.NeighborhoodComponentsAnalysis` for metric learning, which implements the Neighborhood Components Analysis algorithm. :pr:`10058` by :user:`William de Vazelhes <wdevazelhes>` and :user:`John Chiotellis <johny-c>`.
es_es: |MajorFeature| Se ha añadido :class:`neighbors.NeighborhoodComponentsAnalysis` para el aprendizaje métrico, que implementa el algoritmo de análisis de componentes de vecindario (Neighborhood Components Analysis). :pr:`10058` por :user:`William de Vazelhes <wdevazelhes>` y :user:`John Chiotellis <johny-c>`.

source: |API| Methods in :class:`neighbors.NearestNeighbors` : :func:`~neighbors.NearestNeighbors.kneighbors`, :func:`~neighbors.NearestNeighbors.radius_neighbors`, :func:`~neighbors.NearestNeighbors.kneighbors_graph`, :func:`~neighbors.NearestNeighbors.radius_neighbors_graph` now raise ``NotFittedError``, rather than ``AttributeError``, when called before ``fit`` :pr:`12279` by :user:`Krishna Sangeeth <whiletruelearn>`.
es_es: |API| Los métodos en :class:`neighbors.NearestNeighbors` : :func:`~neighbors.NearestNeighbors.kneighbors`, :func:`~neighbors.NearestNeighbors.radius_neighbors`, :func:`~neighbors.NearestNeighbors.kneighbors_graph`, :func:`~neighbors.NearestNeighbors.radius_neighbors_graph` ahora generan ``NotFittedError``, en lugar de ``AttributeError``, cuando se llaman antes de ``fit``. :pr:`12279` por :user:`Krishna Sangeeth <whiletruelearn>`.

source: |Fix| Fixed a bug in :class:`neural_network.MLPClassifier` and :class:`neural_network.MLPRegressor` where the option :code:`shuffle=False` was being ignored. :pr:`12582` by :user:`Sam Waterbury <samwaterbury>`.
es_es: |Fix| Se ha corregido un error en :class:`neural_network.MLPClassifier` y :class:`neural_network.MLPRegressor` por el que se ignoraba la opción :code:`shuffle=False`. :pr:`12582` por :user:`Sam Waterbury <samwaterbury>`.

source: |Fix| Fixed a bug in :class:`neural_network.MLPClassifier` where validation sets for early stopping were not sampled with stratification. In the multilabel case however, splits are still not stratified. :pr:`13164` by :user:`Nicolas Hug<NicolasHug>`.
es_es: |Fix| Se ha corregido un error en :class:`neural_network.MLPClassifier` por el que los conjuntos de validación para la parada anticipada no se muestreaban con estratificación. Sin embargo, en el caso multietiqueta, las divisiones siguen sin estar estratificadas. :pr:`13164` por :user:`Nicolas Hug <NicolasHug>`.

source: |Feature| :class:`pipeline.Pipeline` can now use indexing notation (e.g. ``my_pipeline[0:-1]``) to extract a subsequence of steps as another Pipeline instance. A Pipeline can also be indexed directly to extract a particular step (e.g. ``my_pipeline['svc']``), rather than accessing ``named_steps``. :pr:`2568` by `Joel Nothman`_.
es_es: |Feature| :class:`pipeline.Pipeline` ahora puede utilizar la notación de indexación (por ejemplo, ``my_pipeline[0:-1]``) para extraer una subsecuencia de pasos como otra instancia de Pipeline. Un Pipeline también puede ser indexado directamente para extraer un paso particular (por ejemplo, ``mi_pipeline['svc']``), en lugar de acceder a ``named_steps``. :pr:`2568` por `Joel Nothman`_.

source: |Feature| Added optional parameter ``verbose`` in :class:`pipeline.Pipeline`, :class:`compose.ColumnTransformer` and :class:`pipeline.FeatureUnion` and corresponding ``make_`` helpers for showing progress and timing of each step. :pr:`11364` by :user:`Baze Petrushev <petrushev>`, :user:`Karan Desai <karandesai-96>`, `Joel Nothman`_, and :user:`Thomas Fan <thomasjpfan>`.
es_es: |Feature| Se ha añadido el parámetro opcional ``verbose`` en :class:`pipeline.Pipeline`, :class:`compose.ColumnTransformer` y :class:`pipeline.FeatureUnion` y los correspondientes (helpers) ``make_`` para mostrar el progreso y el tiempo de cada paso. :pr:`11364` por :user:`Baze Petrushev <petrushev>`, :user:`Karan Desai <karandesai-96>`, `Joel Nothman`_, y :user:`Thomas Fan <thomasjpfan>`.

source: Multiple modules
es_es: Múltiples módulos

source: Miscellaneous
es_es: Varios

source: Changes to estimator checks
es_es: Cambios en las comprobaciones de los estimadores

source: These changes mostly affect library developers.
es_es: Estos cambios afectan principalmente a los desarrolladores de bibliotecas.

source: Code and Documentation Contributors
es_es: Colaboradores de código y documentación

source: Thanks to everyone who has contributed to the maintenance and improvement of the project since version 0.20, including:
es_es: Gracias a quienes han contribuido al mantenimiento y mejora del proyecto desde la versión 0.20, incluyendo:
