Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/text/plot_document_classification_20newsgroups.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_text_plot_document_classification_20newsgroups.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_text_plot_document_classification_20newsgroups.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Classification of text documents using sparse features
es_es: Clasificación de documentos de texto utilizando características dispersas

source: This is an example showing how scikit-learn can be used to classify documents by topics using a bag-of-words approach. This example uses a scipy.sparse matrix to store the features and demonstrates various classifiers that can efficiently handle sparse matrices.
es_es: Este es un ejemplo que muestra cómo scikit-learn puede ser utilizado para clasificar documentos por temas utilizando un enfoque de bolsa de palabras(bag-of-words). Este ejemplo utiliza una matriz scipy.sparse para almacenar las características y demuestra varios clasificadores que pueden manejar eficientemente matrices dispersas.

source: The dataset used in this example is the 20 newsgroups dataset. It will be automatically downloaded, then cached.
es_es: El conjunto de datos utilizado en este ejemplo es el de 20 grupos de noticias(newsgroups). Se descargará automáticamente y se almacenará en la caché.

source: Load data from the training set
es_es: Carga los datos del conjunto de entrenamiento

source: Let's load data from the newsgroups dataset which comprises around 18000 newsgroups posts on 20 topics split in two subsets: one for training (or development) and the other one for testing (or for performance evaluation).
es_es: Carguemos los datos del conjunto de datos de grupos de noticias(newsgroups), que comprende unos 18.000 artículos de grupos de noticias sobre 20 temas, divididos en dos subconjuntos: uno para el entrenamiento (o desarrollo) y otro para las pruebas (o para la evaluación del rendimiento).

source: Benchmark classifiers
es_es: Clasificadores de rendimiento

source: We train and test the datasets with 15 different classification models and get performance results for each model.
es_es: Entrenamos y probamos los conjuntos de datos con 15 modelos de clasificación diferentes y obtenemos resultados de rendimiento para cada modelo.

source: Add plots
es_es: Añadir gráficos

source: The bar plot indicates the accuracy, training time (normalized) and test time (normalized) of each classifier.
es_es: El gráfico de barras indica la exactitud, el tiempo de entrenamiento (normalizado) y el tiempo de prueba (normalizado) de cada clasificador.

source: **Total running time of the script:** ( 0 minutes 5.632 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 5.632 segundos)

source: :download:`Download Python source code: plot_document_classification_20newsgroups.py <plot_document_classification_20newsgroups.py>`
es_es: :download:`Descargar código fuente de Python: plot_document_classification_20newsgroups.py <plot_document_classification_20newsgroups.py>`

source: :download:`Download Jupyter notebook: plot_document_classification_20newsgroups.ipynb <plot_document_classification_20newsgroups.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_document_classification_20newsgroups.ipynb <plot_document_classification_20newsgroups.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
