Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/preprocessing/plot_discretization_strategies.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_preprocessing_plot_discretization_strategies.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_preprocessing_plot_discretization_strategies.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Demonstrating the different strategies of KBinsDiscretizer
es_es: Demostrar las diferentes estrategias de KBinsDiscretizer

source: This example presents the different strategies implemented in KBinsDiscretizer:
es_es: Este ejemplo presenta las diferentes estrategias implementadas en KBinsDiscretizer:

source: 'uniform': The discretization is uniform in each feature, which means that the bin widths are constant in each dimension.
es_es: 'uniform': La discretización es uniforme en cada característica, lo que significa que las anchuras de los contenedores son constantes en cada dimensión.

source: quantile': The discretization is done on the quantiled values, which means that each bin has approximately the same number of samples.
es_es: quantile': La discretización se hace sobre los valores de los cuantiles, lo que significa que cada contenedor tiene aproximadamente el mismo número de muestras.

source: 'kmeans': The discretization is based on the centroids of a KMeans clustering procedure.
es_es: 'kmeans': La discretización se basa en los centroides de un procedimiento de agrupación de KMeans.

source: The plot shows the regions where the discretized encoding is constant.
es_es: La gráfica muestra las regiones donde la codificación discretizada es constante.

source: **Total running time of the script:** ( 0 minutes 0.797 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.797 segundos)

source: :download:`Download Python source code: plot_discretization_strategies.py <plot_discretization_strategies.py>`
es_es: :download:`Descargar el código fuente de Python: plot_discretization_strategies.py <plot_discretization_strategies.py>`

source: :download:`Download Jupyter notebook: plot_discretization_strategies.ipynb <plot_discretization_strategies.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_discretization_strategies.ipynb <plot_discretization_strategies.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
