Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/preprocessing/plot_discretization_classification.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_preprocessing_plot_discretization_classification.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_preprocessing_plot_discretization_classification.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Feature discretization
es_es: Discretización de la característica

source: A demonstration of feature discretization on synthetic classification datasets. Feature discretization decomposes each feature into a set of bins, here equally distributed in width. The discrete values are then one-hot encoded, and given to a linear classifier. This preprocessing enables a non-linear behavior even though the classifier is linear.
es_es: Demostración de la discretización de características en conjuntos de datos sintéticos de clasificación. La discretización de rasgos descompone cada rasgo en un conjunto de bines, en este caso distribuidos equitativamente en anchura. A continuación, los valores discretos se codifican en un solo paso y se entregan a un clasificador lineal. Este preprocesamiento permite un comportamiento no lineal aunque el clasificador sea lineal.

source: On this example, the first two rows represent linearly non-separable datasets (moons and concentric circles) while the third is approximately linearly separable. On the two linearly non-separable datasets, feature discretization largely increases the performance of linear classifiers. On the linearly separable dataset, feature discretization decreases the performance of linear classifiers. Two non-linear classifiers are also shown for comparison.
es_es: En este ejemplo, las dos primeras filas representan conjuntos de datos lineales no separables (lunas y círculos concentrados) mientras que la tercera es aproximadamente separable linealmente. En los dos conjuntos de datos lineales no separables, la discretización aumenta en gran medida el rendimiento de los clasificadores lineales. En el conjunto de datos lineales separables, la discretización de las características disminuye el rendimiento de los clasificadores lineales.

source: This example should be taken with a grain of salt, as the intuition conveyed does not necessarily carry over to real datasets. Particularly in high-dimensional spaces, data can more easily be separated linearly. Moreover, using feature discretization and one-hot encoding increases the number of features, which easily lead to overfitting when the number of samples is small.
es_es: Este ejemplo debería tomarse con un grano de sal, ya que la intuición transmitida no necesariamente se transfiere a los conjuntos de datos reales. Particularmente en espacios de alta dimensión, los datos pueden separarse linealmente. Además, el uso de la discretización de características y la codificación de una sola en caliente aumenta el número de características, lo que fácilmente conduce a un exceso de ajuste cuando el número de muestras es pequeño.

source: The plots show training points in solid colors and testing points semi-transparent. The lower right shows the classification accuracy on the test set.
es_es: Las gráficas muestran puntos de entrenamiento en colores sólidos y puntos de prueba semitransparentes.

source: **Total running time of the script:** ( 0 minutes 25.578 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 25.578 segundos)

source: :download:`Download Python source code: plot_discretization_classification.py <plot_discretization_classification.py>`
es_es: :download:`Descargar el código fuente de Python: plot_discretization_classification.py <plot_discretization_classification.py>`

source: :download:`Download Jupyter notebook: plot_discretization_classification.ipynb <plot_discretization_classification.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_discretization_classification.ipynb <plot_discretization_classification.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
