Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/preprocessing/plot_map_data_to_normal.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_preprocessing_plot_map_data_to_normal.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_preprocessing_plot_map_data_to_normal.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Map data to a normal distribution
es_es: Mapear datos a una distribución normal

source: This example demonstrates the use of the Box-Cox and Yeo-Johnson transforms through :class:`~PowerTransformer` to map data from various distributions to a normal distribution.
es_es: Este ejemplo demuestra el uso de las transformas Box-Cox y Yeo-Johnson a través de :class:`~PowerTransformer` para mapear los datos de varias distribuciones a una distribución normal.

source: The power transform is useful as a transformation in modeling problems where homoscedasticity and normality are desired. Below are examples of Box-Cox and Yeo-Johnwon applied to six different probability distributions: Lognormal, Chi-squared, Weibull, Gaussian, Uniform, and Bimodal.
es_es: La transformada de potencia es útil como transformación en problemas de modelado en los que se desea la homocedasticidad y la normalidad. A continuación se muestran ejemplos de Box-Cox y Yeo-Johnwon aplicados a seis distribuciones de probabilidad diferentes: Lognormal, Chi-cuadrado, Weibull, Gaussiana, Uniforme y Bimodal.

source: Note that the transformations successfully map the data to a normal distribution when applied to certain datasets, but are ineffective with others. This highlights the importance of visualizing the data before and after transformation.
es_es: Ten en cuenta que las transformaciones asignan con éxito los datos a una distribución normal cuando se aplican a ciertos conjuntos de datos, pero son ineficaces con otros. Esto subraya la importancia de visualizar los datos antes y después de la transformación.

source: Also note that even though Box-Cox seems to perform better than Yeo-Johnson for lognormal and chi-squared distributions, keep in mind that Box-Cox does not support inputs with negative values.
es_es: También ten en cuenta que aunque Box-Cox parece tener un mejor desempeño que Yeo-Johnson para las distribuciones lognormal y chi-cuadrado, ten en cuenta que Box-Cox no soporta entradas con valores negativos.

source: For comparison, we also add the output from :class:`~QuantileTransformer`. It can force any arbitrary distribution into a gaussian, provided that there are enough training samples (thousands). Because it is a non-parametric method, it is harder to interpret than the parametric ones (Box-Cox and Yeo-Johnson).
es_es: Para comparar, también sumamos la salida de :class:`~QuantileTransformer`. Puede forzar cualquier distribución arbitraria a un gaussiano, siempre que haya suficientes muestras de entrenamiento (millares). Debido a que es un método no paramétrico, es más difícil de interpretar que los parámetros (Box-Cox y Yeo-Johnson).

source: On "small" datasets (less than a few hundred points), the quantile transformer is prone to overfitting. The use of the power transform is then recommended.
es_es: En conjuntos de datos "pequeños" (menos de unos cientos de puntos), la transformada de cuantil es propensa a sobreajustarse. Se recomienda entonces el uso de la transformada de potencia.

source: **Total running time of the script:** ( 0 minutes 1.810 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.810 segundos)

source: :download:`Download Python source code: plot_map_data_to_normal.py <plot_map_data_to_normal.py>`
es_es: :download:`Descargar el código fuente de Python: plot_map_data_to_normal.py <plot_map_data_to_normal.py>`

source: :download:`Download Jupyter notebook: plot_map_data_to_normal.ipynb <plot_map_data_to_normal.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_map_data_to_normal.ipynb <plot_map_data_to_normal.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
