Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/neighbors/approximate_nearest_neighbors.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_neighbors_approximate_nearest_neighbors.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_neighbors_approximate_nearest_neighbors.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Approximate nearest neighbors in TSNE
es_es: Vecinos más cercanos aproximados en TSNE

source: This example presents how to chain KNeighborsTransformer and TSNE in a pipeline. It also shows how to wrap the packages `annoy` and `nmslib` to replace KNeighborsTransformer and perform approximate nearest neighbors. These packages can be installed with `pip install annoy nmslib`.
es_es: Este ejemplo presenta cómo encadenar KNeighborsTransformer y TSNE en un pipeline. También muestra cómo incluir los paquetes `annoy` y `nmslib` para reemplazar KNeighborsTransformer y realizar vecinos más cercanos aproximados. Estos paquetes se pueden instalar con `pip install annoy nmslib`.

source: Note: Currently `TSNE(metric='precomputed')` does not modify the precomputed distances, and thus assumes that precomputed euclidean distances are squared. In future versions, a parameter in TSNE will control the optional squaring of precomputed distances (see #12401).
es_es: Nota: Actualmente `TSNE(metric='precomputed')` no modifica las distancias precalculadas, y por tanto asume que las distancias euclidianas precalculadas son cuadradas. En futuras versiones, un parámetro en TSNE controlará el cuadrado opcional de las distancias precalculadas (ver #12401).

source: Note: In KNeighborsTransformer we use the definition which includes each training point as its own neighbor in the count of `n_neighbors`, and for compatibility reasons, one extra neighbor is computed when `mode == 'distance'`. Please note that we do the same in the proposed wrappers.
es_es: Nota: En KNeighborsTransformer utilizamos la definición que incluye cada punto de entrenamiento como su propio vecino en el recuento de `n_neighbors`, y por razones de compatibilidad, se cálcula un vecino extra cuando `mode == 'distance'`. Ten en cuenta que hacemos lo mismo en las inclusiones propuestas.

source: Sample output::
es_es: Ejemplo de salida::

source: **Total running time of the script:** ( 0 minutes 0.000 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.000 segundos)

source: :download:`Download Python source code: approximate_nearest_neighbors.py <approximate_nearest_neighbors.py>`
es_es: :download:`Descargar el código fuente de Python: approximate_nearest_neighbors.py <approximate_nearest_neighbors.py>`

source: :download:`Download Jupyter notebook: approximate_nearest_neighbors.ipynb <approximate_nearest_neighbors.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: approximate_nearest_neighbors.ipynb <approximate_nearest_neighbors.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
