Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/neighbors/plot_kde_1d.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_neighbors_plot_kde_1d.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_neighbors_plot_kde_1d.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Simple 1D Kernel Density Estimation
es_es: Estimación Simple de la Densidad Núcleo 1D

source: This example uses the :class:`~sklearn.neighbors.KernelDensity` class to demonstrate the principles of Kernel Density Estimation in one dimension.
es_es: Este ejemplo utiliza la clase :class:`~sklearn.neighbors.KernelDensity` para demostrar los principios de Estimación de Densidad Núcleo en una dimensión.

source: The first plot shows one of the problems with using histograms to visualize the density of points in 1D. Intuitively, a histogram can be thought of as a scheme in which a unit "block" is stacked above each point on a regular grid. As the top two panels show, however, the choice of gridding for these blocks can lead to wildly divergent ideas about the underlying shape of the density distribution. If we instead center each block on the point it represents, we get the estimate shown in the bottom left panel. This is a kernel density estimation with a "top hat" kernel. This idea can be generalized to other kernel shapes: the bottom-right panel of the first figure shows a Gaussian kernel density estimate over the same distribution.
es_es: El primer gráfico muestra uno de los problemas del uso de histogramas para visualizar la densidad de puntos en 1D. Intuitivamente, un histograma puede considerarse como un esquema en el que un "bloque" unitario se coloca sobre cada punto en una cuadrícula regular. Sin embargo, como muestran los dos paneles superiores, la elección de la cuadrícula para estos bloques puede conducir a ideas deliberadamente divergentes, sobre la forma subyacente de la distribución de la densidad. Si, en cambio, centramos cada bloque en el punto que representa, obtenemos la estimación que se muestra en el panel inferior izquierdo. Se trata de una estimación de densidad núcleo con un núcleo de "sombrero de copa". Esta idea puede generalizarse a otras formas del núcleo: el panel inferior derecho de la primera figura muestra una estimación de densidad de núcleo Gaussiano sobre la misma distribución.

source: Scikit-learn implements efficient kernel density estimation using either a Ball Tree or KD Tree structure, through the :class:`~sklearn.neighbors.KernelDensity` estimator. The available kernels are shown in the second figure of this example.
es_es: Scikit-learn implementa una estimación eficiente de la densidad del núcleo utilizando una estructura de Ball Tree o KD Tree, a través del estimador :class:`~sklearn.neighbors.KernelDensity`. Los núcleos disponibles se muestran en la segunda figura de este ejemplo.

source: The third figure compares kernel density estimates for a distribution of 100 samples in 1 dimension. Though this example uses 1D distributions, kernel density estimation is easily and efficiently extensible to higher dimensions as well.
es_es: La tercera figura compara las estimaciones de la densidad núcleo para una distribución de 100 muestras en 1 dimensión. Aunque este ejemplo utiliza distribuciones 1D, la estimación de la densidad núcleo es fácil y eficazmente extensible a dimensiones más altas también.

source: **Total running time of the script:** ( 0 minutes 0.514 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.514 segundos)

source: :download:`Download Python source code: plot_kde_1d.py <plot_kde_1d.py>`
es_es: :download:`Descargar el código fuente de Python: plot_kde_1d.py <plot_kde_1d.py>`

source: :download:`Download Jupyter notebook: plot_kde_1d.ipynb <plot_kde_1d.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_kde_1d.ipynb <plot_kde_1d.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
