Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/neighbors/plot_species_kde.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_neighbors_plot_species_kde.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_neighbors_plot_species_kde.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Kernel Density Estimate of Species Distributions
es_es: Estimación de la Densidad del Núcleo de las Distribuciones de las Especies

source: This shows an example of a neighbors-based query (in particular a kernel density estimate) on geospatial data, using a Ball Tree built upon the Haversine distance metric -- i.e. distances over points in latitude/longitude. The dataset is provided by Phillips et. al. (2006). If available, the example uses `basemap <https://matplotlib.org/basemap/>`_ to plot the coast lines and national boundaries of South America.
es_es: Muestra un ejemplo de consulta basada en vecinos (en particular, una estimación de la densidad de núcleo) sobre datos geoespaciales, utilizando un Árbol de Bolas construido sobre la métrica de distancia de Haversine, es decir, distancias sobre puntos en latitud/longitud. El conjunto de datos es proporcionado por Phillips et. al. (2006). Si está disponible, el ejemplo utiliza `basemap <https://matplotlib.org/basemap/>`_ para trazar las líneas de costa y las fronteras nacionales de Sudamérica.

source: This example does not perform any learning over the data (see :ref:`sphx_glr_auto_examples_applications_plot_species_distribution_modeling.py` for an example of classification based on the attributes in this dataset). It simply shows the kernel density estimate of observed data points in geospatial coordinates.
es_es: Este ejemplo no realiza ningún aprendizaje sobre los datos (ver :ref:`sphx_glr_auto_examples_applications_plot_species_distribution_modeling.py` para un ejemplo de clasificación basado en los atributos de este conjunto de datos). Simplemente muestra la estimación de la densidad núcleo de los puntos de datos observados en coordenadas geoespaciales.

source: The two species are:
es_es: Las dos especies son:

source: `"Bradypus variegatus" <http://www.iucnredlist.org/apps/redlist/details/3038/0>`_ , the Brown-throated Sloth.
es_es: `"Bradypus variegatus" <http://www.iucnredlist.org/apps/redlist/details/3038/0>`_ , el perezoso de garganta marrón.

source: `"Microryzomys minutus" <http://www.iucnredlist.org/details/13408/0>`_ , also known as the Forest Small Rice Rat, a rodent that lives in Peru, Colombia, Ecuador, Peru, and Venezuela.
es_es: `"Microryzomys minutus" <http://www.iucnredlist.org/details/13408/0>`_ , también conocido como la Pequeña Rata del Arroz del Bosque, un roedor que vive en Perú, Colombia, Ecuador y Venezuela.

source: References
es_es: Referencias

source: **Total running time of the script:** ( 0 minutes 4.188 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 4.188 segundos)

source: :download:`Download Python source code: plot_species_kde.py <plot_species_kde.py>`
es_es: :download:`Descargar el código fuente de Python: plot_species_kde.py <plot_species_kde.py>`

source: :download:`Download Jupyter notebook: plot_species_kde.ipynb <plot_species_kde.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_species_kde.ipynb <plot_species_kde.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
