Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/compose/plot_column_transformer.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_compose_plot_column_transformer.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`here <sphx_glr_download_auto_examples_compose_plot_column_transformer.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Column Transformer with Heterogeneous Data Sources
es_es: Transformador de columnas con fuentes de datos heterogéneas

source: Datasets can often contain components that require different feature extraction and processing pipelines. This scenario might occur when:
es_es: Los conjuntos de datos pueden contener a menudo componentes que requieren diferente extracción de características y pipeline de procesamiento. Este escenario puede ocurrir cuando:

source: your dataset consists of heterogeneous data types (e.g. raster images and text captions),
es_es: tu conjunto de datos está formado por tipos de datos heterogéneos (por ejemplo, imágenes rasterizadas y leyendas de texto),

source: your dataset is stored in a :class:`pandas.DataFrame` and different columns require different processing pipelines.
es_es: su conjunto de datos se almacena en un :class:`pandas.DataFrame` y las diferentes columnas requieren diferentes pipelines de procesamiento.

source: This example demonstrates how to use :class:`~sklearn.compose.ColumnTransformer` on a dataset containing different types of features. The choice of features is not particularly helpful, but serves to illustrate the technique.
es_es: Este ejemplo demuestra cómo utilizar :class:`~sklearn.compose.ColumnTransformer` en un conjunto de datos que contiene diferentes tipos de características. La elección de las características no es especialmente útil, pero sirve para ilustrar la técnica.

source: 20 newsgroups dataset
es_es: Conjunto de datos de 20 grupos de noticias

source: We will use the :ref:`20 newsgroups dataset <20newsgroups_dataset>`, which comprises posts from newsgroups on 20 topics. This dataset is split into train and test subsets based on messages posted before and after a specific date. We will only use posts from 2 categories to speed up running time.
es_es: Utilizaremos el conjunto de datos :ref:`20 newsgroups <20newsgroups_dataset>`, que comprende mensajes de grupos de noticias sobre 20 temas. Este conjunto de datos se divide en subconjuntos de entrenamiento y de prueba basados en los mensajes publicados antes y después de una fecha específica. Sólo utilizaremos mensajes de dos categorías para acelerar el tiempo de ejecución.

source: Each feature comprises meta information about that post, such as the subject, and the body of the news post.
es_es: Cada característica comprende meta información sobre esa entrada, como el tema, y el cuerpo de la noticia.

source: Creating transformers
es_es: Creación de transformadores

source: First, we would like a transformer that extracts the subject and body of each post. Since this is a stateless transformation (does not require state information from training data), we can define a function that performs the data transformation then use :class:`~sklearn.preprocessing.FunctionTransformer` to create a scikit-learn transformer.
es_es: En primer lugar, queremos un transformador que extraiga el asunto y el cuerpo de cada mensaje. Como se trata de una transformación sin estado (no requiere información de estado de los datos de entrenamiento), podemos definir una función que realice la transformación de los datos y luego utilizar :class:`~sklearn.preprocessing.FunctionTransformer` para crear un transformador de scikit-learn.

source: We will also create a transformer that extracts the length of the text and the number of sentences.
es_es: También crearemos un transformador que extraiga la longitud del texto y el número de frases.

source: Classification pipeline
es_es: Pipeline de clasificación

source: The pipeline below extracts the subject and body from each post using ``SubjectBodyExtractor``, producing a (n_samples, 2) array. This array is then used to compute standard bag-of-words features for the subject and body as well as text length and number of sentences on the body, using ``ColumnTransformer``. We combine them, with weights, then train a classifier on the combined set of features.
es_es: El siguiente pipeline extrae el asunto y el cuerpo de cada entrada utilizando ``SubjectBodyExtractor``, produciendo un arreglo ( n_samples, 2). Este arreglo se utiliza para calcular las características estándar de la bolsa de palabras para el tema y el cuerpo, así como la longitud del texto y el número de frases en el cuerpo, utilizando ``ColumnTransformer``. Las combinamos, con pesos, y luego entrenamos un clasificador en el conjunto combinado de características.

source: Finally, we fit our pipeline on the training data and use it to predict topics for ``X_test``. Performance metrics of our pipeline are then printed.
es_es: Por último, ajustamos nuestro pipeline a los datos de entrenamiento y lo utilizamos para predecir los temas de ``X_test``. A continuación, se imprimen las métricas de rendimiento de nuestro pipeline.

source: **Total running time of the script:** ( 0 minutes 3.151 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 3.151 segundos)

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
