Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/compose/plot_column_transformer_mixed_types.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_compose_plot_column_transformer_mixed_types.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_compose_plot_column_transformer_mixed_types.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Column Transformer with Mixed Types
es_es: Transformador de columna con tipos mixtos

source: This example illustrates how to apply different preprocessing and feature extraction pipelines to different subsets of features, using :class:`~compose.ColumnTransformer`. This is particularly handy for the case of datasets that contain heterogeneous data types, since we may want to scale the numeric features and one-hot encode the categorical ones.
es_es: Este ejemplo ilustra cómo aplicar diferentes pipelines de preprocesamiento y extracción de características a diferentes subconjuntos de características, utilizando :class:`~compose.ColumnTransformer`. Esto es particularmente útil para el caso de conjuntos de datos que contienen tipos de datos heterogéneos, ya que podemos querer escalar las características numéricas y codificar de una sola vez las categóricas.

source: In this example, the numeric data is standard-scaled after mean-imputation, while the categorical data is one-hot encoded after imputing missing values with a new category (``'missing'``).
es_es: En este ejemplo, los datos numéricos se ajustan a la escala estándar después de la imputación de la media, mientras que los datos categóricos se codifican de una sola vez después de imputar los valores faltantes con una nueva categoría (``'missing'``).

source: In addition, we show two different ways to dispatch the columns to the particular pre-processor: by column names and by column data types.
es_es: Además, mostramos dos formas diferentes de enviar las columnas al preprocesador particular: por nombres de columna y por tipos de datos de columna.

source: Finally, the preprocessing pipeline is integrated in a full prediction pipeline using :class:`~pipeline.Pipeline`, together with a simple classification model.
es_es: Por último, el pipeline de preprocesamiento se integra en un pipeline de predicción completo utilizando :class:`~pipeline.Pipeline`, junto con un modelo de clasificación simple.

source: Use ``ColumnTransformer`` by selecting column by names
es_es: Usa ``ColumnTransformer`` seleccionando columna por nombres

source: We will train our classifier with the following features:
es_es: Entrenaremos a nuestro clasificador con las siguientes características:

source: Numeric Features:
es_es: Características numéricas:

source: Categorical Features:
es_es: Características categóricas:

source: ``embarked``: categories encoded as strings ``{'C', 'S', 'Q'}``;
es_es: ``embarked``: categorías codificadas como cadenas ``{'C', 'S', 'Q'}``;

source: ``sex``: categories encoded as strings ``{'female', 'male'}``;
es_es: ``sex``: categorías codificadas como cadenas ``{'female', 'male'}``;

source: ``pclass``: ordinal integers ``{1, 2, 3}``.
es_es: ``pclass``: enteros ordinales ``{1, 2, 3}``.

source: We create the preprocessing pipelines for both numeric and categorical data. Note that ``pclass`` could either be treated as a categorical or numeric feature.
es_es: Creamos pipelines de preprocesamiento para datos numéricos y categóricos. Tenga en cuenta que ``pclass`` puede ser tratada como una característica categórica o numérica.

source: HTML representation of ``Pipeline``
es_es: Representación HTML de ``Pipeline``

source: When the ``Pipeline`` is printed out in a jupyter notebook an HTML representation of the estimator is displayed as follows:
es_es: Cuando el ``Pipeline`` se imprime en un Cuaderno de Jupyter se muestra una representación HTML del estimador como la siguiente:

source: Use ``ColumnTransformer`` by selecting column by data types
es_es: Utiliza ``ColumnTransformer`` seleccionando la columna por tipos de datos

source: When dealing with a cleaned dataset, the preprocessing can be automatic by using the data types of the column to decide whether to treat a column as a numerical or categorical feature. :func:`sklearn.compose.make_column_selector` gives this possibility. First, let's only select a subset of columns to simplify our example.
es_es: Cuando se trata de un conjunto de datos limpio, el preprocesamiento puede ser automático utilizando los tipos de datos de la columna para decidir si se trata una columna como característica numérica o categórica. :func:`sklearn.compose.make_column_selector` ofrece esta posibilidad. Primero, vamos a seleccionar sólo un subconjunto de columnas para simplificar nuestro ejemplo.

source: Then, we introspect the information regarding each column data type.
es_es: A continuación, introspeccionamos la información relativa a cada tipo de dato de la columna.

source: We can observe that the `embarked` and `sex` columns were tagged as `category` columns when loading the data with ``fetch_openml``. Therefore, we can use this information to dispatch the categorical columns to the ``categorical_transformer`` and the remaining columns to the ``numerical_transformer``.
es_es: Podemos observar que las columnas `embarked` y `sex` fueron etiquetadas como columnas de `categoría` al cargar los datos con ``fetch_openml``. Por tanto, podemos utilizar esta información para enviar las columnas categóricas al ``categorical_transformer`` y el resto de columnas al ``numerical_transformer``.

source: In practice, you will have to handle yourself the column data type. If you want some columns to be considered as `category`, you will have to convert them into categorical columns. If you are using pandas, you can refer to their documentation regarding `Categorical data <https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html>`_.
es_es: En la práctica, deberás manejar tú mismo el tipo de datos de la columna. Si quieres que algunas columnas sean consideradas como `categoría`, tendrás que convertirlas en columnas categóricas. Si utilizas pandas, puede consultar su documentación sobre `Datos categóricos <https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html>`_.

source: The resulting score is not exactly the same as the one from the previous pipeline becase the dtype-based selector treats the ``pclass`` columns as a numeric features instead of a categorical feature as previously:
es_es: La puntuación resultante no es exactamente la misma que la del pipeline anterior porque el selector basado en dtype trata las columnas ``pclass`` como características numéricas en lugar de categóricas como anteriormente:

source: Using the prediction pipeline in a grid search
es_es: Uso del pipeline de predicción en una búsqueda en cuadrícula

source: Grid search can also be performed on the different preprocessing steps defined in the ``ColumnTransformer`` object, together with the classifier's hyperparameters as part of the ``Pipeline``. We will search for both the imputer strategy of the numeric preprocessing and the regularization parameter of the logistic regression using :class:`~sklearn.model_selection.GridSearchCV`.
es_es: La búsqueda en cuadrícula también se puede realizar en los diferentes pasos de preprocesamiento definidos en el objeto ``ColumnTransformer``, junto con los hiperparámetros del clasificador como parte del ``Pipeline``. Buscaremos tanto la estrategia de imputación del preprocesamiento numérico como el parámetro de regularización de la regresión logística utilizando :class:`~sklearn.model_selection.GridSearchCV`.

source: Calling 'fit' triggers the cross-validated search for the best hyper-parameters combination:
es_es: Al llamar a 'fit' se desencadena la búsqueda de validada cruzada de la mejor combinación de hiperparámetros:

source: The internal cross-validation scores obtained by those parameters is:
es_es: La puntuación de validación cruzada interna obtenida por esos parámetros es:

source: We can also introspect the top grid search results as a pandas dataframe:
es_es: También podemos introspeccionar los resultados de la búsqueda en cuadrícula superior como un dataframe de pandas:

source: The best hyper-parameters have be used to re-fit a final model on the full training set. We can evaluate that final model on held out test data that was not used for hyparameter tuning.
es_es: Los mejores hiperparámetros se han utilizado para reajustar un modelo final en el conjunto de entrenamiento completo. Podemos evaluar ese modelo final en los datos de prueba retenidos que no se utilizaron para el ajuste de los hiperparámetros.

source: **Total running time of the script:** ( 0 minutes 2.496 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 2.496 segundos)

source: :download:`Download Python source code: plot_column_transformer_mixed_types.py <plot_column_transformer_mixed_types.py>`
es_es: :download:`Descargar el código fuente de Python: plot_column_transformer_mixed_types.py <plot_column_transformer_mixed_types.py>`

source: :download:`Download Jupyter notebook: plot_column_transformer_mixed_types.ipynb <plot_column_transformer_mixed_types.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_column_transformer_mixed_types.ipynb <plot_column_transformer_mixed_types.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
