Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/compose/plot_compare_reduction.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_compose_plot_compare_reduction.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_compose_plot_compare_reduction.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Selecting dimensionality reduction with Pipeline and GridSearchCV
es_es: Selección de la reducción de la dimensionalidad con Pipeline y GridSearchCV

source: This example constructs a pipeline that does dimensionality reduction followed by prediction with a support vector classifier. It demonstrates the use of ``GridSearchCV`` and ``Pipeline`` to optimize over different classes of estimators in a single CV run -- unsupervised ``PCA`` and ``NMF`` dimensionality reductions are compared to univariate feature selection during the grid search.
es_es: Este ejemplo construye un pipeline que realiza una reducción de la dimensionalidad seguida de una predicción con un clasificador de vectores de soporte. Demuestra el uso de ``GridSearchCV`` y ``Pipeline`` para optimizar diferentes clases de estimadores en una sola ejecución de CV -- las reducciones de dimensionalidad no supervisadas ``PCA`` y ``NMF`` se comparan con la selección de características univariantes durante la búsqueda exhaustiva.

source: Additionally, ``Pipeline`` can be instantiated with the ``memory`` argument to memoize the transformers within the pipeline, avoiding to fit again the same transformers over and over.
es_es: Además, ``Pipeline`` puede ser instanciado con el argumento ``memory`` para memorizar los transformadores dentro del pipeline, evitando ajustar de nuevo los mismos transformadores una y otra vez.

source: Note that the use of ``memory`` to enable caching becomes interesting when the fitting of a transformer is costly.
es_es: Nota que el uso de ``memory`` para permitir el almacenamiento en caché se vuelve interesante cuando el ajuste de un transformador es costoso.

source: # %% Illustration of ``Pipeline`` and ``GridSearchCV`` ###############################################################################
es_es: # %% Ilustración de ``Pipeline`` y ``GridSearchCV`` ###############################################################################

source: This section illustrates the use of a ``Pipeline`` with ``GridSearchCV``
es_es: Esta sección ilustra el uso de un ``Pipeline`` con ``GridSearchCV``

source: Out:
es_es: Salida:

source: Caching transformers within a ``Pipeline``
es_es: Almacenamiento en caché de transformadores dentro de un ``Pipeline``

source: It is sometimes worthwhile storing the state of a specific transformer since it could be used again. Using a pipeline in ``GridSearchCV`` triggers such situations. Therefore, we use the argument ``memory`` to enable caching.
es_es: A veces merece la pena almacenar el estado de un transformador concreto, ya que podría volver a utilizarse. El uso de un pipeline en ``GridSearchCV`` provoca este tipo de situaciones. Por lo tanto, utilizamos el argumento ``memory`` para habilitar el almacenamiento en caché.

source: Note that this example is, however, only an illustration since for this specific case fitting PCA is not necessarily slower than loading the cache. Hence, use the ``memory`` constructor parameter when the fitting of a transformer is costly.
es_es: Ten en cuenta que este ejemplo es, sin embargo, sólo una ilustración, ya que para este caso específico el ajuste de PCA no es necesariamente más lento que la carga de la caché. Por lo tanto, utiliza el parámetro del constructor ``memory`` cuando el ajuste de un transformador sea costoso.

source: The ``PCA`` fitting is only computed at the evaluation of the first configuration of the ``C`` parameter of the ``LinearSVC`` classifier. The other configurations of ``C`` will trigger the loading of the cached ``PCA`` estimator data, leading to save processing time. Therefore, the use of caching the pipeline using ``memory`` is highly beneficial when fitting a transformer is costly.
es_es: El ajuste del ``PCA`` sólo se calcula al evaluar la primera configuración del parámetro ``C`` del clasificador ``LinearSVC``. Las demás configuraciones de ``C`` provocarán la carga de los datos del estimador ``PCA`` en caché, lo que permitirá ahorrar tiempo de procesamiento. Por lo tanto, el uso de la caché del pipeline utilizando la ``memory`` es muy beneficioso cuando la adaptación de un transformador es costosa.

source: **Total running time of the script:** ( 0 minutes 11.800 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 11.800 segundos)

source: :download:`Download Python source code: plot_compare_reduction.py <plot_compare_reduction.py>`
es_es: :download:`Descargar el código fuente de Python: plot_compare_reduction.py <plot_compare_reduction.py>`

source: :download:`Download Jupyter notebook: plot_compare_reduction.ipynb <plot_compare_reduction.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_compare_reduction.ipynb <plot_compare_reduction.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
