Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/compose/plot_transformed_target.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_compose_plot_transformed_target.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_compose_plot_transformed_target.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Effect of transforming the targets in regression model
es_es: Efecto de la transformación de los objetivos en el modelo de regresión

source: In this example, we give an overview of :class:`~sklearn.compose.TransformedTargetRegressor`. We use two examples to illustrate the benefit of transforming the targets before learning a linear regression model. The first example uses synthetic data while the second example is based on the Ames housing data set.
es_es: En este ejemplo, damos una visión general de :class:`~sklearn.compose.TransformedTargetRegressor`. Utilizamos dos ejemplos para ilustrar las ventajas de transformar los objetivos antes de aprender un modelo de regresión lineal. El primer ejemplo utiliza datos sintéticos, mientras que el segundo se basa en el conjunto de datos de viviendas de Ames.

source: Synthetic example
es_es: Ejemplo de síntesis

source: A synthetic random regression dataset is generated. The targets ``y`` are modified by:
es_es: Se genera un conjunto de datos de regresión aleatoria sintética. Los objetivos ``y`` se modifican por:

source: translating all targets such that all entries are non-negative (by adding the absolute value of the lowest ``y``) and
es_es: traduciendo todos los objetivos de forma que todas las entradas sean no negativas (sumando el valor absoluto del menor ``y``) y

source: applying an exponential function to obtain non-linear targets which cannot be fitted using a simple linear model.
es_es: aplicando una función exponencial para obtener objetivos no lineales que no pueden ajustarse mediante un modelo lineal simple.

source: Therefore, a logarithmic (`np.log1p`) and an exponential function (`np.expm1`) will be used to transform the targets before training a linear regression model and using it for prediction.
es_es: Por lo tanto, se utilizará una función logarítmica (`np.log1p`) y una función exponencial (`np.expm1`) para transformar los objetivos antes de entrenar un modelo de regresión lineal y utilizarlo para la predicción.

source: Below we plot the probability density functions of the target before and after applying the logarithmic functions.
es_es: A continuación, trazamos las funciones de densidad de probabilidad del objetivo antes y después de aplicar las funciones logarítmicas.

source: At first, a linear model will be applied on the original targets. Due to the non-linearity, the model trained will not be precise during prediction. Subsequently, a logarithmic function is used to linearize the targets, allowing better prediction even with a similar linear model as reported by the median absolute error (MAE).
es_es: Al principio, se aplicará un modelo lineal a los objetivos originales. Debido a la no linealidad, el modelo entrenado no será preciso durante la predicción. Posteriormente, se utiliza una función logarítmica para linealizar los objetivos, lo que permite una mejor predicción incluso con un modelo lineal similar, como indica la mediana del error absoluto (MAE).

source: Real-world data set
es_es: Conjunto de datos del mundo real

source: In a similar manner, the Ames housing data set is used to show the impact of transforming the targets before learning a model. In this example, the target to be predicted is the selling price of each house.
es_es: De forma similar, el conjunto de datos de viviendas de Ames se utiliza para mostrar el impacto de la transformación de los objetivos antes de aprender un modelo. En este ejemplo, el objetivo a predecir es el precio de venta de cada vivienda.

source: A :class:`~sklearn.preprocessing.QuantileTransformer` is used to normalize the target distribution before applying a :class:`~sklearn.linear_model.RidgeCV` model.
es_es: Se utiliza un :class:`~sklearn.preprocessing.QuantileTransformer` para normalizar la distribución objetivo antes de aplicar un modelo :class:`~sklearn.linear_model.RidgeCV`.

source: The effect of the transformer is weaker than on the synthetic data. However, the transformation results in an increase in :math:`R^2` and large decrease of the MAE. The residual plot (predicted target - true target vs predicted target) without target transformation takes on a curved, 'reverse smile' shape due to residual values that vary depending on the value of predicted target. With target transformation, the shape is more linear indicating better model fit.
es_es: El efecto de la transformación es más débil que en los datos sintéticos. Sin embargo, la transformación produce un aumento de :math:`R^2` y una gran disminución del MAE. El gráfico de residuos (objetivo predicho - objetivo verdadero frente a objetivo predicho) sin la transformación del objetivo adquiere una forma curvada, de 'reverse smile', debido a que los valores residuales varían en función del valor del objetivo predicho. Con la transformación del objetivo, la forma es más lineal, lo que indica un mejor ajuste del modelo.

source: **Total running time of the script:** ( 0 minutes 1.802 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.802 segundos)

source: :download:`Download Python source code: plot_transformed_target.py <plot_transformed_target.py>`
es_es: :download:`Descargar el código fuente de Python: plot_transformed_target.py <plot_transformed_target.py>`

source: :download:`Download Jupyter notebook: plot_transformed_target.ipynb <plot_transformed_target.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_transformed_target.ipynb <plot_transformed_target.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
