Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/release_highlights/plot_release_highlights_0_24_0.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_release_highlights_plot_release_highlights_0_24_0.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_release_highlights_plot_release_highlights_0_24_0.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Release Highlights for scikit-learn 0.24
es_es: Aspectos Destacados de scikit-learn 0.24

source: We are pleased to announce the release of scikit-learn 0.24! Many bug fixes and improvements were added, as well as some new key features. We detail below a few of the major features of this release. **For an exhaustive list of all the changes**, please refer to the :ref:`release notes <changes_0_24>`.
es_es: ¡Nos complace anunciar el lanzamiento de scikit-learn 0.24! Se han añadido muchas correcciones de errores y mejoras, así como algunas nuevas características clave. A continuación detallamos algunas de las principales características de esta versión. **Para una lista exhaustiva de todos los cambios**, por favor consulta las :ref:`notas de publicación <changes_0_24>`.

source: To install the latest version (with pip)::
es_es: Para instalar la última versión (con pip)::

source: or with conda::
es_es: o con conda::

source: Successive Halving estimators for tuning hyper-parameters
es_es: Estimadores Sucesivos de Reducción a la Mitad para ajustar los hiperparámetros

source: Successive Halving, a state of the art method, is now available to explore the space of the parameters and identify their best combination. :class:`~sklearn.model_selection.HalvingGridSearchCV` and :class:`~sklearn.model_selection.HalvingRandomSearchCV` can be used as drop-in replacement for :class:`~sklearn.model_selection.GridSearchCV` and :class:`~sklearn.model_selection.RandomizedSearchCV`. Successive Halving is an iterative selection process illustrated in the figure below. The first iteration is run with a small amount of resources, where the resource typically corresponds to the number of training samples, but can also be an arbitrary integer parameter such as `n_estimators` in a random forest. Only a subset of the parameter candidates are selected for the next iteration, which will be run with an increasing amount of allocated resources. Only a subset of candidates will last until the end of the iteration process, and the best parameter candidate is the one that has the highest score on the last iteration.
es_es: El método Successive Halving (división sucesiva a la mitad), un método de vanguardia, está ahora disponible para explorar el espacio de los parámetros e identificar su mejor combinación. :class:`~sklearn.model_selection.HalvingGridSearchCV` y :class:`~sklearn.model_selection.HalvingRandomSearchCV` pueden utilizarse como sustitutos de :class:`~sklearn.model_selection.GridSearchCV` y :class:`~sklearn.model_selection.RandomizedSearchCV`. La reducción sucesiva a la mitad es un proceso de selección iterativo que se ilustra en la siguiente figura. La primera iteración se ejecuta con una pequeña cantidad de recursos, donde el recurso suele corresponder al número de muestras de entrenamiento, pero también puede ser un parámetro entero arbitrario como `n_estimators` en un bosque aleatorio. Sólo un subconjunto de los parámetros candidatos se selecciona para la siguiente iteración, que se ejecutará con una cantidad creciente de recursos asignados. Sólo un subconjunto de candidatos durará hasta el final del proceso de iteración, y el mejor candidato a parámetro es el que tiene la mayor puntuación en la última iteración.

source: Read more in the :ref:`User Guide <successive_halving_user_guide>` (note: the Successive Halving estimators are still :term:`experimental <experimental>`).
es_es: Lea más en el :ref:`Manual de Usuario <successive_halving_user_guide>` (Nota: los estimadores de Successive Halving todavía son :term:`experimentales <experimental>`).

source: The memory footprint of :class:`ensemble.HistGradientBoostingRegressor` and :class:`ensemble.HistGradientBoostingClassifier` has been significantly improved during calls to `fit`. In addition, histogram initialization is now done in parallel which results in slight speed improvements. See more in the `Benchmark page <https://scikit-learn.org/scikit-learn-benchmarks/>`_.
es_es: La huella de memoria de :class:`ensemble.HistGradientBoostingRegressor` y :class:`ensemble.HistGradientBoostingClassifier` se ha mejorado significativamente durante las invocaciones a `fit`. Además, la inicialización del histograma se realiza ahora en paralelo, lo que supone una ligera mejora de la velocidad. Puedes ver más en la `página de Rendimiento (Benchmark) <https://scikit-learn.org/scikit-learn-benchmarks/>`_.

source: New self-training meta-estimator
es_es: Nuevo metaestimador de autoentrenamiento

source: A new self-training implementation, based on `Yarowski's algorithm <https://doi.org/10.3115/981658.981684>`_ can now be used with any classifier that implements :term:`predict_proba`. The sub-classifier will behave as a semi-supervised classifier, allowing it to learn from unlabeled data. Read more in the :ref:`User guide <self_training>`.
es_es: Una nueva implementación de autoentrenamiento, basada en el `algoritmo de Yarowski <https://doi.org/10.3115/981658.981684>`_ puede ahora utilizarse con cualquier clasificador que implemente :term:`predict_proba`. El subclasificador se comportará como un clasificador semisupervisado, permitiéndole aprender de datos no etiquetados. Lee más en el :ref:`Manual de Usuario <self_training>`.

source: New SequentialFeatureSelector transformer
es_es: Nuevo transformador SequentialFeatureSelector

source: A new iterative transformer to select features is available: :class:`~sklearn.feature_selection.SequentialFeatureSelector`. Sequential Feature Selection can add features one at a time (forward selection) or remove features from the list of the available features (backward selection), based on a cross-validated score maximization. See the :ref:`User Guide <sequential_feature_selection>`.
es_es: Un nuevo transformador iterativo para seleccionar características está disponible: :class:`~sklearn.feature_selection.SequentialFeatureSelector`. La Selección Secuencial de Características puede añadir características de una en una (selección hacia delante) o eliminar características de la lista de características disponibles (selección hacia atrás), basándose en una maximización de la puntuación de validación cruzada. Consulta el :ref:`Manual de Usuario <sequential_feature_selection>`.

source: New PolynomialCountSketch kernel approximation function
es_es: Nueva función de aproximación kernel PolynomialCountSketch

source: The new :class:`~sklearn.kernel_approximation.PolynomialCountSketch` approximates a polynomial expansion of a feature space when used with linear models, but uses much less memory than :class:`~sklearn.preprocessing.PolynomialFeatures`.
es_es: La nueva :class:`~sklearn.kernel_approximation.PolynomialCountSketch` aproxima una expansión polinomial de un espacio de características cuando se utiliza con modelos lineales, pero utiliza mucha menos memoria que :class:`~sklearn.preprocessing.PolynomialFeatures`.

source: For comparison, here is the score of a linear baseline for the same data:
es_es: A modo de comparación, aquí está la puntuación de una línea de base lineal para los mismos datos:

source: Individual Conditional Expectation plots
es_es: Gráficos de Expectativas Condicionales Individuales

source: A new kind of partial dependence plot is available: the Individual Conditional Expectation (ICE) plot. ICE plots visualize the dependence of the prediction on a feature for each sample separately, with one line per sample. See the :ref:`User Guide <individual_conditional>`
es_es: Existe un nuevo tipo de gráfico de dependencia parcial: el gráfico de Expectativa Condicional Individual (ICE). Los gráficos ICE visualizan la dependencia de la predicción de una característica para cada muestra por separado, con una línea por muestra. Consulta el :ref:`Manual de Usuario <individual_conditional>`

source: New Poisson splitting criterion for DecisionTreeRegressor
es_es: Nuevo criterio de división de Poisson para DecisionTreeRegressor

source: The integration of Poisson regression estimation continues from version 0.23. :class:`~sklearn.tree.DecisionTreeRegressor` now supports a new `'poisson'` splitting criterion. Setting `criterion="poisson"` might be a good choice if your target is a count or a frequency.
es_es: La integración de la estimación de la regresión de Poisson continúa desde la versión 0.23. :class:`~sklearn.tree.DecisionTreeRegressor` ahora soporta un nuevo criterio de división `'poisson'`. Establecer `criterio="poisson"` puede ser una buena opción si tu objetivo es un recuento o una frecuencia.

source: New documentation improvements
es_es: Nuevas mejoras en la documentación

source: New examples and documentation pages have been added, in a continuous effort to improve the understanding of machine learning practices:
es_es: Se han añadido nuevos ejemplos y páginas de documentación, en un esfuerzo continuo por mejorar la comprensión de las prácticas de aprendizaje automático:

source: a new section about :ref:`common pitfalls and recommended practices <common_pitfalls>`,
es_es: una nueva sección sobre :ref:`errores comunes y prácticas recomendadas <common_pitfalls>`,

source: an example illustrating how to :ref:`statistically compare the performance of models <sphx_glr_auto_examples_model_selection_plot_grid_search_stats.py>` evaluated using :class:`~sklearn.model_selection.GridSearchCV`,
es_es: un ejemplo que ilustra cómo :ref:`comparar estadísticamente el rendimiento de los modelos <sphx_glr_auto_examples_model_selection_plot_grid_search_stats.py>` evaluados utilizando :class:`~sklearn.model_selection.GridSearchCV`,

source: an example on how to :ref:`interpret coefficients of linear models <sphx_glr_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py>`,
es_es: un ejemplo de cómo :ref:`interpretar los coeficientes de los modelos lineales <sphx_glr_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py>`,

source: an :ref:`example <sphx_glr_auto_examples_cross_decomposition_plot_pcr_vs_pls.py>` comparing Principal Component Regression and Partial Least Squares.
es_es: un :ref: `ejemplo <sphx_glr_auto_examples_cross_decomposition_plot_pcr_vs_pls.py>` comparando la Regresión de Componentes Principales y Mínimos Cuadrados Parciales.

source: **Total running time of the script:** ( 0 minutes 17.091 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 17.091 segundos)

source: :download:`Download Python source code: plot_release_highlights_0_24_0.py <plot_release_highlights_0_24_0.py>`
es_es: :download:`Descargar el código fuente de Python: plot_release_highlights_0_24_0.py <plot_release_highlights_0_24_0.py>`

source: :download:`Download Jupyter notebook: plot_release_highlights_0_24_0.ipynb <plot_release_highlights_0_24_0.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_release_highlights_0_24_0.ipynb <plot_release_highlights_0_24_0.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
