Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/release_highlights/plot_release_highlights_0_23_0.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_release_highlights_plot_release_highlights_0_23_0.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_release_highlights_plot_release_highlights_0_23_0.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Release Highlights for scikit-learn 0.23
es_es: Aspectos Destacados de scikit-learn 0.23

source: We are pleased to announce the release of scikit-learn 0.23! Many bug fixes and improvements were added, as well as some new key features. We detail below a few of the major features of this release. **For an exhaustive list of all the changes**, please refer to the :ref:`release notes <changes_0_23>`.
es_es: ¡Nos complace anunciar el lanzamiento de scikit-learn 0.23! Se han añadido muchas correcciones de errores y mejoras, así como algunas nuevas características clave. A continuación detallamos algunas de las principales características de esta versión. **Para una lista exhaustiva de todos los cambios**, por favor consulta las :ref:`notas de publicación <changes_0_23>`.

source: To install the latest version (with pip)::
es_es: Para instalar la última versión (con pip)::

source: or with conda::
es_es: o con conda::

source: Generalized Linear Models, and Poisson loss for gradient boosting
es_es: Modelos Lineales Generalizados y pérdida de Poisson para la potenciación del gradiente

source: Long-awaited Generalized Linear Models with non-normal loss functions are now available. In particular, three new regressors were implemented: :class:`~sklearn.linear_model.PoissonRegressor`, :class:`~sklearn.linear_model.GammaRegressor`, and :class:`~sklearn.linear_model.TweedieRegressor`. The Poisson regressor can be used to model positive integer counts, or relative frequencies. Read more in the :ref:`User Guide <Generalized_linear_regression>`. Additionally, :class:`~sklearn.ensemble.HistGradientBoostingRegressor` supports a new 'poisson' loss as well.
es_es: Ya están disponibles los tan esperados Modelos Lineales Generalizados con funciones de pérdida no normales. En particular, se han implementado tres nuevos regresores: :class:`~sklearn.linear_model.PoissonRegressor`, :class:`~sklearn.linear_model.GammaRegressor`, y :class:`~sklearn.linear_model.TweedieRegressor`. El regresor de Poisson puede utilizarse para modelar recuentos enteros positivos o frecuencias relativas. Lea más en el :ref:`Manual de Usuario <Generalized_linear_regression>`. Además, :class:`~sklearn.ensemble.HistGradientBoostingRegressor` también admite una nueva pérdida 'poisson'.

source: Rich visual representation of estimators
es_es: Representación visual de los estimadores

source: Estimators can now be visualized in notebooks by enabling the `display='diagram'` option. This is particularly useful to summarise the structure of pipelines and other composite estimators, with interactivity to provide detail. Click on the example image below to expand Pipeline elements. See :ref:`visualizing_composite_estimators` for how you can use this feature.
es_es: Los estimadores ahora pueden visualizarse en los cuadernos activando la opción `display='diagram'`. Esto es especialmente útil para resumir la estructura de los pipelines y otros estimadores compuestos, con interactividad para proporcionar detalles. Haz clic en la imagen de ejemplo que aparece a continuación para ampliar los elementos del pipeline. Consulta :ref:`visualizing_composite_estimators` para saber cómo puedes utilizar esta función.

source: Scalability and stability improvements to KMeans
es_es: Mejoras en la escalabilidad y estabilidad de KMeans

source: The :class:`~sklearn.cluster.KMeans` estimator was entirely re-worked, and it is now significantly faster and more stable. In addition, the Elkan algorithm is now compatible with sparse matrices. The estimator uses OpenMP based parallelism instead of relying on joblib, so the `n_jobs` parameter has no effect anymore. For more details on how to control the number of threads, please refer to our :ref:`parallelism` notes.
es_es: El estimador :class:`~sklearn.cluster.KMeans` ha sido completamente reelaborado, y ahora es significativamente más rápido y estable. Además, el algoritmo de Elkan ahora es compatible con matrices dispersas. El estimador utiliza el paralelismo basado en OpenMP en lugar de depender de joblib, por lo que el parámetro `n_jobs` ya no tiene efecto. Para más detalles sobre cómo controlar el número de hilos (threads), consulta nuestras notas sobre :ref:`parallelism`.

source: Improvements to the histogram-based Gradient Boosting estimators
es_es: Mejoras en los estimadores de Potenciación del Gradiente basados en histogramas

source: Various improvements were made to :class:`~sklearn.ensemble.HistGradientBoostingClassifier` and :class:`~sklearn.ensemble.HistGradientBoostingRegressor`. On top of the Poisson loss mentionned above, these estimators now support :ref:`sample weights <sw_hgbdt>`. Also, an automatic early-stopping criterion was added: early-stopping is enabled by default when the number of samples exceeds 10k. Finally, users can now define :ref:`monotonic constraints <monotonic_cst_gbdt>` to constrain the predictions based on the variations of specific features. In the following example, we construct a target that is generally positively correlated with the first feature, with some noise. Applying monotoinc constraints allows the prediction to capture the global effect of the first feature, instead of fitting the noise.
es_es: Se han realizado varias mejoras en :class:`~sklearn.ensemble.HistGradientBoostingClassifier` y :class:`~sklearn.ensemble.HistGradientBoostingRegressor`. Además de la pérdida de Poisson mencionada anteriormente, estos estimadores ahora admiten :ref:`ponderaciones de muestra <sw_hgbdt>`. También se ha añadido un criterio de parada temprana automática: la parada temprana se activa por defecto cuando el número de muestras supera los 10k. Por último, los usuarios ahora pueden definir :ref:`restricciones monótonas <monotonic_cst_gbdt>` para restringir las predicciones en función de las variaciones de características específicas. En el siguiente ejemplo, construimos un objetivo que generalmente está correlacionado positivamente con la primera característica, con algo de ruido. La aplicación de las restricciones monótonas permite que la predicción capture el efecto global de la primera característica, en lugar de ajustar el ruido.

source: Sample-weight support for Lasso and ElasticNet
es_es: Admisión de ponderaciones de muestras para Lasso y ElasticNet

source: The two linear regressors :class:`~sklearn.linear_model.Lasso` and :class:`~sklearn.linear_model.ElasticNet` now support sample weights.
es_es: Los dos regresores lineales :class:`~sklearn.linear_model.Lasso` y :class:`~sklearn.linear_model.ElasticNet` ahora admiten ponderaciones de muestra.

source: **Total running time of the script:** ( 0 minutes 1.663 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.663 segundos)

source: :download:`Download Python source code: plot_release_highlights_0_23_0.py <plot_release_highlights_0_23_0.py>`
es_es: :download:`Descargar el código fuente de Python: plot_release_highlights_0_23_0.py <plot_release_highlights_0_23_0.py>`

source: :download:`Download Jupyter notebook: plot_release_highlights_0_23_0.ipynb <plot_release_highlights_0_23_0.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_release_highlights_0_23_0.ipynb <plot_release_highlights_0_23_0.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
