Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/impute/plot_missing_values.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_impute_plot_missing_values.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_impute_plot_missing_values.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Imputing missing values before building an estimator
es_es: Imputar valores faltantes antes de crear un estimador

source: Missing values can be replaced by the mean, the median or the most frequent value using the basic :class:`~sklearn.impute.SimpleImputer`.
es_es: Los valores faltantes pueden ser reemplazados por la media, la mediana o el valor más frecuente usando el básico :class:`~sklearn.impute.SimpleImputer`.

source: In this example we will investigate different imputation techniques:
es_es: En este ejemplo investigaremos diferentes técnicas de imputación:

source: imputation by the constant value 0
es_es: imputación por el valor constante 0

source: imputation by the mean value of each feature combined with a missing-ness indicator auxiliary variable
es_es: imputación por el valor medio de cada característica combinada con una variable auxiliar indicadora de ausencia

source: k nearest neighbor imputation
es_es: k imputación del vecino más cercano

source: iterative imputation
es_es: imputación iterativa

source: We will use two datasets: Diabetes dataset which consists of 10 feature variables collected from diabetes patients with an aim to predict disease progression and California Housing dataset for which the target is the median house value for California districts.
es_es: Utilizaremos dos conjuntos de datos: el conjunto de datos de diabetes que consiste en 10 variables de características recolectadas de pacientes con diabetes con el objetivo de predecir la progresión de la enfermedad y el conjunto de datos de California Housing para el cual el objetivo es la mediana del valor de la casa de los distritos de California.

source: As neither of these datasets have missing values, we will remove some values to create new versions with artificially missing data. The performance of :class:`~sklearn.ensemble.RandomForestRegressor` on the full original dataset is then compared the performance on the altered datasets with the artificially missing values imputed using different techniques.
es_es: Como ninguno de estos conjuntos de datos tiene valores faltantes, eliminaremos algunos valores para crear nuevas versiones con datos artificialmente faltantes. El rendimiento de :class:`~sklearn.ensemble.RandomForestRegressor` en el conjunto de datos original se compara entonces el rendimiento en los conjuntos de datos alterados con los valores artificialmente faltantes imputados utilizando diferentes técnicas.

source: Download the data and make missing values sets
es_es: Descargar los datos y hacer conjuntos de valores faltantes

source: First we download the two datasets. Diabetes dataset is shipped with scikit-learn. It has 442 entries, each with 10 features. California Housing dataset is much larger with 20640 entries and 8 features. It needs to be downloaded. We will only use the first 400 entries for the sake of speeding up the calculations but feel free to use the whole dataset.
es_es: Primero descargamos los dos conjuntos de datos. El conjunto de datos de diabetes se envía con scikit-learn. Tiene 442 entradas, cada una con 10 características. El conjunto de datos de California Housing es mucho más grande con 20640 entradas y 8 características. Es necesario descargarlo. Sólo utilizaremos las primeras 400 entradas con el fin de acelerar los cálculos, pero no dudes en utilizar todo el conjunto de datos.

source: Impute the missing data and score
es_es: Imputar los datos que faltan y la puntuación

source: Now we will write a function which will score the results on the differently imputed data. Let's look at each imputer separately:
es_es: Ahora vamos a escribir una función que marcará los resultados en los datos diferentes imputados. Veamos cada imputador por separado:

source: Missing information
es_es: Información faltante

source: In addition to imputing the missing values, the imputers have an `add_indicator` parameter that marks the values that were missing, which might carry some information.
es_es: Además de imputar los valores que faltan, los imputadores tienen un parámetro `add_indicator` que marca los valores que faltan, que pueden llevar alguna información.

source: Estimate the score
es_es: Estimar la puntuación

source: First, we want to estimate the score on the original data:
es_es: En primer lugar, queremos estimar la puntuación en los datos originales:

source: Replace missing values by 0
es_es: Reemplaza valores faltantes por 0

source: Now we will estimate the score on the data where the missing values are replaced by 0:
es_es: Ahora calcularemos la puntuación en los datos donde los valores faltantes son reemplazados por 0:

source: kNN-imputation of the missing values
es_es: Imputación kNN de los valores faltantes

source: :class:`~sklearn.impute.KNNImputer` imputes missing values using the weighted or unweighted mean of the desired number of nearest neighbors.
es_es: :class:`~sklearn.impute.KNNImputer` imputa valores faltantes usando la media ponderada o no ponderada del número deseado de vecinos más cercanos.

source: Impute missing values with mean
es_es: Imputa valores faltantes con media

source: Iterative imputation of the missing values
es_es: Imputación iterativa de los valores faltantes

source: Another option is the :class:`~sklearn.impute.IterativeImputer`. This uses round-robin linear regression, modeling each feature with missing values as a function of other features, in turn. The version implemented assumes Gaussian (output) variables. If your features are obviously non-normal, consider transforming them to look more normal to potentially improve performance.
es_es: Otra opción es la :class:`~sklearn.impute.IterativeImputer`. Esta utiliza la regresión lineal round-robin, modelando cada característica con valores faltantes como una función de otras características, a su vez. La versión implementada asume variables gaussianas (de salida). Si tus características son obviamente no normales, considera la posibilidad de transformarlas para que parezcan más normales para mejorar potencialmente el rendimiento.

source: Plot the results
es_es: Traza los resultados

source: Finally we are going to visualize the score:
es_es: Finalmente vamos a visualizar la puntuación:

source: **Total running time of the script:** ( 0 minutes 27.390 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 27.390 segundos)

source: :download:`Download Python source code: plot_missing_values.py <plot_missing_values.py>`
es_es: :download:`Descarga el código fuente de Python: plot_missing_values.py <plot_missing_values.py>`

source: :download:`Download Jupyter notebook: plot_missing_values.ipynb <plot_missing_values.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_missing_values.ipynb <plot_missing_values.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
