Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/impute/plot_iterative_imputer_variants_comparison.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_impute_plot_iterative_imputer_variants_comparison.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_impute_plot_iterative_imputer_variants_comparison.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Imputing missing values with variants of IterativeImputer
es_es: Imputar valores faltantes con variantes de IterativeImputer

source: The :class:`~impute.IterativeImputer` class is very flexible - it can be used with a variety of estimators to do round-robin regression, treating every variable as an output in turn.
es_es: El :class:`~impute.IterativeImputer` es muy flexible - puede ser usada con una variedad de estimadores para hacer regresión de round-robin, tratando cada variable como una salida por turno.

source: In this example we compare some estimators for the purpose of missing feature imputation with :class:`~impute.IterativeImputer`:
es_es: En este ejemplo comparamos algunos estimadores para el propósito de falta de imputación de características con :class:`~impute.IterativeImputer`:

source: :class:`~linear_model.BayesianRidge`: regularized linear regression
es_es: :class:`~linear_model.BayesianRidge`: regresión lineal regularizada

source: :class:`~tree.DecisionTreeRegressor`: non-linear regression
es_es: :class:`~tree.DecisionTreeRegressor`: regresión no lineal

source: :class:`~ensemble.ExtraTreesRegressor`: similar to missForest in R
es_es: :class:`~ensemble.ExtraesRegressor`: similar a missForest en R

source: :class:`~neighbors.KNeighborsRegressor`: comparable to other KNN imputation approaches
es_es: :class:`~neighbors.KNeighborsRegressor`: comparable a otros enfoques de imputación de KNN

source: Of particular interest is the ability of :class:`~impute.IterativeImputer` to mimic the behavior of missForest, a popular imputation package for R. In this example, we have chosen to use :class:`~ensemble.ExtraTreesRegressor` instead of :class:`~ensemble.RandomForestRegressor` (as in missForest) due to its increased speed.
es_es: De especial interés es la habilidad de :class:`~impute.IterativeImputer` para imitar el comportamiento de missForest, un popular paquete de imputación para R. En este ejemplo, hemos elegido usar :class:`~ensemble.ExtraTreesRegressor` en lugar de :class:`~ensemble.RandomForestRegressor` (como en missForest) debido a su velocidad aumentada.

source: Note that :class:`~neighbors.KNeighborsRegressor` is different from KNN imputation, which learns from samples with missing values by using a distance metric that accounts for missing values, rather than imputing them.
es_es: Ten en cuenta que :class:`~neighbors.KNeighborsRegressor` es diferente de la imputación de KNN, que aprende de muestras con valores faltantes usando una métrica a distancia que explica los valores faltantes, en lugar de imputarlos.

source: The goal is to compare different estimators to see which one is best for the :class:`~impute.IterativeImputer` when using a :class:`~linear_model.BayesianRidge` estimator on the California housing dataset with a single value randomly removed from each row.
es_es: El objetivo es comparar diferentes estimadores para ver cuál es mejor para el :class:`~impute.IterativeImputer` cuando se usa un estimador :class:`~linear_model.BayesianRidge` en el conjunto de datos de alojamiento de California con un único valor al azar eliminado de cada fila.

source: For this particular pattern of missing values we see that :class:`~ensemble.ExtraTreesRegressor` and :class:`~linear_model.BayesianRidge` give the best results.
es_es: Para este patrón particular de valores faltantes vemos que :class:`~ensemble.ExtraTreesRegressor` y :class:`~linear_model.BayesianRidge` dan los mejores resultados.

source: **Total running time of the script:** ( 0 minutes 19.241 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 19.241 segundos)

source: :download:`Download Python source code: plot_iterative_imputer_variants_comparison.py <plot_iterative_imputer_variants_comparison.py>`
es_es: :download:`Descargar código fuente de Python: plot_iterative_imputer_variants_comparison.py <plot_iterative_imputer_variants_comparison.py>`

source: :download:`Download Jupyter notebook: plot_iterative_imputer_variants_comparison.ipynb <plot_iterative_imputer_variants_comparison.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_iterative_imputer_variants_comparison.ipynb <plot_iterative_imputer_variants_comparison.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
