Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/biclustering.po
Languages: es_es

source: Biclustering can be performed with the module :mod:`sklearn.cluster.bicluster`. Biclustering algorithms simultaneously cluster rows and columns of a data matrix. These clusters of rows and columns are known as biclusters. Each determines a submatrix of the original data matrix with some desired properties.
es_es: El biclustering puede realizarse con el módulo :mod:`sklearn.cluster.bicluster`. Los algoritmos de biclustering agrupan simultáneamente filas y columnas de una matriz de datos. Estos clusters de filas y columnas se conocen como biclusters. Cada uno determina una submatriz de la matriz de datos original con algunas propiedades deseadas.

source: For instance, given a matrix of shape ``(10, 10)``, one possible bicluster with three rows and two columns induces a submatrix of shape ``(3, 2)``::
es_es: Por ejemplo, dada una matriz de forma ``(10, 10)``, un bicluster posible con tres filas y dos columnas induce un submatriz de la forma ``(3, 2)``::

source: For visualization purposes, given a bicluster, the rows and columns of the data matrix may be rearranged to make the bicluster contiguous.
es_es: Para fines de visualización, dado un bicluster, las filas y columnas de la matriz de datos pueden ser reorganizadas para hacer el bicluster contiguo.

source: Algorithms differ in how they define biclusters. Some of the common types include:
es_es: Los algoritmos difieren en cómo se definen los biclusters. Algunos de los tipos comunes incluyen:

source: constant values, constant rows, or constant columns
es_es: valores constantes, filas constantes o columnas constantes

source: unusually high or low values
es_es: valores inusualmente altos o bajos

source: submatrices with low variance
es_es: submatrices con baja varianza

source: correlated rows or columns
es_es: filas o columnas correlacionadas

source: Algorithms also differ in how rows and columns may be assigned to biclusters, which leads to different bicluster structures. Block diagonal or checkerboard structures occur when rows and columns are divided into partitions.
es_es: Los algoritmos también difieren en la forma de asignar filas y columnas a los biclusters, lo que da lugar a diferentes estructuras de bicluster. Las estructuras de bloque diagonal o de tablero de ajedrez se producen cuando las filas y las columnas se dividen en particiones.

source: If each row and each column belongs to exactly one bicluster, then rearranging the rows and columns of the data matrix reveals the biclusters on the diagonal. Here is an example of this structure where biclusters have higher average values than the other rows and columns:
es_es: Si cada fila y cada columna pertenecen exactamente a un biclúster, el reordenamiento de las filas y columnas de la matriz de datos revela los biclústeres en la diagonal. He aquí un ejemplo de esta estructura en la que los biclusters tienen valores medios más altos que las demás filas y columnas:

source: An example of biclusters formed by partitioning rows and columns.
es_es: Un ejemplo de biclusters formado por particionado de filas y columnas.

source: In the checkerboard case, each row belongs to all column clusters, and each column belongs to all row clusters. Here is an example of this structure where the variance of the values within each bicluster is small:
es_es: En el caso del tablero de ajedrez, cada fila pertenece a todos los grupos de columnas y cada columna pertenece a todos los grupos de filas. He aquí un ejemplo de esta estructura en la que la varianza de los valores dentro de cada bicluster es pequeña:

source: An example of checkerboard biclusters.
es_es: Un ejemplo de biclusters de tablero de ajedrez.

source: After fitting a model, row and column cluster membership can be found in the ``rows_`` and ``columns_`` attributes. ``rows_[i]`` is a binary vector with nonzero entries corresponding to rows that belong to bicluster ``i``. Similarly, ``columns_[i]`` indicates which columns belong to bicluster ``i``.
es_es: Después de ajustar un modelo, la pertenencia a los clusters de filas y columnas se puede encontrar en los atributos ``rows_`` y ``columns_``. El atributo ``rows_[i]`` es un vector binario con entradas no nulas que corresponden a las filas que pertenecen al bicluster ``i``. Del mismo modo, ``columns_[i]`` indica qué columnas pertenecen al bicluster ``i``.

source: Some models also have ``row_labels_`` and ``column_labels_`` attributes. These models partition the rows and columns, such as in the block diagonal and checkerboard bicluster structures.
es_es: Algunos modelos también tienen atributos ``row_labels_`` y ``column_labels_``. Estos modelos particionan las filas y columnas, como en las estructuras de bicluster del bloque diagonal y del tablero de ajedrez.

source: Biclustering has many other names in different fields including co-clustering, two-mode clustering, two-way clustering, block clustering, coupled two-way clustering, etc. The names of some algorithms, such as the Spectral Co-Clustering algorithm, reflect these alternate names.
es_es: El biclustering tiene muchos otros nombres en diferentes campos, como co-clustering, clustering de dos modos, clustering de dos vías, clustering de bloques, clustering de dos vías acoplado, etc. Los nombres de algunos algoritmos, como el algoritmo de Co-Clustering Espectral, reflejan estos nombres alternativos.

source: Spectral Co-Clustering
es_es: Co-Clustering espectral

source: The :class:`SpectralCoclustering` algorithm finds biclusters with values higher than those in the corresponding other rows and columns. Each row and each column belongs to exactly one bicluster, so rearranging the rows and columns to make partitions contiguous reveals these high values along the diagonal:
es_es: El algoritmo :class:`SpectralCoclustering` encuentra biclusters con valores más altos que los de las otras filas y columnas correspondientes. Cada fila y cada columna pertenecen exactamente a un biclúster, por lo que la reorganización de las filas y columnas para que las particiones sean contiguas revela estos valores altos a lo largo de la diagonal:

source: The algorithm treats the input data matrix as a bipartite graph: the rows and columns of the matrix correspond to the two sets of vertices, and each entry corresponds to an edge between a row and a column. The algorithm approximates the normalized cut of this graph to find heavy subgraphs.
es_es: El algoritmo trata la matriz de datos de entrada como un grafo bipartito: las filas y columnas de la matriz corresponden a los dos conjuntos de vértices, y cada entrada corresponde a una arista entre una fila y una columna. El algoritmo aproxima el corte normalizado de este grafo para encontrar subgrafos pesados.

source: Mathematical formulation
es_es: Formulación matemática

source: An approximate solution to the optimal normalized cut may be found via the generalized eigenvalue decomposition of the Laplacian of the graph. Usually this would mean working directly with the Laplacian matrix. If the original data matrix :math:`A` has shape :math:`m \times n`, the Laplacian matrix for the corresponding bipartite graph has shape :math:`(m + n) \times (m + n)`. However, in this case it is possible to work directly with :math:`A`, which is smaller and more efficient.
es_es: Una solución aproximada al corte óptimo normalizado puede encontrarse a través de la descomposición generalizada de valores propios del laplaciano del grafo. Normalmente, esto significaría trabajar directamente con la matriz laplaciana. Si la matriz de datos original :math:`A` tiene forma :math:`m \times n`, la matriz laplaciana del grafo bipartito correspondiente tiene forma :math:`(m + n) \times (m + n)`. Sin embargo, en este caso es posible trabajar directamente con :math:`A`, que es más pequeña y eficiente.

source: The input matrix :math:`A` is preprocessed as follows:
es_es: La matriz de entrada :math:`A` está preprocesada como sigue:

source: Where :math:`R` is the diagonal matrix with entry :math:`i` equal to :math:`\sum_{j} A_{ij}` and :math:`C` is the diagonal matrix with entry :math:`j` equal to :math:`\sum_{i} A_{ij}`.
es_es: Donde :math:`R` es la matriz diagonal con la entrada :math:`i` igual a :math:`\sum_{j} A_{ij}` y :math:`C` es la matriz diagonal con la entrada :math:`j` igual a :math:`\sum_{i} A_{ij}`.

source: The singular value decomposition, :math:`A_n = U \Sigma V^\top`, provides the partitions of the rows and columns of :math:`A`. A subset of the left singular vectors gives the row partitions, and a subset of the right singular vectors gives the column partitions.
es_es: La descomposición del valor singular, :math:`A_n = U \Sigma V^\top`, proporciona las particiones de las filas y columnas de :math:`A`. Un subconjunto de los vectores singulares de la izquierda da las particiones de las filas, y un subconjunto de los vectores singulares de la derecha da las particiones de las columnas.

source: The :math:`\ell = \lceil \log_2 k \rceil` singular vectors, starting from the second, provide the desired partitioning information. They are used to form the matrix :math:`Z`:
es_es: Los vectores singulares :math:`\ell = \lceil \log_2 k \rceil`, empezando por el segundo, proporcionan la información de partición deseada. Se utilizan para formar la matriz :math:`Z`:

source: where the columns of :math:`U` are :math:`u_2, \dots, u_{\ell + 1}`, and similarly for :math:`V`.
es_es: donde las columnas de :math:`U` son :math:`u_2, \dots, u_{\ell + 1}`, y similarmente para :math:`V`.

source: Then the rows of :math:`Z` are clustered using :ref:`k-means <k_means>`. The first ``n_rows`` labels provide the row partitioning, and the remaining ``n_columns`` labels provide the column partitioning.
es_es: A continuación, las filas de :math:`Z` se agrupan utilizando :ref:`k-means <k_means>`. Las primeras etiquetas ``n_rows`` proporcionan la partición de las filas, y las restantes etiquetas ``n_columns`` proporcionan la partición de las columnas.

source: :ref:`sphx_glr_auto_examples_bicluster_plot_spectral_coclustering.py`: A simple example showing how to generate a data matrix with biclusters and apply this method to it.
es_es: :ref:`sphx_glr_auto_examples_bicluster_plot_spectral_coclustering.py`: Un ejemplo simple que muestra cómo generar una matriz de datos con biclusters y aplicar este método a ella.

source: :ref:`sphx_glr_auto_examples_bicluster_plot_bicluster_newsgroups.py`: An example of finding biclusters in the twenty newsgroup dataset.
es_es: :ref:`sphx_glr_auto_examples_bicluster_plot_bicluster_newsgroups.py`: Un ejemplo de búsqueda de biclusters en el conjunto de datos de veinte grupos de comunicación.

source: Spectral Biclustering
es_es: Biclustering espectral

source: The :class:`SpectralBiclustering` algorithm assumes that the input data matrix has a hidden checkerboard structure. The rows and columns of a matrix with this structure may be partitioned so that the entries of any bicluster in the Cartesian product of row clusters and column clusters are approximately constant. For instance, if there are two row partitions and three column partitions, each row will belong to three biclusters, and each column will belong to two biclusters.
es_es: El algoritmo :class:`SpectralBiclustering` supone que la matriz de datos de entrada tiene una estructura de tablero de ajedrez oculto. Las filas y las columnas de una matriz con esta estructura pueden dividirse de forma que las entradas de cualquier bicluster en el producto cartesiano de los clusters de filas y los clusters de columnas sean aproximadamente constantes. Por ejemplo, si hay dos particiones de filas y tres de columnas, cada fila pertenecerá a tres biclústeres y cada columna pertenecerá a dos biclústeres.

source: The algorithm partitions the rows and columns of a matrix so that a corresponding blockwise-constant checkerboard matrix provides a good approximation to the original matrix.
es_es: El algoritmo divide las filas y las columnas de una matriz de modo que la correspondiente matriz en forma de tablero de ajedrez con constantes de bloque proporciona una buena aproximación a la matriz original.

source: The input matrix :math:`A` is first normalized to make the checkerboard pattern more obvious. There are three possible methods:
es_es: La matriz de entrada :math:`A` se normaliza primero para que el patrón de tablero de ajedrez sea más evidente. Hay tres métodos posibles:

source: *Independent row and column normalization*, as in Spectral Co-Clustering. This method makes the rows sum to a constant and the columns sum to a different constant.
es_es: *Normalización independiente de filas y columnas*, como en el Co-Clustering Espectral. Este método hace que las filas sumen una constante y las columnas sumen una constante diferente.

source: **Bistochastization**: repeated row and column normalization until convergence. This method makes both rows and columns sum to the same constant.
es_es: **Bistocastizacion**: normalización repetida de filas y columnas hasta la convergencia. Este método hace que tanto las filas como las columnas sumen la misma constante.

source: **Log normalization**: the log of the data matrix is computed: :math:`L = \log A`. Then the column mean :math:`\overline{L_{i \cdot}}`, row mean :math:`\overline{L_{\cdot j}}`, and overall mean :math:`\overline{L_{\cdot \cdot}}` of :math:`L` are computed. The final matrix is computed according to the formula
es_es: **Normalización logarítmica**: se calcula el logaritmo de la matriz de datos: :math:`L = \log A`. A continuación, se calcula la media de las columnas :math:`overline{L_{i \cdot}}, la media de las filas :math:`\overline{L_{cdot j}}, y la media global :math:`\overline{L_{cdot \cdot}} de :math:`L`. La matriz final se calcula según la fórmula

source: After normalizing, the first few singular vectors are computed, just as in the Spectral Co-Clustering algorithm.
es_es: Después de la normalización, se calculan los primeros vectores singulares, al igual que en el algoritmo de coagrupación espectral.

source: If log normalization was used, all the singular vectors are meaningful. However, if independent normalization or bistochastization were used, the first singular vectors, :math:`u_1` and :math:`v_1`. are discarded. From now on, the "first" singular vectors refers to :math:`u_2 \dots u_{p+1}` and :math:`v_2 \dots v_{p+1}` except in the case of log normalization.
es_es: Si se utilizó la normalización logarítmica, todos los vectores singulares son significativos. Sin embargo, si se utilizó la normalización independiente o la bistocastizacion, los primeros vectores singulares, :math:`u_1` y :math:`v_1`. se descartan. A partir de ahora, los "primeros" vectores singulares se refieren a :math:`u_2 \dots u_{p+1}` y :math:`v_2 \dots v_{p+1}` excepto en el caso de la normalización logarítmica.

source: Given these singular vectors, they are ranked according to which can be best approximated by a piecewise-constant vector. The approximations for each vector are found using one-dimensional k-means and scored using the Euclidean distance. Some subset of the best left and right singular vector are selected. Next, the data is projected to this best subset of singular vectors and clustered.
es_es: Dados estos vectores singulares, se clasifican en función de cuál de ellos puede ser mejor aproximado por un vector a trozos. Las aproximaciones de cada vector se encuentran utilizando k-means unidimensional y se califican utilizando la distancia euclidiana. Se selecciona un subconjunto del mejor vector singular izquierdo y derecho. A continuación, los datos se proyectan a este mejor subconjunto de vectores singulares y se agrupan.

source: For instance, if :math:`p` singular vectors were calculated, the :math:`q` best are found as described, where :math:`q<p`. Let :math:`U` be the matrix with columns the :math:`q` best left singular vectors, and similarly :math:`V` for the right. To partition the rows, the rows of :math:`A` are projected to a :math:`q` dimensional space: :math:`A * V`. Treating the :math:`m` rows of this :math:`m \times q` matrix as samples and clustering using k-means yields the row labels. Similarly, projecting the columns to :math:`A^{\top} * U` and clustering this :math:`n \times q` matrix yields the column labels.
es_es: Por ejemplo, si se calcularon los vectores singulares :math:`p`, se encuentran los mejores :math:`q` como se ha descrito, donde :math:`q<p`. Sea :math:`U` la matriz con las columnas de los vectores singulares :math:`q` mejores de la izquierda, y de forma similar :math:`V` para la derecha. Para dividir las filas, las filas de :math:`A` se proyectan a un espacio dimensional :math:`q`: :math:`A * V`. Tratando las filas :math:`m` de esta matriz :math:`m \times q` como muestras y agrupando mediante k-means se obtienen las etiquetas de las filas. Del mismo modo, la proyección de las columnas a :math:`A^{\top} * U` y la agrupación de esta matriz :math:`n \times q` produce las etiquetas de las columnas.

source: :ref:`sphx_glr_auto_examples_bicluster_plot_spectral_biclustering.py`: a simple example showing how to generate a checkerboard matrix and bicluster it.
es_es: :ref:`sphx_glr_auto_examples_bicluster_plot_spectral_biclustering.py`: un ejemplo simple que muestra cómo generar una matriz de tablero de ajedrez y bicluster.

source: Biclustering evaluation
es_es: Evaluación de Biclustering

source: There are two ways of evaluating a biclustering result: internal and external. Internal measures, such as cluster stability, rely only on the data and the result themselves. Currently there are no internal bicluster measures in scikit-learn. External measures refer to an external source of information, such as the true solution. When working with real data the true solution is usually unknown, but biclustering artificial data may be useful for evaluating algorithms precisely because the true solution is known.
es_es: Hay dos formas de evaluar un resultado de biclustering: interna y externa. Las medidas internas, como la estabilidad de los clusters, se basan únicamente en los datos y en el propio resultado. Actualmente no hay medidas internas de bicluster en scikit-learn. Las medidas externas se refieren a una fuente de información externa, como la solución verdadera. Cuando se trabaja con datos reales, la solución verdadera suele ser desconocida, pero el biclustering de datos artificiales puede ser útil para evaluar algoritmos precisamente porque la solución verdadera es conocida.

source: To compare a set of found biclusters to the set of true biclusters, two similarity measures are needed: a similarity measure for individual biclusters, and a way to combine these individual similarities into an overall score.
es_es: Para comparar un conjunto de biclusters encontrados con el conjunto de biclusters verdaderos, se necesitan dos medidas de similitud: una medida de similitud para los biclusters individuales, y una forma de combinar estas similitudes individuales en una puntuación global.

source: To compare individual biclusters, several measures have been used. For now, only the Jaccard index is implemented:
es_es: Para comparar biclusters individuales, se han utilizado varias medidas. Por ahora, sólo se aplica el índice de Jaccard:

source: where :math:`A` and :math:`B` are biclusters, :math:`|A \cap B|` is the number of elements in their intersection. The Jaccard index achieves its minimum of 0 when the biclusters to not overlap at all and its maximum of 1 when they are identical.
es_es: donde :math:`A` y :math:`B` son biclusters, :math:`|A \cap B|` es el número de elementos en su intersección. El índice de la tarjeta de crédito alcanza su mínimo de 0 cuando los biclusters para no solaparse en absoluto y su máximo de 1 cuando son idénticos.

source: Several methods have been developed to compare two sets of biclusters. For now, only :func:`consensus_score` (Hochreiter et. al., 2010) is available:
es_es: Se han desarrollado varios métodos para comparar dos conjuntos de biclusters. Por ahora, solo :func:`consensus_score` (Hochreiter et. al., 2010) está disponible:

source: Compute bicluster similarities for pairs of biclusters, one in each set, using the Jaccard index or a similar measure.
es_es: Calcula las similitudes de bicluster para pares de biclusters, una en cada conjunto, utilizando el índice de Jaccard o una medida similar.

source: Assign biclusters from one set to another in a one-to-one fashion to maximize the sum of their similarities. This step is performed using the Hungarian algorithm.
es_es: Asigna biclusters de un conjunto a otro de una manera una-a otra para maximizar la suma de sus similitudes. Este paso se realiza utilizando el algoritmo húngaro.

source: The final sum of similarities is divided by the size of the larger set.
es_es: La suma final de similitudes se divide por el tamaño del conjunto más grande.

source: The minimum consensus score, 0, occurs when all pairs of biclusters are totally dissimilar. The maximum score, 1, occurs when both sets are identical.
es_es: La puntuación mínima de consenso, 0, se produce cuando todos los pares de biclusters son totalmente disímiles. La puntuación máxima, 1, se produce cuando ambos conjuntos son idénticos.
