Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/clustering.po
Languages: es_es

source: **Random (uniform) label assignments have a AMI score close to 0.0** for any value of ``n_clusters`` and ``n_samples`` (which is not the case for raw Mutual Information or the V-measure for instance).
es_es: **Las asignaciones de etiquetas aleatorias (uniformes) tienen una puntuación AMI cercana a 0,0** para cualquier valor de ``n_clusters`` y ``n_samples`` (lo que no ocurre con la Información Mutua bruta o la medida V, por ejemplo).

source: **Upper bound of 1**: Values close to zero indicate two label assignments that are largely independent, while values close to one indicate significant agreement. Further, an AMI of exactly 1 indicates that the two label assignments are equal (with or without permutation).
es_es: **Límite superior de 1**: Los valores cercanos a cero indican dos asignaciones de etiquetas que son en gran medida independientes, mientras que los valores cercanos a uno indican un acuerdo significativo. Además, una AMI de exactamente 1 indica que las dos asignaciones de etiquetas son iguales (con o sin permutación).

source: Contrary to inertia, **MI-based measures require the knowledge of the ground truth classes** while almost never available in practice or requires manual assignment by human annotators (as in the supervised learning setting).
es_es: Al contrario de lo que ocurre con la inercia, **las medidas basadas en el IM requieren el conocimiento de las clases verdaderas**, mientras que casi nunca están disponibles en la práctica o requieren la asignación manual por parte de anotadores humanos (como en el entorno del aprendizaje supervisado).

source: However MI-based measures can also be useful in purely unsupervised setting as a building block for a Consensus Index that can be used for clustering model selection.
es_es: Sin embargo, las medidas basadas en el IM también pueden ser útiles en un entorno puramente no supervisado como componente básico para un Índice de Consenso que puede utilizarse para la selección de modelos de agrupamiento.

source: NMI and MI are not adjusted against chance.
es_es: La NMI y la MI no están ajustadas al azar.

source: :ref:`sphx_glr_auto_examples_cluster_plot_adjusted_for_chance_measures.py`: Analysis of the impact of the dataset size on the value of clustering measures for random assignments. This example also includes the Adjusted Rand Index.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_adjusted_for_chance_measures.py`: Análisis del impacto del tamaño del conjunto de datos en el valor de las medidas de agrupamiento para las asignaciones aleatorias. Este ejemplo también incluye el índice de Rand ajustado.

source: Assume two label assignments (of the same N objects), :math:`U` and :math:`V`. Their entropy is the amount of uncertainty for a partition set, defined by:
es_es: Supongamos dos asignaciones de etiquetas (de los mismos N objetos), :math:`U` y :math:`V`. Su entropía es la cantidad de incertidumbre para un conjunto particionado, definida por:

source: where :math:`P(i) = |U_i| / N` is the probability that an object picked at random from :math:`U` falls into class :math:`U_i`. Likewise for :math:`V`:
es_es: donde :math:`P(i) = |U_i| / N` es la probabilidad de que un objeto elegido al azar de :math:`U` pertenezca a la clase :math:`U_i`. Lo mismo ocurre con :math:`V`:

source: With :math:`P'(j) = |V_j| / N`. The mutual information (MI) between :math:`U` and :math:`V` is calculated by:
es_es: Con :math:`P'(j) = |V_j| / N`. La información mutua (Mutual Information, MI) entre :math:`U` y :math:`V` se calcula mediante:

source: where :math:`P(i, j) = |U_i \cap V_j| / N` is the probability that an object picked at random falls into both classes :math:`U_i` and :math:`V_j`.
es_es: donde :math:`P(i, j) = |U_i \cap V_j| / N` es la probabilidad de que un objeto elegido al azar caiga en ambas clases :math:`U_i` y :math:`V_j`.

source: It also can be expressed in set cardinality formulation:
es_es: También puede expresarse en la formulación de la cardinalidad del conjunto:

source: The normalized mutual information is defined as
es_es: La información mutua normalizada se define como

source: This value of the mutual information and also the normalized variant is not adjusted for chance and will tend to increase as the number of different labels (clusters) increases, regardless of the actual amount of "mutual information" between the label assignments.
es_es: Este valor de la información mutua y también la variante normalizada no está ajustada al azar y tenderá a aumentar a medida que aumente el número de etiquetas diferentes (conglomerados), sin importar la cantidad real de "información mutua" entre las asignaciones de etiquetas.

source: The expected value for the mutual information can be calculated using the following equation [VEB2009]_. In this equation, :math:`a_i = |U_i|` (the number of elements in :math:`U_i`) and :math:`b_j = |V_j|` (the number of elements in :math:`V_j`).
es_es: El valor esperado de la información mutua puede calcularse mediante la siguiente ecuación [VEB2009]_. En esta ecuación, :math:`a_i = |U_i|` (el número de elementos en :math:`U_i`) y :math:`b_j = |V_j|` (el número de elementos en :math:`V_j`).

source: Using the expected value, the adjusted mutual information can then be calculated using a similar form to that of the adjusted Rand index:
es_es: A partir del valor esperado, la información mutua ajustada puede calcularse de forma similar a la del índice de Rand ajustado:

source: For normalized mutual information and adjusted mutual information, the normalizing value is typically some *generalized* mean of the entropies of each clustering. Various generalized means exist, and no firm rules exist for preferring one over the others. The decision is largely a field-by-field basis; for instance, in community detection, the arithmetic mean is most common. Each normalizing method provides "qualitatively similar behaviours" [YAT2016]_. In our implementation, this is controlled by the ``average_method`` parameter.
es_es: Para la información mutua normalizada y la información mutua ajustada, el valor normalizador suele ser alguna media *generalizada* de las entropías de cada conglomerado. Existen varias medias generalizadas, y no hay reglas firmes para preferir una sobre las otras. La decisión es en gran medida un campo por campo; por ejemplo, en la detección de comunidades, la media aritmética es la más común. Cada método de normalización proporciona "comportamientos cualitativamente similares" [YAT2016]_. En nuestra implementación, esto se controla con el parámetro ``average_method``.

source: Vinh et al. (2010) named variants of NMI and AMI by their averaging method [VEB2010]_. Their 'sqrt' and 'sum' averages are the geometric and arithmetic means; we use these more broadly common names.
es_es: Vinh et al. (2010) nombraron variantes de la NMI y la AMI por su método de promediación [VEB2010]_. Sus promedios 'sqrt' y 'sum' son las medias geométrica y aritmética; nosotros utilizamos estos nombres más comunes.

source: Homogeneity, completeness and V-measure
es_es: Homogeneidad, completitud y medida V

source: Given the knowledge of the ground truth class assignments of the samples, it is possible to define some intuitive metric using conditional entropy analysis.
es_es: Dado el conocimiento de las asignaciones de clase de las muestras basadas en la evidencia, es posible definir alguna métrica intuitiva utilizando el análisis de entropía condicional.

source: In particular Rosenberg and Hirschberg (2007) define the following two desirable objectives for any cluster assignment:
es_es: En particular, Rosenberg y Hirschberg (2007) definen los siguientes dos objetivos deseables para cualquier asignación de conglomerados:

source: **homogeneity**: each cluster contains only members of a single class.
es_es: **homogeneidad**: cada conglomerado contiene sólo miembros de una sola clase.

source: **completeness**: all members of a given class are assigned to the same cluster.
es_es: **completitud**: todos los miembros de una clase determinada están asignados al mismo conglomerado.

source: We can turn those concept as scores :func:`homogeneity_score` and :func:`completeness_score`. Both are bounded below by 0.0 and above by 1.0 (higher is better)::
es_es: Podemos convertir estos conceptos en puntuaciones :func:`homogeneity_score` y :func:`completeness_score`. Ambas están delimitadas por debajo de 0,0 y por encima de 1,0 (cuanto más alto, mejor)::

source: Their harmonic mean called **V-measure** is computed by :func:`v_measure_score`::
es_es: Su media armónica llamada **medidad V** se calcula con :func:`v_measure_score`::

source: This function's formula is as follows:
es_es: La fórmula de esta función es la siguiente:

source: `beta` defaults to a value of 1.0, but for using a value less than 1 for beta::
es_es: El valor predeterminado de `beta` es 1,0, pero para utilizar un valor menor que 1 para beta::

source: more weight will be attributed to homogeneity, and using a value greater than 1::
es_es: se atribuirá más peso a la homogeneidad, y utilizando un valor mayor que 1::

source: more weight will be attributed to completeness.
es_es: se atribuirá más peso a la completitud.

source: The V-measure is actually equivalent to the mutual information (NMI) discussed above, with the aggregation function being the arithmetic mean [B2011]_.
es_es: La medida V es, en realidad equivalente a la información mutua (NMI) comentada anteriormente, siendo la función de agregación la media aritmética [B2011]_.

source: Homogeneity, completeness and V-measure can be computed at once using :func:`homogeneity_completeness_v_measure` as follows::
es_es: La homogeneidad, la completitud y la medida V pueden calcularse a la vez utilizando :func:`homogeneity_completeness_v_measure` de la siguiente manera::

source: The following clustering assignment is slightly better, since it is homogeneous but not complete::
es_es: La siguiente asignación de agrupamiento es ligeramente mejor, ya que es homogénea pero no completa::

source: :func:`v_measure_score` is **symmetric**: it can be used to evaluate the **agreement** of two independent assignments on the same dataset.
es_es: :func:`v_measure_score` es **simétrica**: puede utilizarse para evaluar el **acuerdo** de dos asignaciones independientes en el mismo conjunto de datos.

source: This is not the case for :func:`completeness_score` and :func:`homogeneity_score`: both are bound by the relationship::
es_es: Este no es el caso de :func:`completeness_score` y :func:`homogeneity_score`: ambos están vinculados por la relación::

source: **Bounded scores**: 0.0 is as bad as it can be, 1.0 is a perfect score.
es_es: **Puntuaciones limitadas**: 0,0 es lo peor que puede ser, 1,0 es una puntuación perfecta.

source: Intuitive interpretation: clustering with bad V-measure can be **qualitatively analyzed in terms of homogeneity and completeness** to better feel what 'kind' of mistakes is done by the assignment.
es_es: Interpretación intuitiva: el agrupamiento con mala medida V se puede **analizar cualitativamente en términos de homogeneidad y completitud** para sentir mejor qué 'tipo' de errores se hace mediante la asignación.

source: **No assumption is made on the cluster structure**: can be used to compare clustering algorithms such as k-means which assumes isotropic blob shapes with results of spectral clustering algorithms which can find cluster with "folded" shapes.
es_es: **No se hace ninguna suposición sobre la estructura del conglomerado**: puede utilizarse para comparar todos los tipos de algoritmos de agrupamiento, y puede utilizarse para comparar algoritmos de agrupamiento tales como k-medias que asume formas de manchas isotrópicas con resultados de los algoritmos de agrupamiento espectral, que pueden encontrar conglomerados con formas "plegadas".

source: The previously introduced metrics are **not normalized with regards to random labeling**: this means that depending on the number of samples, clusters and ground truth classes, a completely random labeling will not always yield the same values for homogeneity, completeness and hence v-measure. In particular **random labeling won't yield zero scores especially when the number of clusters is large**.
es_es: Las métricas introducidas anteriormente **no están normalizadas con respecto al etiquetado aleatorio**: esto significa que, dependiendo del número de muestras, conglomerados y clases basadas en la evidencia, un etiquetado completamente aleatorio no siempre produce los mismos valores de homogeneidad, completitud y, por tanto, la medida v. En particular, **el etiquetado aleatorio no producirá puntuaciones iguales a cero, especialmente cuando el número de conglomerados sea grande**.

source: This problem can safely be ignored when the number of samples is more than a thousand and the number of clusters is less than 10. **For smaller sample sizes or larger number of clusters it is safer to use an adjusted index such as the Adjusted Rand Index (ARI)**.
es_es: Este problema puede ignorarse con seguridad cuando el número de muestras es superior a mil y el número de conglomerados es menor que 10. **Para tamaños de muestra más pequeños o mayor número de conglomerados, es más seguro utilizar un índice ajustado como el Índice de Rand Ajustado (Adjusted Rand Index ARI)**.

source: These metrics **require the knowledge of the ground truth classes** while almost never available in practice or requires manual assignment by human annotators (as in the supervised learning setting).
es_es: Estas métricas **requieren el conocimiento de las clases basadas en la evidencia**, mientras que casi nunca están disponibles en la práctica o requieren la asignación manual por parte de anotadores humanos (como en el entorno del aprendizaje supervisado).

source: Homogeneity and completeness scores are formally given by:
es_es: Las puntuaciones de homogeneidad y completitud vienen dadas formalmente por:

source: where :math:`H(C|K)` is the **conditional entropy of the classes given the cluster assignments** and is given by:
es_es: donde :math:`H(C|K)` es la **entropía condicional de las clases dadas las asignaciones de los conglomerados** y viene dada por:

source: and :math:`H(C)` is the **entropy of the classes** and is given by:
es_es: y :math:`H(C)` es la **entropía de las clases** y viene dada por:

source: with :math:`n` the total number of samples, :math:`n_c` and :math:`n_k` the number of samples respectively belonging to class :math:`c` and cluster :math:`k`, and finally :math:`n_{c,k}` the number of samples from class :math:`c` assigned to cluster :math:`k`.
es_es: con :math:`n` el número total de muestras, :math:`n_c` y :math:`n_k` el número de muestras que pertenecen respectivamente a la clase :math:`c` y al conglomerado :math:`k`, y finalmente :math:`n_{c,k}` el número de muestras de la clase :math:`c` asignadas al conglomerado :math:`k`.

source: The **conditional entropy of clusters given class** :math:`H(K|C)` and the **entropy of clusters** :math:`H(K)` are defined in a symmetric manner.
es_es: La **entropía condicional de los conglomerados dada la clase** :math:`H(K|C)` y la **entropía de los conglomerados** :math:`H(K)` se definen de forma simétrica.

source: Rosenberg and Hirschberg further define **V-measure** as the **harmonic mean of homogeneity and completeness**:
es_es: Rosenberg y Hirschberg definen además la **medida V** como la **media armónica de la homogeneidad y la completitud**:

source: `Identication and Characterization of Events in Social Media <http://www.cs.columbia.edu/~hila/hila-thesis-distributed.pdf>`_, Hila Becker, PhD Thesis.
es_es: `Identication and Characterization of Events in Social Media <http://www.cs.columbia.edu/~hila/hila-thesis-distributed.pdf>`_, Hila Becker, Tesis doctoral.

source: Fowlkes-Mallows scores
es_es: Puntuaciones de Fowlkes-Mallow

source: The Fowlkes-Mallows index (:func:`sklearn.metrics.fowlkes_mallows_score`) can be used when the ground truth class assignments of the samples is known. The Fowlkes-Mallows score FMI is defined as the geometric mean of the pairwise precision and recall:
es_es: El índice de Fowlkes-Mallows (:func:`sklearn.metrics.fowlkes_mallows_score`) puede utilizarse cuando se conoce la asignación de la clase de las muestras basadas en la evidencia. La puntuación de Fowlkes-Mallows FMI se define como la media geométrica de la precisión y exhaustividad por pares:

source: Where ``TP`` is the number of **True Positive** (i.e. the number of pair of points that belong to the same clusters in both the true labels and the predicted labels), ``FP`` is the number of **False Positive** (i.e. the number of pair of points that belong to the same clusters in the true labels and not in the predicted labels) and ``FN`` is the number of **False Negative** (i.e the number of pair of points that belongs in the same clusters in the predicted labels and not in the true labels).
es_es: Donde ``TP`` es el número de **Verdaderos Positivos** (es decir, el número de pares de puntos que pertenecen a los mismos conglomerados tanto en las etiquetas verdaderas como en las etiquetas predichas), ``FP`` es el número de **Falsos Positivos** (es decir, el número de pares de puntos que pertenecen a los mismos conglomerados en las etiquetas verdaderas y no en las etiquetas predichas) y ``FN`` es el número de **Falsos Negativos** (es decir, el número de puntos que pertenecen a los mismos conglomerados en las etiquetas predichas y no en las etiquetas verdaderas).

source: The score ranges from 0 to 1. A high value indicates a good similarity between two clusters.
es_es: La puntuación oscila entre 0 y 1. Un valor alto indica una buena similitud entre dos conglomerados.

source: Bad (e.g. independent labelings) have zero scores::
es_es: Los malos (por ejemplo, los etiquetados independientes) tienen puntuación cero::

source: **Random (uniform) label assignments have a FMI score close to 0.0** for any value of ``n_clusters`` and ``n_samples`` (which is not the case for raw Mutual Information or the V-measure for instance).
es_es: **Las asignaciones de etiquetas aleatorias (uniformes) tienen una puntuación FMI cercana a 0,0** para cualquier valor de ``n_clusters`` y ``n_samples`` (lo que no ocurre con la Información Mutua en bruto o la medida V, por ejemplo).

source: **Upper-bounded at 1**: Values close to zero indicate two label assignments that are largely independent, while values close to one indicate significant agreement. Further, values of exactly 0 indicate **purely** independent label assignments and a FMI of exactly 1 indicates that the two label assignments are equal (with or without permutation).
es_es: **El límite superior es 1**: Los valores cercanos a cero indican dos asignaciones de etiquetas que son en gran medida independientes, mientras que los valores cercanos a uno indican un acuerdo significativo. Además, los valores de exactamente 0 indican asignaciones de etiquetas **puramente** independientes y un FMI de exactamente 1 indica que las dos asignaciones de etiquetas son iguales (con o sin permutación).

source: Contrary to inertia, **FMI-based measures require the knowledge of the ground truth classes** while almost never available in practice or requires manual assignment by human annotators (as in the supervised learning setting).
es_es: Al contrario de lo que ocurre con la inercia, **las medidas basadas en el FMI requieren el conocimiento de las clases basadas en la evidencia**, mientras que casi nunca están disponibles en la práctica o requieren la asignación manual por parte de anotadores humanos (como en el entorno del aprendizaje supervisado).

source: Silhouette Coefficient
es_es: Coeficiente de Silueta

source: If the ground truth labels are not known, evaluation must be performed using the model itself. The Silhouette Coefficient (:func:`sklearn.metrics.silhouette_score`) is an example of such an evaluation, where a higher Silhouette Coefficient score relates to a model with better defined clusters. The Silhouette Coefficient is defined for each sample and is composed of two scores:
es_es: Si no se conocen las etiquetas basadas en la evidencia, la evaluación debe realizarse utilizando el propio modelo. El Coeficiente de Silueta (:func:`sklearn.metrics.silhouette_score`) es un ejemplo de este tipo de evaluación, donde una mayor puntuación del Coeficiente de Silueta se relaciona con un modelo con conglomerados mejor definidos. El coeficiente de silueta se define para cada muestra y se compone de dos puntuaciones:

source: **a**: The mean distance between a sample and all other points in the same class.
es_es: **a**: La distancia media entre una muestra y todos los demás puntos de la misma clase.

source: **b**: The mean distance between a sample and all other points in the *next nearest cluster*.
es_es: **b**: La distancia media entre una muestra y todos los demás puntos en el *conglomerado más cercano*.

source: The Silhouette Coefficient *s* for a single sample is then given as:
es_es: El Coeficiente de Silueta *s* para una sola muestra se da entonces como:

source: The Silhouette Coefficient for a set of samples is given as the mean of the Silhouette Coefficient for each sample.
es_es: El Coeficiente de Silueta para un conjunto de muestras se da como la media del Coeficiente de Silueta para cada muestra.

source: In normal usage, the Silhouette Coefficient is applied to the results of a cluster analysis.
es_es: En el uso normal, el Coeficiente de Silueta se aplica a los resultados de un análisis de conglomerados.

source: The score is bounded between -1 for incorrect clustering and +1 for highly dense clustering. Scores around zero indicate overlapping clusters.
es_es: La puntuación está limitada entre -1 para un agrupamiento incorrecto y +1 para un conglomerado altamente denso. Las puntuaciones alrededor de cero indican agrupamiento superpuestos.

source: The score is higher when clusters are dense and well separated, which relates to a standard concept of a cluster.
es_es: La puntuación es mayor cuando los conglomerados son densos y están bien separados, lo cual se relaciona con el concepto estándar de un conglomerado.

source: The Silhouette Coefficient is generally higher for convex clusters than other concepts of clusters, such as density based clusters like those obtained through DBSCAN.
es_es: El Coeficiente de Silueta es generalmente más alto para los conglomerados convexos que para otros conceptos de conglomerados, como los conglomerados basados en la densidad como los obtenidos a través de DBSCAN.

source: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_silhouette_analysis.py` : In this example the silhouette analysis is used to choose an optimal value for n_clusters.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_silhouette_analysis.py` : En este ejemplo se utiliza el análisis de siluetas para elegir un valor óptimo para n_clusters.

source: Calinski-Harabasz Index
es_es: Índice de Calinski-Harabasz

source: If the ground truth labels are not known, the Calinski-Harabasz index (:func:`sklearn.metrics.calinski_harabasz_score`) - also known as the Variance Ratio Criterion - can be used to evaluate the model, where a higher Calinski-Harabasz score relates to a model with better defined clusters.
es_es: Si no se conocen las etiquetas basadas en la evidencia, se puede utilizar el índice de Calinski-Harabasz (:func:`sklearn.metrics.calinski_harabasz_score`) -también conocido como Criterio de Razón de la Varianza- para evaluar el modelo, donde una puntuación Calinski-Harabasz más alta se relaciona con un modelo con conglomerados mejor definidos.
