Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/clustering.po
Languages: es_es

source: Note that for any single value of ``eps``, DBSCAN will tend to have a shorter run time than OPTICS; however, for repeated runs at varying ``eps`` values, a single run of OPTICS may require less cumulative runtime than DBSCAN. It is also important to note that OPTICS' output is close to DBSCAN's only if ``eps`` and ``max_eps`` are close.
es_es: Tenga en cuenta que para cualquier valor único de ``eps``, DBSCAN tenderá a tener un tiempo de ejecución más corto que OPTICS; sin embargo, para ejecuciones repetidas con valores variantes de ``eps``, una sola ejecución de OPTICS puede requerir menos tiempo de ejecución acumulado que DBSCAN. También es importante tener en cuenta que la salida de OPTICS se acerca a la de DBSCAN, sólo si ``eps`` y ``max_eps`` están cerca.

source: Computational Complexity
es_es: Complejidad computacional

source: Spatial indexing trees are used to avoid calculating the full distance matrix, and allow for efficient memory usage on large sets of samples. Different distance metrics can be supplied via the ``metric`` keyword.
es_es: Los árboles de indexación espacial se utilizan para evitar el cálculo de la matriz de distancias completa, y permiten un uso eficiente de la memoria en grandes conjuntos de muestras. Diferentes métricas de distancia pueden ser suministradas a través de la palabra clave ``metric``.

source: For large datasets, similar (but not identical) results can be obtained via `HDBSCAN <https://hdbscan.readthedocs.io>`_. The HDBSCAN implementation is multithreaded, and has better algorithmic runtime complexity than OPTICS, at the cost of worse memory scaling. For extremely large datasets that exhaust system memory using HDBSCAN, OPTICS will maintain :math:`n` (as opposed to :math:`n^2`) memory scaling; however, tuning of the ``max_eps`` parameter will likely need to be used to give a solution in a reasonable amount of wall time.
es_es: Para grandes conjuntos de datos, se pueden obtener resultados similares (pero no idénticos) mediante `HDBSCAN <https://hdbscan.readthedocs.io>`_. La implementación de HDBSCAN es multihilo, y tiene una mejor complejidad algorítmica en tiempo de ejecución que OPTICS, a costa de un peor escalado de memoria. Para los conjuntos de datos extremadamente grandes que agotan la memoria del sistema utilizando HDBSCAN, OPTICS mantendrá el escalado de memoria :math:`n` (en lugar de :math:`n^2`) ; sin embargo, es probable que sea necesario ajustar el parámetro ``max_eps`` para obtener una solución en una cantidad razonable de tiempo real.

source: The :class:`Birch` builds a tree called the Clustering Feature Tree (CFT) for the given data. The data is essentially lossy compressed to a set of Clustering Feature nodes (CF Nodes). The CF Nodes have a number of subclusters called Clustering Feature subclusters (CF Subclusters) and these CF Subclusters located in the non-terminal CF Nodes can have CF Nodes as children.
es_es: El :class:`Birch` construye un árbol llamado el Árbol de Características de Conglomerados (CFT) para los datos dados. Los datos se comprimen esencialmente con pérdidas en un conjunto de nodos de característica de conglomeración (Nodos CF). Los Nodos CF tienen un número de subconglomerados llamados "Subconglomerados de Características de Conglomeración (Subconglomerados CF) y estos subconglomerados CF ubicados en los Nodos CF no terminales pueden tener Nodos CF como hijos.

source: The CF Subclusters hold the necessary information for clustering which prevents the need to hold the entire input data in memory. This information includes:
es_es: Los Subconglomerados CF contienen la información necesaria para el análisis de conglomerados, lo que evita la necesidad de mantener todos los datos de entrada en la memoria. Esta información incluye:

source: Number of samples in a subcluster.
es_es: Número de muestras en un subconglomerado.

source: Linear Sum - An n-dimensional vector holding the sum of all samples
es_es: Suma lineal - Un vector n-dimensional que contiene la suma de todas las muestras

source: Squared Sum - Sum of the squared L2 norm of all samples.
es_es: Suma cuadrado - Suma de la norma L2 al cuadrado de todas las muestras.

source: Centroids - To avoid recalculation linear sum / n_samples.
es_es: Centroides - Para evitar recálculos de suma lineal / n_muestras.

source: Squared norm of the centroids.
es_es: Norma al cuadrado de los centroides.

source: The Birch algorithm has two parameters, the threshold and the branching factor. The branching factor limits the number of subclusters in a node and the threshold limits the distance between the entering sample and the existing subclusters.
es_es: El algoritmo Birch tiene dos parámetros, el umbral y el factor de ramificación. El factor de ramificación limita el número de subconglomerados en un nodo y el umbral limita la distancia entre la muestra que entra y los subconglomerados existentes.

source: This algorithm can be viewed as an instance or data reduction method, since it reduces the input data to a set of subclusters which are obtained directly from the leaves of the CFT. This reduced data can be further processed by feeding it into a global clusterer. This global clusterer can be set by ``n_clusters``. If ``n_clusters`` is set to None, the subclusters from the leaves are directly read off, otherwise a global clustering step labels these subclusters into global clusters (labels) and the samples are mapped to the global label of the nearest subcluster.
es_es: Este algoritmo puede considerarse como una instancia o un método de reducción de datos, ya que reduce los datos de entrada a un conjunto de subconglomerados que se obtienen directamente de las hojas del CFT. Estos datos reducidos pueden ser procesados posteriormente alimentando un agrupador global. Este agrupador global puede establecerse mediante ``n_clusters``. Si ``n_clusters`` se establece como None, los subconglomerados de las hojas se leen directamente, de lo contrario en un paso del análisis de conglomerados globales etiqueta estos subconglomerados globales (etiquetas) y las muestras se asignan a la etiqueta global del subconglomerado más cercano.

source: **Algorithm description:**
es_es: **Descripción del algoritmo:**

source: A new sample is inserted into the root of the CF Tree which is a CF Node. It is then merged with the subcluster of the root, that has the smallest radius after merging, constrained by the threshold and branching factor conditions. If the subcluster has any child node, then this is done repeatedly till it reaches a leaf. After finding the nearest subcluster in the leaf, the properties of this subcluster and the parent subclusters are recursively updated.
es_es: Una nueva muestra se inserta en la raíz del árbol CF que es un nodo CF. Luego se fusiona con el subconglomerado de la raíz, que tenga el radio más pequeño después de la fusión, restringido por el umbral y las condiciones del factor de ramificación. Si el subconglomerado tiene algún nodo hijo, entonces se repite la operación hasta que alcanza una hoja. Después de encontrar el subconglomerado más cercano en la hoja, las propiedades de este subconglomerado y los subconglomerados padre se actualizan recursivamente.

source: If the radius of the subcluster obtained by merging the new sample and the nearest subcluster is greater than the square of the threshold and if the number of subclusters is greater than the branching factor, then a space is temporarily allocated to this new sample. The two farthest subclusters are taken and the subclusters are divided into two groups on the basis of the distance between these subclusters.
es_es: Si el radio del subconglomerado obtenido al fuisionar la nueva muestra y el subconglomerado más cercano es mayor que el cuadrado del umbral y si el número de subconglomerados es mayor que el factor de ramificación, entonces se asigna temporalmente un espacio a esta nueva muestra. Se toman los dos subconglomerados más alejados y se dividen los subconglomerados en dos grupos en función de la distancia entre estos subconglomerados.

source: If this split node has a parent subcluster and there is room for a new subcluster, then the parent is split into two. If there is no room, then this node is again split into two and the process is continued recursively, till it reaches the root.
es_es: Si este nodo dividido tiene un subconglomerado padre y hay espacio para un nuevo subconglomerado, entonces el padre se divide en dos. Si no hay espacio, entonces este nodo se divide de nuevo en dos y el proceso se continúa recursivamente, hasta que llega a la raíz.

source: **Birch or MiniBatchKMeans?**
es_es: **¿Birch o MiniBatchKMeans?**

source: Birch does not scale very well to high dimensional data. As a rule of thumb if ``n_features`` is greater than twenty, it is generally better to use MiniBatchKMeans.
es_es: Birch no se adapta muy bien a los datos de alta dimensión. Como regla general, si ``n_features`` es mayor que veinte, suele ser mejor utilizar MiniBatchKMeans.

source: If the number of instances of data needs to be reduced, or if one wants a large number of subclusters either as a preprocessing step or otherwise, Birch is more useful than MiniBatchKMeans.
es_es: Si es necesario reducir el número de instancias de datos, o si se desea un gran número de subconglomerados, ya sea como paso previo al procesamiento o de otro modo, Birch es más útil que MiniBatchKMeans.

source: **How to use partial_fit?**
es_es: **¿Cómo utilizar partial_fit?**

source: To avoid the computation of global clustering, for every call of ``partial_fit`` the user is advised
es_es: Para evitar el cálculo del agrupamiento global, para cada llamado de ``partial_fit`` se aconseja al usuario

source: To set ``n_clusters=None`` initially
es_es: Para establecer ``n_clusters=None`` inicialmente

source: Train all data by multiple calls to partial_fit.
es_es: Entrena todos los datos mediante múltiples llamados a partial_fit.

source: Set ``n_clusters`` to a required value using ``brc.set_params(n_clusters=n_clusters)``.
es_es: Establezca ``n_clusters`` a un valor requerido usando ``brc.set_params(n_clusters=n_clusters)``.

source: Call ``partial_fit`` finally with no arguments, i.e. ``brc.partial_fit()`` which performs the global clustering.
es_es: Llama finalmente a ``partial_fit`` sin argumentos, es decir, ``brc.partial_fit()`` que realiza el agrupamiento global.

source: Clustering performance evaluation
es_es: Evaluación del rendimiento del análisis de conglomerados (agrupamiento)

source: Evaluating the performance of a clustering algorithm is not as trivial as counting the number of errors or the precision and recall of a supervised classification algorithm. In particular any evaluation metric should not take the absolute values of the cluster labels into account but rather if this clustering define separations of the data similar to some ground truth set of classes or satisfying some assumption such that members belong to the same class are more similar than members of different classes according to some similarity metric.
es_es: Evaluar el rendimiento de un algoritmo de análisis de conglomerados no es tan trivial como contar el número de errores o la precisión y exhaustividad de un algoritmo de clasificación supervisada. En particular, cualquier métrica de evaluación no debería tener en cuenta los valores absolutos de las etiquetas de los conglomerados, sino más bien si este agrupamiento define separaciones de los datos similares a algún conjunto de clases de la verdad básica o satisface alguna suposición como que los miembros que pertenecen a la misma clase son más similares que los miembros de clases diferentes según alguna métrica de similitud.

source: Rand index
es_es: Índice de Rand

source: Given the knowledge of the ground truth class assignments ``labels_true`` and our clustering algorithm assignments of the same samples ``labels_pred``, the **(adjusted or unadjusted) Rand index** is a function that measures the **similarity** of the two assignments, ignoring permutations::
es_es: Dado el conocimiento de las asignaciones de clase de la verdad sobre el terreno ``labels_true`` y las asignaciones de nuestro algoritmo de agrupación de las mismas muestras ``labels_pred``, el **índice de Rand (ajustado o no ajustado)** es una función que mide la **similitud** de las dos asignaciones, ignorando las permutaciones::

source: The Rand index does not ensure to obtain a value close to 0.0 for a random labelling. The adjusted Rand index **corrects for chance** and will give such a baseline.
es_es: El índice de Rand no garantiza obtener un valor cercano a 0.0 para un etiquetado aleatorio. El índice de Rand ajustado **corrige por casualidad** y dará esa línea de base.

source: As with all clustering metrics, one can permute 0 and 1 in the predicted labels, rename 2 to 3, and get the same score::
es_es: Como con todas las métricas del análisis de conglomerados, se puede permutar 0 y 1 en las etiquetas predichas, renombrar 2 a 3 y obtener la misma puntuación::

source: Furthermore, both :func:`rand_score` :func:`adjusted_rand_score` are **symmetric**: swapping the argument does not change the scores. They can thus be used as **consensus measures**::
es_es: Además, :func:`rand_score`y :func:`adjusted_rand_score` son **simétricos**: intercambiar el argumento no cambia las puntuaciones. Por tanto, pueden utilizarse como **medidas de consenso**::

source: Perfect labeling is scored 1.0::
es_es: El etiquetado perfecto tiene una puntuación de 1,0::

source: Poorly agreeing labels (e.g. independent labelings) have lower scores, and for the adjusted Rand index the score will be negative or close to zero. However, for the unadjusted Rand index the score, while lower, will not necessarily be close to zero.::
es_es: Las etiquetas con poca concordancia (por ejemplo, etiquetas independientes) tienen puntuaciones más bajas, y para el índice de Rand ajustado la puntuación será negativa o cercana a cero. Sin embargo, para el índice de Rand no ajustado la puntuación, aunque sea más baja, no será necesariamente cercana a cero.::

source: Advantages
es_es: Ventajas

source: **Interpretability**: The unadjusted Rand index is proportional to the number of sample pairs whose labels are the same in both `labels_pred` and `labels_true`, or are different in both.
es_es: **Interpretabilidad**: El índice de Rand no ajustado es proporcional al número de pares de muestras cuyas etiquetas son iguales tanto en `labels_pred` como en `labels_true`, o son diferentes en ambas.

source: **Random (uniform) label assignments have an adjusted Rand index score close to 0.0** for any value of ``n_clusters`` and ``n_samples`` (which is not the case for the unadjusted Rand index or the V-measure for instance).
es_es: **Las asignaciones de etiquetas aleatorias (uniformes) tienen una puntuación del índice de Rand ajustado cercana a 0,0** para cualquier valor de ``n_clusters`` y ``n_muestras`` (lo que no ocurre con el índice de Rand no ajustado o la medida V, por ejemplo).

source: **Bounded range**: Lower values indicate different labelings, similar clusterings have a high (adjusted or unadjusted) Rand index, 1.0 is the perfect match score. The score range is [0, 1] for the unadjusted Rand index and [-1, 1] for the adjusted Rand index.
es_es: **Rango limitado**: Los valores más bajos indican diferentes etiquetados, las agrupaciones similares tienen un índice de Rand alto (ajustado o no ajustado), 1,0 es la puntuación de coincidencia perfecta. El rango de puntuación es [0, 1] para el índice de Rand no ajustado y [-1, 1] para el índice de Rand ajustado.

source: **No assumption is made on the cluster structure**: The (adjusted or unadjusted) Rand index can be used to compare all kinds of clustering algorithms, and can be used to compare clustering algorithms such as k-means which assumes isotropic blob shapes with results of spectral clustering algorithms which can find cluster with "folded" shapes.
es_es: **No se hace ninguna suposición sobre la estructura del conglomerado**: El índice de Rand (ajustado o no ajustado) puede utilizarse para comparar todos los tipos de algoritmos de análisis de conglomerados, y puede utilizarse para comparar algoritmos de agrupamiento tales como k-medias que asume formas de manchas isotrópicas con resultados de algoritmos de agrupamiento espectral que pueden encontrar conglomerados con formas "plegadas".

source: Drawbacks
es_es: Inconvenientes

source: Contrary to inertia, the **(adjusted or unadjusted) Rand index requires knowledge of the ground truth classes** which is almost never available in practice or requires manual assignment by human annotators (as in the supervised learning setting).
es_es: Al contrario de lo que ocurre con la inercia, el **índice de Rand (ajustado o sin ajustar) requiere el conocimiento de las clases verdaderas**, que casi nunca están disponibles en la práctica o requieren la asignación manual por parte de anotadores humanos (como en el entorno del aprendizaje supervisado).

source: However (adjusted or unadjusted) Rand index can also be useful in a purely unsupervised setting as a building block for a Consensus Index that can be used for clustering model selection (TODO).
es_es: Sin embargo, el índice de Rand (ajustado o no ajustado) también puede ser útil en un entorno puramente no supervisado como bloque de construcción para un Índice de Consenso que puede ser utilizado para la selección de modelos de análisis de conglomerados (TODO).

source: The **unadjusted Rand index is often close to 1.0** even if the clusterings themselves differ significantly. This can be understood when interpreting the Rand index as the accuracy of element pair labeling resulting from the clusterings: In practice there often is a majority of element pairs that are assigned the ``different`` pair label under both the predicted and the ground truth clustering resulting in a high proportion of pair labels that agree, which leads subsequently to a high score.
es_es: El **índice de Rand no ajustado suele ser cercano a 1,0** incluso si los conglomerados difieren significativamente. Esto se puede entender cuando se interpreta el índice de Rand como la exactitud del etiquetado de los pares de elementos resultantes de los agrupamientos: En la práctica, a menudo hay una mayoría de pares de elementos a los que se le asigna la etiqueta ``different`` tanto en el conglomerado predicho como en el agrupamiento verdadero sobre el terreno, lo que da lugar a una alta proporción de etiquetas de par que coinciden, lo que conduce posteriormente a una alta puntuación.

source: :ref:`sphx_glr_auto_examples_cluster_plot_adjusted_for_chance_measures.py`: Analysis of the impact of the dataset size on the value of clustering measures for random assignments.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_adjusted_for_chance_measures.py`: Análisis del impacto del tamaño del conjunto de datos en el valor de las medidas del agrupamiento para las asignaciones aleatorias.

source: Mathematical formulation
es_es: Formulación matemática

source: If C is a ground truth class assignment and K the clustering, let us define :math:`a` and :math:`b` as:
es_es: Si C es una asignación de la clase basada en la evidencia y K el agrupamiento, definamos :math:`a` y :math:`b` como:

source: :math:`a`, the number of pairs of elements that are in the same set in C and in the same set in K
es_es: :math:`a`, el número de pares de elementos que están en el mismo conjunto en C y en el mismo conjunto en K

source: :math:`b`, the number of pairs of elements that are in different sets in C and in different sets in K
es_es: :math:`b`, el número de pares de elementos que están en conjuntos diferentes en C y en conjuntos diferentes en K

source: The unadjusted Rand index is then given by:
es_es: El índice de Rand no ajustado viene dado entonces por:

source: where :math:`C_2^{n_{samples}}` is the total number of possible pairs in the dataset. It does not matter if the calculation is performed on ordered pairs or unordered pairs as long as the calculation is performed consistently.
es_es: donde :math:`C_2^{n_{samples}}` es el número total de pares posibles en el conjunto de datos. No importa si el cálculo se realiza sobre pares ordenados o pares no ordenados siempre y cuando el cálculo se realice de forma coherente.

source: However, the Rand index does not guarantee that random label assignments will get a value close to zero (esp. if the number of clusters is in the same order of magnitude as the number of samples).
es_es: Sin embargo, el índice de Rand no garantiza que las asignaciones aleatorias de etiquetas obtengan un valor cercano a cero (especialmente si el número de conglomerado es del mismo orden de magnitud que el número de muestras).

source: To counter this effect we can discount the expected RI :math:`E[\text{RI}]` of random labelings by defining the adjusted Rand index as follows:
es_es: Para contrarrestar este efecto podemos descontar el RI esperado :math:`E[\text{RI}]` de las etiquetas aleatorias definiendo el índice de Rand ajustado de la siguiente manera:

source: Mutual Information based scores
es_es: Puntuaciones basadas en información mutua

source: Given the knowledge of the ground truth class assignments ``labels_true`` and our clustering algorithm assignments of the same samples ``labels_pred``, the **Mutual Information** is a function that measures the **agreement** of the two assignments, ignoring permutations. Two different normalized versions of this measure are available, **Normalized Mutual Information (NMI)** and **Adjusted Mutual Information (AMI)**. NMI is often used in the literature, while AMI was proposed more recently and is **normalized against chance**::
es_es: Dado el conocimiento de las asignaciones de clase basadas en la evidencia ``labels_true`` y nuestras asignaciones del algoritmo de agrupación de las mismas muestras ``labels_pred``, la **Información Mutua** es una función que mide el **acuerdo** de las dos asignaciones, ignorando las permutaciones. Dos versiones normalizadas de esta medida están disponibles, la **Información Mutua Normalizada (Normalized Mutual Information, NMI)** y la **Información Mutua Ajustada (Adjusted Mutual Information, AMI)**. La NMI se utiliza a menudo en la literatura, mientras que la AMI fue propuesto más recientemente y se **normaliza contra el azar**::

source: One can permute 0 and 1 in the predicted labels, rename 2 to 3 and get the same score::
es_es: Se puede permutar el 0 y 1 en las etiquetas predichas, renombrar el 2 al 3 y obtener la misma puntuación::

source: All, :func:`mutual_info_score`, :func:`adjusted_mutual_info_score` and :func:`normalized_mutual_info_score` are symmetric: swapping the argument does not change the score. Thus they can be used as a **consensus measure**::
es_es: Todas, :func:`mutual_info_score`, :func:`adjusted_mutual_info_score` y :func:`normalized_mutual_info_score` son simétricos: intercambiar el argumento no cambia la puntuación. Por lo tanto, pueden utilizarse como una **medida de consenso**::

source: This is not true for ``mutual_info_score``, which is therefore harder to judge::
es_es: Esto no es cierto para ``mutual_info_score``, que por lo tanto es más difícil de juzgar::

source: Bad (e.g. independent labelings) have non-positive scores::
es_es: Los malos (por ejemplo, los etiquetados independientes) tienen puntuaciones no positivas::
