Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/clustering.po
Languages: es_es

source: Clustering
es_es: Análisis de conglomerados (Agrupamiento)

source: `Clustering <https://en.wikipedia.org/wiki/Cluster_analysis>`__ of unlabeled data can be performed with the module :mod:`sklearn.cluster`.
es_es: `El análisis de conglomerados <https://en.wikipedia.org/wiki/Cluster_analysis>`__ de datos no etiquetados puede realizarse con el módulo :mod:`sklearn.cluster`.

source: Each clustering algorithm comes in two variants: a class, that implements the ``fit`` method to learn the clusters on train data, and a function, that, given train data, returns an array of integer labels corresponding to the different clusters. For the class, the labels over the training data can be found in the ``labels_`` attribute.
es_es: Cada algoritmo de análisis de conglomerados viene en dos variantes: una clase, que implementa el método ``fit`` para aprender los conglomerados en los datos de entrenamiento, y una función, que, dados los datos de entrenamiento, devuelve un arreglo de etiquetas de enteros correspondientes a los diferentes conglomerados. Para la clase, las etiquetas sobre los datos de entrenamiento se pueden encontrar en el atributo ``labels_``.

source: Input data
es_es: Datos de entrada

source: One important thing to note is that the algorithms implemented in this module can take different kinds of matrix as input. All the methods accept standard data matrices of shape ``(n_samples, n_features)``. These can be obtained from the classes in the :mod:`sklearn.feature_extraction` module. For :class:`AffinityPropagation`, :class:`SpectralClustering` and :class:`DBSCAN` one can also input similarity matrices of shape ``(n_samples, n_samples)``. These can be obtained from the functions in the :mod:`sklearn.metrics.pairwise` module.
es_es: Una cosa importante a tener en cuenta es que los algoritmos implementados en este módulo pueden tomar diferentes tipos de matriz como entrada. Todos los métodos aceptan matrices de datos estándar con la forma ``(n_samples, n_features)``. Estos pueden obtenerse de las clases en el módulo :mod:`sklearn. módulo eature_extraction`. Para :class:`AffinityPropagation`, :class:`SpectralClustering` y :class:`DBSCAN` también se pueden introducir matrices de similitud de la forma ``(n_samples, n_muestras)``. Estos se pueden obtener de las funciones en el módulo :mod:`sklearn.metrics.pairwise`.

source: Overview of clustering methods
es_es: Resumen de los métodos de análisis de conglomerados

source: A comparison of the clustering algorithms in scikit-learn
es_es: Una comparación de los algoritmos de análisis de conglomerados en scikit-learn

source: Method name
es_es: Nombre del método

source: Parameters
es_es: Parámetros

source: Scalability
es_es: Escalabilidad

source: Usecase
es_es: Casos de uso

source: Geometry (metric used)
es_es: Geometría (métrica utilizada)

source: :ref:`K-Means <k_means>`
es_es: :ref:`K-Medias <k_means>`

source: number of clusters
es_es: número de conglomerados

source: Very large ``n_samples``, medium ``n_clusters`` with :ref:`MiniBatch code <mini_batch_kmeans>`
es_es: ``n_samples`` muy grande, ``n_clusters`` mediano con :ref:`Código del mini lote <mini_batch_kmeans>`

source: General-purpose, even cluster size, flat geometry, not too many clusters
es_es: Uso general, tamaño uniforme de los conglomerados, geometría plana, no demasiados conglomerados

source: Distances between points
es_es: Distancias entre puntos

source: :ref:`Affinity propagation <affinity_propagation>`
es_es: :ref:`Propagación por afinidad <affinity_propagation>`

source: damping, sample preference
es_es: amortiguación, preferencia de muestra

source: Not scalable with n_samples
es_es: No escalable con `n_samples`

source: Many clusters, uneven cluster size, non-flat geometry
es_es: Muchos conglomerados, tamaño desigual de los conglomerados, geometría no plana

source: Graph distance (e.g. nearest-neighbor graph)
es_es: Distancia gráfica (por ejemplo, el gráfico vecino más cercano)

source: :ref:`Mean-shift <mean_shift>`
es_es: :ref:`Cambio medio <mean_shift>`

source: Not scalable with ``n_samples``
es_es: No escalable con ``n_samples``

source: :ref:`Spectral clustering <spectral_clustering>`
es_es: :ref:`Análisis espectral de conglomerados <spectral_clustering>`

source: Medium ``n_samples``, small ``n_clusters``
es_es: ``n_samples`` mediano, ``n_clusters`` pequeño

source: Few clusters, even cluster size, non-flat geometry
es_es: Pocos conglomerados, tamaño uniforme de los conglomerados, geometría no plana

source: :ref:`Ward hierarchical clustering <hierarchical_clustering>`
es_es: :ref:`Análisis de conglomerados jerárquicos de Ward <hierarchical_clustering>`

source: number of clusters or distance threshold
es_es: número de conglomerados o umbral de distancia

source: Large ``n_samples`` and ``n_clusters``
es_es: ``n_samples`` y ``n_clusters`` grandes

source: Many clusters, possibly connectivity constraints
es_es: Muchos conglomerados, posiblemente con limitaciones de conectividad

source: :ref:`Agglomerative clustering <hierarchical_clustering>`
es_es: :ref:`Análisis de conglomerados aglomerativos <hierarchical_clustering>`

source: number of clusters or distance threshold, linkage type, distance
es_es: número de conglomerados o umbral de distancia, tipo de vinculación, distancia

source: Many clusters, possibly connectivity constraints, non Euclidean distances
es_es: Muchos conglomerados, posibles restricciones de conectividad, distancias no euclidianas

source: Any pairwise distance
es_es: Cualquier distancia entre pares

source: neighborhood size
es_es: tamaño del vecindario

source: Very large ``n_samples``, medium ``n_clusters``
es_es: ``n_samples`` muy grande, ``n_clusters`` mediano

source: Non-flat geometry, uneven cluster sizes
es_es: Geometría no plana, tamaños desiguales de los conglomerados

source: Distances between nearest points
es_es: Distancias entre los puntos más cercanos

source: minimum cluster membership
es_es: número mínimo de miembros del conglomerado

source: Very large ``n_samples``, large ``n_clusters``
es_es: ``n_samples`` muy grande, ``n_clusters`` grande

source: Non-flat geometry, uneven cluster sizes, variable cluster density
es_es: Geometría no plana, tamaños desiguales de los conglomerados, densidad variable de los conglomerados

source: :ref:`Gaussian mixtures <mixture>`
es_es: :ref:`Mezclas Gaussianas <mixture>`

source: many
es_es: muchos

source: Not scalable
es_es: No escalable

source: Flat geometry, good for density estimation
es_es: Geometría plana, buena para la estimación de la densidad

source: Mahalanobis distances to centers
es_es: Distancias de Mahalanobis para los centros

source: branching factor, threshold, optional global clusterer.
es_es: factor de ramificación, umbral, agrupador global opcional.

source: Large ``n_clusters`` and ``n_samples``
es_es: ``n_clusters`` y ``n_samples`` grandes

source: Large dataset, outlier removal, data reduction.
es_es: Conjunto de datos grande, eliminación de valores atípicos, reducción de datos.

source: Euclidean distance between points
es_es: Distancia euclidiana entre puntos

source: Non-flat geometry clustering is useful when the clusters have a specific shape, i.e. a non-flat manifold, and the standard euclidean distance is not the right metric. This case arises in the two top rows of the figure above.
es_es: El análisis de conglomerados de geometría no plana es útil cuando los conglomerados tienen una forma específica, es decir, una variedad no plana, y la distancia euclidiana estándar no es la métrica adecuada. Este caso se da en las dos filas superiores de la figura anterior.

source: Gaussian mixture models, useful for clustering, are described in :ref:`another chapter of the documentation <mixture>` dedicated to mixture models. KMeans can be seen as a special case of Gaussian mixture model with equal covariance per component.
es_es: Los modelos de mezclas Gaussianas, útiles para el análisis de conglomerados, se describen en :ref:`otro capítulo de la documentación <mixture>` dedicado a modelos de mezclas. KMedias puede ser visto como un caso especial del modelo de mezcla Gaussiana con igual covarianza por componente.

source: K-means
es_es: K-medias

source: The :class:`KMeans` algorithm clusters data by trying to separate samples in n groups of equal variance, minimizing a criterion known as the *inertia* or within-cluster sum-of-squares (see below). This algorithm requires the number of clusters to be specified. It scales well to large number of samples and has been used across a large range of application areas in many different fields.
es_es: El algoritmo :class:`KMeans` agrupa los datos tratando de separar muestras en n grupos de igual varianza, minimizando un criterio conocido como la *inercia* o la suma de cuadrados dentro del conglomerado (ver abajo). Este algoritmo requiere que se especifique el número de conglomerados. Se ajusta bien a un gran número de muestras y se ha utilizado en una una gran variedad de áreas de aplicación en muchos campos diferentes.

source: The k-means algorithm divides a set of :math:`N` samples :math:`X` into :math:`K` disjoint clusters :math:`C`, each described by the mean :math:`\mu_j` of the samples in the cluster. The means are commonly called the cluster "centroids"; note that they are not, in general, points from :math:`X`, although they live in the same space.
es_es: El algoritmo k-medias divide un conjunto :math:`N` de :math:`X` muestras en :math:`K` conglomerados disjuntos :math:`C`, cada uno descrito por la media :math:`mu_j` de las muestras en el conglomerado. Los medias se denominan comúnmente los "centroides" del conglomerado; nótese que no son, en general, puntos de :math:`X`, aunque viven en el mismo espacio.

source: The K-means algorithm aims to choose centroids that minimise the **inertia**, or **within-cluster sum-of-squares criterion**:
es_es: El algoritmo K-medias tiene como objetivo elegir los centroides que minimicen la **inercia**, o el **criterio de la suma de cuadrados dentro del conglomerado**:

source: Inertia can be recognized as a measure of how internally coherent clusters are. It suffers from various drawbacks:
es_es: La inercia puede reconocerse como una medida de la coherencia interna de los conglomerados. Sufre varios inconvenientes:

source: Inertia makes the assumption that clusters are convex and isotropic, which is not always the case. It responds poorly to elongated clusters, or manifolds with irregular shapes.
es_es: La inercia supone que los conglomerados son convexos e isotrópicos, lo que no siempre es el caso. Responde mal a los conglomerados alargados o a las variedades con formas irregulares.

source: Inertia is not a normalized metric: we just know that lower values are better and zero is optimal. But in very high-dimensional spaces, Euclidean distances tend to become inflated (this is an instance of the so-called "curse of dimensionality"). Running a dimensionality reduction algorithm such as :ref:`PCA` prior to k-means clustering can alleviate this problem and speed up the computations.
es_es: La inercia no es una métrica normalizada: sólo sabemos que los valores más bajos son mejores y cero es óptimo. Pero en espacios de muy alta dimensión, las distancias Euclidianas tienden a inflarse (este es un ejemplo de la llamada "maldición de la dimensión"). Ejecutar un algoritmo de reducción de dimensionalidad como :ref:`PCA` antes de un análisis de conglomerados mediante k-medias puede minimizar este problema y acelerar los cálculos.

source: K-means is often referred to as Lloyd's algorithm. In basic terms, the algorithm has three steps. The first step chooses the initial centroids, with the most basic method being to choose :math:`k` samples from the dataset :math:`X`. After initialization, K-means consists of looping between the two other steps. The first step assigns each sample to its nearest centroid. The second step creates new centroids by taking the mean value of all of the samples assigned to each previous centroid. The difference between the old and the new centroids are computed and the algorithm repeats these last two steps until this value is less than a threshold. In other words, it repeats until the centroids do not move significantly.
es_es: K-medias se conoce a menudo como el algoritmo de Lloyd. En términos básicos, el algoritmo tiene tres pasos. El primer paso elige los centroides iniciales, siendo el método más básico elegir :math:`k` muestras del conjunto de datos :math:`X`. Después de la inicialización, K-medias consiste en un bucle entre los otros dos pasos. El primer paso asigna cada muestra a su centroide más cercano. El segundo paso crea nuevos centroides tomando el valor medio de todas las muestras asignadas a cada centroide anterior. Se calcula la diferencia entre los centroides antiguos y los nuevos y el algoritmo repite estos dos últimos pasos hasta que este valor sea menor que un umbral. En otras palabras, se repite hasta que los centroides no se muevan de forma significativa.

source: K-means is equivalent to the expectation-maximization algorithm with a small, all-equal, diagonal covariance matrix.
es_es: K-medias es equivalente al algoritmo de maximización de la esperanza con una matriz de covarianzas pequeña, toda igual y diagonal.

source: The algorithm can also be understood through the concept of `Voronoi diagrams <https://en.wikipedia.org/wiki/Voronoi_diagram>`_. First the Voronoi diagram of the points is calculated using the current centroids. Each segment in the Voronoi diagram becomes a separate cluster. Secondly, the centroids are updated to the mean of each segment. The algorithm then repeats this until a stopping criterion is fulfilled. Usually, the algorithm stops when the relative decrease in the objective function between iterations is less than the given tolerance value. This is not the case in this implementation: iteration stops when centroids move less than the tolerance.
es_es: El algoritmo también puede entenderse a través del concepto de Voronoi diagrams <https://en.wikipedia.org/wiki/Voronoi_diagram>`_. En primer lugar, se calcula el diagrama de Voronoi de los puntos utilizando los centroides actuales. Cada segmento del diagrama de Voronoi se convierte en un conglomerado separado. En segundo lugar, los centroides se actualizan a la media de cada segmento. El algoritmo repite esto hasta que se cumpla un criterio de parada. Normalmente, el algoritmo se detiene cuando la disminución relativa de la función objetiva entre iteraciones es menor que el valor de tolerancia dado. Este no es el caso en esta implementación: la iteración se detiene cuando los centroides se mueven por debajo de la tolerancia.

source: Given enough time, K-means will always converge, however this may be to a local minimum. This is highly dependent on the initialization of the centroids. As a result, the computation is often done several times, with different initializations of the centroids. One method to help address this issue is the k-means++ initialization scheme, which has been implemented in scikit-learn (use the ``init='k-means++'`` parameter). This initializes the centroids to be (generally) distant from each other, leading to provably better results than random initialization, as shown in the reference.
es_es: Con suficiente tiempo, K-medias siempre convergerá sin embargo, esto puede ser a un mínimo local. Esto depende en gran medida de la inicialización de los centroides. Como resultado, el cálculo se realiza a menudo varias veces, con diferentes inicializaciones de los centroides. Un método que ayuda a resolver este problema es el esquema de inicialización de k-medias++, que se ha implementado en scikit-learn (utilice el parámetro ``init='k-means++'``). Esto inicializa los centroides para que sean (generalmente) distantes entre sí, conduciendo a resultados probadamente mejores que la inicialización aleatoria, como se muestra en la referencia.

source: K-means++ can also be called independently to select seeds for other clustering algorithms, see :func:`sklearn.cluster.kmeans_plusplus` for details and example usage.
es_es: K-medias++ también puede ser llamado independientemente para seleccionar semillas para otros algoritmos de análisis de conglomerados ver :func:`sklearn.cluster.kmeans_plus` para detalles y ejemplos de uso.

source: The algorithm supports sample weights, which can be given by a parameter ``sample_weight``. This allows to assign more weight to some samples when computing cluster centers and values of inertia. For example, assigning a weight of 2 to a sample is equivalent to adding a duplicate of that sample to the dataset :math:`X`.
es_es: El algoritmo admite pesos de las muestras, que pueden ser dados por un parámetro ``sample_weight``. Esto permite asignar más peso a algunas muestras cuando se calculan los centros de los conglomerados y los valores de inercia. Por ejemplo, asignar un peso de 2 a una muestra equivale a añadir un duplicado de esa muestra al conjunto de datos :math:`X`.

source: K-means can be used for vector quantization. This is achieved using the transform method of a trained model of :class:`KMeans`.
es_es: K-medias puede utilizarse para la cuantificación de vectores. Esto se consigue utilizando el método de transformación de un modelo entrenado de :class:`KMeans`.

source: Low-level parallelism
es_es: Paralelismo de bajo nivel

source: :class:`KMeans` benefits from OpenMP based parallelism through Cython. Small chunks of data (256 samples) are processed in parallel, which in addition yields a low memory footprint. For more details on how to control the number of threads, please refer to our :ref:`parallelism` notes.
es_es: :class:`KMeans` se beneficia del paralelismo basado en OpenMP a través de Cython. Pequeñas porciones de datos (256 muestras) se procesan en paralelo, lo que, además, supone un bajo consumo de memoria. Para más detalles sobre cómo controlar el número de hilos, por favor consulta nuestras notas de :ref:`parallelism`.

source: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_assumptions.py`: Demonstrating when k-means performs intuitively and when it does not
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_assumptions.py`: Demostración de cuándo k-medias funciona intuitivamente y cuándo no

source: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_digits.py`: Clustering handwritten digits
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_kmeans_digits.py`: Análisis de conglomerados de dígitos manuscritos

source: Mini Batch K-Means
es_es: K-medias de mini lotes

source: The :class:`MiniBatchKMeans` is a variant of the :class:`KMeans` algorithm which uses mini-batches to reduce the computation time, while still attempting to optimise the same objective function. Mini-batches are subsets of the input data, randomly sampled in each training iteration. These mini-batches drastically reduce the amount of computation required to converge to a local solution. In contrast to other algorithms that reduce the convergence time of k-means, mini-batch k-means produces results that are generally only slightly worse than the standard algorithm.
es_es: El :class:`MiniBatchKMeans` es una variante del algoritmo :class:`KMeans` que usa mini lotes para reducir el tiempo de cálculo, mientras se intenta optimizar la misma función objetivo. Los mini lotes son subconjuntos de los datos de entrada, muestreados aleatoriamente en cada iteración de entrenamiento. Estos mini lotes reducen drásticamente la cantidad de cálculo necesaria para converger a una solución local. En contraste con otros algoritmos que reducen el tiempo de convergencia de k-medias, k-medias en mini lotes produce resultados que generalmente son ligeramente peores que el algoritmo estándar.

source: The algorithm iterates between two major steps, similar to vanilla k-means. In the first step, :math:`b` samples are drawn randomly from the dataset, to form a mini-batch. These are then assigned to the nearest centroid. In the second step, the centroids are updated. In contrast to k-means, this is done on a per-sample basis. For each sample in the mini-batch, the assigned centroid is updated by taking the streaming average of the sample and all previous samples assigned to that centroid. This has the effect of decreasing the rate of change for a centroid over time. These steps are performed until convergence or a predetermined number of iterations is reached.
es_es: El algoritmo itera entre dos pasos principales, similares a las k-medias vanilla. En el primer paso, las :math:`b` muestras se extraen aleatoriamente del conjunto de datos, para formar un mini lote. Estos se asignan al centroide más cercano. En el segundo paso, se actualizan los centroides. En contraste con las k-medias, esto se hace sobre una base por muestra. Para cada muestra en el mini lote, el centroide asignado se actualiza tomando la media de transmisión de la muestra y todas las muestras anteriores asignadas a ese centroide. Esto tiene el efecto de disminuir la tasa de cambio de un centroide en el tiempo. Estos pasos se realizan hasta que se alcanza la convergencia o un número predeterminado de iteraciones.

source: :class:`MiniBatchKMeans` converges faster than :class:`KMeans`, but the quality of the results is reduced. In practice this difference in quality can be quite small, as shown in the example and cited reference.
es_es: :class:`MiniBatchKMeans` converge más rápido que :class:`KMeans`, pero la calidad de los resultados se reduce. En la práctica, esta diferencia de calidad puede ser bastante pequeña, como se muestra en el ejemplo y referencia citada.

source: :ref:`sphx_glr_auto_examples_cluster_plot_mini_batch_kmeans.py`: Comparison of KMeans and MiniBatchKMeans
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_mini_batch_kmeans.py`: Comparación de las KMedias y K-Medias de mini lotes

source: :ref:`sphx_glr_auto_examples_text_plot_document_clustering.py`: Document clustering using sparse MiniBatchKMeans
es_es: :ref:`sphx_glr_auto_examples_text_plot_document_clustering.py`: Análisis de conglomerados de documentos utilizando K-medias de mini lotes dispersos

source: Affinity Propagation
es_es: Propagación de la afinidad

source: :class:`AffinityPropagation` creates clusters by sending messages between pairs of samples until convergence. A dataset is then described using a small number of exemplars, which are identified as those most representative of other samples. The messages sent between pairs represent the suitability for one sample to be the exemplar of the other, which is updated in response to the values from other pairs. This updating happens iteratively until convergence, at which point the final exemplars are chosen, and hence the final clustering is given.
es_es: :class:`AffinityPropagation` crea conglomerados enviando mensajes entre pares de muestras hasta la convergencia. A continuación, se describe un conjunto de datos utilizando un pequeño número de ejemplares, que se identifican como los más representativos de otras muestras. Los mensajes enviados entre pares representan la idoneidad de una muestra para ser el ejemplar de la otra, que se actualiza en respuesta a los valores de otros pares. Esta actualización ocurre iterativamente hasta la convergencia, momento en el que se eligen los ejemplos finales, y por lo tanto se da el análisis de conglomerados final.
