Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/clustering.po
Languages: es_es

source: The index is the ratio of the sum of between-clusters dispersion and of within-cluster dispersion for all clusters (where dispersion is defined as the sum of distances squared):
es_es: El índice es la razón de la suma de la dispersión entre conglomerados y de la dispersión dentro del conglomerado para todos los conglomerados (donde la dispersión se define como la suma de las distancias al cuadrado):

source: In normal usage, the Calinski-Harabasz index is applied to the results of a cluster analysis:
es_es: En el uso normal, el índice de Calinski-Harabasz se aplica a los resultados de un análisis de conglomerados:

source: The score is fast to compute.
es_es: La puntuación es rápida de calcular.

source: The Calinski-Harabasz index is generally higher for convex clusters than other concepts of clusters, such as density based clusters like those obtained through DBSCAN.
es_es: El índice de Calinski-Harabasz suele ser mayor para los conglomerados convexos que para otros conceptos de conglomerados, entre ellos los conglomerados basados en la densidad como los obtenidos a través de DBSCAN.

source: For a set of data :math:`E` of size :math:`n_E` which has been clustered into :math:`k` clusters, the Calinski-Harabasz score :math:`s` is defined as the ratio of the between-clusters dispersion mean and the within-cluster dispersion:
es_es: Para un conjunto de datos :math:`E` de tamaño :math:`n_E` que ha sido agrupado en :math:`k` conglomerados, la puntuación de Calinski-Harabasz :math:`s` se define como la razón de la dispersión media entre los conglomerados y la dispersión dentro de los conglomerados:

source: where :math:`\mathrm{tr}(B_k)` is trace of the between group dispersion matrix and :math:`\mathrm{tr}(W_k)` is the trace of the within-cluster dispersion matrix defined by:
es_es: donde :math:`\mathrm{tr}(B_k)` es la traza de la matriz de la dispersión entre grupos y :math:`mathrm{tr}(W_k)` es la traza de la matriz de la dispersión dentro del conglomerado definida por:

source: with :math:`C_q` the set of points in cluster :math:`q`, :math:`c_q` the center of cluster :math:`q`, :math:`c_E` the center of :math:`E`, and :math:`n_q` the number of points in cluster :math:`q`.
es_es: con :math:`C_q` el conjunto de puntos en el conglomerado :math:`q`, :math:`c_q` el centro del conglomerado :math:`q`, :math:`c_E` el centro de :math:`E`, y :math:`n_q` el número de puntos del conglomerado :math:`q`.

source: Davies-Bouldin Index
es_es: Índice de Davies-Bouldin

source: If the ground truth labels are not known, the Davies-Bouldin index (:func:`sklearn.metrics.davies_bouldin_score`) can be used to evaluate the model, where a lower Davies-Bouldin index relates to a model with better separation between the clusters.
es_es: Si no se conocen las etiquetas basadas en la evidencia, se puede utilizar el índice de Davies-Bouldin (:func:`sklearn.metrics.davies_bouldin_score`) para evaluar el modelo, donde un índice de Davies-Bouldin más bajo se relaciona con un modelo con mejor separación entre los conglomerados.

source: This index signifies the average 'similarity' between clusters, where the similarity is a measure that compares the distance between clusters with the size of the clusters themselves.
es_es: Este índice significa la "similitud" promedio entre conglomerados, donde la similitud es una medida que compara la distancia entre conglomerados con el tamaño de los propios conglomerados.

source: Zero is the lowest possible score. Values closer to zero indicate a better partition.
es_es: El cero es la puntuación más baja posible. Los valores más cercanos a cero indican una mejor partición.

source: In normal usage, the Davies-Bouldin index is applied to the results of a cluster analysis as follows:
es_es: En el uso normal, el índice de Davies-Bouldin se aplica a los resultados de un análisis de conglomerados de la siguiente manera:

source: The computation of Davies-Bouldin is simpler than that of Silhouette scores.
es_es: El cálculo de Davies-Bouldin es más sencillo que el de las puntuaciones de Silueta.

source: The index is computed only quantities and features inherent to the dataset.
es_es: El índice sólo calcula las cantidades y características inherentes al conjunto de datos.

source: The Davies-Boulding index is generally higher for convex clusters than other concepts of clusters, such as density based clusters like those obtained from DBSCAN.
es_es: El índice de Davies-Boulding suele ser mayor para los conglomerados convexos que para otros conceptos de conglomerados, como los basados en la densidad, como los obtenidos con DBSCAN.

source: The usage of centroid distance limits the distance metric to Euclidean space.
es_es: El uso de la distancia centroide limita la métrica de la distancia al espacio Euclideano.

source: The index is defined as the average similarity between each cluster :math:`C_i` for :math:`i=1, ..., k` and its most similar one :math:`C_j`. In the context of this index, similarity is defined as a measure :math:`R_{ij}` that trades off:
es_es: El índice se define como la similitud promedio entre cada conglomerado :math:`C_i` para :math:`i=1, ..., k` y su más similar :math:`C_j`. En el contexto de este índice, la similitud se define como una medida :math:`R_{ij}` que compensa:

source: :math:`s_i`, the average distance between each point of cluster :math:`i` and the centroid of that cluster -- also know as cluster diameter.
es_es: :math:`s_i` la distancia promedio entre cada punto del conglomerado :math:`i` y el centroide de ese conglomerado -- también conocido como diámetro del conglomerado.

source: :math:`d_{ij}`, the distance between cluster centroids :math:`i` and :math:`j`.
es_es: :math:`d_{ij}`, la distancia entre los centroides de los conglomerados :math:`i` y :math:`j`.

source: A simple choice to construct :math:`R_{ij}` so that it is nonnegative and symmetric is:
es_es: Una opción sencilla para construir :math:`R_{ij}` de manera que sea no negativa y simétrica es:

source: Then the Davies-Bouldin index is defined as:
es_es: Entonces el índice de Davies-Bouldin se define como:

source: Contingency Matrix
es_es: Matriz de contingencia

source: Contingency matrix (:func:`sklearn.metrics.cluster.contingency_matrix`) reports the intersection cardinality for every true/predicted cluster pair. The contingency matrix provides sufficient statistics for all clustering metrics where the samples are independent and identically distributed and one doesn't need to account for some instances not being clustered.
es_es: La matriz de contingencia (:func:`sklearn.metrics.cluster.contingency_matrix`) informa de la cardinalidad de la intersección para cada par de conglomerados verdadero/predicho. La matriz de contingencia proporciona estadísticos suficientes para todas las métricas de agrupamiento (análisis de conglomerados) en las que las muestras son independientes e idénticamente distribuidas y no es necesario tener en cuenta que algunas instancias no están conglomeradas.

source: Here is an example::
es_es: Aquí hay un ejemplo::

source: The first row of output array indicates that there are three samples whose true cluster is "a". Of them, two are in predicted cluster 0, one is in 1, and none is in 2. And the second row indicates that there are three samples whose true cluster is "b". Of them, none is in predicted cluster 0, one is in 1 and two are in 2.
es_es: La primera fila del arreglo de salida indica que hay tres muestras cuyo verdadero conglomerado es "a". De ellas, dos están en el conglomerado predicho 0, una en el 1 y ninguna en el 2. Y la segunda fila indica que hay tres muestras cuyo verdadero conglomerado es "b". De ellas, ninguna está en el conglomerado previsto 0, una está en el 1 y dos en el 2.

source: A :ref:`confusion matrix <confusion_matrix>` for classification is a square contingency matrix where the order of rows and columns correspond to a list of classes.
es_es: Una :ref:`matriz de confusión <confusion_matrix>` para la clasificación es una matriz de contingencia cuadrada donde el orden de filas y columnas corresponden a una lista de clases.

source: Allows to examine the spread of each true cluster across predicted clusters and vice versa.
es_es: Permite examinar la propagación de cada conglomerado verdadero a través de conglomerados predichos, y viceversa.

source: The contingency table calculated is typically utilized in the calculation of a similarity statistic (like the others listed in this document) between the two clusterings.
es_es: La tabla de contingencia calculada suele utilizarse en el cálculo de un estadístico de similitud (como los demás que figuran en este documento) entre los dos agrupamientos.

source: Contingency matrix is easy to interpret for a small number of clusters, but becomes very hard to interpret for a large number of clusters.
es_es: La matriz de contingencia es fácil de interpretar para un pequeño número de conglomerados, pero se vuelve muy difícil de interpretar para un gran número de conglomerados.

source: It doesn't give a single metric to use as an objective for clustering optimisation.
es_es: No da una sola métrica para usar como objetivo para la optimización del agrupamiento.

source: Pair Confusion Matrix
es_es: Matriz de confusión por pares

source: The pair confusion matrix (:func:`sklearn.metrics.cluster.pair_confusion_matrix`) is a 2x2 similarity matrix
es_es: La matriz de confusión por pares (:func:`sklearn.metrics.cluster.pair_confusion_matrix`) es una matriz de similitud de 2x2

source: between two clusterings computed by considering all pairs of samples and counting pairs that are assigned into the same or into different clusters under the true and predicted clusterings.
es_es: entre dos agrupamientos calculados considerando todos los pares de muestras y contando los pares que se asignan en el mismo o en diferentes conglomerados bajo los agrupamientos verdaderos y predichos.

source: It has the following entries:
es_es: Tiene las siguientes entradas:

source: :math:`C_{00}` : number of pairs with both clusterings having the samples not clustered together
es_es: :math:`C_{00}` : número de pares con ambos agrupamientos que tienen las muestras no conglomeradas

source: :math:`C_{10}` : number of pairs with the true label clustering having the samples clustered together but the other clustering not having the samples clustered together
es_es: :math:`C_{10}` : número de pares con el agrupamiento de etiqueta verdadera que tiene las muestras conglomeradas pero el otro agrupamiento no tiene las muestras conglomeradas

source: :math:`C_{01}` : number of pairs with the true label clustering not having the samples clustered together but the other clustering having the samples clustered together
es_es: :math:`C_{01}` : número de pares con el agrupamiento de la etiqueta verdadera que no tiene las muestras conglomeradas pero el otro agrupamiento tiene las muestras conglomeradas

source: :math:`C_{11}` : number of pairs with both clusterings having the samples clustered together
es_es: :math:`C_{11}` : número de pares con ambos agrupamientos que tienen las muestras conglomeradas

source: Considering a pair of samples that is clustered together a positive pair, then as in binary classification the count of true negatives is :math:`C_{00}`, false negatives is :math:`C_{10}`, true positives is :math:`C_{11}` and false positives is :math:`C_{01}`.
es_es: Considerando un par de muestras que están conglomeradas como un par positivo, entonces como en la clasificación binaria el conteo de verdaderos negativos es :math:`C_{00}`, falsos negativos :math:`C_{10}`, verdaderos positivos :math:`C_{11}` y falsos positivos :math:`C_{01}`.

source: Perfectly matching labelings have all non-zero entries on the diagonal regardless of actual label values::
es_es: Las etiquetas que corresponden perfectamente tienen todas las entradas no nulas o iguales a cero en la diagonal, independientemente de los valores reales de las etiquetas::

source: Labelings that assign all classes members to the same clusters are complete but may not always be pure, hence penalized, and have some off-diagonal non-zero entries::
es_es: Las etiquetas que asignan a todos los miembros de las clases a los mismos conglomerados son completos, pero pueden no ser siempre puros, por lo que están penalizados, y tienen algunas entradas no nulas fuera de la diagonal::

source: The matrix is not symmetric::
es_es: La matriz no es simétrica::

source: If classes members are completely split across different clusters, the assignment is totally incomplete, hence the matrix has all zero diagonal entries::
es_es: Si los miembros de las clases están completamente divididos en diferentes conglomerados, la asignación es totalmente incompleta, por lo que la matriz tiene todas las entradas diagonales cero::
