Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/clustering.po
Languages: es_es

source: Affinity Propagation can be interesting as it chooses the number of clusters based on the data provided. For this purpose, the two important parameters are the *preference*, which controls how many exemplars are used, and the *damping factor* which damps the responsibility and availability messages to avoid numerical oscillations when updating these messages.
es_es: La Propagación de la Afinidad puede ser interesante ya que elige el número de conglomerados basado en los datos proporcionados. Para este propósito, los dos parámetros importantes son la *preferencia*, que controla cuántos ejemplares se utilizan, y el *factor de amortiguación* que reduce la responsabilidad y la disponibilidad de los mensajes para evitar oscilaciones numéricas al actualizar estos mensajes.

source: The main drawback of Affinity Propagation is its complexity. The algorithm has a time complexity of the order :math:`O(N^2 T)`, where :math:`N` is the number of samples and :math:`T` is the number of iterations until convergence. Further, the memory complexity is of the order :math:`O(N^2)` if a dense similarity matrix is used, but reducible if a sparse similarity matrix is used. This makes Affinity Propagation most appropriate for small to medium sized datasets.
es_es: El principal inconveniente de la Propagación de la Afinidad es su complejidad. El algoritmo tiene una complejidad temporal del orden :math:`O(N^2 T)`, donde :math:`N` es el número de muestras y :math:`T` es el número de iteraciones hasta la convergencia. Además, la complejidad de la memoria es del orden :math:`O(N^2)` si se utiliza una matriz de similitud densa, pero reducible si se utiliza una matriz de similitud dispersa. Esto hace que la Propagación de la Afinidad sea la más apropiada para los conjuntos de datos de tamaño pequeño o mediano.

source: :ref:`sphx_glr_auto_examples_cluster_plot_affinity_propagation.py`: Affinity Propagation on a synthetic 2D datasets with 3 classes.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_affinity_propagation.py`: Propagación de la Afinidad en un conjunto de datos sintéticos 2D con 3 clases.

source: :ref:`sphx_glr_auto_examples_applications_plot_stock_market.py` Affinity Propagation on Financial time series to find groups of companies
es_es: :ref:`sphx_glr_auto_examples_applications_plot_stock_market.py` Propagación de afinidad en series temporales financieras para encontrar grupos de empresas

source: **Algorithm description:** The messages sent between points belong to one of two categories. The first is the responsibility :math:`r(i, k)`, which is the accumulated evidence that sample :math:`k` should be the exemplar for sample :math:`i`. The second is the availability :math:`a(i, k)` which is the accumulated evidence that sample :math:`i` should choose sample :math:`k` to be its exemplar, and considers the values for all other samples that :math:`k` should be an exemplar. In this way, exemplars are chosen by samples if they are (1) similar enough to many samples and (2) chosen by many samples to be representative of themselves.
es_es: **Descripción del algoritmo:** Los mensajes enviados entre puntos pertenecen a una de las dos categorías. La primera es la responsabilidad :math:`r(i, k)`, que es la evidencia acumulada de que la muestra :math:`k` debe ser el ejemplar para la muestra :math:`i`. La segunda es la disponibilidad :math:`a(i, k)` que es la evidencia acumulada de que la muestra :math:`i` debe elegir la muestra :math:`k` para ser su ejemplar, y considera los valores para todas las demás muestras que :math:`k` debe ser un ejemplar. De este modo, los ejemplares son elegidos por las muestras si son (1) lo suficientemente similares a muchas muestras y (2) elegidos por muchas muestras para ser representativos de sí mismos.

source: More formally, the responsibility of a sample :math:`k` to be the exemplar of sample :math:`i` is given by:
es_es: Más formalmente, la responsabilidad de una muestra :math:`k` de ser el ejemplar de la muestra :math:`i` viene dada por:

source: Where :math:`s(i, k)` is the similarity between samples :math:`i` and :math:`k`. The availability of sample :math:`k` to be the exemplar of sample :math:`i` is given by:
es_es: Donde :math:`s(i, k)` es la similitud entre las muestras :math:`i` y :math:`k`. La disponibilidad de la muestra :math:`k` para ser el ejemplar de la muestra :math:`i` viene dada por:

source: To begin with, all values for :math:`r` and :math:`a` are set to zero, and the calculation of each iterates until convergence. As discussed above, in order to avoid numerical oscillations when updating the messages, the damping factor :math:`\lambda` is introduced to iteration process:
es_es: Para empezar, todos los valores de :math:`r` y :math:`a` se establecen en cero, y el cálculo de cada uno itera hasta la convergencia. Como se ha comentado anteriormente, para evitar las oscilaciones numéricas al actualizar los mensajes, se introduce el factor de amortiguación :math:`\lambda` en el proceso de iteración:

source: where :math:`t` indicates the iteration times.
es_es: donde :math:`t` indica los tiempos de iteración.

source: Mean Shift
es_es: Media desplazada

source: :class:`MeanShift` clustering aims to discover *blobs* in a smooth density of samples. It is a centroid based algorithm, which works by updating candidates for centroids to be the mean of the points within a given region. These candidates are then filtered in a post-processing stage to eliminate near-duplicates to form the final set of centroids.
es_es: El análisis de conglomerados por :class:`MeanShift` tiene como objetivo descubrir *manchas* en una densidad suave de muestras. Se trata de un algoritmo basado en el centroide, que funciona actualizando los candidatos a centroides para que sean la media de los puntos dentro de una región determinada. Estos candidatos se filtran en una etapa de post-procesamiento para eliminar los duplicados cercanos y formar el conjunto final de centroides.

source: Given a candidate centroid :math:`x_i` for iteration :math:`t`, the candidate is updated according to the following equation:
es_es: Dado un centroide candidato :math:`x_i` para la iteración :math:`t`, el candidato se actualiza según la siguiente ecuación:

source: Where :math:`N(x_i)` is the neighborhood of samples within a given distance around :math:`x_i` and :math:`m` is the *mean shift* vector that is computed for each centroid that points towards a region of the maximum increase in the density of points. This is computed using the following equation, effectively updating a centroid to be the mean of the samples within its neighborhood:
es_es: Donde :math:`N(x_i)` es el vecindario de muestras dentro de una distancia determinada alrededor de :math:`x_i` y :math:`m` es el vector de *medias desplazadas* que se calcula para cada centroide que apunta hacia una región de máximo aumento de la densidad de puntos. Esto se calcula utilizando la siguiente ecuación, actualizando efectivamente un centroide para que sea la media de las muestras dentro de su vecindario:

source: The algorithm automatically sets the number of clusters, instead of relying on a parameter ``bandwidth``, which dictates the size of the region to search through. This parameter can be set manually, but can be estimated using the provided ``estimate_bandwidth`` function, which is called if the bandwidth is not set.
es_es: El algoritmo establece automáticamente el número de conglomerados, en lugar de depender de un parámetro ``bandwidth``, que dicta el tamaño de la región a buscar. Este parámetro se puede definir manualmente, pero se puede estimar usando la función proporcionada ``estimate_bandwidth``, que se llama si el bandwidth no está establecido.

source: The algorithm is not highly scalable, as it requires multiple nearest neighbor searches during the execution of the algorithm. The algorithm is guaranteed to converge, however the algorithm will stop iterating when the change in centroids is small.
es_es: El algoritmo no es altamente escalable, ya que requiere múltiples búsquedas del vecino más cercano durante la ejecución del algoritmo. El algoritmo está garantizado para converger, sin embargo, el algoritmo dejará de iterar cuando el cambio en los centroides sea pequeño.

source: Labelling a new sample is performed by finding the nearest centroid for a given sample.
es_es: El etiquetado de una nueva muestra se realiza buscando el centroide más cercano para una muestra determinada.

source: :ref:`sphx_glr_auto_examples_cluster_plot_mean_shift.py`: Mean Shift clustering on a synthetic 2D datasets with 3 classes.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_mean_shift.py`: El análisis de conglomerados por media desplazada en un conjunto de datos 2D sintéticos con 3 clases.

source: Spectral clustering
es_es: Análisis espectral de conglomerados

source: :class:`SpectralClustering` performs a low-dimension embedding of the affinity matrix between samples, followed by clustering, e.g., by KMeans, of the components of the eigenvectors in the low dimensional space. It is especially computationally efficient if the affinity matrix is sparse and the `amg` solver is used for the eigenvalue problem (Note, the `amg` solver requires that the `pyamg <https://github.com/pyamg/pyamg>`_ module is installed.)
es_es: :class:`SpectralClustering` realiza una incrustación de baja dimensión de la matriz de afinidad entre las muestras, seguida del agrupamiento, por ejemplo, mediante KMedias, de los componentes de los autovectores en el espacio de baja dimensión. Es especialmente eficiente desde el punto de vista computacional si la matriz de afinidad es dispersa y se utiliza el solucionador `amg` para el problema de autovalores (Nota, el solucionador `amg` requiere que el módulo `pyamg <https://github.com/pyamg/pyamg>`_ esté instalado.)

source: The present version of SpectralClustering requires the number of clusters to be specified in advance. It works well for a small number of clusters, but is not advised for many clusters.
es_es: La versión actual de SpectralClustering requiere que se especifique de antemano el número de conglomerados. Funciona bien para un número pequeño de conglomerados, pero no se aconseja para muchos conglomerados.

source: For two clusters, SpectralClustering solves a convex relaxation of the `normalised cuts <https://people.eecs.berkeley.edu/~malik/papers/SM-ncut.pdf>`_ problem on the similarity graph: cutting the graph in two so that the weight of the edges cut is small compared to the weights of the edges inside each cluster. This criteria is especially interesting when working on images, where graph vertices are pixels, and weights of the edges of the similarity graph are computed using a function of a gradient of the image.
es_es: Para dos conglomerados, SpectralClustering resuelve una relajación convexa del problema de los `cortes normalizados <https://people.eecs.berkeley.edu/~malik/papers/SM-ncut.pdf>`_ en el grafo de similitud: cortar el grafo en dos para que el peso de las aristas cortadas sea pequeño comparado con los pesos de las aristas dentro de cada conglomerado. Este criterio es especialmente interesante cuando se trabaja con imágenes, en las que los vértices del grafo son píxeles, y los pesos de las aristas del grafo de similitud se calculan utilizando una función del gradiente de la imagen.

source: Transforming distance to well-behaved similarities
es_es: Transformación de la distancia en similitudes bien avenidas

source: Note that if the values of your similarity matrix are not well distributed, e.g. with negative values or with a distance matrix rather than a similarity, the spectral problem will be singular and the problem not solvable. In which case it is advised to apply a transformation to the entries of the matrix. For instance, in the case of a signed distance matrix, is common to apply a heat kernel::
es_es: Tenga en cuenta que si los valores de su matriz de similitud no están bien distribuidos, por ejemplo, con valores negativos o con una matriz de distancias en lugar de similitud, el problema espectral será singular y el problema no se podrá resolver. En ese caso, se aconseja aplicar una transformación a las entradas de la matriz. Por ejemplo, en el caso de una matriz de distancias es común aplicar un kernel de calor::

source: See the examples for such an application.
es_es: Vea los ejemplos para una aplicación de este tipo.

source: :ref:`sphx_glr_auto_examples_cluster_plot_segmentation_toy.py`: Segmenting objects from a noisy background using spectral clustering.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_segmentation_toy.py`: Segmentación de objetos de un contexto ruidoso utilizando análisis espectral de conglomerados.

source: :ref:`sphx_glr_auto_examples_cluster_plot_coin_segmentation.py`: Spectral clustering to split the image of coins in regions.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_coin_segmentation.py`: Análisis Espectral de Conglomerados para dividir la imagen de las monedas en regiones.

source: Different label assignment strategies
es_es: Diferentes estrategias de asignación de etiquetas

source: Different label assignment strategies can be used, corresponding to the ``assign_labels`` parameter of :class:`SpectralClustering`. ``"kmeans"`` strategy can match finer details, but can be unstable. In particular, unless you control the ``random_state``, it may not be reproducible from run-to-run, as it depends on random initialization. The alternative ``"discretize"`` strategy is 100% reproducible, but tends to create parcels of fairly even and geometrical shape.
es_es: Se pueden utilizar diferentes estrategias de asignación de etiquetas, correspondientes al parámetro ``assign_labels`` de :class:`SpectralClustering`. La estrategia ``"kmeans"`` puede coincidir con detalles más precisos, pero puede ser inestable. En particular, a menos que controle el ``random_state``, puede no ser reproducible de una ejecución a otra, ya que depende de una inicialización aleatoria. La estrategia alternativa ``"discretize"`` es 100% reproducible, pero tiende a crear parcelas de forma bastante uniforme y geométrica.

source: Spectral Clustering Graphs
es_es: Grafos de Análisis Espectral de conglomerados

source: Spectral Clustering can also be used to partition graphs via their spectral embeddings. In this case, the affinity matrix is the adjacency matrix of the graph, and SpectralClustering is initialized with `affinity='precomputed'`::
es_es: El Análisis Espectral de Conglomerados también puede utilizarse para dividir los grafos a través de sus incrustaciones espectrales. En este caso, la matriz de afinidad es la matriz de adyacencia del grafo, y SpectralClustering se inicializa con `affinity='precomputed'`::

source: Hierarchical clustering
es_es: Análisis de conglomerados jerárquicos

source: Hierarchical clustering is a general family of clustering algorithms that build nested clusters by merging or splitting them successively. This hierarchy of clusters is represented as a tree (or dendrogram). The root of the tree is the unique cluster that gathers all the samples, the leaves being the clusters with only one sample. See the `Wikipedia page <https://en.wikipedia.org/wiki/Hierarchical_clustering>`_ for more details.
es_es: El análisis de conglomerados jerárquicos es una familia general de los algoritmos de agrupamiento que construyen conglomerados anidados fusionándolos o dividiéndolos sucesivamente. Esta jerarquía de conglomerados se representa como un árbol (o dendrograma). La raíz del árbol es el conglomerado único que reúne todas las muestras, siendo las hojas los conglomerados con una sola muestra. Véase la página de la `Wikipedia <https://en.wikipedia.org/wiki/Hierarchical_clustering>`_ para más detalles.

source: The :class:`AgglomerativeClustering` object performs a hierarchical clustering using a bottom up approach: each observation starts in its own cluster, and clusters are successively merged together. The linkage criteria determines the metric used for the merge strategy:
es_es: El objeto :class:`AgglomerativeClustering` realiza un análisis de conglomerados jerárquicos utilizando un enfoque ascendente: cada observación comienza en su propio conglomerado y los conglomerados se fusionan sucesivamente. El criterio de enlace determina la métrica utilizada para la estrategia de fusión:

source: **Ward** minimizes the sum of squared differences within all clusters. It is a variance-minimizing approach and in this sense is similar to the k-means objective function but tackled with an agglomerative hierarchical approach.
es_es: **Ward** minimiza la suma de las diferencias al cuadrado dentro de todos los conglomerados. Se trata de un enfoque de minimización de la varianza y, en este sentido, es similar a la función objetivo de k-medias pero abordada con un enfoque jerárquico aglomerativo.

source: **Maximum** or **complete linkage** minimizes the maximum distance between observations of pairs of clusters.
es_es: **Máximo** o **enlazamiento completo** minimiza la distancia máxima entre las observaciones de pares de conglomerados.

source: **Average linkage** minimizes the average of the distances between all observations of pairs of clusters.
es_es: **Enlazamiento promedio** minimiza el promedio de las distancias entre todas las observaciones de pares de conglomerados.

source: **Single linkage** minimizes the distance between the closest observations of pairs of clusters.
es_es: El **enlazamiento simple** minimiza la distancia entre las observaciones más cercanas de los pares de conglomerados.

source: :class:`AgglomerativeClustering` can also scale to large number of samples when it is used jointly with a connectivity matrix, but is computationally expensive when no connectivity constraints are added between samples: it considers at each step all the possible merges.
es_es: :class:`AglomerativeClustering` también puede escalar a un gran número de muestras cuando se utiliza conjuntamente con una matriz de conectividad, pero es computacionalmente costoso cuando no se añaden restricciones de conectividad entre las muestras: considera en cada paso todas las fusiones posibles.

source: The :class:`FeatureAgglomeration` uses agglomerative clustering to group together features that look very similar, thus decreasing the number of features. It is a dimensionality reduction tool, see :ref:`data_reduction`.
es_es: :class:`FeatureAgglomeration` utiliza el agrupamiento aglomerativo para agrupar características muy similares, disminuyendo así el número de características. Es una herramienta de reducción de la dimensionalidad, véase :ref:`data_reduction`.

source: Different linkage type: Ward, complete, average, and single linkage
es_es: Diferentes tipos de enlazamientos: Ward, completo, promedio y enlazamiento simple

source: :class:`AgglomerativeClustering` supports Ward, single, average, and complete linkage strategies.
es_es: :class:`AgglomerativeClustering` admite las estrategias de enlazamientos Ward, simple, promedio, y completos.

source: Agglomerative cluster has a "rich get richer" behavior that leads to uneven cluster sizes. In this regard, single linkage is the worst strategy, and Ward gives the most regular sizes. However, the affinity (or distance used in clustering) cannot be varied with Ward, thus for non Euclidean metrics, average linkage is a good alternative. Single linkage, while not robust to noisy data, can be computed very efficiently and can therefore be useful to provide hierarchical clustering of larger datasets. Single linkage can also perform well on non-globular data.
es_es: El conglomerado aglomerativo tiene un comportamiento de "los ricos se hacen más ricos" que conduce a tamaños de conglomerado desiguales. En este sentido, el enlazamiento simple es la peor estrategia, y Ward da los tamaños más regulares. Sin embargo, la afinidad (o distancia utilizada en la conglomeración) no puede variarse con Ward, por lo que para las métricas no Euclidianas, el enlazamiento promedio es una buena alternativa. El enlazamiento simple, aunque no es robusto frente a los datos ruidosos, puede calcularse de forma muy eficiente y, por tanto, puede ser útil para proporcionar un análisis de conglomerados jerárquicos de conjuntos de datos más grandes. El enlazamiento simple también puede funcionar bien con datos no globulares.

source: :ref:`sphx_glr_auto_examples_cluster_plot_digits_linkage.py`: exploration of the different linkage strategies in a real dataset.
es_es: :ref:`sphx_glr_auto_examples_cluster_plot_digits_linkage.py`: exploración de las diferentes estrategias de enlazamientos en un conjunto de datos real.

source: Visualization of cluster hierarchy
es_es: Visualización de la jerarquía de conglomerados

source: It's possible to visualize the tree representing the hierarchical merging of clusters as a dendrogram. Visual inspection can often be useful for understanding the structure of the data, though more so in the case of small sample sizes.
es_es: Es posible visualizar el árbol que representa la fusión jerárquica de conglomerados como un dendrograma. La inspección visual a menudo puede ser a menudo útil para comprender la estructura de los datos, aunque más en el caso de tamaños de muestra pequeños.

source: Adding connectivity constraints
es_es: Añadir restricciones de conectividad

source: An interesting aspect of :class:`AgglomerativeClustering` is that connectivity constraints can be added to this algorithm (only adjacent clusters can be merged together), through a connectivity matrix that defines for each sample the neighboring samples following a given structure of the data. For instance, in the swiss-roll example below, the connectivity constraints forbid the merging of points that are not adjacent on the swiss roll, and thus avoid forming clusters that extend across overlapping folds of the roll.
es_es: Un aspecto interesante de :class:`AgglomerativeClustering`es que a este algoritmo se le pueden añadir restricciones de conectividad (sólo se pueden fusionar conglomerados adyacentes), a través de una matriz de conectividad que define para cada muestra las muestras vecinas siguiendo una estructura determinada de los datos. Por ejemplo, en el ejemplo de brazo de gitano que aparece a continuación, las restricciones de conectividad prohíben la fusión de puntos que no sean adyacentes en el brazo gitano, y evitar así la formación de conglomerados que se extiendan a través de partes o pliegues superpuestos del rollo.

source: These constraint are useful to impose a certain local structure, but they also make the algorithm faster, especially when the number of the samples is high.
es_es: Estas restricciones son útiles para imponer una cierta estructura local, pero también hacen que el algoritmo sea más rápido, especialmente cuando el número de muestras es alto.
