Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/compose.po
Languages: es_es

source: Pipelines and composite estimators
es_es: Pipelines y estimadores compuestos

source: Transformers are usually combined with classifiers, regressors or other estimators to build a composite estimator. The most common tool is a :ref:`Pipeline <pipeline>`. Pipeline is often used in combination with :ref:`FeatureUnion <feature_union>` which concatenates the output of transformers into a composite feature space. :ref:`TransformedTargetRegressor <transformed_target_regressor>` deals with transforming the :term:`target` (i.e. log-transform :term:`y`). In contrast, Pipelines only transform the observed data (:term:`X`).
es_es: Los transformadores generalmente se combinan con clasificadores, regresores u otros estimadores para construir un estimador compuesto. La herramienta más común es un :ref:`Pipeline <pipeline>`. El pipeline se utiliza a menudo en combinación con :ref:`FeatureUnion <feature_union>` que concatena la salida de los transformadores en un espacio compuesto de características. :ref:`TransformedTargetRegressor <transformed_target_regressor>` trata de transformar el :term:`target` (i.e. log-transform :term:`y`). En contraste, los pipelines sólo transforman los datos observados (:term:`X`).

source: Pipeline: chaining estimators
es_es: Pipeline: estimadores encadenados

source: :class:`Pipeline` can be used to chain multiple estimators into one. This is useful as there is often a fixed sequence of steps in processing the data, for example feature selection, normalization and classification. :class:`Pipeline` serves multiple purposes here:
es_es: :class:`Pipeline` puede ser usado para encadenar múltiples estimadores en uno. Esto es útil ya que a menudo hay una secuencia fija de pasos en el procesamiento de los datos, por ejemplo selección de características, normalización y clasificación. :class:`Pipeline` sirve varios propósitos aquí:

source: Convenience and encapsulation
es_es: Conveniencia y encapsulación

source: You only have to call :term:`fit` and :term:`predict` once on your data to fit a whole sequence of estimators.
es_es: Solo tienes que llamar a :term:`fit` y :term:`predict` una vez en tus datos para ajustar toda una secuencia de estimadores.

source: Joint parameter selection
es_es: Selección conjunta de parámetros

source: You can :ref:`grid search <grid_search>` over parameters of all estimators in the pipeline at once.
es_es: Puedes utilizar :ref:`búsqueda en cuadrícula <grid_search>` sobre los parámetros de todos los estimadores en el pipeline a la vez.

source: Safety
es_es: Seguridad

source: Pipelines help avoid leaking statistics from your test data into the trained model in cross-validation, by ensuring that the same samples are used to train the transformers and predictors.
es_es: Los pipelines ayudan a evitar la fuga de estadísticas de los datos de prueba en el modelo entrenado en la validación cruzada, asegurando que se utilizan las mismas muestras para entrenar los transformadores y los predictores.

source: All estimators in a pipeline, except the last one, must be transformers (i.e. must have a :term:`transform` method). The last estimator may be any type (transformer, classifier, etc.).
es_es: Todos los estimadores en un pipeline, excepto el último, deben ser transformadores (es decir, debe tener un método :term:`transform`). El último estimador puede ser cualquier tipo (transformador, clasificador, etc.).

source: Usage
es_es: Uso

source: Construction
es_es: Construcción

source: The :class:`Pipeline` is built using a list of ``(key, value)`` pairs, where the ``key`` is a string containing the name you want to give this step and ``value`` is an estimator object::
es_es: El :class:`Pipeline` está construido usando una lista de pares ``(key, value)``, donde la ``key`` es una cadena que contiene el nombre que quieres dar este paso y ``value`` es un objeto de estimación::

source: The utility function :func:`make_pipeline` is a shorthand for constructing pipelines; it takes a variable number of estimators and returns a pipeline, filling in the names automatically::
es_es: La función de utilidad :func:`make_pipeline` es un atajo para construir pipelines; toma un número variable de estimadores y devuelve un pipeline, rellenando los nombres automáticamente::

source: Accessing steps
es_es: Acceso a los steps (pasos)

source: The estimators of a pipeline are stored as a list in the ``steps`` attribute, but can be accessed by index or name by indexing (with ``[idx]``) the Pipeline::
es_es: Los estimadores de un pipeline se almacenan como una lista en el atributo ``steps`` (pasos), pero se puede acceder por índice o nombre indexando (con ``[idx]``) el Pipeline::

source: Pipeline's `named_steps` attribute allows accessing steps by name with tab completion in interactive environments::
es_es: El atributo `named_steps` del pipeline permite acceder a los pasos por su nombre con una autocompletado con tabulación en entornos interactivos::

source: A sub-pipeline can also be extracted using the slicing notation commonly used for Python Sequences such as lists or strings (although only a step of 1 is permitted). This is convenient for performing only some of the transformations (or their inverse):
es_es: También se puede extraer una sub-línea utilizando la notación de corte comúnmente utilizada para secuencias de Python como listas o cadenas (aunque sólo se permite un paso de 1). Esto es conveniente para realizar sólo algunas de las transformaciones (o su inversa):

source: Nested parameters
es_es: Parámetros anidados

source: Parameters of the estimators in the pipeline can be accessed using the ``<estimator>__<parameter>`` syntax::
es_es: Puedes acceder a los parámetros de los estimadores en el pipeline usando la sintaxis ``<estimator>__<parameter>```::

source: This is particularly important for doing grid searches::
es_es: Esto es particularmente importante para realizar búsquedas en cuadrículas::

source: Individual steps may also be replaced as parameters, and non-final steps may be ignored by setting them to ``'passthrough'``::
es_es: Los pasos individuales también pueden ser reemplazados como parámetros, y los pasos no finales pueden ser ignorados estableciéndolos a ``'passthrough'``::

source: The estimators of the pipeline can be retrieved by index:
es_es: Los estimadores del pipeline pueden ser recuperados por el índice:

source: or by name::
es_es: o por el nombre::

source: Notes
es_es: Notas

source: Calling ``fit`` on the pipeline is the same as calling ``fit`` on each estimator in turn, ``transform`` the input and pass it on to the next step. The pipeline has all the methods that the last estimator in the pipeline has, i.e. if the last estimator is a classifier, the :class:`Pipeline` can be used as a classifier. If the last estimator is a transformer, again, so is the pipeline.
es_es: Llamar a ``fit`` en el pipeline es lo mismo que llamar a ``fit`` en cada estimador a su vez, ``transform`` la entrada y pasarla al siguiente paso. El pipeline tiene todos los métodos que tiene el último estimador del pipeline, es decir, si el último estimador es un clasificador, el :class:`Pipeline` puede ser utilizado como un clasificador. Si el último estimador es un transformador, también lo es la tubería.

source: Caching transformers: avoid repeated computation
es_es: Transformadores de caché: evitar cálculos repetidos

source: Fitting transformers may be computationally expensive. With its ``memory`` parameter set, :class:`Pipeline` will cache each transformer after calling ``fit``. This feature is used to avoid computing the fit transformers within a pipeline if the parameters and input data are identical. A typical example is the case of a grid search in which the transformers can be fitted only once and reused for each configuration.
es_es: El ajuste de los transformadores puede ser costoso desde el punto de vista computacional. Con su parámetro ``memory`` ya establecido, :class:`Pipeline` almacenará en caché cada transformador después de llamar a ``fit``. Esta característica se utiliza para evitar el cálculo de los transformadores de ajuste dentro de un pipeline si los parámetros y los datos de entrada son idénticos. Un ejemplo típico es el caso de una búsqueda en cuadrícula en la que los transformadores pueden ajustarse sólo una vez y reutilizarse para cada configuración.

source: The parameter ``memory`` is needed in order to cache the transformers. ``memory`` can be either a string containing the directory where to cache the transformers or a `joblib.Memory <https://pythonhosted.org/joblib/memory.html>`_ object::
es_es: El parámetro ``memory`` es necesario para almacenar en caché los transformadores. ``memory`` puede ser una cadena que contiene el directorio donde guardar los transformadores en caché o un `joblib.Memory <https://pythonhosted.org/joblib/memory.html>`_ objeto::

source: **Side effect of caching transformers**
es_es: **Efecto colateral de los transformadores de caché**

source: Using a :class:`Pipeline` without cache enabled, it is possible to inspect the original instance such as::
es_es: Usando un :class:`Pipeline` sin caché activado, es posible inspeccionar la instancia original como en::

source: Enabling caching triggers a clone of the transformers before fitting. Therefore, the transformer instance given to the pipeline cannot be inspected directly. In following example, accessing the :class:`PCA` instance ``pca2`` will raise an ``AttributeError`` since ``pca2`` will be an unfitted transformer. Instead, use the attribute ``named_steps`` to inspect estimators within the pipeline::
es_es: La activación del almacenamiento en caché desencadena un clon de los transformadores antes del ajuste. Por lo tanto, la instancia del transformador del pipeline no puede ser inspeccionada directamente. En el siguiente ejemplo, el acceso a la instancia de :class:`PCA` ``pca2`` generará un ``AttributeError`` ya que ``pca2`` será un transformador no ajustado. En su lugar, utiliza el atributo ``named_steps`` para inspeccionar los estimadores dentro del pipeline::

source: Transforming target in regression
es_es: Transformación del objetivo en regresión

source: :class:`~sklearn.compose.TransformedTargetRegressor` transforms the targets ``y`` before fitting a regression model. The predictions are mapped back to the original space via an inverse transform. It takes as an argument the regressor that will be used for prediction, and the transformer that will be applied to the target variable::
es_es: :class:`~sklearn.compose.TransformedTargetRegressor` transforma los objetivos ``y`` antes de ajustar un modelo de regresión. Las predicciones se devuelven al espacio original mediante una transformación inversa. Toma como argumento el regresor que se utilizará para la predicción, y el transformador que se aplicará a la variable objetivo::

source: For simple transformations, instead of a Transformer object, a pair of functions can be passed, defining the transformation and its inverse mapping::
es_es: Para transformaciones simples, en lugar de un objeto Transformador, puedes pasar un par de funciones, para definir la transformación y su mapeo inverso::

source: Subsequently, the object is created as::
es_es: Posteriormente, el objeto es creado como::

source: By default, the provided functions are checked at each fit to be the inverse of each other. However, it is possible to bypass this checking by setting ``check_inverse`` to ``False``::
es_es: Por defecto, las funciones proporcionadas se comprueban en cada ajuste para ser la inversa de cada una. Sin embargo, es posible evitar esta comprobación estableciendo ``check_inverse`` a ``False``::

source: The transformation can be triggered by setting either ``transformer`` or the pair of functions ``func`` and ``inverse_func``. However, setting both options will raise an error.
es_es: La transformación puede ser activada estableciendo ``transformer`` o el par de funciones ``func`` y ``inverse_func``. Sin embargo, ambas opciones provocarán un error.

source: FeatureUnion: composite feature spaces
es_es: FeatureUnion: espacios de características compuestas

source: :class:`FeatureUnion` combines several transformer objects into a new transformer that combines their output. A :class:`FeatureUnion` takes a list of transformer objects. During fitting, each of these is fit to the data independently. The transformers are applied in parallel, and the feature matrices they output are concatenated side-by-side into a larger matrix.
es_es: :class:`FeatureUnion` combina varios objetos transformadores en un nuevo transformador que combina su salida. Una :class:`FeatureUnion` toma una lista de objetos transformadores. Durante el ajuste, cada uno de ellos se ajusta a los datos de forma independiente. Los transformadores se aplican en paralelo, y las matrices de características que producen se concatenan una al lado de la otra en una matriz mayor.

source: When you want to apply different transformations to each field of the data, see the related class :class:`~sklearn.compose.ColumnTransformer` (see :ref:`user guide <column_transformer>`).
es_es: Cuando quieras aplicar diferentes transformaciones a cada campo de los datos, consulta la clase relacionada :class:`~sklearn.compose.ColumnTransformer` (ver :ref:`guía de usuario <column_transformer>`).

source: :class:`FeatureUnion` serves the same purposes as :class:`Pipeline` - convenience and joint parameter estimation and validation.
es_es: :class:`FeatureUnion` tiene los mismos propósitos que :class:`Pipeline` - conveniencia y estimación y validación de parámetros conjuntos.

source: :class:`FeatureUnion` and :class:`Pipeline` can be combined to create complex models.
es_es: :class:`FeatureUnion` y :class:`Pipeline` pueden ser combinados para crear modelos complejos.

source: (A :class:`FeatureUnion` has no way of checking whether two transformers might produce identical features. It only produces a union when the feature sets are disjoint, and making sure they are is the caller's responsibility.)
es_es: (Un :class:`FeatureUnion` no tiene forma de comprobar si dos transformadores pueden producir características idénticas. Sólo produce una unión cuando los conjuntos de características son disjuntos, y asegurarse de que lo son es responsabilidad de quien invoca dicha clase.)

source: A :class:`FeatureUnion` is built using a list of ``(key, value)`` pairs, where the ``key`` is the name you want to give to a given transformation (an arbitrary string; it only serves as an identifier) and ``value`` is an estimator object::
es_es: Una :class:`FeatureUnion` se construye utilizando una lista de pares ``(key, value)``, donde ``key`` es el nombre que se quiere dar a una determinada transformación (es una cadena arbitraria; sólo sirve como identificador) y ``valor`` es un objeto estimador::

source: Like pipelines, feature unions have a shorthand constructor called :func:`make_union` that does not require explicit naming of the components.
es_es: Al igual que las pipelines, las uniones de características tienen un constructor abreviado llamado :func:`make_union` que no requiere nombrar explícitamente los componentes.

source: Like ``Pipeline``, individual steps may be replaced using ``set_params``, and ignored by setting to ``'drop'``::
es_es: Como ``Pipeline``, los pasos individuales pueden ser reemplazados usando ``set_params``, e ignorados con la configuración de ``'drop'``::

source: ColumnTransformer for heterogeneous data
es_es: ColumnTransformer para datos heterogéneos

source: Many datasets contain features of different types, say text, floats, and dates, where each type of feature requires separate preprocessing or feature extraction steps. Often it is easiest to preprocess data before applying scikit-learn methods, for example using `pandas <https://pandas.pydata.org/>`__. Processing your data before passing it to scikit-learn might be problematic for one of the following reasons:
es_es: Muchos conjuntos de datos contienen características de diferentes tipos, por ejemplo, texto, flotantes y fechas, donde cada tipo de característica requiere pasos separados de preprocesamiento o extracción de características. A menudo es más fácil preprocesar los datos antes de aplicar los métodos de scikit-learn, por ejemplo, utilizando `pandas <https://pandas.pydata.org/>`__. Procesar los datos antes de pasarlos a scikit-learn podría resultar problemático por alguna de las siguientes razones:

source: Incorporating statistics from test data into the preprocessors makes cross-validation scores unreliable (known as *data leakage*), for example in the case of scalers or imputing missing values.
es_es: La incorporación de las estadísticas de los datos de prueba en los preprocesadores hace que las puntuaciones de la validación cruzada no sean fiables (lo que se conoce como *fuga de datos*), por ejemplo en el caso de los escaladores o de la imputación de valores perdidos.

source: You may want to include the parameters of the preprocessors in a :ref:`parameter search <grid_search>`.
es_es: Es posible que desees incluir los parámetros de los preprocesadores en una :ref:`búsqueda de parámetros <grid_search>`.

source: The :class:`~sklearn.compose.ColumnTransformer` helps performing different transformations for different columns of the data, within a :class:`~sklearn.pipeline.Pipeline` that is safe from data leakage and that can be parametrized. :class:`~sklearn.compose.ColumnTransformer` works on arrays, sparse matrices, and `pandas DataFrames <https://pandas.pydata.org/pandas-docs/stable/>`__.
es_es: El :class:`~sklearn.compose.ColumnTransformer` ayuda a realizar diferentes transformaciones para diferentes columnas de los datos, dentro de un :class:`~sklearn.pipeline.Pipeline` que está a salvo de fugas de datos y que puede ser parametrizado. :class:`~sklearn.compose.ColumnTransformer` trabaja en arreglos, matrices dispersas y `pandas DataFrames <https://pandas.pydata.org/pandas-docs/stable/>`__.

source: To each column, a different transformation can be applied, such as preprocessing or a specific feature extraction method::
es_es: Para cada columna, se puede aplicar una transformación diferente, como el preprocesamiento o un método de extracción de características específicas::

source: For this data, we might want to encode the ``'city'`` column as a categorical variable using :class:`~sklearn.preprocessing.OneHotEncoder` but apply a :class:`~sklearn.feature_extraction.text.CountVectorizer` to the ``'title'`` column. As we might use multiple feature extraction methods on the same column, we give each transformer a unique name, say ``'city_category'`` and ``'title_bow'``. By default, the remaining rating columns are ignored (``remainder='drop'``)::
es_es: Para estos datos, podríamos querer codificar la columna ``ciudad`` como una variable categórica utilizando :class:`~sklearn.preprocessing.OneHotEncoder` pero aplicar un :class:`~sklearn.feature_extraction.text.CountVectorizer` a la columna ``título``. Como podemos utilizar varios métodos de extracción de características en la misma columna, damos a cada transformador un nombre único, por ejemplo ``city_category`` y ``title_bow``. Por defecto, el resto de columnas de valoración se ignoran (``remainder='drop'``)::

source: In the above example, the :class:`~sklearn.feature_extraction.text.CountVectorizer` expects a 1D array as input and therefore the columns were specified as a string (``'title'``). However, :class:`~sklearn.preprocessing.OneHotEncoder` as most of other transformers expects 2D data, therefore in that case you need to specify the column as a list of strings (``['city']``).
es_es: En el ejemplo anterior, el transformador :class:`~sklearn.feature_extraction.text.CountVectorizer` espera un arreglo 1D como entrada y por lo tanto las columnas fueron especificadas como una cadena (``'title``). Sin embargo, :class:`~sklearn.preprocessing.OneHotEncoder`, como la mayoría de los otros transformadores, espera datos 2D, por lo que en ese caso hay que especificar la columna como una lista de cadenas (``['city']``).

source: Apart from a scalar or a single item list, the column selection can be specified as a list of multiple items, an integer array, a slice, a boolean mask, or with a :func:`~sklearn.compose.make_column_selector`. The :func:`~sklearn.compose.make_column_selector` is used to select columns based on data type or column name::
es_es: Aparte de un escalar o una lista de un solo elemento, la selección de columnas puede especificarse como una lista de múltiples elementos, un arreglo de enteros, un intervalo, una máscara booleana, o con un :func:`~sklearn.compose.make_column_selector`. El :func:`~sklearn.compose.make_column_selector` se utiliza para seleccionar columnas basándose en el tipo de datos o en el nombre de la columna::

source: Strings can reference columns if the input is a DataFrame, integers are always interpreted as the positional columns.
es_es: Las cadenas pueden referenciar columnas si la entrada es de tipo DataFrame, los enteros siempre se interpretan como las columnas posicionales.

source: We can keep the remaining rating columns by setting ``remainder='passthrough'``. The values are appended to the end of the transformation::
es_es: Podemos mantener las columnas de valoración restantes estableciendo ``remainder='passthrough'``. Los valores se añaden al final de la transformación::

source: The ``remainder`` parameter can be set to an estimator to transform the remaining rating columns. The transformed values are appended to the end of the transformation::
es_es: El parámetro ``remainder`` puede establecerse en un estimador para transformar las columnas de valoración restantes. Los valores transformados se añaden al final de la transformación::

source: The :func:`~sklearn.compose.make_column_transformer` function is available to more easily create a :class:`~sklearn.compose.ColumnTransformer` object. Specifically, the names will be given automatically. The equivalent for the above example would be::
es_es: La función :func:`~sklearn.compose.make_column_transformer` está disponible para crear más fácilmente un objeto de tipo :class:`~sklearn.compose.ColumnTransformer`. Específicamente, los nombres serán generados automáticamente. El equivalente para el ejemplo anterior sería::

source: Visualizing Composite Estimators
es_es: Visualización de estimadores compuestos

source: Estimators can be displayed with a HTML representation when shown in a jupyter notebook. This can be useful to diagnose or visualize a Pipeline with many estimators. This visualization is activated by setting the `display` option in :func:`~sklearn.set_config`::
es_es: Los estimadores pueden ser mostrados con una representación HTML cuando se muestran en un cuaderno de Jupyter. Esto puede ser útil para diagnosticar o visualizar un pipeline con muchos estimadores. Esta visualización se activa estableciendo la opción `display` en :func:`~sklearn.set_config`::

source: An example of the HTML output can be seen in the **HTML representation of Pipeline** section of :ref:`sphx_glr_auto_examples_compose_plot_column_transformer_mixed_types.py`. As an alternative, the HTML can be written to a file using :func:`~sklearn.utils.estimator_html_repr`::
es_es: Un ejemplo de la salida HTML puede verse en la sección **Representación HTML del pipeline** de :ref:`sphx_glr_auto_examples_compose_plot_column_transformer_mixed_types.py`. Como alternativa, el HTML se puede escribir en un archivo utilizando :func:`~sklearn.utils.estimator_html_repr`::
