Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/covariance.po
Languages: es_es

source: Rousseeuw and Van Driessen [4]_ developed the FastMCD algorithm in order to compute the Minimum Covariance Determinant. This algorithm is used in scikit-learn when fitting an MCD object to data. The FastMCD algorithm also computes a robust estimate of the data set location at the same time.
es_es: Rousseeuw y Van Driessen [4]_ desarrollaron el algoritmo FastMCD para calcular el Determinante de Covarianza Mínimo. Este algoritmo se utiliza en scikit-learn cuando se ajusta un objeto MCD a los datos. El algoritmo FastMCD también calcula una estimación robusta de la ubicación del conjunto de datos al mismo tiempo.

source: Raw estimates can be accessed as ``raw_location_`` and ``raw_covariance_`` attributes of a :class:`MinCovDet` robust covariance estimator object.
es_es: Se puede acceder a las estimaciones en bruto como atributos ``raw_location_`` y ``raw_covariance_`` de un objeto estimador de covarianza robusta :class:`MinCovDet`.

source: See :ref:`sphx_glr_auto_examples_covariance_plot_robust_vs_empirical_covariance.py` for an example on how to fit a :class:`MinCovDet` object to data and see how the estimate remains accurate despite the presence of outliers.
es_es: Puedes consultar :ref:`sphx_glr_auto_examples_covariance_plot_robust_vs_empirical_covariance.py` para ver un ejemplo sobre cómo ajustar un objeto :class:`MinCovDet` a los datos y ver cómo la estimación sigue siendo precisa a pesar de la presencia de valores atípicos.

source: See :ref:`sphx_glr_auto_examples_covariance_plot_mahalanobis_distances.py` to visualize the difference between :class:`EmpiricalCovariance` and :class:`MinCovDet` covariance estimators in terms of Mahalanobis distance (so we get a better estimate of the precision matrix too).
es_es: Ver :ref:`sphx_glr_auto_examples_covariance_plot_mahalanobis_distances.py` para visualizar la diferencia entre los estimadores de covarianza :class:`EmpiricalCovariance` y :class:`MinCovDet` en términos de la distancia de Mahalanobis (así obtenemos también una mejor estimación de la matriz de precisión).

source: Influence of outliers on location and covariance estimates
es_es: Influencia de los valores atípicos en las estimaciones de localización y covarianza

source: Separating inliers from outliers using a Mahalanobis distance
es_es: Separar valores típicos de atípicos utilizando una distancia de Mahalanobis
