Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/cross_validation.po
Languages: es_es

source: However, if the learning curve is steep for the training size in question, then 5- or 10- fold cross validation can overestimate the generalization error.
es_es: Sin embargo, si la curva de aprendizaje es pronunciada para el volumen de entrenamiento en cuestión, la validación cruzada de 5 o 10 partes puede sobreestimar el error de generalización.

source: As a general rule, most authors, and empirical evidence, suggest that 5- or 10- fold cross validation should be preferred to LOO.
es_es: Como regla general, la mayoría de los autores, y la evidencia empírica, sugieren que la validación cruzada de 5 o 10 partes debería preferirse a la LOO.

source: :class:`LeavePOut` is very similar to :class:`LeaveOneOut` as it creates all the possible training/test sets by removing :math:`p` samples from the complete set. For :math:`n` samples, this produces :math:`{n \choose p}` train-test pairs. Unlike :class:`LeaveOneOut` and :class:`KFold`, the test sets will overlap for :math:`p > 1`.
es_es: :class:`LeavePOut` es muy similar a :class:`LeaveOneOut` ya que crea todos los posibles conjuntos de entrenamiento/prueba eliminando las muestras :math:`p` del conjunto completo. Para las muestras de :math:`n`, esto produce pares de entrenamiento-prueba de :math:`{n \choose p}`. A diferencia de :class:`LeaveOneOut` y :class:`KFold`, los conjuntos de prueba se superponen para :math:`p > 1`.

source: Example of Leave-2-Out on a dataset with 4 samples::
es_es: Ejemplo de Leave-2-Out en un conjunto de datos con 4 muestras::

source: Random permutations cross-validation a.k.a. Shuffle & Split
es_es: Validación cruzada de permutaciones aleatorias, también conocida como Mezcla y División

source: The :class:`ShuffleSplit` iterator will generate a user defined number of independent train / test dataset splits. Samples are first shuffled and then split into a pair of train and test sets.
es_es: El iterador :class:`ShuffleSplit` generará un número definido por el usuario de divisiones independientes del conjunto de datos de entrenamiento/prueba. Las muestras se barajan primero y luego se dividen en un par de conjuntos de entrenamiento y prueba.

source: It is possible to control the randomness for reproducibility of the results by explicitly seeding the ``random_state`` pseudo random number generator.
es_es: Es posible controlar la aleatoriedad para la reproducibilidad de los resultados sembrando explícitamente el generador de números pseudoaleatorios ``random_state``.

source: Here is a usage example::
es_es: Este es un ejemplo de uso::

source: Here is a visualization of the cross-validation behavior. Note that :class:`ShuffleSplit` is not affected by classes or groups.
es_es: Aquí hay una visualización del comportamiento de la validación cruzada. Tenga en cuenta que :class:`ShuffleSplit` no se ve afectado por las clases o grupos.

source: :class:`ShuffleSplit` is thus a good alternative to :class:`KFold` cross validation that allows a finer control on the number of iterations and the proportion of samples on each side of the train / test split.
es_es: Por tanto, :class:`ShuffleSplit` es una buena alternativa a la validación cruzada :class:`KFold` que permite un control más fino del número de iteraciones y de la proporción de muestras en cada lado de la división entrenamiento/prueba.

source: Cross-validation iterators with stratification based on class labels.
es_es: Iteradores de validación cruzada con estratificación basada en las etiquetas de clase.

source: Some classification problems can exhibit a large imbalance in the distribution of the target classes: for instance there could be several times more negative samples than positive samples. In such cases it is recommended to use stratified sampling as implemented in :class:`StratifiedKFold` and :class:`StratifiedShuffleSplit` to ensure that relative class frequencies is approximately preserved in each train and validation fold.
es_es: Algunos problemas de clasificación pueden presentar un gran desequilibrio en la distribución de las clases objetivo: por ejemplo, puede haber varias veces más muestras negativas que positivas. En estos casos se recomienda utilizar el muestreo estratificado como se implementa en :class:`StratifiedKFold` y :class:`StratifiedShuffleSplit` para asegurar que las frecuencias relativas de las clases se conserven aproximadamente en cada parte de entrenamiento y validación.

source: Stratified k-fold
es_es: K-fold estratificado

source: :class:`StratifiedKFold` is a variation of *k-fold* which returns *stratified* folds: each set contains approximately the same percentage of samples of each target class as the complete set.
es_es: :class:`StratifiedKFold` es una variación de *k-fold* que devuelve partes *estratificadas*: cada conjunto contiene aproximadamente el mismo porcentaje de muestras de cada clase objetivo que el conjunto completo.

source: Here is an example of stratified 3-fold cross-validation on a dataset with 50 samples from two unbalanced classes. We show the number of samples in each class and compare with :class:`KFold`.
es_es: Este es un ejemplo de validación cruzada estratificada de 3 partes en un conjunto de datos con 50 muestras de dos clases no equilibradas. Se presenta el número de muestras de cada clase y se compara con :class:`KFold`.

source: We can see that :class:`StratifiedKFold` preserves the class ratios (approximately 1 / 10) in both train and test dataset.
es_es: Podemos ver que :class:`StratifiedKFold` preserva los ratios de clase (aproximadamente 1 / 10) tanto en el conjunto de datos de entrenamiento como en el de prueba.

source: Here is a visualization of the cross-validation behavior.
es_es: Aquí hay una visualización del comportamiento de la validación cruzada.

source: :class:`RepeatedStratifiedKFold` can be used to repeat Stratified K-Fold n times with different randomization in each repetition.
es_es: :class:`RepeatedStratifiedKFold` se puede utilizar para repetir el K-Fold Estratificado n veces con diferente aleatorización en cada repetición.

source: Stratified Shuffle Split
es_es: División aleatoria estratificada

source: :class:`StratifiedShuffleSplit` is a variation of *ShuffleSplit*, which returns stratified splits, *i.e* which creates splits by preserving the same percentage for each target class as in the complete set.
es_es: :class:`StratifiedShuffleSplit` es una variación de *Mezcla y División*, que devuelve divisiones estratificadas, *es decir* que crea divisiones conservando el mismo porcentaje para cada clase objetivo que en el conjunto completo.

source: Cross-validation iterators for grouped data.
es_es: Iteradores de validación cruzada para datos agrupados.

source: The i.i.d. assumption is broken if the underlying generative process yield groups of dependent samples.
es_es: La suposición i.i.d. se rompe si el proceso generativo subyacente produce grupos de muestras dependientes.

source: Such a grouping of data is domain specific. An example would be when there is medical data collected from multiple patients, with multiple samples taken from each patient. And such data is likely to be dependent on the individual group. In our example, the patient id for each sample will be its group identifier.
es_es: Tal agrupación de datos es específica del dominio. Un ejemplo sería cuando hay datos médicos recogidos de múltiples pacientes, con múltiples muestras tomadas de cada paciente. Y es probable que esos datos sean dependientes del grupo individual. En nuestro ejemplo, el identificador del paciente de cada muestra será su identificador de grupo.

source: In this case we would like to know if a model trained on a particular set of groups generalizes well to the unseen groups. To measure this, we need to ensure that all the samples in the validation fold come from groups that are not represented at all in the paired training fold.
es_es: En este caso, nos gustaría saber si un modelo entrenado en un determinado conjunto de grupos generaliza bien a los grupos no vistos. Para medirlo, tenemos que asegurarnos de que todas las muestras en esa parte de la validación proceden de grupos que no están representados en absoluto en la parte de entrenamiento emparejado.

source: The following cross-validation splitters can be used to do that. The grouping identifier for the samples is specified via the ``groups`` parameter.
es_es: Para ello, se pueden utilizar los siguientes divisores de validación cruzada. El identificador de agrupación de las muestras se especifica mediante el parámetro ``groups``.

source: Group k-fold
es_es: K-fold de grupos

source: :class:`GroupKFold` is a variation of k-fold which ensures that the same group is not represented in both testing and training sets. For example if the data is obtained from different subjects with several samples per-subject and if the model is flexible enough to learn from highly person specific features it could fail to generalize to new subjects. :class:`GroupKFold` makes it possible to detect this kind of overfitting situations.
es_es: :class:`GroupKFold` es una variación de k-fold que garantiza que el mismo grupo no esté representado en los conjuntos de prueba y de entrenamiento. Por ejemplo, si los datos se obtienen de diferentes sujetos con varias muestras por sujeto y si el modelo es lo suficientemente flexible como para aprender de características muy específicas de la persona, podría fallar al generalizar para nuevos sujetos. :class:`GroupKFold` permite detectar este tipo de situaciones de sobreajuste.

source: Imagine you have three subjects, each with an associated number from 1 to 3::
es_es: Imagina que tienes tres sujetos, cada uno con un número asociado del 1 al 3::

source: Each subject is in a different testing fold, and the same subject is never in both testing and training. Notice that the folds do not have exactly the same size due to the imbalance in the data.
es_es: Cada sujeto está en un pliegue de prueba diferente, y el mismo sujeto nunca está tanto en la prueba como en el entrenamiento. Observa que las partes no tienen exactamente el mismo tamaño debido al desequilibrio de los datos.

source: Leave One Group Out
es_es: Dejar un grupo afuera (Leave One Group Out)

source: :class:`LeaveOneGroupOut` is a cross-validation scheme which holds out the samples according to a third-party provided array of integer groups. This group information can be used to encode arbitrary domain specific pre-defined cross-validation folds.
es_es: :class:`LeaveOneGroupOut` es un esquema de validación cruzada que mantiene las muestras según una matriz de grupos enteros proporcionada por terceros. Esta información de grupo puede utilizarse para codificar partes de validación cruzada predefinidas y específicas del dominio.

source: Each training set is thus constituted by all the samples except the ones related to a specific group.
es_es: De este modo, cada conjunto de entrenamiento está constituido por todas las muestras excepto las relacionadas con un grupo específico.

source: For example, in the cases of multiple experiments, :class:`LeaveOneGroupOut` can be used to create a cross-validation based on the different experiments: we create a training set using the samples of all the experiments except one::
es_es: Por ejemplo, en los casos de experimentos múltiples, se puede utilizar :class:`LeaveOneGroupOut` para crear una validación cruzada basada en los diferentes experimentos: creamos un conjunto de entrenamiento utilizando las muestras de todos los experimentos excepto uno::

source: Another common application is to use time information: for instance the groups could be the year of collection of the samples and thus allow for cross-validation against time-based splits.
es_es: Otra aplicación común es utilizar información temporal: por ejemplo, los grupos podrían ser el año de recogida de las muestras y así permitir la validación cruzada contra divisiones basadas en el tiempo.

source: Leave P Groups Out
es_es: Dejar fuera los grupos P

source: :class:`LeavePGroupsOut` is similar as :class:`LeaveOneGroupOut`, but removes samples related to :math:`P` groups for each training/test set.
es_es: :class:`LeavePGroupsOut` es similar a :class:`LeaveOneGroupOut`, pero elimina las muestras relacionadas con los grupos de :math:`P` para cada conjunto de entrenamiento/prueba.

source: Example of Leave-2-Group Out::
es_es: Ejemplo de Dejar-2-Grupos Afuera::

source: Group Shuffle Split
es_es: Dividir grupos de forma aleatoria

source: The :class:`GroupShuffleSplit` iterator behaves as a combination of :class:`ShuffleSplit` and :class:`LeavePGroupsOut`, and generates a sequence of randomized partitions in which a subset of groups are held out for each split.
es_es: El iterador :class:`GroupShuffleSplit` se comporta como una combinación de :class:`ShuffleSplit` y :class:`LeavePGroupsOut`, y genera una secuencia de particiones aleatorias en las que se mantiene un subconjunto de grupos para cada partición.

source: This class is useful when the behavior of :class:`LeavePGroupsOut` is desired, but the number of groups is large enough that generating all possible partitions with :math:`P` groups withheld would be prohibitively expensive. In such a scenario, :class:`GroupShuffleSplit` provides a random sample (with replacement) of the train / test splits generated by :class:`LeavePGroupsOut`.
es_es: Esta clase es útil cuando se desea el comportamiento de :class:`LeavePGroupsOut`, pero el número de grupos es lo suficientemente grande como para que generar todas las posibles particiones con grupos retenidos de :math:`P` sea prohibitivamente costoso. En este caso, :class:`GroupShuffleSplit` proporciona una muestra aleatoria (con reemplazo) de las particiones de entrenamiento/prueba generadas por :class:`LeavePGroupsOut`.

source: Predefined Fold-Splits / Validation-Sets
es_es: Divisiones predefinidas/ Conjuntos de validación

source: For some datasets, a pre-defined split of the data into training- and validation fold or into several cross-validation folds already exists. Using :class:`PredefinedSplit` it is possible to use these folds e.g. when searching for hyperparameters.
es_es: Para algunos conjuntos de datos, ya existe una división predefinida de los datos en partes de entrenamiento y validación o en varias partes de validación cruzada. Utilizando :class:`PredefinedSplit` es posible utilizar estas partes, por ejemplo, cuando se buscan hiperparámetros.

source: For example, when using a validation set, set the ``test_fold`` to 0 for all samples that are part of the validation set, and to -1 for all other samples.
es_es: Por ejemplo, cuando se utiliza un conjunto de validación, establezca el ``test_fold`` a 0 para todas las muestras que forman parte del conjunto de validación, y a -1 para todas las demás muestras.

source: Using cross-validation iterators to split train and test
es_es: Uso de los iteradores de validación cruzada para dividir el entrenamiento y la prueba

source: The above group cross-validation functions may also be useful for spitting a dataset into training and testing subsets. Note that the convenience function :func:`train_test_split` is a wrapper around :func:`ShuffleSplit` and thus only allows for stratified splitting (using the class labels) and cannot account for groups.
es_es: Las anteriores funciones de validación cruzada de grupo también pueden ser útiles para dividir un conjunto de datos en subconjuntos de entrenamiento y prueba. Ten en cuenta que la función :func:`train_test_split` es un envoltorio de :func:`ShuffleSplit` y, por tanto, sólo permite la división estratificada (utilizando las etiquetas de clase) y no puede tener en cuenta los grupos.

source: To perform the train and test split, use the indices for the train and test subsets yielded by the generator output by the `split()` method of the cross-validation splitter. For example::
es_es: Para realizar la división de entrenamiento y prueba, utiliza los índices de los subconjuntos de entrenamiento y prueba producidos por la salida del generador mediante el método `split()` del divisor de validación cruzada. Por ejemplo::

source: Cross validation of time series data
es_es: Validación cruzada de datos de series de tiempo

source: Time series data is characterised by the correlation between observations that are near in time (*autocorrelation*). However, classical cross-validation techniques such as :class:`KFold` and :class:`ShuffleSplit` assume the samples are independent and identically distributed, and would result in unreasonable correlation between training and testing instances (yielding poor estimates of generalisation error) on time series data. Therefore, it is very important to evaluate our model for time series data on the "future" observations least like those that are used to train the model. To achieve this, one solution is provided by :class:`TimeSeriesSplit`.
es_es: Los datos de las series de tiempo se caracterizan por la correlación entre observaciones cercanas en el tiempo (*autocorrelación*). Sin embargo, las técnicas clásicas de validación cruzada, como :class:`KFold` y :class:`ShuffleSplit`, suponen que las muestras son independientes y están idénticamente distribuidas, y darían lugar a una correlación poco razonable entre las instancias de entrenamiento y las de prueba (lo que daría lugar a malas estimaciones del error de generalización) en los datos de series de tiempo. Por lo tanto, es muy importante evaluar nuestro modelo para datos de series de tiempo en las observaciones "futuras" menos parecidas a las que se utilizan para entrenar el modelo. Para conseguirlo, una solución es la que proporciona :class:`TimeSeriesSplit`.

source: Time Series Split
es_es: División de series de tiempo

source: :class:`TimeSeriesSplit` is a variation of *k-fold* which returns first :math:`k` folds as train set and the :math:`(k+1)` th fold as test set. Note that unlike standard cross-validation methods, successive training sets are supersets of those that come before them. Also, it adds all surplus data to the first training partition, which is always used to train the model.
es_es: :class:`TimeSeriesSplit` es una variación de *k-fold* que devuelve los primeros pliegues de :math:`k` como conjunto de entrenamiento y el :math:`(k+1)` última parte como conjunto de prueba. Tenga en cuenta que, a diferencia de los métodos estándar de validación cruzada, los conjuntos de entrenamiento sucesivos son superconjuntos de los que vienen antes. Además, añade todos los datos sobrantes a la primera partición de entrenamiento, que siempre se utiliza para entrenar el modelo.

source: This class can be used to cross-validate time series data samples that are observed at fixed time intervals.
es_es: Esta clase puede utilizarse para la validación cruzada de muestras de datos de series de tiempo que se observan en intervalos de tiempo fijos.

source: Example of 3-split time series cross-validation on a dataset with 6 samples::
es_es: Ejemplo de validación cruzada de series de tiempo con 3 divisiones en un conjunto de datos con 6 muestras::

source: A note on shuffling
es_es: Nota sobre la mezcla

source: If the data ordering is not arbitrary (e.g. samples with the same class label are contiguous), shuffling it first may be essential to get a meaningful cross- validation result. However, the opposite may be true if the samples are not independently and identically distributed. For example, if samples correspond to news articles, and are ordered by their time of publication, then shuffling the data will likely lead to a model that is overfit and an inflated validation score: it will be tested on samples that are artificially similar (close in time) to training samples.
es_es: Si el orden de los datos no es arbitrario (por ejemplo, las muestras con la misma etiqueta de clase son contiguas), mezclarlas primero puede ser esencial para obtener un resultado de validación cruzada significativo. Sin embargo, puede ocurrir lo contrario si las muestras no están distribuidas de forma independiente e idéntica. Por ejemplo, si las muestras corresponden a artículos de noticias, y están ordenadas por su hora de publicación, entonces barajar los datos probablemente conducirá a un modelo que está sobreajustado y a una puntuación de validación inflada: se probará en muestras que son artificialmente similares (cercanas en el tiempo) a las muestras de entrenamiento.

source: Some cross validation iterators, such as :class:`KFold`, have an inbuilt option to shuffle the data indices before splitting them. Note that:
es_es: Algunos iteradores de validación cruzada, como :class:`KFold`, tienen una opción incorporada para revolver los índices de datos antes de dividirlos. Tenga en cuenta que:

source: This consumes less memory than shuffling the data directly.
es_es: Esto consume menos memoria que revolver los datos directamente.

source: By default no shuffling occurs, including for the (stratified) K fold cross- validation performed by specifying ``cv=some_integer`` to :func:`cross_val_score`, grid search, etc. Keep in mind that :func:`train_test_split` still returns a random split.
es_es: Por defecto no se revuelve, incluso para la validación cruzada (estratificada) de K partes que se realiza especificando ``cv=algunos_integros`` a :func:`cross_val_score`, búsqueda en cuadrícula, etc. Tenga en cuenta que :func:`train_test_split` sigue devolviendo una división aleatoria.

source: The ``random_state`` parameter defaults to ``None``, meaning that the shuffling will be different every time ``KFold(..., shuffle=True)`` is iterated. However, ``GridSearchCV`` will use the same shuffling for each set of parameters validated by a single call to its ``fit`` method.
es_es: El parámetro ``random_state`` es por defecto ``None``, lo que significa que la forma de revolver será diferente cada vez que se itere ``KFold(..., shuffle=True)``. Sin embargo, ``GridSearchCV`` utilizará el mismo proceso de revolver para cada conjunto de parámetros validados por una única llamada a su método ``fit``.

source: To get identical results for each split, set ``random_state`` to an integer.
es_es: Para obtener resultados idénticos para cada división, establezca ``random_state`` a un número entero.

source: For more details on how to control the randomness of cv splitters and avoid common pitfalls, see :ref:`randomness`.
es_es: Para más detalles sobre cómo controlar la aleatoriedad de los divisores de cv y evitar errores comunes, véase :ref:`randomness`.

source: Cross validation and model selection
es_es: Validación cruzada y selección de modelos

source: Cross validation iterators can also be used to directly perform model selection using Grid Search for the optimal hyperparameters of the model. This is the topic of the next section: :ref:`grid_search`.
es_es: Los iteradores de validación cruzada también pueden utilizarse para realizar directamente la selección del modelo mediante la búsqueda en cuadrícula de los hiperparámetros óptimos del modelo. Este es el tema de la siguiente sección: :ref:`grid_search`.

source: Permutation test score
es_es: Puntuación de la prueba de permutación
