Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/cross_validation.po
Languages: es_es

source: Cross-validation: evaluating estimator performance
es_es: Validación cruzada: evaluación del rendimiento del estimador

source: Learning the parameters of a prediction function and testing it on the same data is a methodological mistake: a model that would just repeat the labels of the samples that it has just seen would have a perfect score but would fail to predict anything useful on yet-unseen data. This situation is called **overfitting**. To avoid it, it is common practice when performing a (supervised) machine learning experiment to hold out part of the available data as a **test set** ``X_test, y_test``. Note that the word "experiment" is not intended to denote academic use only, because even in commercial settings machine learning usually starts out experimentally. Here is a flowchart of typical cross validation workflow in model training. The best parameters can be determined by :ref:`grid search <grid_search>` techniques.
es_es: Aprender los parámetros de una función de predicción y probarla sobre los mismos datos es un error metodológico: un modelo que se limitase a repetir las etiquetas de las muestras que acaba de ver tendría una puntuación perfecta, pero no lograría predecir nada útil sobre datos aún no vistos. Esta situación se llama **sobreajuste**. Para evitarla, es práctica común cuando se realiza un experimento de aprendizaje automático (supervisado), el mantener una parte de los datos disponibles como un **conjunto de prueba** ``X_test, y_test`. Tenga en cuenta que la palabra "experimento" no pretende denotar un uso académico únicamente, ya que incluso en entornos comerciales el aprendizaje automático suele comenzar de forma experimental. Este es un diagrama de flujo del proceso de trabajo típico de validación cruzada en el entrenamiento de modelos. Los mejores parámetros pueden determinarse mediante las técnicas de :ref:`búsqueda exhaustiva <grid_search>`.

source: In scikit-learn a random split into training and test sets can be quickly computed with the :func:`train_test_split` helper function. Let's load the iris data set to fit a linear support vector machine on it::
es_es: En scikit-learn una división aleatoria en conjuntos de entrenamiento y prueba puede ser rápidamente calculada con la función de ayuda :func:`train_test_split`. Carguemos el conjunto de datos del iris para ajustar una máquina de vectores de soporte lineal en él::

source: We can now quickly sample a training set while holding out 40% of the data for testing (evaluating) our classifier::
es_es: Ahora podemos hacer un muestreo rápido de un conjunto de entrenamiento y reservar el 40% de los datos para probar (evaluar) nuestro clasificador::

source: When evaluating different settings ("hyperparameters") for estimators, such as the ``C`` setting that must be manually set for an SVM, there is still a risk of overfitting *on the test set* because the parameters can be tweaked until the estimator performs optimally. This way, knowledge about the test set can "leak" into the model and evaluation metrics no longer report on generalization performance. To solve this problem, yet another part of the dataset can be held out as a so-called "validation set": training proceeds on the training set, after which evaluation is done on the validation set, and when the experiment seems to be successful, final evaluation can be done on the test set.
es_es: Cuando se evalúan diferentes ajustes ("hiperparámetros") para los estimadores, como el ajuste ``C`` que debe establecerse manualmente para una SVM, sigue existiendo el riesgo de sobreajuste *en el conjunto de prueba* porque los parámetros pueden ajustarse hasta que el estimador tenga un rendimiento óptimo. De este modo, el conocimiento sobre el conjunto de pruebas puede "filtrarse" en el modelo y las métricas de evaluación ya no reportan el rendimiento de la generalización. Para resolver este problema, otra parte del conjunto de datos puede mantenerse como el llamado "conjunto de validación": el entrenamiento se lleva a cabo en el conjunto de entrenamiento, tras lo cual la evaluación se realiza en el conjunto de validación, y cuando el experimento parece ser exitoso, la evaluación final puede realizarse en el conjunto de prueba.

source: However, by partitioning the available data into three sets, we drastically reduce the number of samples which can be used for learning the model, and the results can depend on a particular random choice for the pair of (train, validation) sets.
es_es: Sin embargo, al dividir los datos disponibles en tres conjuntos, reducimos drásticamente el número de muestras que pueden utilizarse para el aprendizaje del modelo, y los resultados pueden depender de una determinada elección aleatoria del par de conjuntos (de entrenamiento, de validación).

source: A solution to this problem is a procedure called `cross-validation <https://en.wikipedia.org/wiki/Cross-validation_(statistics)>`_ (CV for short). A test set should still be held out for final evaluation, but the validation set is no longer needed when doing CV. In the basic approach, called *k*-fold CV, the training set is split into *k* smaller sets (other approaches are described below, but generally follow the same principles). The following procedure is followed for each of the *k* "folds":
es_es: Una solución a este problema es un procedimiento llamado `validación cruzada <https://es.wikipedia.org/wiki/Validaci%C3%B3n_cruzada)>`_ (VC para abreviar). El conjunto de pruebas debe seguir siendo utilizado para la evaluación final, pero el conjunto de validación ya no es necesario cuando se realiza la VC. En el enfoque básico, llamado *k*-parte VC, el conjunto de entrenamiento se divide en *k* conjuntos más pequeños (más adelante se describen otros enfoques, pero en general siguen los mismos principios). Se sigue el siguiente procedimiento para cada uno de las *k* "partes":

source: A model is trained using :math:`k-1` of the folds as training data;
es_es: Se entrena un modelo utilizando :math:`k-1` de las partes como datos de entrenamiento;

source: the resulting model is validated on the remaining part of the data (i.e., it is used as a test set to compute a performance measure such as accuracy).
es_es: el modelo resultante se valida en la parte restante de los datos (es decir, se utiliza como conjunto de pruebas para calcular una medida de rendimiento como la precisión).

source: The performance measure reported by *k*-fold cross-validation is then the average of the values computed in the loop. This approach can be computationally expensive, but does not waste too much data (as is the case when fixing an arbitrary validation set), which is a major advantage in problems such as inverse inference where the number of samples is very small.
es_es: La medida de rendimiento obtenida mediante la validación cruzada de *k* partes es entonces la media de los valores calculados en el bucle. Este enfoque puede ser costoso desde el punto de vista computacional, pero no desperdicia demasiados datos (como ocurre cuando se fija un conjunto de validación arbitrario), lo que supone una gran ventaja en problemas como la inferencia inversa, donde el número de muestras es muy pequeño.

source: Computing cross-validated metrics
es_es: Cálculo de métricas de validación cruzada

source: The simplest way to use cross-validation is to call the :func:`cross_val_score` helper function on the estimator and the dataset.
es_es: La forma más sencilla de utilizar la validación cruzada es llamar a la función de ayuda :func:`cross_val_score` sobre el estimador y el conjunto de datos.

source: The following example demonstrates how to estimate the accuracy of a linear kernel support vector machine on the iris dataset by splitting the data, fitting a model and computing the score 5 consecutive times (with different splits each time)::
es_es: El siguiente ejemplo muestra cómo estimar la precisión de una máquina de vectores de soporte de núcleo lineal en el conjunto de datos del iris dividiendo los datos, ajustando un modelo y calculando la puntuación 5 veces consecutivas (con diferentes divisiones cada vez)::

source: The mean score and the standard deviation are hence given by::
es_es: La puntuación media y la desviación estándar vienen dadas por::

source: By default, the score computed at each CV iteration is the ``score`` method of the estimator. It is possible to change this by using the scoring parameter::
es_es: Por defecto, la puntuación calculada en cada iteración del CV es el método ``score`` del estimador. Es posible cambiar esto utilizando el parámetro de puntuación::

source: See :ref:`scoring_parameter` for details. In the case of the Iris dataset, the samples are balanced across target classes hence the accuracy and the F1-score are almost equal.
es_es: Observa el :ref:`scoring_parameter` para más detalles. En el caso del conjunto de datos Iris, las muestras están equilibradas entre las clases objetivo, por lo que la precisión y la puntuación F1 son casi iguales.

source: When the ``cv`` argument is an integer, :func:`cross_val_score` uses the :class:`KFold` or :class:`StratifiedKFold` strategies by default, the latter being used if the estimator derives from :class:`ClassifierMixin <sklearn.base.ClassifierMixin>`.
es_es: Cuando el argumento ``cv`` es un entero, :func:`cross_val_score` utiliza por defecto las estrategias :class:`KFold` o :class:`StratifiedKFold`, usándose esta última si el estimador deriva de :class:`ClassifierMixin <sklearn.base.ClassifierMixin>`.

source: It is also possible to use other cross validation strategies by passing a cross validation iterator instead, for instance::
es_es: También es posible utilizar otras estrategias de validación cruzada pasando un iterador de validación cruzada en su lugar, por ejemplo::

source: Another option is to use an iterable yielding (train, test) splits as arrays of indices, for example::
es_es: Otra opción es utilizar un iterable que produzca divisiones (entrenamiento, prueba) como matrices de índices, por ejemplo::

source: Data transformation with held out data
es_es: Transformación de datos con datos retenidos

source: Just as it is important to test a predictor on data held-out from training, preprocessing (such as standardization, feature selection, etc.) and similar :ref:`data transformations <data-transforms>` similarly should be learnt from a training set and applied to held-out data for prediction::
es_es: Al igual que es importante probar un predictor en los datos retenidos del entrenamiento, el preprocesamiento (como la estandarización, la selección de características, etc.) y las transformaciones de datos similares :ref:` <data-transforms>` deberían aprenderse de un conjunto de entrenamiento y aplicarse a los datos retenidos para la predicción::

source: A :class:`Pipeline <sklearn.pipeline.Pipeline>` makes it easier to compose estimators, providing this behavior under cross-validation::
es_es: Un :class:`Pipeline <sklearn.pipeline.Pipeline>` facilita la composición de los estimadores, proporcionando este comportamiento bajo validación cruzada::

source: See :ref:`combining_estimators`.
es_es: Véase :ref:`combining_estimators`.

source: The cross_validate function and multiple metric evaluation
es_es: La función cross_validate y la evaluación de métricas múltiples

source: The :func:`cross_validate` function differs from :func:`cross_val_score` in two ways:
es_es: La función :func:`cross_validate` difiere de :func:`cross_val_score` en dos aspectos:

source: It allows specifying multiple metrics for evaluation.
es_es: Permite especificar múltiples métricas para su evaluación.

source: It returns a dict containing fit-times, score-times (and optionally training scores as well as fitted estimators) in addition to the test score.
es_es: Devuelve un diccionario que contiene tiempos de ajuste, tiempos de puntuación (y opcionalmente puntuaciones de entrenamiento así como estimadores ajustados) además de la puntuación de la prueba.

source: For single metric evaluation, where the scoring parameter is a string, callable or None, the keys will be - ``['test_score', 'fit_time', 'score_time']``
es_es: Para la evaluación de una sola métrica, en la que el parámetro de puntuación es una cadena, invocable o None, las claves serán - ``['test_score', 'fit_time', 'score_time']``

source: And for multiple metric evaluation, the return value is a dict with the following keys - ``['test_<scorer1_name>', 'test_<scorer2_name>', 'test_<scorer...>', 'fit_time', 'score_time']``
es_es: Y para la evaluación de métricas múltiples, el valor de retorno es un diccionario con las siguientes claves - ``['test_<scorer1_name>', 'test_<scorer2_name>', 'test_<scorer...>', 'fit_time', 'score_time']``

source: ``return_train_score`` is set to ``False`` by default to save computation time. To evaluate the scores on the training set as well you need to be set to ``True``.
es_es: ``retornar_puntuación_de_entrenamiento`` se establece por defecto en ``False`` para ahorrar tiempo de cálculo. Para evaluar las puntuaciones en el conjunto de entrenamiento también es necesario que se establezca en ``True``.

source: You may also retain the estimator fitted on each training set by setting ``return_estimator=True``.
es_es: También puede conservar el estimador ajustado en cada conjunto de entrenamiento estableciendo ``return_estimator=True``.

source: The multiple metrics can be specified either as a list, tuple or set of predefined scorer names::
es_es: Las métricas múltiples se pueden especificar como una lista, tupla o conjunto de nombres de puntuadores predefinidos::

source: Or as a dict mapping scorer name to a predefined or custom scoring function::
es_es: O como un diccionario que asigna el nombre del calificador a una función de calificación predefinida o personalizada::

source: Here is an example of ``cross_validate`` using a single metric::
es_es: Este es un ejemplo de ``validación_cruzada`` utilizando una sola métrica::

source: Obtaining predictions by cross-validation
es_es: Obtención de predicciones por validación cruzada

source: The function :func:`cross_val_predict` has a similar interface to :func:`cross_val_score`, but returns, for each element in the input, the prediction that was obtained for that element when it was in the test set. Only cross-validation strategies that assign all elements to a test set exactly once can be used (otherwise, an exception is raised).
es_es: La función :func:`cross_val_predict` tiene una interfaz similar a la de :func:`cross_val_score`, pero devuelve, para cada elemento de la entrada, la predicción que se obtuvo para ese elemento cuando estaba en el conjunto de prueba. Sólo pueden utilizarse las estrategias de validación cruzada que asignan todos los elementos a un conjunto de prueba exactamente una vez (en caso contrario, se produce una excepción).

source: Note on inappropriate usage of cross_val_predict
es_es: Nota sobre el uso inadecuado de cross_val_predict

source: The result of :func:`cross_val_predict` may be different from those obtained using :func:`cross_val_score` as the elements are grouped in different ways. The function :func:`cross_val_score` takes an average over cross-validation folds, whereas :func:`cross_val_predict` simply returns the labels (or probabilities) from several distinct models undistinguished. Thus, :func:`cross_val_predict` is not an appropriate measure of generalisation error.
es_es: La función :func:`cross_val_predict` tiene una interfaz similar a la de :func:`cross_val_score`, pero devuelve, para cada elemento de la entrada, la predicción que se obtuvo para ese elemento cuando estaba en el conjunto de prueba. Sólo pueden utilizarse las estrategias de validación cruzada que asignan todos los elementos a un conjunto de prueba exactamente una vez (en caso contrario, se produce una excepción).

source: The function :func:`cross_val_predict` is appropriate for:
es_es: La función :func:`cross_val_predict` es apropiada para:

source: Visualization of predictions obtained from different models.
es_es: Visualización de las predicciones obtenidas a partir de diferentes modelos.

source: Model blending: When predictions of one supervised estimator are used to train another estimator in ensemble methods.
es_es: Mezcla de modelos: Cuando las predicciones de un estimador supervisado se utilizan para entrenar a otro estimador en métodos de conjunto.

source: The available cross validation iterators are introduced in the following section.
es_es: Los iteradores de validación cruzada disponibles se presentan en la siguiente sección.

source: Cross validation iterators
es_es: Iteradores de validación cruzada

source: The following sections list utilities to generate indices that can be used to generate dataset splits according to different cross validation strategies.
es_es: En las siguientes secciones se enumeran las utilidades para generar índices que pueden utilizarse para generar divisiones de conjuntos de datos según diferentes estrategias de validación cruzada.

source: Cross-validation iterators for i.i.d. data
es_es: Iteradores de validación cruzada para datos i.i.d

source: Assuming that some data is Independent and Identically Distributed (i.i.d.) is making the assumption that all samples stem from the same generative process and that the generative process is assumed to have no memory of past generated samples.
es_es: Asumir que unos datos son independientes e idénticamente distribuidos (i.i.d.) es hacer la suposición de que todas las muestras provienen del mismo proceso generativo y que se supone que el proceso generativo no tiene memoria de las muestras generadas anteriormente.

source: The following cross-validators can be used in such cases.
es_es: En estos casos se pueden utilizar los siguientes validadores cruzados.

source: While i.i.d. data is a common assumption in machine learning theory, it rarely holds in practice. If one knows that the samples have been generated using a time-dependent process, it is safer to use a :ref:`time-series aware cross-validation scheme <timeseries_cv>`. Similarly, if we know that the generative process has a group structure (samples collected from different subjects, experiments, measurement devices), it is safer to use :ref:`group-wise cross-validation <group_cv>`.
es_es: Aunque los datos i.i.d. son una suposición común en la teoría del aprendizaje automático, rara vez ésto se cumple en la práctica. Si se sabe que las muestras se han generado utilizando un proceso dependiente del tiempo, es más seguro utilizar un :ref:`esquema de validación cruzada <timeseries_cv>` que tenga en cuenta las series temporales. Del mismo modo, si sabemos que el proceso generativo tiene una estructura de grupo (muestras recogidas de diferentes sujetos, experimentos, dispositivos de medición), es más seguro utilizar :ref:`validación cruzada en función del grupo <group_cv>`.

source: :class:`KFold` divides all the samples in :math:`k` groups of samples, called folds (if :math:`k = n`, this is equivalent to the *Leave One Out* strategy), of equal sizes (if possible). The prediction function is learned using :math:`k - 1` folds, and the fold left out is used for test.
es_es: :class:`KFold` divide todas las muestras en :math:`k` grupos de muestras, llamados partes (si :math:`k = n`, esto equivale a la estrategia *Leave One Out*), de igual tamaño (si es posible). La función de predicción se aprende utilizando :math:`k - 1` partes, y la parte que se deja fuera se utiliza para la prueba.

source: Example of 2-fold cross-validation on a dataset with 4 samples::
es_es: Ejemplo de validación cruzada de 2 partes en un conjunto de datos con 4 muestras::

source: Here is a visualization of the cross-validation behavior. Note that :class:`KFold` is not affected by classes or groups.
es_es: Aquí hay una visualización del comportamiento de la validación cruzada. Ten en cuenta que :class:`KFold` no se ve afectado por las clases o grupos.

source: Each fold is constituted by two arrays: the first one is related to the *training set*, and the second one to the *test set*. Thus, one can create the training/test sets using numpy indexing::
es_es: Cada parte está constituida por dos matrices: la primera está relacionada con el *conjunto de entrenamiento*, y la segunda con el *conjunto de prueba*. Así, se pueden crear los conjuntos de entrenamiento/prueba utilizando la indexación de numpy::

source: Repeated K-Fold
es_es: K-Fold repetido

source: :class:`RepeatedKFold` repeats K-Fold n times. It can be used when one requires to run :class:`KFold` n times, producing different splits in each repetition.
es_es: :class:`RepeatedKFold` repite K-Fold n veces. Se puede utilizar cuando se requiere ejecutar :class:`KFold` n veces, produciendo diferentes divisiones en cada repetición.

source: Example of 2-fold K-Fold repeated 2 times::
es_es: Ejemplo de K-Fold repetido 2 veces::

source: Similarly, :class:`RepeatedStratifiedKFold` repeats Stratified K-Fold n times with different randomization in each repetition.
es_es: Del mismo modo, :class:`RepeatedStratifiedKFold` repite el K-Fold estratificado n veces con una aleatorización diferente en cada repetición.

source: :class:`LeaveOneOut` (or LOO) is a simple cross-validation. Each learning set is created by taking all the samples except one, the test set being the sample left out. Thus, for :math:`n` samples, we have :math:`n` different training sets and :math:`n` different tests set. This cross-validation procedure does not waste much data as only one sample is removed from the training set::
es_es: :class:`LeaveOneOut` (o LOO) es una simple validación cruzada. Cada conjunto de aprendizaje se crea tomando todas las muestras excepto una, siendo el conjunto de prueba la muestra que se deja fuera. Así, para :math:`n` muestras, tenemos :math:`n` conjuntos de entrenamiento diferentes y :math:`n` conjuntos de prueba diferentes. Este procedimiento de validación cruzada no desperdicia muchos datos, ya que sólo se elimina una muestra del conjunto de entrenamiento::

source: Potential users of LOO for model selection should weigh a few known caveats. When compared with :math:`k`-fold cross validation, one builds :math:`n` models from :math:`n` samples instead of :math:`k` models, where :math:`n > k`. Moreover, each is trained on :math:`n - 1` samples rather than :math:`(k-1) n / k`. In both ways, assuming :math:`k` is not too large and :math:`k < n`, LOO is more computationally expensive than :math:`k`-fold cross validation.
es_es: Los usuarios potenciales de LOO para la selección de modelos deben sopesar algunas advertencias conocidas. Cuando se compara con la validación cruzada :math:`k`, se construyen modelos :math:`n` a partir de muestras :math:`n` en lugar de modelos :math:`k`, donde :math:`n > k`. Además, cada uno se entrena con muestras :math:`n - 1` en lugar de :math:`(k-1) n / k`. En ambos casos, asumiendo que :math:`k` no es demasiado grande y que :math:`k < n`, LOO es más costoso computacionalmente que la validación cruzada de :math:`k`.

source: In terms of accuracy, LOO often results in high variance as an estimator for the test error. Intuitively, since :math:`n - 1` of the :math:`n` samples are used to build each model, models constructed from folds are virtually identical to each other and to the model built from the entire training set.
es_es: En términos de precisión, la LOO suele dar lugar a una alta varianza como estimador del error de la prueba. Intuitivamente, dado que :math:`n - 1` de las muestras :math:`n` se utilizan para construir cada modelo, los modelos construidos a partir de partes son prácticamente idénticos entre sí y al modelo construido a partir del conjunto de entrenamiento completo.
