Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/decomposition.po
Languages: es_es

source: The :class:`SparseCoder` object is an estimator that can be used to transform signals into sparse linear combination of atoms from a fixed, precomputed dictionary such as a discrete wavelet basis. This object therefore does not implement a ``fit`` method. The transformation amounts to a sparse coding problem: finding a representation of the data as a linear combination of as few dictionary atoms as possible. All variations of dictionary learning implement the following transform methods, controllable via the ``transform_method`` initialization parameter:
es_es: El objeto :class:`SparseCoder` es un estimador que puede utilizarse para transformar las señales en una combinación lineal dispersa de átomos a partir de un diccionario fijo precalculado, como una base wavelet discreta. Por lo tanto, este objeto no implementa un método de ``fit``. La transformación equivale a un problema de codificación dispersa: encontrar una representación de los datos como una combinación lineal del menor número posible de átomos del diccionario. Todas las variaciones del diccionario de aprendizaje implementan los siguientes métodos de transformación, controlables a través del parámetro de inicialización ``transform_method``:

source: Orthogonal matching pursuit (:ref:`omp`)
es_es: Búsqueda de coincidencias ortogonales (:ref:`omp`)

source: Least-angle regression (:ref:`least_angle_regression`)
es_es: Regresión de ángulo mínimo (:ref:`least_angle_regression`)

source: Lasso computed by least-angle regression
es_es: Lasso calculado por regresión de ángulo mínimo

source: Lasso using coordinate descent (:ref:`lasso`)
es_es: Lasso usando coordenadas de descenso (:ref:`lasso`)

source: Thresholding
es_es: Fijar umbrales

source: Thresholding is very fast but it does not yield accurate reconstructions. They have been shown useful in literature for classification tasks. For image reconstruction tasks, orthogonal matching pursuit yields the most accurate, unbiased reconstruction.
es_es: La fijación de umbrales es muy rápida pero no produce reconstrucciones precisas. Se ha demostrado su utilidad en la literatura para tareas de clasificación. Para las tareas de reconstrucción de imágenes, la búsqueda de coincidencias ortogonales produce la reconstrucción más precisa y no sesgada.

source: The dictionary learning objects offer, via the ``split_code`` parameter, the possibility to separate the positive and negative values in the results of sparse coding. This is useful when dictionary learning is used for extracting features that will be used for supervised learning, because it allows the learning algorithm to assign different weights to negative loadings of a particular atom, from to the corresponding positive loading.
es_es: Los objetos del diccionario de aprendizaje ofrecen, a través del parámetro ``split_code``, la posibilidad de separar los valores positivos y negativos en los resultados de la codificación dispersa. Esto es útil cuando el diccionario de aprendizaje se usa para extraer características que se utilizarán para el aprendizaje supervisado, porque permite que el algoritmo de aprendizaje asigne pesos diferentes a las cargas negativas de un átomo en particular, a partir de la carga positiva correspondiente.

source: The split code for a single sample has length ``2 * n_components`` and is constructed using the following rule: First, the regular code of length ``n_components`` is computed. Then, the first ``n_components`` entries of the ``split_code`` are filled with the positive part of the regular code vector. The second half of the split code is filled with the negative part of the code vector, only with a positive sign. Therefore, the split_code is non-negative.
es_es: El código dividido para una sola muestra tiene una longitud de ``2 * n_components`` y se construye utilizando la siguiente regla: Primero, se calcula el código regular de longitud ``n_components``. A continuación, las primeras entradas de ``n_components`` del ``split_code`` se rellenan con la parte positiva del vector de código regular. La segunda mitad del código dividido se rellena con la parte negativa del vector de códigos, sólo que con signo positivo. Por lo tanto, el split_code es no negativo.

source: Generic dictionary learning
es_es: Diccionario genérico de aprendizaje

source: Dictionary learning (:class:`DictionaryLearning`) is a matrix factorization problem that amounts to finding a (usually overcomplete) dictionary that will perform well at sparsely encoding the fitted data.
es_es: El diccionario de aprendizaje (:class:`DictionaryLearning`) es un problema de factorización de matrices que consiste en encontrar un diccionario (normalmente sobrecompleto) que funciona bien en la codificación dispersa de los datos ajustados.

source: Representing data as sparse combinations of atoms from an overcomplete dictionary is suggested to be the way the mammalian primary visual cortex works. Consequently, dictionary learning applied on image patches has been shown to give good results in image processing tasks such as image completion, inpainting and denoising, as well as for supervised recognition tasks.
es_es: Se sugiere que la representación de los datos como combinaciones dispersas de átomos de un diccionario sobrecompleto es la forma en que funciona la córtex visual primario de los mamíferos. En consecuencia, el diccionario de aprendizaje aplicado a parches de imágenes ha demostrado dar buenos resultados en tareas de procesamiento de imágenes como la finalización, el repintado y la eliminación de ruido, así como en tareas de reconocimiento supervisado.

source: Dictionary learning is an optimization problem solved by alternatively updating the sparse code, as a solution to multiple Lasso problems, considering the dictionary fixed, and then updating the dictionary to best fit the sparse code.
es_es: El diccionario de aprendizaje es un problema de optimización que se resuelve actualizando alternativamente el código disperso, como solución a múltiples problemas de Lasso, considerando el diccionario fijo, y luego actualizando el diccionario para que se ajuste mejor al código disperso.

source: After using such a procedure to fit the dictionary, the transform is simply a sparse coding step that shares the same implementation with all dictionary learning objects (see :ref:`SparseCoder`).
es_es: Después de utilizar este procedimiento para ajustar el diccionario, la transformación es simplemente un paso de codificación dispersa que comparte la misma implementación con todos los objetos del diccionario de aprendizaje(véase :ref:`SparseCoder`).

source: It is also possible to constrain the dictionary and/or code to be positive to match constraints that may be present in the data. Below are the faces with different positivity constraints applied. Red indicates negative values, blue indicates positive values, and white represents zeros.
es_es: También es posible restringir el diccionario y/o el código para que sea positivo para que coincida con las restricciones que puedan estar presentes en los datos. A continuación se muestran las caras con diferentes restricciones de positividad aplicadas. El rojo indica valores negativos, el azul indica valores positivos y el blanco representa ceros.

source: The following image shows how a dictionary learned from 4x4 pixel image patches extracted from part of the image of a raccoon face looks like.
es_es: La siguiente imagen muestra el aspecto de un diccionario obtenido a partir de fragmentos de imagen de 4x4 píxeles extraídos de una zona de la imagen de la cara de un mapache.

source: Mini-batch dictionary learning
es_es: Diccionario de aprendizaje por mini lotes

source: :class:`MiniBatchDictionaryLearning` implements a faster, but less accurate version of the dictionary learning algorithm that is better suited for large datasets.
es_es: :class:`MiniBatchDictionaryLearning` implementa una versión más rápida, pero menos precisa, del algoritmo de diccionario de aprendizaje que es más adecuado para conjuntos de datos grandes.

source: By default, :class:`MiniBatchDictionaryLearning` divides the data into mini-batches and optimizes in an online manner by cycling over the mini-batches for the specified number of iterations. However, at the moment it does not implement a stopping condition.
es_es: Por defecto, :class:`MiniBatchDictionaryLearning` divide los datos en mini lotes y los optimiza de forma directa, recorriendo los mini lotes durante el número de iteraciones especificado. Sin embargo, por el momento no implementa una condición de parada.

source: The estimator also implements ``partial_fit``, which updates the dictionary by iterating only once over a mini-batch. This can be used for online learning when the data is not readily available from the start, or for when the data does not fit into the memory.
es_es: El estimador también implementa ``partial_fit``, que actualiza el diccionario iterando sólo una vez sobre un mini lote. Esto puede utilizarse para el aprendizaje en línea cuando los datos no están disponibles desde el principio, o para cuando los datos no caben en la memoria.

source: **Clustering for dictionary learning**
es_es: **Análisis de conglomerados para el aprendizaje de diccionario**

source: Note that when using dictionary learning to extract a representation (e.g. for sparse coding) clustering can be a good proxy to learn the dictionary. For instance the :class:`MiniBatchKMeans` estimator is computationally efficient and implements on-line learning with a ``partial_fit`` method.
es_es: Tenga en cuenta que cuando se utiliza el aprendizaje de diccionario para extraer una representación (por ejemplo, para la codificación dispersa) el análisis de conglomerados puede ser un buen sustituto para aprender el diccionario. Por ejemplo, el estimador :class:`MiniBatchKMeans` es computacionalmente eficiente e implementa el aprendizaje en línea con un método ``partial_fit``.

source: Example: :ref:`sphx_glr_auto_examples_cluster_plot_dict_face_patches.py`
es_es: Ejemplo: :ref:`sphx_glr_auto_examples_cluster_plot_dict_face_patches.py`

source: Factor Analysis
es_es: Análisis de factores

source: In unsupervised learning we only have a dataset :math:`X = \{x_1, x_2, \dots, x_n \}`. How can this dataset be described mathematically? A very simple `continuous latent variable` model for :math:`X` is
es_es: En el aprendizaje no supervisado sólo tenemos un conjunto de datos :math:`X = \{x_1, x_2, \dots, x_n \}`. ¿Cómo se puede describir matemáticamente este conjunto de datos? Un modelo muy sencillo de `variable latente continua` para :math:`X` es

source: The vector :math:`h_i` is called "latent" because it is unobserved. :math:`\epsilon` is considered a noise term distributed according to a Gaussian with mean 0 and covariance :math:`\Psi` (i.e. :math:`\epsilon \sim \mathcal{N}(0, \Psi)`), :math:`\mu` is some arbitrary offset vector. Such a model is called "generative" as it describes how :math:`x_i` is generated from :math:`h_i`. If we use all the :math:`x_i`'s as columns to form a matrix :math:`\mathbf{X}` and all the :math:`h_i`'s as columns of a matrix :math:`\mathbf{H}` then we can write (with suitably defined :math:`\mathbf{M}` and :math:`\mathbf{E}`):
es_es: El vector :math:`h_i` se llama "latente" porque no se observa. :math:`\epsilon` se considera un término de ruido distribuido según una Gaussiana con media 0 y covarianza :math:`\Psi` (es decir, :math:`\epsilon \sim \mathcal{N}(0, \Psi)`), :math:`\mu` es algún vector de desplazamiento arbitrario. Este modelo se llama "generativo", ya que describe cómo se genera :math:`x_i` a partir de :math:`h_i`. Si utilizamos todas las :math:`x_i` como columnas para formar una matriz :math:`\mathbf{X}` y todas las :math:`h_i` como columnas de una matriz :math:`\mathbf{H}` entonces podemos escribir (con :math:`\mathbf{M}` and :math:`\mathbf{E}` adecuadamente definidos):

source: In other words, we *decomposed* matrix :math:`\mathbf{X}`.
es_es: En otras palabras, hemos *descompuesto* la matriz :math:`\mathbf{X}`.

source: If :math:`h_i` is given, the above equation automatically implies the following probabilistic interpretation:
es_es: Si se da :math:`h_i`, la ecuación anterior implica automáticamente la siguiente interpretación probabilística:

source: For a complete probabilistic model we also need a prior distribution for the latent variable :math:`h`. The most straightforward assumption (based on the nice properties of the Gaussian distribution) is :math:`h \sim \mathcal{N}(0, \mathbf{I})`. This yields a Gaussian as the marginal distribution of :math:`x`:
es_es: Para un modelo probabilístico completo necesitamos también una distribución a priori para la variable latente :math:`h`. La suposición más directa (basada en las buenas propiedades de la distribución Gaussiana) es :math:`h \sim \mathcal{N}(0, \mathbf{I})`. Esto da como resultado una Gaussiana como distribución marginal de :math:`x`:

source: Now, without any further assumptions the idea of having a latent variable :math:`h` would be superfluous -- :math:`x` can be completely modelled with a mean and a covariance. We need to impose some more specific structure on one of these two parameters. A simple additional assumption regards the structure of the error covariance :math:`\Psi`:
es_es: Ahora, sin ninguna otra suposición, la idea de tener una variable latente :math:`h` sería superflua, ya que :math:`x` puede modelarse completamente con una media y una covarianza. Por ello, necesitamos imponer alguna estructura más específica a uno de estos dos parámetros. Una simple suposición adicional se refiere a la estructura de la covarianza del error :math:`\Psi`:

source: :math:`\Psi = \sigma^2 \mathbf{I}`: This assumption leads to the probabilistic model of :class:`PCA`.
es_es: :math:`\Psi = \sigma^2 \mathbf{I}`: Esta suposición conduce al modelo probabilístico de :class:`PCA`.

source: :math:`\Psi = \mathrm{diag}(\psi_1, \psi_2, \dots, \psi_n)`: This model is called :class:`FactorAnalysis`, a classical statistical model. The matrix W is sometimes called the "factor loading matrix".
es_es: :math:`\Psi = \mathrm{diag}(\psi_1, \psi_2, \dots, \psi_n)`: Este modelo se llama :class:`FactorAnalysis`, un modelo estadístico clásico. La matriz W se denomina a veces "matriz de carga de los factores".

source: Both models essentially estimate a Gaussian with a low-rank covariance matrix. Because both models are probabilistic they can be integrated in more complex models, e.g. Mixture of Factor Analysers. One gets very different models (e.g. :class:`FastICA`) if non-Gaussian priors on the latent variables are assumed.
es_es: Ambos modelos estiman esencialmente una Gaussiana con una matriz de covarianza de bajo rango. Como ambos modelos son probabilísticos, pueden integrarse en modelos más complejos como, por ejemplo, la Mezcla de Analizadores de Factores. Se obtienen modelos muy diferentes (por ejemplo, :class:`FastICA`) si se asumen no Gaussianos a priori en las variables latentes.

source: Factor analysis *can* produce similar components (the columns of its loading matrix) to :class:`PCA`. However, one can not make any general statements about these components (e.g. whether they are orthogonal):
es_es: El análisis factorial *puede* arrojar componentes similares (las columnas de su matriz de carga) al :class:`PCA`. Sin embargo, no se puede hacer ninguna afirmación general sobre estos componentes (por ejemplo, sobre si son ortogonales):

source: The main advantage for Factor Analysis over :class:`PCA` is that it can model the variance in every direction of the input space independently (heteroscedastic noise):
es_es: La principal ventaja del Análisis Factorial sobre el :class:`PCA` es que puede modelar la varianza en cada dirección del espacio de entrada de forma independiente (ruido heteroscedástico):

source: This allows better model selection than probabilistic PCA in the presence of heteroscedastic noise:
es_es: Esto permite una mejor selección del modelo que el PCA probabilístico en presencia de ruido heteroscedástico:

source: Factor Analysis is often followed by a rotation of the factors (with the parameter `rotation`), usually to improve interpretability. For example, Varimax rotation maximizes the sum of the variances of the squared loadings, i.e., it tends to produce sparser factors, which are influenced by only a few features each (the "simple structure"). See e.g., the first example below.
es_es: El análisis factorial suele ir seguido de una rotación de los factores (con el parámetro `rotation`), normalmente para mejorar la interpretabilidad. Por ejemplo, la rotación Varimax maximiza la suma de las varianzas de las cargas al cuadrado, es decir, tiende a producir factores más dispersos, en los que sólo influyen unas pocas características cada uno (la "estructura simple"). Véase, por ejemplo, el primer caso a continuación.

source: Independent component analysis (ICA)
es_es: Análisis de componentes independientes (ICA)

source: Independent component analysis separates a multivariate signal into additive subcomponents that are maximally independent. It is implemented in scikit-learn using the :class:`Fast ICA <FastICA>` algorithm. Typically, ICA is not used for reducing dimensionality but for separating superimposed signals. Since the ICA model does not include a noise term, for the model to be correct, whitening must be applied. This can be done internally using the whiten argument or manually using one of the PCA variants.
es_es: El análisis de componentes independientes separa una señal multivariante en subcomponentes aditivos que son independientes al máximo. Se implementa en scikit-learn utilizando el algoritmo :class:`Fast ICA <FastICA>`. Normalmente, el ICA no se utiliza para reducir la dimensionalidad, sino para separar las señales superpuestas. Dado que el modelo ICA no incluye un término de ruido, para que el modelo sea correcto se debe aplicar un whitening. Esto puede hacerse internamente usando el argumento whiten o manualmente usando una de las variantes de PCA.

source: It is classically used to separate mixed signals (a problem known as *blind source separation*), as in the example below:
es_es: Se utiliza tradicionalmente para separar señales mixtas (un problema conocido como *separación ciega de fuentes*), como en el ejemplo siguiente:

source: ICA can also be used as yet another non linear decomposition that finds components with some sparsity:
es_es: El ICA también puede utilizarse como otra descomposición no lineal que encuentra componentes con cierta dispersión:

source: Non-negative matrix factorization (NMF or NNMF)
es_es: Factorización matricial no negativa (NMF o NNMF)

source: NMF with the Frobenius norm
es_es: NMF con la norma de Frobenius

source: :class:`NMF` [1]_ is an alternative approach to decomposition that assumes that the data and the components are non-negative. :class:`NMF` can be plugged in instead of :class:`PCA` or its variants, in the cases where the data matrix does not contain negative values. It finds a decomposition of samples :math:`X` into two matrices :math:`W` and :math:`H` of non-negative elements, by optimizing the distance :math:`d` between :math:`X` and the matrix product :math:`WH`. The most widely used distance function is the squared Frobenius norm, which is an obvious extension of the Euclidean norm to matrices:
es_es: La :class:`NMF` [1]_ es un enfoque alternativo a la descomposición que asume que los datos y los componentes son no negativos. La :class:`NMF` puede utilizarse en lugar del :class:`PCA` o sus variantes, en los casos en que la matriz de datos no contenga valores negativos. Encuentra una descomposición de las muestras :math:`X` en dos matrices :math:`W` y :math:`H` de elementos no negativos, optimizando la distancia :math:`d` entre :math:`X` y el producto matricial :math:`WH`. La función de distancia más utilizada es la norma de Frobenius al cuadrado, que es una extensión obvia de la norma euclidiana a las matrices:

source: Unlike :class:`PCA`, the representation of a vector is obtained in an additive fashion, by superimposing the components, without subtracting. Such additive models are efficient for representing images and text.
es_es: A diferencia del :class:`PCA`, la representación de un vector se obtiene de forma aditiva, superponiendo los componentes, sin restar. Estos modelos aditivos son eficaces para representar imágenes y textos.

source: It has been observed in [Hoyer, 2004] [2]_ that, when carefully constrained, :class:`NMF` can produce a parts-based representation of the dataset, resulting in interpretable models. The following example displays 16 sparse components found by :class:`NMF` from the images in the Olivetti faces dataset, in comparison with the PCA eigenfaces.
es_es: Se ha observado en [Hoyer, 2004] [2]_ que, cuando se restringe cuidadosamente, la :class:`NMF` puede producir una representación basada en partes del conjunto de datos, dando lugar a modelos interpretables. El siguiente ejemplo muestra 16 componentes dispersos encontrados por :class:`NMF` a partir de las imágenes del conjunto de datos de rostros Olivetti, en comparación con las caras propias del PCA.

source: The :attr:`init` attribute determines the initialization method applied, which has a great impact on the performance of the method. :class:`NMF` implements the method Nonnegative Double Singular Value Decomposition. NNDSVD [4]_ is based on two SVD processes, one approximating the data matrix, the other approximating positive sections of the resulting partial SVD factors utilizing an algebraic property of unit rank matrices. The basic NNDSVD algorithm is better fit for sparse factorization. Its variants NNDSVDa (in which all zeros are set equal to the mean of all elements of the data), and NNDSVDar (in which the zeros are set to random perturbations less than the mean of the data divided by 100) are recommended in the dense case.
es_es: El atributo :attr:`init` determina el método de inicialización aplicado, que tiene un gran impacto en el rendimiento del método. La :class:`NMF` implementa el método Descomposición del Valor Singular Doble No Negativo. El NNDSVD [4]_ se basa en dos procesos SVD, uno aproximando la matriz de datos, el otro aproximando secciones positivas de los factores parciales SVD resultantes, utilizando una propiedad algebraica de las matrices de rango unitario. El algoritmo básico NNDSVD se adapta mejor a la factorización dispersa. Sus variantes NNDSVDa (en la que todos los ceros se ajustan a la media de todos los elementos de los datos), y NNDSVDar (en la que los ceros se fijan a perturbaciones aleatorias menores que la media de los datos dividida por 100) se recomiendan en el caso denso.

source: Note that the Multiplicative Update ('mu') solver cannot update zeros present in the initialization, so it leads to poorer results when used jointly with the basic NNDSVD algorithm which introduces a lot of zeros; in this case, NNDSVDa or NNDSVDar should be preferred.
es_es: Tenga en cuenta que el solucionador de actualización multiplicativa ('mu') no puede actualizar los ceros presentes en la inicialización, por lo que conduce a resultados más pobres cuando se utiliza conjuntamente con el algoritmo básico NNDSVD que introduce muchos ceros; en este caso, se debe preferir NNDSVDa o NNDSVDar.

source: :class:`NMF` can also be initialized with correctly scaled random non-negative matrices by setting :attr:`init="random"`. An integer seed or a ``RandomState`` can also be passed to :attr:`random_state` to control reproducibility.
es_es: La :class:`NMF` también puede inicializarse con matrices aleatorias no negativas correctamente escaladas estableciendo :attr:`init="random"`. También se puede pasar una semilla entera o un ``RandomState`` a :attr:`random_state` para controlar la reproducibilidad.
