Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/decomposition.po
Languages: es_es

source: In :class:`NMF`, L1 and L2 priors can be added to the loss function in order to regularize the model. The L2 prior uses the Frobenius norm, while the L1 prior uses an elementwise L1 norm. As in :class:`ElasticNet`, we control the combination of L1 and L2 with the :attr:`l1_ratio` (:math:`\rho`) parameter, and the intensity of the regularization with the :attr:`alpha` (:math:`\alpha`) parameter. Then the priors terms are:
es_es: En :class:`NMF`, se pueden añadir los valores a priori L1 y L2 a la función de pérdida para regularizar el modelo. El valor a priori L2 utiliza la norma de Frobenius, mientras que el valor a priori L1 utiliza una norma L1 elemental. Como en :class:`ElasticNet`, controlamos la combinación de L1 y L2 con el parámetro :attr:`l1_ratio` (:math:`\rho`), y la intensidad de la regularización con el parámetro :attr:`alpha` (:math:`\alpha`). Entonces los términos a priori son:

source: and the regularized objective function is:
es_es: y la función objetivo regularizada es:

source: :class:`NMF` regularizes both W and H by default. The :attr:`regularization` parameter allows for finer control, with which only W, only H, or both can be regularized.
es_es: La :class:`NMF` regulariza tanto W como H por defecto. El parámetro :attr:`regularization` permite un control más fino, con el que se puede regularizar sólo W, sólo H, o ambos.

source: NMF with a beta-divergence
es_es: NMF con una divergencia beta

source: As described previously, the most widely used distance function is the squared Frobenius norm, which is an obvious extension of the Euclidean norm to matrices:
es_es: Como se ha descrito anteriormente, la función de distancia más utilizada es la norma de Frobenius al cuadrado, que es una extensión obvia de la norma Euclidiana a las matrices:

source: Other distance functions can be used in NMF as, for example, the (generalized) Kullback-Leibler (KL) divergence, also referred as I-divergence:
es_es: Se pueden utilizar otras funciones de distancia en el NMF como, por ejemplo, la divergencia (generalizada) de Kullback-Leibler (KL), también denominada divergencia I:

source: Or, the Itakura-Saito (IS) divergence:
es_es: O la divergencia Itakura-Saito (IS):

source: These three distances are special cases of the beta-divergence family, with :math:`\beta = 2, 1, 0` respectively [6]_. The beta-divergence are defined by :
es_es: Estas tres distancias son casos especiales de la familia de las divergencias beta, con :math:`\beta = 2, 1, 0` respectivamente [6]_. Las divergencias beta se definen por:

source: Note that this definition is not valid if :math:`\beta \in (0; 1)`, yet it can be continuously extended to the definitions of :math:`d_{KL}` and :math:`d_{IS}` respectively.
es_es: Ten en cuenta que esta definición no es válida si :math:`\beta \in (0; 1)`, pero puede extenderse continuamente a las definiciones de :math:`d_{KL}` y :math:`d_{IS}` respectivamente.

source: :class:`NMF` implements two solvers, using Coordinate Descent ('cd') [5]_, and Multiplicative Update ('mu') [6]_. The 'mu' solver can optimize every beta-divergence, including of course the Frobenius norm (:math:`\beta=2`), the (generalized) Kullback-Leibler divergence (:math:`\beta=1`) and the Itakura-Saito divergence (:math:`\beta=0`). Note that for :math:`\beta \in (1; 2)`, the 'mu' solver is significantly faster than for other values of :math:`\beta`. Note also that with a negative (or 0, i.e. 'itakura-saito') :math:`\beta`, the input matrix cannot contain zero values.
es_es: La :class:`NMF` implementa dos solucionadores, utilizando el Descenso de Coordenadas ('cd') [5]_, y la Actualización Multiplicativa ('mu') [6]_. El solucionador 'mu' puede optimizar todas las divergencias beta, incluyendo por supuesto la norma de Frobenius (:math:`\beta=2`), la divergencia (generalizada) de Kullback-Leibler (:math:`\beta=1`) y la divergencia de Itakura-Saito (:math:`\beta=0`). Observa que para :math:`\beta \in (1; 2)`, el solucionador 'mu' es significativamente más rápido que para otros valores de :math:`beta`. Observa también que con un valor negativo (o 0, es decir, 'itakura-saito') de :math:`beta`, la matriz de entrada no puede contener valores cero.

source: The 'cd' solver can only optimize the Frobenius norm. Due to the underlying non-convexity of NMF, the different solvers may converge to different minima, even when optimizing the same distance function.
es_es: El solucionador 'cd' sólo puede optimizar la norma de Frobenius. Debido a la no-convexidad subyacente de la NMF, los diferentes solucionadores pueden converger en diferentes mínimos, incluso cuando se optimiza la misma función de distancia.

source: NMF is best used with the ``fit_transform`` method, which returns the matrix W. The matrix H is stored into the fitted model in the ``components_`` attribute; the method ``transform`` will decompose a new matrix X_new based on these stored components::
es_es: La NMF se utiliza mejor con el método ``fit_transform``, que devuelve la matriz W. La matriz H se almacena en el modelo ajustado en el atributo ``components_``; el método ``transform`` descompondrá una nueva matriz X_new basada en estos componentes almacenados::

source: Latent Dirichlet Allocation (LDA)
es_es: Asignación Latente de Dirichlet (LDA)

source: Latent Dirichlet Allocation is a generative probabilistic model for collections of discrete dataset such as text corpora. It is also a topic model that is used for discovering abstract topics from a collection of documents.
es_es: La Asignación Latente de Dirichlet es un modelo probabilístico generativo para colecciones de conjuntos de datos discretos, como los corpus de texto. También es un modelo temático que se utiliza para descubrir temas abstractos a partir de una colección de documentos.

source: The graphical model of LDA is a three-level generative model:
es_es: El modelo gráfico de LDA es un modelo generativo de tres niveles:

source: Note on notations presented in the graphical model above, which can be found in Hoffman et al. (2013):
es_es: Nota sobre las notaciones presentadas en el modelo gráfico anterior, que se puede encontrar en Hoffman et al. (2013):

source: The corpus is a collection of :math:`D` documents.
es_es: El corpus es una colección de documentos :math:`D`.

source: A document is a sequence of :math:`N` words.
es_es: Un documento es una secuencia de palabras :math:`N`.

source: There are :math:`K` topics in the corpus.
es_es: Hay temas :math:`K` en el corpus.

source: The boxes represent repeated sampling.
es_es: Los recuadros representan un muestreo repetido.

source: In the graphical model, each node is a random variable and has a role in the generative process. A shaded node indicates an observed variable and an unshaded node indicates a hidden (latent) variable. In this case, words in the corpus are the only data that we observe. The latent variables determine the random mixture of topics in the corpus and the distribution of words in the documents. The goal of LDA is to use the observed words to infer the hidden topic structure.
es_es: En el modelo gráfico, cada nodo es una variable aleatoria y tiene un papel en el proceso generativo. Un nodo sombreado indica una variable observada y un nodo no sombreado indica una variable oculta (latente). En este caso, las palabras del corpus son los únicos datos que observamos. Las variables latentes determinan la mezcla aleatoria de temas en el corpus y la distribución de palabras en los documentos. El objetivo del LDA es utilizar las palabras observadas para inferir la estructura temática oculta.

source: When modeling text corpora, the model assumes the following generative process for a corpus with :math:`D` documents and :math:`K` topics, with :math:`K` corresponding to :attr:`n_components` in the API:
es_es: Cuando se modelan corpus de texto, el modelo asume el siguiente proceso generativo para un corpus con :math:`D` documentos y :math:`K` temas, con :math:`K` correspondiente a :attr:`n_components` en el API:

source: For each topic :math:`k \in K`, draw :math:`\beta_k \sim \mathrm{Dirichlet}(\eta)`. This provides a distribution over the words, i.e. the probability of a word appearing in topic :math:`k`. :math:`\eta` corresponds to :attr:`topic_word_prior`.
es_es: Para cada tema :math:`k \in K`, dibujar :math:`\beta_k \sim \mathrm{Dirichlet}(\eta)`. Esto proporciona una distribución sobre las palabras, es decir, la probabilidad de que una palabra aparezca en el tema :math:`k`. :math:`\eta` corresponde a :attr:`topic_word_prior`.

source: For each document :math:`d \in D`, draw the topic proportions :math:`\theta_d \sim \mathrm{Dirichlet}(\alpha)`. :math:`\alpha` corresponds to :attr:`doc_topic_prior`.
es_es: Para cada documento :math:`d \in D`, dibujar las proporciones del tema :math:`\theta_d \sim \mathrm{Dirichlet}(\alpha)`. :math:`\alpha` corresponde a :attr:`doc_topic_prior`.

source: For each word :math:`i` in document :math:`d`:
es_es: Para cada palabra :math:`i` en el documento :math:`d`:

source: Draw the topic assignment :math:`z_{di} \sim \mathrm{Multinomial} (\theta_d)`
es_es: Dibuja la asignación del tema :math:`z_{di} \sim \mathrm{Multinomial} (\theta_d)`

source: Draw the observed word :math:`w_{ij} \sim \mathrm{Multinomial} (\beta_{z_{di}})`
es_es: Dibuja la palabra observada :math:`w_{ij} \sim \mathrm{Multinomial} (\beta_{z_{di}})`

source: For parameter estimation, the posterior distribution is:
es_es: Para la estimación de los parámetros, la distribución posterior es:

source: Since the posterior is intractable, variational Bayesian method uses a simpler distribution :math:`q(z,\theta,\beta | \lambda, \phi, \gamma)` to approximate it, and those variational parameters :math:`\lambda`, :math:`\phi`, :math:`\gamma` are optimized to maximize the Evidence Lower Bound (ELBO):
es_es: Como la posterior es inabordable, el método bayesiano variacional utiliza una distribución más simple :math:`q(z,\theta,\beta | \lambda, \phi, \gamma)` para aproximarla, y esos parámetros variacionales :math:`lambda`, :math:`\phi`, :math:`gamma` se optimizan para maximizar el Límite Inferior de Evidencia (ELBO):

source: Maximizing ELBO is equivalent to minimizing the Kullback-Leibler(KL) divergence between :math:`q(z,\theta,\beta)` and the true posterior :math:`p(z, \theta, \beta |w, \alpha, \eta)`.
es_es: Maximizar el ELBO es equivalente a minimizar la divergencia de Kullback-Leibler (KL) entre :math:`q(z,\theta,\beta)` y la verdadera posterior :math:`p(z, \theta, \beta |w, \alpha, \eta)`.

source: :class:`LatentDirichletAllocation` implements the online variational Bayes algorithm and supports both online and batch update methods. While the batch method updates variational variables after each full pass through the data, the online method updates variational variables from mini-batch data points.
es_es: :class:`LatentDirichletAllocation` implementa el algoritmo Bayes variacional en línea y admite métodos de actualización en línea y por lotes. Mientras que el método por lotes actualiza las variables variacionales después de cada paso completo por los datos, el método en línea actualiza las variables variacionales a partir de puntos de datos de mini lotes.

source: Although the online method is guaranteed to converge to a local optimum point, the quality of the optimum point and the speed of convergence may depend on mini-batch size and attributes related to learning rate setting.
es_es: Aunque se garantiza que el método en línea converge a un punto óptimo local, la calidad del punto óptimo y la velocidad de convergencia pueden depender del tamaño del mini lote y de los atributos relacionados con la configuración de la tasa de aprendizaje.

source: When :class:`LatentDirichletAllocation` is applied on a "document-term" matrix, the matrix will be decomposed into a "topic-term" matrix and a "document-topic" matrix. While "topic-term" matrix is stored as :attr:`components_` in the model, "document-topic" matrix can be calculated from ``transform`` method.
es_es: Cuando se aplica :class:`LatentDirichletAllocation` a una matriz "documento-término", la matriz se descompone en una matriz "tema-término" y una matriz "documento-tema". Mientras que la matriz "tema-término" se almacena como :attr:`components_` en el modelo, la matriz "documento-tema" puede calcularse a partir del método ``transform``.

source: :class:`LatentDirichletAllocation` also implements ``partial_fit`` method. This is used when data can be fetched sequentially.
es_es: :class:`LatentDirichletAllocation` también implementa el método ``partial_fit``. Se utiliza cuando los datos pueden obtenerse de forma secuencial.

source: See also :ref:`nca_dim_reduction` for dimensionality reduction with Neighborhood Components Analysis.
es_es: Revisa también :ref:`nca_dim_reduction` para la reducción de la dimensionalidad con el Análisis de Componentes de Vecindad.
