Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/decomposition.po
Languages: es_es

source: Decomposing signals in components (matrix factorization problems)
es_es: Descomposición de señales en componentes (problemas de factorización de matrices)

source: Principal component analysis (PCA)
es_es: Análisis de componentes principales (PCA)

source: Exact PCA and probabilistic interpretation
es_es: PCA exacto e interpretación probabilista

source: PCA is used to decompose a multivariate dataset in a set of successive orthogonal components that explain a maximum amount of the variance. In scikit-learn, :class:`PCA` is implemented as a *transformer* object that learns :math:`n` components in its ``fit`` method, and can be used on new data to project it on these components.
es_es: PCA se utiliza para descomponer un conjunto de datos multivariantes en un conjunto de componentes ortogonales sucesivos que explican una cantidad máxima de la varianza. En scikit-learn, :class:`PCA` es implementado como un objeto *transformador* que aprende componentes :math: `n` en su método ``fit``, y se puede utilizar en nuevos datos para proyectarlos en estos componentes.

source: PCA centers but does not scale the input data for each feature before applying the SVD. The optional parameter ``whiten=True`` makes it possible to project the data onto the singular space while scaling each component to unit variance. This is often useful if the models down-stream make strong assumptions on the isotropy of the signal: this is for example the case for Support Vector Machines with the RBF kernel and the K-Means clustering algorithm.
es_es: PCA centra pero no escala los datos de entrada para cada característica antes de aplicar la SVD. El parámetro opcional ``whiten=True`` permite proyectar los datos en el espacio singular mientras se escala cada componente a la varianza unitaria. Esto suele ser útil si los modelos subsiguientes hacen suposiciones firmes sobre la isotropía de la señal: este es el caso, por ejemplo, de las Máquinas de Vectores de Apoyo con el núcleo RBF y el algoritmo de agrupación K-Medias.

source: Below is an example of the iris dataset, which is comprised of 4 features, projected on the 2 dimensions that explain most variance:
es_es: A continuación se muestra un ejemplo del conjunto de datos del iris, que se compone de 4 características, proyectadas en las 2 dimensiones que explican la mayor parte de la varianza:

source: The :class:`PCA` object also provides a probabilistic interpretation of the PCA that can give a likelihood of data based on the amount of variance it explains. As such it implements a :term:`score` method that can be used in cross-validation:
es_es: El objeto :class:`PCA` también proporciona una interpretación probabilística del PCA que puede dar una verosimilitud de los datos basada en la cantidad de varianza que explica. Como tal, implementa un método :term:`score` que puede utilizarse en la validación cruzada:

source: Incremental PCA
es_es: PCA Incremental

source: The :class:`PCA` object is very useful, but has certain limitations for large datasets. The biggest limitation is that :class:`PCA` only supports batch processing, which means all of the data to be processed must fit in main memory. The :class:`IncrementalPCA` object uses a different form of processing and allows for partial computations which almost exactly match the results of :class:`PCA` while processing the data in a minibatch fashion. :class:`IncrementalPCA` makes it possible to implement out-of-core Principal Component Analysis either by:
es_es: El objeto :class:`PCA` es muy útil, pero tiene ciertas limitaciones para conjuntos de datos grandes. La mayor limitación es que :class:`PCA` sólo admite el procesamiento por lotes, lo que significa que todos los datos a procesar deben caber en la memoria principal. El objeto :class:`IncrementalPCA` utiliza una forma diferente de procesamiento y permite realizar cálculos parciales que coinciden casi exactamente con los resultados de :class:`PCA` mientras se procesan los datos de en mini lotes. :class:`IncrementalPCA` permite implementar el análisis de componentes principales fuera del núcleo:

source: Using its ``partial_fit`` method on chunks of data fetched sequentially from the local hard drive or a network database.
es_es: Utilizando su método ``partial_fit`` en fragmentos de datos obtenidos secuencialmente desde el disco duro local o de una base de datos en la red.

source: Calling its fit method on a sparse matrix or a memory mapped file using ``numpy.memmap``.
es_es: Llamando a su método de ajuste en una matriz dispersa o un archivo mapeado en memoria usando ``numpy.memmap``.

source: :class:`IncrementalPCA` only stores estimates of component and noise variances, in order update ``explained_variance_ratio_`` incrementally. This is why memory usage depends on the number of samples per batch, rather than the number of samples to be processed in the dataset.
es_es: :class:`IncrementalPCA` sólo almacena las estimaciones de las varianzas de los componentes y del ruido, con el fin de actualizar la ``explained_variance_ratio_`` de forma incremental. Por ello, el uso de la memoria depende del número de muestras por lote, y no del número de muestras a procesar en el conjunto de datos.

source: As in :class:`PCA`, :class:`IncrementalPCA` centers but does not scale the input data for each feature before applying the SVD.
es_es: Como en el :class:`PCA`, el :class:`IncrementalPCA` centra pero no escala los datos de entrada para cada característica antes de aplicar la SVD.

source: PCA using randomized SVD
es_es: PCA usando SVD aleatorio

source: It is often interesting to project data to a lower-dimensional space that preserves most of the variance, by dropping the singular vector of components associated with lower singular values.
es_es: A menudo es interesante proyectar los datos a un espacio de menor dimensión que conserve la mayor parte de la varianza, dejando de lado el vector singular de los componentes asociados a los valores singulares más bajos.

source: For instance, if we work with 64x64 pixel gray-level pictures for face recognition, the dimensionality of the data is 4096 and it is slow to train an RBF support vector machine on such wide data. Furthermore we know that the intrinsic dimensionality of the data is much lower than 4096 since all pictures of human faces look somewhat alike. The samples lie on a manifold of much lower dimension (say around 200 for instance). The PCA algorithm can be used to linearly transform the data while both reducing the dimensionality and preserve most of the explained variance at the same time.
es_es: Por ejemplo, si trabajamos con imágenes de 64x64 píxeles de escala de grises para el reconocimiento facial, la dimensionalidad de los datos es de 4096 y se hace lento entrenar una máquina de vectores de soporte RBF en datos tan amplios. Además, sabemos que la dimensionalidad intrínseca de los datos es mucho menor que 4096, ya que todas las imágenes de rostros humanos se parecen en cierto modo. Las muestras se sitúan en una matriz de dimensión mucho menor (por ejemplo, alrededor de 200). El algoritmo PCA puede utilizarse para transformar linealmente los datos y, al mismo tiempo, reducir la dimensionalidad y conservar la mayor parte de la varianza explicada.

source: The class :class:`PCA` used with the optional parameter ``svd_solver='randomized'`` is very useful in that case: since we are going to drop most of the singular vectors it is much more efficient to limit the computation to an approximated estimate of the singular vectors we will keep to actually perform the transform.
es_es: La clase :class:`PCA` utilizada con el parámetro opcional ``svd_solver='randomized'`` es muy útil en ese caso: como vamos a descartar la mayoría de los vectores singulares, es mucho más eficiente limitar el cálculo a una estimación aproximada de los vectores singulares que mantendremos para realizar realmente la transformación.

source: For instance, the following shows 16 sample portraits (centered around 0.0) from the Olivetti dataset. On the right hand side are the first 16 singular vectors reshaped as portraits. Since we only require the top 16 singular vectors of a dataset with size :math:`n_{samples} = 400` and :math:`n_{features} = 64 \times 64 = 4096`, the computation time is less than 1s:
es_es: Por ejemplo, a continuación se presentan 16 retratos de muestra (centrados en 0,0) del conjunto de datos Olivetti. En el lado derecho están los primeros 16 vectores singulares transformados en retratos. Dado que sólo necesitamos los 16 primeros vectores singulares de un conjunto de datos con tamaño :math:`n_{samples} = 400` y :math:`n_{features} = 64 \times 64 = 4096`, el tiempo de cálculo es inferior a 1s:

source: If we note :math:`n_{\max} = \max(n_{\mathrm{samples}}, n_{\mathrm{features}})` and :math:`n_{\min} = \min(n_{\mathrm{samples}}, n_{\mathrm{features}})`, the time complexity of the randomized :class:`PCA` is :math:`O(n_{\max}^2 \cdot n_{\mathrm{components}})` instead of :math:`O(n_{\max}^2 \cdot n_{\min})` for the exact method implemented in :class:`PCA`.
es_es: Si observamos :math:`n_{\max} = \max(n_{\mathrm{samples}}, n_{\mathrm{features}})` y :math:`n_{\min} = \min(n_{\mathrm{samples}}, n_{\mathrm{features}})`, la complejidad temporal del :class:`PCA` aleatoriado es :math:`O(n_{\max}^2 \cdot n_{\mathrm{components}})` en lugar de :math:`O(n_{\max}^2 \cdot n_{\min})` para el método exacto implementado en :class:`PCA`.

source: The memory footprint of randomized :class:`PCA` is also proportional to :math:`2 \cdot n_{\max} \cdot n_{\mathrm{components}}` instead of :math:`n_{\max} \cdot n_{\min}` for the exact method.
es_es: La huella de memoria del :class:`PCA` aleatorio también es proporcional a :math:`2 \cdot n_{\max} en lugar de \cdot n_{\mathrm{components}} en lugar de :math:`n_{\max} \cdot n_{\min}` para el método exacto.

source: Note: the implementation of ``inverse_transform`` in :class:`PCA` with ``svd_solver='randomized'`` is not the exact inverse transform of ``transform`` even when ``whiten=False`` (default).
es_es: Nota: la implementación de ``inverse_transform`` en :class:`PCA` con ``svd_solver='randomized'`` no es la transformada inversa exacta de ``transform`` incluso cuando ``whiten=False`` (por defecto).

source: :class:`KernelPCA` is an extension of PCA which achieves non-linear dimensionality reduction through the use of kernels (see :ref:`metrics`). It has many applications including denoising, compression and structured prediction (kernel dependency estimation). :class:`KernelPCA` supports both ``transform`` and ``inverse_transform``.
es_es: :class:`KernelPCA` es una extensión de PCA que obtiene una reducción de la dimensionalidad no lineal mediante el uso de kernels (ver :ref:`metrics`). Tiene muchas aplicaciones, incluyendo la eliminación de ruido, la compresión y la predicción estructurada (estimación de la dependencia del núcleo). :class:`KernelPCA` soporta tanto la ``transform`` como la ``inverse_transform``.

source: Sparse principal components analysis (SparsePCA and MiniBatchSparsePCA)
es_es: Análisis de componentes principales dispersos (SparsePCA y MiniBatchSparsePCA)

source: :class:`SparsePCA` is a variant of PCA, with the goal of extracting the set of sparse components that best reconstruct the data.
es_es: :class:`SparsePCA` es una variante del PCA, cuyo objetivo es extraer el conjunto de componentes dispersos que mejor reconstruyen los datos.

source: Mini-batch sparse PCA (:class:`MiniBatchSparsePCA`) is a variant of :class:`SparsePCA` that is faster but less accurate. The increased speed is reached by iterating over small chunks of the set of features, for a given number of iterations.
es_es: El PCA disperso en mini lotes (:class:`MiniBatchSparsePCA`) es una variante de :class:`SparsePCA` que es más rápida pero menos precisa. El aumento de la velocidad se consigue iterando sobre pequeñas porciones del conjunto de características, para un número determinado de iteraciones.

source: Principal component analysis (:class:`PCA`) has the disadvantage that the components extracted by this method have exclusively dense expressions, i.e. they have non-zero coefficients when expressed as linear combinations of the original variables. This can make interpretation difficult. In many cases, the real underlying components can be more naturally imagined as sparse vectors; for example in face recognition, components might naturally map to parts of faces.
es_es: El análisis de componentes principales (:class:`PCA`) tiene el inconveniente de que los componentes extraídos por este método tienen expresiones exclusivamente densas, es decir, tienen coeficientes distintos de cero cuando se expresan como combinaciones lineales de las variables originales. Esto puede dificultar su interpretación. En muchos casos, los componentes reales subyacentes pueden pensarse más naturalmente como vectores dispersos; por ejemplo, en el reconocimiento de rostros, los componentes podrían asignarse naturalmente a partes de rostros.

source: Sparse principal components yields a more parsimonious, interpretable representation, clearly emphasizing which of the original features contribute to the differences between samples.
es_es: Los componentes principales dispersos producen una representación más sencilla e interpretable, destacando claramente cuáles son las características originales que contribuyen a las diferencias entre las muestras.

source: The following example illustrates 16 components extracted using sparse PCA from the Olivetti faces dataset. It can be seen how the regularization term induces many zeros. Furthermore, the natural structure of the data causes the non-zero coefficients to be vertically adjacent. The model does not enforce this mathematically: each component is a vector :math:`h \in \mathbf{R}^{4096}`, and there is no notion of vertical adjacency except during the human-friendly visualization as 64x64 pixel images. The fact that the components shown below appear local is the effect of the inherent structure of the data, which makes such local patterns minimize reconstruction error. There exist sparsity-inducing norms that take into account adjacency and different kinds of structure; see [Jen09]_ for a review of such methods. For more details on how to use Sparse PCA, see the Examples section, below.
es_es: El siguiente ejemplo ilustra 16 componentes extraídos mediante PCA disperso del conjunto de datos de rostros Olivetti. Se puede observar cómo el término de regularización induce muchos ceros. Además, la estructura natural de los datos hace que los coeficientes no nulos sean verticalmente adyacentes.El modelo no impone esto matemáticamente: cada componente es un vector :math:`h \in \mathbf{R}^{4096}`, y no hay ninguna noción de adyacencia vertical excepto durante la visualización amigable para el ser humano como imágenes de 64x64 píxeles. El hecho de que los componentes mostrados a continuación aparezcan locales es el efecto de la estructura inherente de los datos, que hace que tales patrones locales minimicen el error de reconstrucción. Existen normas que inducen la dispersión que tienen en cuenta la adyacencia y diferentes tipos de estructura; véase [Jen09]_ para una revisión de tales métodos. Para más detalles sobre el uso de Sparse PCA, véase la sección Ejemplos, más abajo.

source: Note that there are many different formulations for the Sparse PCA problem. The one implemented here is based on [Mrl09]_ . The optimization problem solved is a PCA problem (dictionary learning) with an :math:`\ell_1` penalty on the components:
es_es: Tenga en cuenta que hay muchas formulaciones diferentes para el problema de Sparse PCA. La implementada aquí se basa en [Mrl09]_ . El problema de optimización que se resuelve es un problema PCA (diccionario de aprendizaje) con una penalidad :math:`\ell_1` sobre los componentes:

source: The sparsity-inducing :math:`\ell_1` norm also prevents learning components from noise when few training samples are available. The degree of penalization (and thus sparsity) can be adjusted through the hyperparameter ``alpha``. Small values lead to a gently regularized factorization, while larger values shrink many coefficients to zero.
es_es: La norma :math:`\ell_1`, que induce la dispersión, también impide el aprendizaje de componentes a partir del ruido cuando se dispone de pocas muestras. El grado de penalidad (y, por tanto, la dispersión) puede ajustarse mediante el hiperparámetro ``alpha``. Los valores pequeños conducen a una factorización ligeramente regularizada, mientras que los valores más grandes reducen muchos coeficientes a cero.

source: While in the spirit of an online algorithm, the class :class:`MiniBatchSparsePCA` does not implement ``partial_fit`` because the algorithm is online along the features direction, not the samples direction.
es_es: Aunque se trata de un algoritmo online, la clase :class:`MiniBatchSparsePCA` no implementa ``partial_fit`` porque el algoritmo está en línea en la dirección de las características, no en la dirección de las muestras.

source: Truncated singular value decomposition and latent semantic analysis
es_es: Descomposición de valor singular truncado y análisis semántico latente

source: :class:`TruncatedSVD` implements a variant of singular value decomposition (SVD) that only computes the :math:`k` largest singular values, where :math:`k` is a user-specified parameter.
es_es: :class:`TruncatedSVD` implementa una variante de la descomposición del valor singular (SVD) que sólo calcula los valores singulares más grandes de :math:`k`, donde :math:`k` es un parámetro especificado por el usuario.

source: When truncated SVD is applied to term-document matrices (as returned by :class:`~sklearn.feature_extraction.text.CountVectorizer` or :class:`~sklearn.feature_extraction.text.TfidfVectorizer`), this transformation is known as `latent semantic analysis <https://nlp.stanford.edu/IR-book/pdf/18lsi.pdf>`_ (LSA), because it transforms such matrices to a "semantic" space of low dimensionality. In particular, LSA is known to combat the effects of synonymy and polysemy (both of which roughly mean there are multiple meanings per word), which cause term-document matrices to be overly sparse and exhibit poor similarity under measures such as cosine similarity.
es_es: Cuando se aplica la SVD truncada a las matrices término-documento (como las devueltas por :class:`~sklearn.feature_extraction.text.CountVectorizer` o :class:`~sklearn.feature_extraction.text.TfidfVectorizer`), esta transformación se conoce como `análisis semántico latente <https://nlp.stanford.edu/IR-book/pdf/18lsi.pdf>`_ (LSA), porque transforma dichas matrices a un espacio "semántico" de baja dimensionalidad. En particular, el LSA es conocido por combatir los efectos de la sinonimia y la polisemia (ambos significan, a grandes rasgos, que hay múltiples significados por palabra), que hacen que las matrices término-documento sean demasiado escasas y muestren una pobre similitud bajo medidas como la similitud del coseno.

source: LSA is also known as latent semantic indexing, LSI, though strictly that refers to its use in persistent indexes for information retrieval purposes.
es_es: El LSA también se conoce como indexación semántica latente, LSI, aunque estrictamente se refiere a su uso en índices persistentes con fines de recuperación de información.

source: Mathematically, truncated SVD applied to training samples :math:`X` produces a low-rank approximation :math:`X`:
es_es: Matemáticamente, la SVD truncada aplicada a las muestras de entrenamiento :math:`X` produce una aproximación de bajo rango :math:`X`:

source: After this operation, :math:`U_k \Sigma_k^\top` is the transformed training set with :math:`k` features (called ``n_components`` in the API).
es_es: Después de esta operación, :math:`U_k \Sigma_k^\top` es el conjunto de entrenamiento transformado con características :math:`k` (llamadas ``n_components`` en la API).

source: To also transform a test set :math:`X`, we multiply it with :math:`V_k`:
es_es: Para transformar también un conjunto de pruebas :math:`X`, lo multiplicamos por :math:`V_k`:

source: Most treatments of LSA in the natural language processing (NLP) and information retrieval (IR) literature swap the axes of the matrix :math:`X` so that it has shape ``n_features`` × ``n_samples``. We present LSA in a different way that matches the scikit-learn API better, but the singular values found are the same.
es_es: La mayoría de los tratamientos de LSA en el procesamiento de lenguaje natural (PLN) y la literatura de recuperación de información (RI) intercambian los ejes de la matriz :math:`X` para que tenga forma ``n_features`` × ``n_samples``. Presentamos la LSA de una manera diferente que se ajusta mejor con la API de la scikit-learn, pero los valores singulares encontrados son los mismos.

source: :class:`TruncatedSVD` is very similar to :class:`PCA`, but differs in that the matrix :math:`X` does not need to be centered. When the columnwise (per-feature) means of :math:`X` are subtracted from the feature values, truncated SVD on the resulting matrix is equivalent to PCA. In practical terms, this means that the :class:`TruncatedSVD` transformer accepts ``scipy.sparse`` matrices without the need to densify them, as densifying may fill up memory even for medium-sized document collections.
es_es: :class:`TruncatedSVD` es muy similar a :class:`PCA`, pero difiere en que la matriz :math:`X` no necesita estar centrada. Cuando las medias a nivel de columna (por característica) de :math:`X` se restan de los valores de las características, la SVD truncada en la matriz resultante es equivalente a la PCA. En términos prácticos, esto significa que el transformador :class:`TruncatedSVD` acepta matrices ``scipy.sparse`` sin necesidad de densificarlas, ya que la densificación puede llenar la memoria incluso para colecciones de documentos de tamaño medio.

source: While the :class:`TruncatedSVD` transformer works with any feature matrix, using it on tf–idf matrices is recommended over raw frequency counts in an LSA/document processing setting. In particular, sublinear scaling and inverse document frequency should be turned on (``sublinear_tf=True, use_idf=True``) to bring the feature values closer to a Gaussian distribution, compensating for LSA's erroneous assumptions about textual data.
es_es: Aunque el transformador :class:`TruncatedSVD` funciona con cualquier matriz de características, se recomienda su uso con matrices tf-idf en lugar de con recuentos de frecuencias en bruto en un entorno de procesamiento de LSA/documentos. En particular, el escalado sublineal y la frecuencia inversa del documento deberían estar activados (``sublinear_tf=True, use_idf=True``) para acercar los valores de las características a una Distribución Gaussiana, compensando las suposiciones erróneas de LSA sobre los datos textuales.

source: Dictionary Learning
es_es: Diccionario de aprrendizaje

source: Sparse coding with a precomputed dictionary
es_es: Codificación dispersa con un diccionario precalculado
