Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/ensemble.po
Languages: es_es

source: The idea behind the :class:`VotingRegressor` is to combine conceptually different machine learning regressors and return the average predicted values. Such a regressor can be useful for a set of equally well performing models in order to balance out their individual weaknesses.
es_es: La idea detrás del :class:`VotingClassifier` es combinar regresores de machine learning conceptualmente distintos y devolver el promedio de probabilidades predichas. Este tipo de regresor puede ser útil para un conjunto de modelos de igual rendimiento a fin de equilibrar sus debilidades individuales.

source: The following example shows how to fit the VotingRegressor::
es_es: El siguiente ejemplo muestra cómo ajustar el VotingRegressor::

source: Stacked generalization
es_es: Generalización apilada

source: Stacked generalization is a method for combining estimators to reduce their biases [W1992]_ [HTF]_. More precisely, the predictions of each individual estimator are stacked together and used as input to a final estimator to compute the prediction. This final estimator is trained through cross-validation.
es_es: La generalización apilada es un método combinar estimadores y así reducir sus sesgos [W1992]_ [HTF]_. Para ser mas precisos, las predicciones de cada estimador individual se apilan juntos y se usan como entrada a un estimador final para calcular la predicción. Este ultimo estimador es entrenado a través de la validación cruzada.

source: The :class:`StackingClassifier` and :class:`StackingRegressor` provide such strategies which can be applied to classification and regression problems.
es_es: Los :class:`StackingClassifier` y :class:`StackingRegressor` proporcionan tales estrategias, las cuales se pueden aplicar a problemas tanto de clasificación como de regresión.

source: The `estimators` parameter corresponds to the list of the estimators which are stacked together in parallel on the input data. It should be given as a list of names and estimators::
es_es: El parámetro `estimators` corresponde a la lista de estimadores que se apilan juntos en paralelo en los datos de entrada. Debe ser dado como una lista de nombres y estimadores::

source: The `final_estimator` will use the predictions of the `estimators` as input. It needs to be a classifier or a regressor when using :class:`StackingClassifier` or :class:`StackingRegressor`, respectively::
es_es: El `final_estimator` usará las predicciones de los `estimators` como entrada. Debe ser un clasificador o un regresor cuando se utiliza :class:`StackingClassifier` o :class:`StackingRegressor`, respectivamente::

source: To train the `estimators` and `final_estimator`, the `fit` method needs to be called on the training data::
es_es: Para entrenar a `estimators` y `final_estimator`, el método `fit` necesita ser llamado en los datos de entrenamiento::

source: During training, the `estimators` are fitted on the whole training data `X_train`. They will be used when calling `predict` or `predict_proba`. To generalize and avoid over-fitting, the `final_estimator` is trained on out-samples using :func:`sklearn.model_selection.cross_val_predict` internally.
es_es: Durante el entrenamiento, los `estimators` se ajustan en todos los datos de entrenamiento `X_train`. Serán utilizados al llamar a `predict` o `predict_proba`. Para generalizar y evitar sobreajustes, el `final_estimator` es entrenado en muestras externas usando :func:`sklearn.model_selection.cross_val_predict` internamente.

source: For :class:`StackingClassifier`, note that the output of the ``estimators`` is controlled by the parameter `stack_method` and it is called by each estimator. This parameter is either a string, being estimator method names, or `'auto'` which will automatically identify an available method depending on the availability, tested in the order of preference: `predict_proba`, `decision_function` and `predict`.
es_es: Para :class:`StackingClassifier`, tenga en cuenta que la salida de los ``estimators`` está controlada por el parámetro `stack_method` y es llamada por cada estimador. Este parámetro puede ser tanto una cadena, con los nombres de métodos de estimador, o `'auto'` que identificará automáticamente un método disponible dependiendo de la disponibilidad, probado en el siguiente orden de preferencia: `predict_proba`, `decision_function` y `predict`.

source: A :class:`StackingRegressor` and :class:`StackingClassifier` can be used as any other regressor or classifier, exposing a `predict`, `predict_proba`, and `decision_function` methods, e.g.::
es_es: Un :class:`StackingRegressor` y :class:`StackingClassifier` pueden ser usados como cualquier otro regresor o clasificador, exponiendo los métodos `predict`, `predict_proba`, y `decision_function`, por ejemplo.::

source: Note that it is also possible to get the output of the stacked `estimators` using the `transform` method::
es_es: Ten en cuenta que también es posible obtener la salida de los `estimators` apilados utilizando el método `transform`::

source: In practice, a stacking predictor predicts as good as the best predictor of the base layer and even sometimes outperforms it by combining the different strengths of the these predictors. However, training a stacking predictor is computationally expensive.
es_es: En la práctica, un predictor de apilado predice tan bien como el mejor predictor de la capa base e inclusive a veces lo supera combinando las diferentes fortalezas de estos predictores. Sin embargo, entrenar un predictor apilado es costoso computacionalmente.

source: For :class:`StackingClassifier`, when using `stack_method_='predict_proba'`, the first column is dropped when the problem is a binary classification problem. Indeed, both probability columns predicted by each estimator are perfectly collinear.
es_es: Para :class:`StackingClassifier`, al usar `stack_method_='predict_proba'`, la primera columna se elimina cuando el problema es un problema de clasificación binaria. En efecto, ambas columnas de probabilidad predichas por cada estimador son perfectamente colineales.

source: Multiple stacking layers can be achieved by assigning `final_estimator` to a :class:`StackingClassifier` or :class:`StackingRegressor`::
es_es: Múltiples capas de apilación se pueden conseguir asignando `final_estimator` a un :class:`StackingClassifier` o :class:`StackingRegressor`::
