Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/ensemble.po
Languages: es_es

source: In practice those estimates are stored as an attribute named ``feature_importances_`` on the fitted model. This is an array with shape ``(n_features,)`` whose values are positive and sum to 1.0. The higher the value, the more important is the contribution of the matching feature to the prediction function.
es_es: En la practica, estos estimados se almacenan como un atributo llamado ``feature_importances_`` en el modelo ajustado. Este es un array de forma ``(n_features,)`` cuyos valores son positivos y cuya suma resulta en 1.0. Mientras mas grande sea el valor, mas importante va a ser la contribución de la característica correspondiente a la función de predicción.

source: Totally Random Trees Embedding
es_es: Incrustación de Arboles Totalmente Aleatorios

source: :class:`RandomTreesEmbedding` implements an unsupervised transformation of the data. Using a forest of completely random trees, :class:`RandomTreesEmbedding` encodes the data by the indices of the leaves a data point ends up in. This index is then encoded in a one-of-K manner, leading to a high dimensional, sparse binary coding. This coding can be computed very efficiently and can then be used as a basis for other learning tasks. The size and sparsity of the code can be influenced by choosing the number of trees and the maximum depth per tree. For each tree in the ensemble, the coding contains one entry of one. The size of the coding is at most ``n_estimators * 2 ** max_depth``, the maximum number of leaves in the forest.
es_es: :class:`RandomTreesEmbedding` implementa una transformación no supervisada de los datos. Usando un bosque de árboles completamente aleatorios, :class:`RandomTreesEmbedding` codifica los datos mediante los índices de las hojas en las que termina un punto de datos. Este índice es entonces codificado de una manera one-of-K, dando lugar a una codificación binaria dispersa y de alta dimensión. Esta codificación puede ser eficientemente calculada y después ser usada como una base para otras tareas de aprendizaje. El tamaño y la dispersión del codigo puede ser influenciada eligiendo el número de árboles y la profundidad máxima por árbol. Por cada árbol en el conjunto, la codificación contiene una entrada de uno. El tamaño de la codificación es a lo mas ``n_estimators * 2 ** max_depth``, el número máximo de hojas en el bosque.

source: As neighboring data points are more likely to lie within the same leaf of a tree, the transformation performs an implicit, non-parametric density estimation.
es_es: Ya que los puntos de datos vecinos son mas probables a estar dentro de la misma hoja de un árbol, la transformación realiza una estimación de densidad implícita y no paramétrica.

source: The module :mod:`sklearn.ensemble` includes the popular boosting algorithm AdaBoost, introduced in 1995 by Freund and Schapire [FS1995]_.
es_es: El módulo :mod:`sklearn.ensemble` incluye el popular algoritmo de boosting AdaBoost, introducido en 1995 por Freund y Schapire [FS1995]_.

source: The core principle of AdaBoost is to fit a sequence of weak learners (i.e., models that are only slightly better than random guessing, such as small decision trees) on repeatedly modified versions of the data. The predictions from all of them are then combined through a weighted majority vote (or sum) to produce the final prediction. The data modifications at each so-called boosting iteration consist of applying weights :math:`w_1`, :math:`w_2`, ..., :math:`w_N` to each of the training samples. Initially, those weights are all set to :math:`w_i = 1/N`, so that the first step simply trains a weak learner on the original data. For each successive iteration, the sample weights are individually modified and the learning algorithm is reapplied to the reweighted data. At a given step, those training examples that were incorrectly predicted by the boosted model induced at the previous step have their weights increased, whereas the weights are decreased for those that were predicted correctly. As iterations proceed, examples that are difficult to predict receive ever-increasing influence. Each subsequent weak learner is thereby forced to concentrate on the examples that are missed by the previous ones in the sequence [HTF]_.
es_es: El principio básico de AdaBoost es encajar una secuencia de aprendices débiles (es decir, modelos que solo son ligeramente mejores que adivinar al azar, como los árboles de decisión pequeños) en versiones repetidamente modificadas de los datos. Las predicciones de todos ellos son entonces combinados mediante un voto por mayoría ponderado (o suma) para producir la última predicción. Las modificaciones de datos en cada iteración de boosting consisten en aplicar los ponderados :math:`w_1`, :math:`w_2`, ..., :math:`w_N` a cada una de las muestras de entrenamiento. Inicialmente, esos ponderados son todos establecidos como :math:`w_i = 1/N`, para que el primer paso simplemente entrene a un aprendiz débil con los datos originales. Para cada iteración sucesiva, los ponderados de la muestra son modificados individualmente y el algoritmo de aprendizaje es aplicado de nuevo a los datos reponderados. En un paso determinado, se incrementan los ponderados de aquellos ejemplos de entrenamiento que fueron predichos incorrectamente por el modelo con boosting inducido en el paso anterior, mientras que los ponderados son disminuidos para aquellos que fueron predichos correctamente. Con cada iteración, los ejemplos que fueron difíciles de predecir reciben influencia cada vez mayor. Cada aprendedor débil subsecuente es entonces forzado a concentrarse en los ejemplos que fueron omitidos por aquellos anteriores en la secuencia [HTF]_.

source: AdaBoost can be used both for classification and regression problems:
es_es: AdaBoost puede ser utilizado tanto para problemas de clasificación como de regresión:

source: For multi-class classification, :class:`AdaBoostClassifier` implements AdaBoost-SAMME and AdaBoost-SAMME.R [ZZRH2009]_.
es_es: Para clasificación multiclase, :class:`AdaBoostClassifier` implementa AdaBoost-SAMME y AdaBoost-SAMME.R [ZZRH2009]_.

source: For regression, :class:`AdaBoostRegressor` implements AdaBoost.R2 [D1997]_.
es_es: Para la regresión, :class:`AdaBoostRegressor` implementa AdaBoost.R2 [D1997]_.

source: Usage
es_es: Uso

source: The following example shows how to fit an AdaBoost classifier with 100 weak learners::
es_es: El siguiente ejemplo muestra cómo ajustar un clasificador AdaBoost con 100 aprendices débiles::

source: The number of weak learners is controlled by the parameter ``n_estimators``. The ``learning_rate`` parameter controls the contribution of the weak learners in the final combination. By default, weak learners are decision stumps. Different weak learners can be specified through the ``base_estimator`` parameter. The main parameters to tune to obtain good results are ``n_estimators`` and the complexity of the base estimators (e.g., its depth ``max_depth`` or minimum required number of samples to consider a split ``min_samples_split``).
es_es: El número de aprendices débiles es controlado por el parámetro ``n_estimators``. El parámetro ``learning_rate`` controla la contribución de los aprendices débiles en la última combinación. Por defecto, los aprendices débiles son topes de decisión. Diferentes aprendices débiles pueden ser especificados a través del parámetro ``base_estimator``. Los principales parámetros a ajustar para obtener buenos resultados son ``n_estimators`` y la complejidad de los estimadores base (por ejemplo, su profundidad ``max_depth`` o número mínimo requerido de muestras para considerar una división ``min_samples_split``).

source: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_hastie_10_2.py` compares the classification error of a decision stump, decision tree, and a boosted decision stump using AdaBoost-SAMME and AdaBoost-SAMME.R.
es_es: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_hastie_10_2.py` compara el error de clasificación de un tope de decisión, árbol de decisión, y un tope de decisión con boosting usando AdaBoost-SAMME y AdaBoost-SAMME.R.

source: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_multiclass.py` shows the performance of AdaBoost-SAMME and AdaBoost-SAMME.R on a multi-class problem.
es_es: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_multiclass.py` muestra el rendimiento de AdaBoost-SAMME y AdaBoost-SAMME.R en un problema de multiclase.

source: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_twoclass.py` shows the decision boundary and decision function values for a non-linearly separable two-class problem using AdaBoost-SAMME.
es_es: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_twoclass.py` muestra el límite de decisión y los valores de la función de decisión para un problema de dos clases separables no linealmente usando AdaBoost-SAMME.

source: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_regression.py` demonstrates regression with the AdaBoost.R2 algorithm.
es_es: :ref:`sphx_glr_auto_examples_ensemble_plot_adaboost_regression.py` demuestra regresión con el algoritmo AdaBoost.R2.

source: `Gradient Tree Boosting <https://en.wikipedia.org/wiki/Gradient_boosting>`_ or Gradient Boosted Decision Trees (GBDT) is a generalization of boosting to arbitrary differentiable loss functions. GBDT is an accurate and effective off-the-shelf procedure that can be used for both regression and classification problems in a variety of areas including Web search ranking and ecology.
es_es: `Gradient Tree Boosting <https://en.wikipedia.org/wiki/Gradient_boosting>`_ o Gradient Boosted Decision Trees (GBDT) es una generalización del boosting a funciones de pérdida diferenciable arbitrarias. GBDT es un procedimiento preciso y efectivo que puede ser usado tanto para problemas de regresión como de clasificación en una variedad de areas, incluyendo la ecología y el ranking de búsquedas Web.

source: The module :mod:`sklearn.ensemble` provides methods for both classification and regression via gradient boosted decision trees.
es_es: El módulo :mod:`sklearn.ensemble` proporciona métodos para clasificación y regresión mediante árboles de decisión con boosting por gradiente.

source: Scikit-learn 0.21 introduces two new experimental implementations of gradient boosting trees, namely :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor`, inspired by `LightGBM <https://github.com/Microsoft/LightGBM>`__ (See [LightGBM]_).
es_es: Scikit-learn 0.21 introduce dos nuevas implementaciones y experimentales de árboles con boosting por gradientes, principalmente :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor`, inspirado por `LightGBM <https://github.com/Microsoft/LightGBM>`__ (Ver [LightGBM]_).

source: These histogram-based estimators can be **orders of magnitude faster** than :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor` when the number of samples is larger than tens of thousands of samples.
es_es: Estos estimadores basados en histogramas pueden ser **órdenes de magnitud más rápidos** que :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor` cuando el número de muestras es mayor que decenas de miles de muestras.

source: They also have built-in support for missing values, which avoids the need for an imputer.
es_es: También tienen soporte incorporado para valores faltantes, lo cual evita la necesita de un importador.

source: These estimators are described in more detail below in :ref:`histogram_based_gradient_boosting`.
es_es: Estos estimadores son descritos con más detalle a continuación en :ref:`histogram_based_gradient_boosting`.

source: The following guide focuses on :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor`, which might be preferred for small sample sizes since binning may lead to split points that are too approximate in this setting.
es_es: La siguiente guía se enfoca en :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor`, lo que podría ser preferido para tamaños pequeños de muestra ya que el binning quizás lleve a puntos de división que son demasiado aproximados con esta configuración.

source: The usage and the parameters of :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor` are described below. The 2 most important parameters of these estimators are `n_estimators` and `learning_rate`.
es_es: A continuación se describe el uso y los parámetros de :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor`. Los 2 parámetros más importantes de estos estimadores son `n_estimators` y `learning_rate`.

source: Classification
es_es: Clasificación

source: :class:`GradientBoostingClassifier` supports both binary and multi-class classification. The following example shows how to fit a gradient boosting classifier with 100 decision stumps as weak learners::
es_es: :class:`GradientBoostingClassifier` soporta tanto clasificación binaria como multiclase. El siguiente ejemplo muestra como ajustar un clasificador de boosting por gradiente con 100 topes de decisión como aprendices débiles::

source: The number of weak learners (i.e. regression trees) is controlled by the parameter ``n_estimators``; :ref:`The size of each tree <gradient_boosting_tree_size>` can be controlled either by setting the tree depth via ``max_depth`` or by setting the number of leaf nodes via ``max_leaf_nodes``. The ``learning_rate`` is a hyper-parameter in the range (0.0, 1.0] that controls overfitting via :ref:`shrinkage <gradient_boosting_shrinkage>` .
es_es: El número de aprendices débiles (por ejemplo, árboles de regresión) es controlado por el parametro ``n_estimators``; :ref:`El tamaño de cada árbol <gradient_boosting_tree_size>` puede ser controlado tanto estableciendo la profundidad del árbol mediante ``max_depth`` o estableciendo el número de nodos de hojas mediante ``max_leaf_nodes``. El ``learning_rate`` es ún hiperparámetro en el rango (0.0, 1.0] que controla el sobreajuste mediante el :ref:`encogimiento <gradient_boosting_shrinkage>` .

source: Classification with more than 2 classes requires the induction of ``n_classes`` regression trees at each iteration, thus, the total number of induced trees equals ``n_classes * n_estimators``. For datasets with a large number of classes we strongly recommend to use :class:`HistGradientBoostingClassifier` as an alternative to :class:`GradientBoostingClassifier` .
es_es: La clasificación con más de 2 clases requiere la inducción de ``n_classes`` árboles de regresión en cada iteración, por lo que el número total de árboles inducidos es igual a ``n_clases * n_estimators``. Para conjuntos de datos con un número grande de clases recomendamos utilizar :class:`HistGradientBoostingClassifier` como una alternativa a :class:`GradientBoostingClassifier` .

source: Regression
es_es: Regresión

source: :class:`GradientBoostingRegressor` supports a number of :ref:`different loss functions <gradient_boosting_loss>` for regression which can be specified via the argument ``loss``; the default loss function for regression is least squares (``'ls'``).
es_es: :class:`GradientBoostingRegressor` soporta un número de :ref:`diferentes funciones de pérdida <gradient_boosting_loss>` para regresión que pueden ser especificadas mediante el argumento ``loss``; la función de pérdida por defecto para la regresión es la de mínimos cuadrados (``'ls'``).

source: The figure below shows the results of applying :class:`GradientBoostingRegressor` with least squares loss and 500 base learners to the diabetes dataset (:func:`sklearn.datasets.load_diabetes`). The plot on the left shows the train and test error at each iteration. The train error at each iteration is stored in the :attr:`~GradientBoostingRegressor.train_score_` attribute of the gradient boosting model. The test error at each iterations can be obtained via the :meth:`~GradientBoostingRegressor.staged_predict` method which returns a generator that yields the predictions at each stage. Plots like these can be used to determine the optimal number of trees (i.e. ``n_estimators``) by early stopping.
es_es: La siguiente figura muestra los resultados de aplicar :class:`GradientBoostingRegressor` con pérdida de mínimos cuadrados y 500 aprendices base al conjunto de datos de diabetes (:func:`sklearn.datasets.load_diabetes`). La gráfica a la izquierda muestra el error de prueba y entrenamiento en cada iteración. El error de entrenamiento en cada iteración se guarda en el atributo :attr:`~GradientBoostingRegressor.train_score_` del modelo de boosting por gradientes. El error de prueba en cada iteración se puede obtener mediante el método :meth:`~GradientBoostingRegressor.staged_predict` que devuelve un generador que da las predicciones en cada etapa. Gráficos como estos pueden ser utilizados para determinar el número óptimo de árboles (por ejemplo, ``n_estimators``) por parada anticipada.

source: Fitting additional weak-learners
es_es: Ajustando aprendices débiles adicionales

source: Both :class:`GradientBoostingRegressor` and :class:`GradientBoostingClassifier` support ``warm_start=True`` which allows you to add more estimators to an already fitted model.
es_es: Tanto :class:`GradientBoostingRegressor` como :class:`GradientBoostingClassifier` soportan ``warm_start=True``, el cual te permite añadir mas estimadores a un modelo ya ajustado.

source: Controlling the tree size
es_es: Controlando el tamaño del árbol

source: The size of the regression tree base learners defines the level of variable interactions that can be captured by the gradient boosting model. In general, a tree of depth ``h`` can capture interactions of order ``h`` . There are two ways in which the size of the individual regression trees can be controlled.
es_es: El tamaño de los aprendices del árbol de regresión base define el nivel de interacciones variable que pueden ser capturadas por el modelo de boosting por gradiente. En general, un árbol de profundidad ``h`` puede capturar interacciones de orden ``h``. Hay dos formas en la que el tamaño de los árboles de regresión individuales puede ser controlado.

source: If you specify ``max_depth=h`` then complete binary trees of depth ``h`` will be grown. Such trees will have (at most) ``2**h`` leaf nodes and ``2**h - 1`` split nodes.
es_es: Si tu especificas ``max_depth=h``, entonces se crecerán árboles binarios completos de profundidad ``h``. Tales árboles tendrán (como máximo) ``2**h`` nodos de hoja y ``2**h - 1`` nodos divididos.

source: Alternatively, you can control the tree size by specifying the number of leaf nodes via the parameter ``max_leaf_nodes``. In this case, trees will be grown using best-first search where nodes with the highest improvement in impurity will be expanded first. A tree with ``max_leaf_nodes=k`` has ``k - 1`` split nodes and thus can model interactions of up to order ``max_leaf_nodes - 1`` .
es_es: Alternativamente, puedes controlar el tamaño del árbol especificando el número de nodos de hoja mediante el parámetro ``max_leaf_nodes``. En este caso, los árboles crecerán usando una búsqueda best-first donde los nodos con la mayor mejora en la impureza se expandirán primero. Un árbol con ``max_leaf_nodes=k`` tiene ``k - 1`` nodos divididos y por lo tanto puede modelar interacciones de hasta el orden ``max_leaf_nodes=k`` .

source: We found that ``max_leaf_nodes=k`` gives comparable results to ``max_depth=k-1`` but is significantly faster to train at the expense of a slightly higher training error. The parameter ``max_leaf_nodes`` corresponds to the variable ``J`` in the chapter on gradient boosting in [F2001]_ and is related to the parameter ``interaction.depth`` in R's gbm package where ``max_leaf_nodes == interaction.depth + 1`` .
es_es: Encontramos que ``max_leaf_nodes=k`` da resultados comparables a ``max_depth=k-1`` pero es significativamente mas rapido de entrenar al costo de un error de entrenamiento ligeramente mayor. El parámetro ``max_leaf_nodes`` corresponde a la variable ``J`` en el capítulo sobre boosting por gradiente en [F2001]_ y es relacionado al parámetro ``interaction.depth`` en el paquete gbm de R donde ``max_leaf_nodes == interaction.depth +1`` .

source: Mathematical formulation
es_es: Formulación matemática

source: We first present GBRT for regression, and then detail the classification case.
es_es: Primero presentamos GBRT para la regresión, y luego detallamos el caso por clasificación.

source: GBRT regressors are additive models whose prediction :math:`y_i` for a given input :math:`x_i` is of the following form:
es_es: Los regresores GBRT son modelos aditivos cuya predicción :math:`y_i` para una entrada dada :math:`x_i` es de la siguiente forma:

source: where the :math:`h_m` are estimators called *weak learners* in the context of boosting. Gradient Tree Boosting uses :ref:`decision tree regressors <tree>` of fixed size as weak learners. The constant M corresponds to the `n_estimators` parameter.
es_es: donde los :math:`h_m` son estimadores llamados *aprendices débiles* en el contexto del boosting. Gradient Tree Boosting utiliza :ref:`regresores de árboles de decisión <tree>` de tamaño fijo como aprendices débiles. La constante M corresponde al parámetro `n_estimators`.

source: Similar to other boosting algorithms, a GBRT is built in a greedy fashion:
es_es: Similar a otros algoritmos de boosting, un GBRT se construye de manera codiciosa:

source: where the newly added tree :math:`h_m` is fitted in order to minimize a sum of losses :math:`L_m`, given the previous ensemble :math:`F_{m-1}`:
es_es: donde el árbol recién añadido :math:`h_m` es ajustado para minimizar una suma de pérdidas :math:`L_m`, dado el conjunto anterior :math:`F_{m-1}`:

source: where :math:`l(y_i, F(x_i))` is defined by the `loss` parameter, detailed in the next section.
es_es: donde :math:`l(y_i, F(x_i))` es definido por el parámetro `loss`, detallado en la siguiente sección.

source: By default, the initial model :math:`F_{0}` is chosen as the constant that minimizes the loss: for a least-squares loss, this is the empirical mean of the target values. The initial model can also be specified via the ``init`` argument.
es_es: Por defecto, el modelo inicial :math: `F_{0}` es elegido como la constante que minimiza la pérdida: para una pérdida de mínimos cuadrados, esta es la media empírica de los valores objetivo. El modelo inicial también puede ser especificado mediante el arugmento `ìnit``.

source: Using a first-order Taylor approximation, the value of :math:`l` can be approximated as follows:
es_es: Utilizando una aproximación de Taylor de primer orden, el valor de :math:`l` puede aproximarse de la siguiente manera:

source: Briefly, a first-order Taylor approximation says that :math:`l(z) \approx l(a) + (z - a) \frac{\partial l(a)}{\partial a}`. Here, :math:`z` corresponds to :math:`F_{m - 1}(x_i) + h_m(x_i)`, and :math:`a` corresponds to :math:`F_{m-1}(x_i)`
es_es: En pocas palabras, una aproximación de Taylor de primer orden dice que :math:`l(z) \approx l(a) + (z - a) \frac{\partial l(a)}{\partial a}`. Aquí, :math:`z` corresponde a :math:`F_{m - 1}(x_i) + h_m(x_i)`, y :math:`a` corresponde a :math:`F_{m-1}(x_i)`
