Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/ensemble.po
Languages: es_es

source: :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor` have built-in support for missing values (NaNs).
es_es: :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor` tienen soporte integrado para valores faltantes (NaNs).

source: During training, the tree grower learns at each split point whether samples with missing values should go to the left or right child, based on the potential gain. When predicting, samples with missing values are assigned to the left or right child consequently::
es_es: Durante el entrenamiento, el cultivador de árboles aprende en cada punto de división si las muestras con valores faltantes deberían ir al hijo de la izquierda o la derecha, basado en la ganancia potencial. Cuando se realiza la predicción, las muestras con valores faltantes son asignadas consecuentemente al hijo de la izquierda o la derecha::

source: When the missingness pattern is predictive, the splits can be done on whether the feature value is missing or not::
es_es: Cuando el patrón de falta es predictivo, las divisiones pueden ser realizadas dependiendo sí falta el valor de característica o no::

source: If no missing values were encountered for a given feature during training, then samples with missing values are mapped to whichever child has the most samples.
es_es: Si no se encontraron valores faltantes para una característica determinada durante el entrenamiento, entonces las muestras con valores faltantes se mapean al hijo que tenga más muestras.

source: Sample weight support
es_es: Soporte para ponderado de muestras

source: :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor` sample support weights during :term:`fit`.
es_es: :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor` soportan ponderados durante :term:`fit`.

source: The following toy example demonstrates how the model ignores the samples with zero sample weights:
es_es: El siguiente ejemplo de juguete demuestra cómo el modelo ignora las muestras con cero ponderado de muestra:

source: As you can see, the `[1, 0]` is comfortably classified as `1` since the first two samples are ignored due to their sample weights.
es_es: Como puedes ver, el `[1, 0]` se clasifica cómodamente como `1` ya que las dos primeras muestras son ignoradas debido a sus ponderados de muestra.

source: Implementation detail: taking sample weights into account amounts to multiplying the gradients (and the hessians) by the sample weights. Note that the binning stage (specifically the quantiles computation) does not take the weights into account.
es_es: Detalle de la implementación: tomar en cuenta los ponderados de las muestras equivale a multiplicar los gradientes (y los hessians) por los ponderados de las muestras. Note que la etapa de binning (específicamente el cálculo de cuantías) no toma en cuenta los ponderados.

source: Categorical Features Support
es_es: Soporte de características categóricas

source: :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor` have native support for categorical features: they can consider splits on non-ordered, categorical data.
es_es: :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor` tienen soporte nativo para características categóricas: las dos pueden considerar divisiones en datos categóricos no ordenados.

source: For datasets with categorical features, using the native categorical support is often better than relying on one-hot encoding (:class:`~sklearn.preprocessing.OneHotEncoder`), because one-hot encoding requires more tree depth to achieve equivalent splits. It is also usually better to rely on the native categorical support rather than to treat categorical features as continuous (ordinal), which happens for ordinal-encoded categorical data, since categories are nominal quantities where order does not matter.
es_es: Para conjuntos de datos con características categóricas, usar el soporte nativo categórico suele ser mejor que depender en la codificación one-hot (:class:`~sklearn.preprocessing.OneHotEncoder`), ya que la codificación one-hot requiere mas profundidad del árbol para obtener divisiones equivalentes. También generalmente es mejor depender en el soporte categórico nativo que tomar las características categóricas como continuas (ordinales), lo cual ocurre para datos categóricos codificados por ordinal, ya que las categorías son cantidades nominales donde el orden no importa.

source: To enable categorical support, a boolean mask can be passed to the `categorical_features` parameter, indicating which feature is categorical. In the following, the first feature will be treated as categorical and the second feature as numerical::
es_es: Para activar el soporte categórico, se puede pasar una máscara booleana al parámetro `categorical_features`, indicando qué característica es categórica. En lo siguiente, la primera característica sera tomada como categórica y la segunda característica como numerica::

source: Equivalently, one can pass a list of integers indicating the indices of the categorical features::
es_es: Equivalentemente, uno puede pasar una lista de enteros indicando los índices de las características categóricas::

source: The cardinality of each categorical feature should be less than the `max_bins` parameter, and each categorical feature is expected to be encoded in `[0, max_bins - 1]`. To that end, it might be useful to pre-process the data with an :class:`~sklearn.preprocessing.OrdinalEncoder` as done in :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_categorical.py`.
es_es: La cardinalidad de cada característica categórica debe ser menor que el parámetro `max_bins`, y se espera que cada característica categórica este codificada en `[0, max_bins - 1]`. Para este fin, quizás sea útil pre-procesar los datos con un :class:`~sklearn.preprocessing.OrdinalEncoder` como se hace en :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_categorical.py`.

source: If there are missing values during training, the missing values will be treated as a proper category. If there are no missing values during training, then at prediction time, missing values are mapped to the child node that has the most samples (just like for continuous features). When predicting, categories that were not seen during fit time will be treated as missing values.
es_es: Si hay valores faltantes durante el entrenamiento, estos serán tratados como una categoría adecuada. Si no hay valores faltantes durante el entrenamiento, entonces en el tiempo de predicción, los valores faltantes son mapeados al nodo hijo que tenga el mayor número de muestras (igual que en la características continuas). Durante la predicción, las categorías que no fueron vistas durante el tiempo de ajuste serán tratadas como valores faltantes.

source: **Split finding with categorical features**: The canonical way of considering categorical splits in a tree is to consider all of the :math:`2^{K - 1} - 1` partitions, where :math:`K` is the number of categories. This can quickly become prohibitive when :math:`K` is large. Fortunately, since gradient boosting trees are always regression trees (even for classification problems), there exist a faster strategy that can yield equivalent splits. First, the categories of a feature are sorted according to the variance of the target, for each category `k`. Once the categories are sorted, one can consider *continuous partitions*, i.e. treat the categories as if they were ordered continuous values (see Fisher [Fisher1958]_ for a formal proof). As a result, only :math:`K - 1` splits need to be considered instead of :math:`2^{K - 1} - 1`. The initial sorting is a :math:`\mathcal{O}(K \log(K))` operation, leading to a total complexity of :math:`\mathcal{O}(K \log(K) + K)`, instead of :math:`\mathcal{O}(2^K)`.
es_es: **Búsqueda de divisiones con características categóricas**: La manera canonica de considerar divisiones categóricas en un árbol es considerar todas las particiones :math:`2^{K - 1} - 1`, donde :math:`K` es el número de categórias. Esto puede volverse prohibitivo rapidamente si :math:`K` es grande. Afortunadamente, ya que los arboles de boosting por gradiente son siempre arboles de regresión (incluso para problemas de clasificación), existe una estrategia mas rápida que puede dar divisiones equivalentes. Primero, las categorías de una características son ordenadas acorde a la varianza del objetivo, por cada categoría `k`. Después de que las categorías sean ordenadas, uno puede considerar *particiones continuas*, es decir, tratar las categorías como si fueran valores continuos ordenados (ver Fisher [Fisher1958]_ para una prueba formal). Como resultado, solo :math:`K - 1` divisiones deben ser consideradas en lugar de :math:`2^{K - 1} - 1`. El sorteo inicial es una operación :math:`\mathcal{O}(K \log(K))`, lo cual lleva a una complejidad total de :math:`\mathcal{O}(K \log(K) + K)`, en lugar de :math:`\mathcal{O}(2^K)`.

source: Monotonic Constraints
es_es: Restricciones monotónicas

source: Depending on the problem at hand, you may have prior knowledge indicating that a given feature should in general have a positive (or negative) effect on the target value. For example, all else being equal, a higher credit score should increase the probability of getting approved for a loan. Monotonic constraints allow you to incorporate such prior knowledge into the model.
es_es: Dependiendo del problema en cuestión, quizás tengas conocimientos previos indicando que una característica particular debería tener, por lo general, un efecto positivo (o negativo) en el valor objetivo. Por ejemplo, si todo lo demás es igual, una mayor calificación de solvencia debería incrementar la probabilidad de que se apruebe un préstamo. Las restricciones monotónicas te permiten incorporar estos conocimientos previos dentro del modelo.

source: A positive monotonic constraint is a constraint of the form:
es_es: Una restricción monotónica positiva es una restricción de la forma:

source: :math:`x_1 \leq x_1' \implies F(x_1, x_2) \leq F(x_1', x_2)`, where :math:`F` is the predictor with two features.
es_es: :math:`x_1 \leq x_1' \implies F(x_1, x_2) \leq F(x_1', x_2)`, donde :math:`F` es el predictor con dos características.

source: Similarly, a negative monotonic constraint is of the form:
es_es: De la misma manera, una restricción monotónica negativa es de la forma:

source: Note that monotonic constraints only constraint the output "all else being equal". Indeed, the following relation **is not enforced** by a positive constraint: :math:`x_1 \leq x_1' \implies F(x_1, x_2) \leq F(x_1', x_2')`.
es_es: Tenga en cuenta que las restricciones monotónicas solo restringen la salida "todo lo demás siendo igual". En efecto, la siguiente relación **no es forzada** por una restricción positiva: :math:`x_1 \leq x_1' \implies F(x_1, x_2) \leq F(x_1', x_2')`.

source: You can specify a monotonic constraint on each feature using the `monotonic_cst` parameter. For each feature, a value of 0 indicates no constraint, while -1 and 1 indicate a negative and positive constraint, respectively::
es_es: Puedes especificar una restricción monotónica en cada característica usando el parámetro `monotonic_cst`. Para cada característica, un valor de 0 indica que no hay ninguna restricción, mientras que -1 y 1 indica una restricción negativa y positiva, respectivamente::

source: In a binary classification context, imposing a monotonic constraint means that the feature is supposed to have a positive / negative effect on the probability to belong to the positive class. Monotonic constraints are not supported for multiclass context.
es_es: En el contexto de una clasificación binaria, imponer una restricción monotónica significa que la característica debe tener un efecto positivo / negativo en la probabilidad de pertenecer a la clase positiva. Las restricciones monotónicas no están soportadas en un contexto multiclase.

source: Since categories are unordered quantities, it is not possible to enforce monotonic constraints on categorical features.
es_es: Ya que las categorías son cantidades no ordenadas, no es posible imponer restricciones monotónicas sobre características categóricas.

source: Low-level parallelism
es_es: Paralelismo de bajo nivel

source: :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor` have implementations that use OpenMP for parallelization through Cython. For more details on how to control the number of threads, please refer to our :ref:`parallelism` notes.
es_es: :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor` tienen implementaciones que usan OpenMP para la paralelización a través de Cython. Para más detalles sobre cómo controlar el número de hilos, por favor consulte nuestras notas de :ref:`parallelism`.

source: The following parts are parallelized:
es_es: Las siguientes partes son paralelizadas:

source: mapping samples from real values to integer-valued bins (finding the bin thresholds is however sequential)
es_es: el mapeado de muestras desde valores reales a contenedores de valores enteros (sin embargo, encontrar los umbrales de los contenedores es secuencial)

source: building histograms is parallelized over features
es_es: la construcción de histogramas está paralelizada sobre características

source: finding the best split point at a node is parallelized over features
es_es: la búsqueda del mejor punto de división en un nodo es paralelizado sobre características

source: during fit, mapping samples into the left and right children is parallelized over samples
es_es: durante el ajuste, el mapeo de muestras a los hijos de izquierda y derecha es paralelizado sobre muestras

source: gradient and hessians computations are parallelized over samples
es_es: los cálculos de gradiente y hessians son paralelizados sobre muestras

source: predicting is parallelized over samples
es_es: la predicción es paralelizada sobre muestras

source: Why it's faster
es_es: Porqué es más rápido

source: The bottleneck of a gradient boosting procedure is building the decision trees. Building a traditional decision tree (as in the other GBDTs :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor`) requires sorting the samples at each node (for each feature). Sorting is needed so that the potential gain of a split point can be computed efficiently. Splitting a single node has thus a complexity of :math:`\mathcal{O}(n_\text{features} \times n \log(n))` where :math:`n` is the number of samples at the node.
es_es: El cuello de botella de un procedimiento de boosting por gradientes es la construcción de los árboles de decisión. Construir un árbol de decisión tradicional (como en los otros GBDT, :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor`) requiere ordenar las muestras en cada nodo (por cada característica). Es necesario ordenar para que cada aumento potencial de un punto de división pueda ser calculado eficientemente. Dividir un único nodo tiene entonces una complejidad de :math:`\mathcal{O}(n_\text{features} \times n \log(n))` donde :math:`n` es el número de muestras en el nodo.

source: :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor`, in contrast, do not require sorting the feature values and instead use a data-structure called a histogram, where the samples are implicitly ordered. Building a histogram has a :math:`\mathcal{O}(n)` complexity, so the node splitting procedure has a :math:`\mathcal{O}(n_\text{features} \times n)` complexity, much smaller than the previous one. In addition, instead of considering :math:`n` split points, we here consider only ``max_bins`` split points, which is much smaller.
es_es: :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor`, en contraste, no requieren ordenar los valores de las características y en su lugar usar una estructura de datos llamada histograma, donde las muestras están ordenadas implícitamente. Construir un histograma tiene una complejidad :math:`\mathcal{O}(n)`, así que el procedimiento de división del nodo tiene una complejidad de :math:`\mathcal{O}(n_\text{features} \times n)`, mucho más pequeño que el anterior. Además, en lugar de considerar :math:`n` puntos divididos, aquí consideramos sólo ``max_bins`` puntos de división, que es mucho más pequeño.

source: In order to build histograms, the input data `X` needs to be binned into integer-valued bins. This binning procedure does require sorting the feature values, but it only happens once at the very beginning of the boosting process (not at each node, like in :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor`).
es_es: Para construir histogramas, los datos de entrada `X` necesitan ser recolectados en contenedores de valores enteros. Este procedimiento de binning si requiere ordenar los valores de característica, pero sólo ocurre una vez al principio del proceso de boosting (no en cada nodo, como en :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor`).

source: Finally, many parts of the implementation of :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor` are parallelized.
es_es: Finalmente, muchas partes de la implementación de :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor` son paralelizadas.

source: Voting Classifier
es_es: Clasificador de voto

source: The idea behind the :class:`VotingClassifier` is to combine conceptually different machine learning classifiers and use a majority vote or the average predicted probabilities (soft vote) to predict the class labels. Such a classifier can be useful for a set of equally well performing model in order to balance out their individual weaknesses.
es_es: La idea detrás de :class:`VotingClassifier` es combinar clasificadores de machine learning conceptualmente diferentes y usar un voto por mayoría o el promedio de probabilidades predichas (voto blando) para predecir las etiquetas de clase. Este tipo de clasificador puede ser útil para un conjunto de modelos de igual rendimiento a fin de equilibrar sus debilidades individuales.

source: Majority Class Labels (Majority/Hard Voting)
es_es: Etiquetas de clase mayoritarias (mayoría/voto duro)

source: In majority voting, the predicted class label for a particular sample is the class label that represents the majority (mode) of the class labels predicted by each individual classifier.
es_es: En la votación por mayoría, la etiqueta de clase predicha para una muestra en particular es aquella etiqueta de clase que representa la mayoría (modo) de las etiquetas de clases predichas por cada clasificador individual.

source: E.g., if the prediction for a given sample is
es_es: Por ejemplo, si la predicción de una muestra dada es

source: classifier 1 -> class 1
es_es: clasificador 1 -> clase 1

source: classifier 2 -> class 1
es_es: clasificador 2 -> clase 1

source: classifier 3 -> class 2
es_es: clasificador 3 -> clase 2

source: the VotingClassifier (with ``voting='hard'``) would classify the sample as "class 1" based on the majority class label.
es_es: el VotingClassifier (con ``voting='hard'``) clasificaría la muestra como "clase 1" basada en la etiqueta de clase mayoritaria.

source: In the cases of a tie, the :class:`VotingClassifier` will select the class based on the ascending sort order. E.g., in the following scenario
es_es: En el caso de un empate, el :class:`VotingClassifier` seleccionara la clase basada en el orden de clasificación ascendente. Por ejemplo, en el siguiente escenario

source: classifier 1 -> class 2
es_es: clasificador 1 -> clase 2

source: the class label 1 will be assigned to the sample.
es_es: la etiqueta de clase 1 será asignada a la muestra.

source: The following example shows how to fit the majority rule classifier::
es_es: El siguiente ejemplo muestra cómo ajustar el clasificador por regla de mayoría::

source: Weighted Average Probabilities (Soft Voting)
es_es: Promedio ponderado de probabilidades (Votación blanda)

source: In contrast to majority voting (hard voting), soft voting returns the class label as argmax of the sum of predicted probabilities.
es_es: En contraste con la votación por mayoría (votación dura), el voto blando devuelve la etiqueta de clase como argmax de la suma de probabilidades predichas.

source: Specific weights can be assigned to each classifier via the ``weights`` parameter. When weights are provided, the predicted class probabilities for each classifier are collected, multiplied by the classifier weight, and averaged. The final class label is then derived from the class label with the highest average probability.
es_es: Se pueden asignar ponderados específicos a cada clasificador mediante el parámetro ``weights``. Cuando se proporcionan ponderados, las probabilidades de clase para cada clasificador son recolectadas, multiplicadas por el ponderado del clasificador, y promediadas. La etiqueta de clase final se deriva entonces de la etiqueta de clase con la probabilidad media más alta.

source: To illustrate this with a simple example, let's assume we have 3 classifiers and a 3-class classification problems where we assign equal weights to all classifiers: w1=1, w2=1, w3=1.
es_es: Para ilustrar esto con un ejemplo sencillo, supongamos que tengamos 3 clasificadores y un problema de clasificación de 3 clases donde asignamos ponderados iguales a todos los clasificadores: w1=1, w2=1, w3=1.

source: The weighted average probabilities for a sample would then be calculated as follows:
es_es: Las probabilidades medias ponderadas para una muestra entonces se calcularían de la siguiente forma:

source: classifier
es_es: clasificador

source: class 1
es_es: clase 1

source: class 2
es_es: clase 2

source: class 3
es_es: clase 3

source: classifier 1
es_es: clasificador 1

source: classifier 2
es_es: clasificador 2

source: classifier 3
es_es: clasificador 3

source: weighted average
es_es: promedio ponderado

source: Here, the predicted class label is 2, since it has the highest average probability.
es_es: Aquí, la etiqueta de clase predicha es 2, ya que tiene la probabilidad media más alta.

source: The following example illustrates how the decision regions may change when a soft :class:`VotingClassifier` is used based on an linear Support Vector Machine, a Decision Tree, and a K-nearest neighbor classifier::
es_es: El siguiente ejemplo ilustra como las regiones de decisión quizás cambien cuando un :class:`VotingClassifier` blando se utilice basado en una maquína de vectores de apoyo lineal, un árbol de decisiones y un clasificador de vecinos K-nearest::

source: Using the `VotingClassifier` with `GridSearchCV`
es_es: Usando el `VotingClassifier` con `GridSearchCV`

source: The :class:`VotingClassifier` can also be used together with :class:`~sklearn.model_selection.GridSearchCV` in order to tune the hyperparameters of the individual estimators::
es_es: El :class:`VotingClassifier` también puede ser usado junto con :class:`~sklearn.model_selection.GridSearchCV` para afinar los hiperparámetros de los estimadores individuales::

source: In order to predict the class labels based on the predicted class-probabilities (scikit-learn estimators in the VotingClassifier must support ``predict_proba`` method)::
es_es: Para predecir las etiquetas de clase basadas en las probabilidades de clase predichas (los estimadores de scikit-learn en el VotingClassifier deben soportar el método ``predict_proba``)::

source: Optionally, weights can be provided for the individual classifiers::
es_es: Opcionalmente, se pueden proporcionar ponderados para clasificadores individuales::

source: Voting Regressor
es_es: Regresor de voto
