Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/ensemble.po
Languages: es_es

source: Ensemble methods
es_es: Métodos combinados

source: The goal of **ensemble methods** is to combine the predictions of several base estimators built with a given learning algorithm in order to improve generalizability / robustness over a single estimator.
es_es: Los **métodos combinados** se utilizan para unir las predicciones de varios estimadores base construidos desde un algoritmo de aprendizaje dado con el propósito de tener una generalización / robustez mayor que la de un solo estimador.

source: Two families of ensemble methods are usually distinguished:
es_es: Se suelen distinguir dos familias de métodos combinados:

source: In **averaging methods**, the driving principle is to build several estimators independently and then to average their predictions. On average, the combined estimator is usually better than any of the single base estimator because its variance is reduced.
es_es: En los **métodos de promedio**, el principio guía es la creación de varios estimadores independientes para después promediar sus predicciones. En promedio, el estimador combinado es mejor que cualquiera de los estimadores base individuales porque su varianza se reduce.

source: **Examples:** :ref:`Bagging methods <bagging>`, :ref:`Forests of randomized trees <forest>`, ...
es_es: **Ejemplos:** :ref:`Métodos de bagging <bagging>`, :ref:`Bosques de árboles aleatorios <forest>`, ...

source: By contrast, in **boosting methods**, base estimators are built sequentially and one tries to reduce the bias of the combined estimator. The motivation is to combine several weak models to produce a powerful ensemble.
es_es: En cambio, en los **métodos de boosting**, los estimadores base se construyen de manera secuencial y uno intenta reducir el sesgo del estimador combinado. La intención es producir un conjunto potente a partir de varios modelos débiles.

source: **Examples:** :ref:`AdaBoost <adaboost>`, :ref:`Gradient Tree Boosting <gradient_boosting>`, ...
es_es: **Ejemplos:** :ref:`AdaBoost <adaboost>`, :ref:`Gradient Tree Boosting <gradient_boosting>`, ...

source: Bagging meta-estimator
es_es: Meta estimador de bagging

source: In ensemble algorithms, bagging methods form a class of algorithms which build several instances of a black-box estimator on random subsets of the original training set and then aggregate their individual predictions to form a final prediction. These methods are used as a way to reduce the variance of a base estimator (e.g., a decision tree), by introducing randomization into its construction procedure and then making an ensemble out of it. In many cases, bagging methods constitute a very simple way to improve with respect to a single model, without making it necessary to adapt the underlying base algorithm. As they provide a way to reduce overfitting, bagging methods work best with strong and complex models (e.g., fully developed decision trees), in contrast with boosting methods which usually work best with weak models (e.g., shallow decision trees).
es_es: En los algoritmos de conjunto, los métodos de bagging forman una clase de algoritmos que construyen varias instancias de un estimador de caja negra en subconjuntos aleatorios del conjunto de entrenamiento original y luego agregan sus predicciones individuales para realizar una predicción final. Estos métodos introducen la aleatorización en la construcción de un estimador base (p. ej. un árbol de decisión) y crean un conjunto después para así reducir su varianza. En muchos casos, los métodos de bagging son una manera muy sencilla de mejorar con respecto a un único modelo, sin hacer necesario el adaptar el algoritmo base subyacente. Como proporcionan una forma de reducir el sobreajuste, los métodos de bagging funcionan mejor con modelos fuertes y complejos (p. ej. árboles de decisión completamente desarrollados), al contrario que los métodos de boosting, los cuales suelen funcionar mejor con modelos débiles (p. ej. árboles de decisión con poca profundidad).

source: Bagging methods come in many flavours but mostly differ from each other by the way they draw random subsets of the training set:
es_es: Los métodos de bagging vienen en muchos sabores, pero por lo general difieren uno del otro por la forma en la cual agarran subconjuntos aleatorios del conjunto de entrenamiento:

source: When random subsets of the dataset are drawn as random subsets of the samples, then this algorithm is known as Pasting [B1999]_.
es_es: Cuando se escogen subconjuntos aleatorios del conjunto de datos como subconjuntos aleatorios de las muestras, este algoritmo es conocido como Pasting [B1999]_.

source: When samples are drawn with replacement, then the method is known as Bagging [B1996]_.
es_es: Cuando las muestras son escogidas con reemplazo, entonces el método es conocido como Bagging [B1996]_.

source: When random subsets of the dataset are drawn as random subsets of the features, then the method is known as Random Subspaces [H1998]_.
es_es: Cuando son escogidos subconjuntos aleatorios del conjunto de datos como subconjuntos aleatorios de las características, entonces el método se conoce como Random Subspaces [H1998]_.

source: Finally, when base estimators are built on subsets of both samples and features, then the method is known as Random Patches [LG2012]_.
es_es: Finalmente, cuando los estimadores base son construidos en subconjuntos tanto de características como muestras, entonces el método es conocido como Random Patches [LG2012]_.

source: In scikit-learn, bagging methods are offered as a unified :class:`BaggingClassifier` meta-estimator (resp. :class:`BaggingRegressor`), taking as input a user-specified base estimator along with parameters specifying the strategy to draw random subsets. In particular, ``max_samples`` and ``max_features`` control the size of the subsets (in terms of samples and features), while ``bootstrap`` and ``bootstrap_features`` control whether samples and features are drawn with or without replacement. When using a subset of the available samples the generalization accuracy can be estimated with the out-of-bag samples by setting ``oob_score=True``. As an example, the snippet below illustrates how to instantiate a bagging ensemble of :class:`KNeighborsClassifier` base estimators, each built on random subsets of 50% of the samples and 50% of the features.
es_es: En scikit-learn, los métodos de bagging son ofrecidos como un meta estimador unificado :class:`BaggingClassifier` (resp. :class:`BaggingRegressor`) tomando como entrada un estimador base especificado por el usuario y parámetros especificando la estrategia a utilizar para escoger subconjuntos aleatorios. En particular. ``max_samples`` y ``max_features`` controlan el tamaño de los subconjuntos (en terminos de muestras y características), mientras que ``bootstrap`` and ``bootstrap_features`` controlan si las muestras y características son escogidas con o sin reemplazo. Cuando es utilizado un subconjunto de las muestras disponibles, la exactitud de la generalización puede ser estimada con las muestras fuera-de-bolsa estableciendo que ``oob_score=True``. Como un ejemplo, el fragmento de código abajo ilustra como instanciar un conjunto de bagging de :class:`KNeighborsClassifier` estimadores base, cada uno construido con subconjuntos aleatorios de 50% de las muestras y 50% de las características.

source: Forests of randomized trees
es_es: Bosques de árboles aleatorios

source: The :mod:`sklearn.ensemble` module includes two averaging algorithms based on randomized :ref:`decision trees <tree>`: the RandomForest algorithm and the Extra-Trees method. Both algorithms are perturb-and-combine techniques [B1998]_ specifically designed for trees. This means a diverse set of classifiers is created by introducing randomness in the classifier construction. The prediction of the ensemble is given as the averaged prediction of the individual classifiers.
es_es: El módulo :mod:`sklearn.ensemble` incluye dos algoritmos de promedio basados en :ref:`arboles de decisión <tree>`: el algoritmo RandomForest y el método Extra-Trees. Ambos algoritmos son técnicas de perturbar-y-combinar [B1998]_ específicamente diseñadas para árboles. Esto significa que un diverso conjunto de clasificadores es creado introduciendo aleatoriedad en la construcción de los clasificadores. La predicción del conjunto es dada como la predicción promediada de los clasificadores individuales.

source: As other classifiers, forest classifiers have to be fitted with two arrays: a sparse or dense array X of shape ``(n_samples, n_features)`` holding the training samples, and an array Y of shape ``(n_samples,)`` holding the target values (class labels) for the training samples::
es_es: Como otros clasificadores, los clasificadores de arboles tienen que estar provistos con dos arrays: un array X denso o disperso de forma ``(n_samples, n_features)``, sosteniendo las muestras de entrenamiento, y un array Y de forma ``(n_samples,)``, sosteniendo los valores objetivo (etiquetas de clase) para las muestras de entrenamiento::

source: Like :ref:`decision trees <tree>`, forests of trees also extend to :ref:`multi-output problems <tree_multioutput>` (if Y is an array of shape ``(n_samples, n_outputs)``).
es_es: Como los :ref:`arboles de decisión <tree>`, los bosques de arboles también se extienden a :ref:`problemas de salida múltiple <tree_multioutput>` (si Y es un array de forma ``(n_samples, n_outputs)``).

source: Random Forests
es_es: Bosques Aleatorios

source: In random forests (see :class:`RandomForestClassifier` and :class:`RandomForestRegressor` classes), each tree in the ensemble is built from a sample drawn with replacement (i.e., a bootstrap sample) from the training set.
es_es: En los bosques aleatorios (ver las clases :class:`RandomForestClassifier` y :class:`RandomForestRegressor`), cada árbol en el conjunto es construido desde una muestra escogida con reemplazo (es decir, una muestra de bootstrap) desde el conjunto de entrenamiento.

source: Furthermore, when splitting each node during the construction of a tree, the best split is found either from all input features or a random subset of size ``max_features``. (See the :ref:`parameter tuning guidelines <random_forest_parameters>` for more details).
es_es: Además, cuando se divide cada nodo durante la construcción de un árbol, se encuentra la mejor división desde todas las características de entrada o bien desde un subconjunto aleatorio de tamaño ``max_features``. (Ver el :ref:`lineamientos para el ajustamiento de parámetros <random_forest_parameters>` para mas detalles).

source: The purpose of these two sources of randomness is to decrease the variance of the forest estimator. Indeed, individual decision trees typically exhibit high variance and tend to overfit. The injected randomness in forests yield decision trees with somewhat decoupled prediction errors. By taking an average of those predictions, some errors can cancel out. Random forests achieve a reduced variance by combining diverse trees, sometimes at the cost of a slight increase in bias. In practice the variance reduction is often significant hence yielding an overall better model.
es_es: Estas dos fuentes de aleatoriedad son utilizadas para disminuir la varianza del estimador de árbol. En efecto, los árboles de decisión únicos suelen exhibir varianza alta y tienden a sobreajustarse. Al inyectar aleatoriedad en los bosques, se obtienen árboles con errores de predicción algo desacoplados. Algunos de estos errores se pueden cancelar tomando un promedio de estas predicciones. Los bosques aleatorios consiguen una varianza reducida mediante la combinación de árboles diversos, a veces al costo de un ligero aumento en el sesgo. En la practica, la reducción de varianza suele ser significativa, por lo que se obtiene un mejor modelo en general.

source: In contrast to the original publication [B2001]_, the scikit-learn implementation combines classifiers by averaging their probabilistic prediction, instead of letting each classifier vote for a single class.
es_es: A diferencia de la publicación original [B2001]_, la implementación de scikit-learn combina clasificadores al promediar su predicción probabilística, en lugar de dejar que cada clasificador vote por una única clase.

source: Extremely Randomized Trees
es_es: Árboles extremadamente aleatorizados

source: In extremely randomized trees (see :class:`ExtraTreesClassifier` and :class:`ExtraTreesRegressor` classes), randomness goes one step further in the way splits are computed. As in random forests, a random subset of candidate features is used, but instead of looking for the most discriminative thresholds, thresholds are drawn at random for each candidate feature and the best of these randomly-generated thresholds is picked as the splitting rule. This usually allows to reduce the variance of the model a bit more, at the expense of a slightly greater increase in bias::
es_es: En árboles extremadamente aleatorizados (ver las clases :class:`ExtraTreesClassifier` y :class:`ExtraTreesRegressor`), la aleatoriedad va un paso más allá en la forma en la que se calculan las divisiones. Como en los bosques aleatorios, un subconjunto aleatorio de características candidato son utilizadas, pero en lugar de buscar por los umbrales mas discriminatorios, los umbrales son escogidos de forma aleatoria por cada característica candidato, y se escoge el mejor de estos umbrales generados al azar como la regla según la cual se realizaran las divisiones. Esto usualmente permite reducir la varianza del modelo un poco más, al costo de un ligeramente mayor aumento en el sesgo::

source: Parameters
es_es: Parámetros

source: The main parameters to adjust when using these methods is ``n_estimators`` and ``max_features``. The former is the number of trees in the forest. The larger the better, but also the longer it will take to compute. In addition, note that results will stop getting significantly better beyond a critical number of trees. The latter is the size of the random subsets of features to consider when splitting a node. The lower the greater the reduction of variance, but also the greater the increase in bias. Empirical good default values are ``max_features=None`` (always considering all features instead of a random subset) for regression problems, and ``max_features="sqrt"`` (using a random subset of size ``sqrt(n_features)``) for classification tasks (where ``n_features`` is the number of features in the data). Good results are often achieved when setting ``max_depth=None`` in combination with ``min_samples_split=2`` (i.e., when fully developing the trees). Bear in mind though that these values are usually not optimal, and might result in models that consume a lot of RAM. The best parameter values should always be cross-validated. In addition, note that in random forests, bootstrap samples are used by default (``bootstrap=True``) while the default strategy for extra-trees is to use the whole dataset (``bootstrap=False``). When using bootstrap sampling the generalization accuracy can be estimated on the left out or out-of-bag samples. This can be enabled by setting ``oob_score=True``.
es_es: Los parámetros principales a ajustar cuando se utilizan estos métodos son ``n_estimators`` y ``max_features``. El primero es el número de árboles en el bosque. Mientras mas grande, mejor, pero tardara también mas tiempo en calcular. Además, observé que los resultados dejaran de mejorar significativamente después de un número crítico de árboles. El segundo es el tamaño de los subconjuntos aleatorios de características a considerar cuando se divide un nodo. Reduce la varianza mientras sea más bajo, pero también aumenta el sesgo. Empíricamente, ``max_features=None`` (considerar siempre todas las características en vez de un subconjunto aleatorio), y ``max_features="sqrt"`` (usar un subconjunto aleatorio de tamaño ``sqrt(n_features)``) son buenos valores por defecto para problemas de regresión, y tareas de clasificación (donde ``n_features`` es el número de características en los datos), respectivamente. Buenos resultados se suelen obtener al establecer que ``max_depth=None`` en combinación con ``min_samples_split=2`` (es decir, cuando se desarrollan los árboles por completo). Sin embargo, tome en cuenta que estos valores no suelen ser óptimos, y quizás resulten en modelos que consumen mucha RAM. Los mejores valores parámetro siempre deben ser validados de forma cruzada. Además, observé que en bosques aleatorios, se usan por defecto muestras de bootstrap (``bootstrap=True``), mientras que usar todo el conjunto de datos (``bootstrap=False``) es la estrategia por defecto de extra-trees. Cuando se utiliza el muestreo por bootstrap, la exactitud de la generalización puede ser estimada en las muestras que sobren o que queden fuera-de-bolsa. Esto se puede habilitar estableciendo que ``oob_score=True``.

source: The size of the model with the default parameters is :math:`O( M * N * log (N) )`, where :math:`M` is the number of trees and :math:`N` is the number of samples. In order to reduce the size of the model, you can change these parameters: ``min_samples_split``, ``max_leaf_nodes``, ``max_depth`` and ``min_samples_leaf``.
es_es: Con los parámetros predeterminados, el tamaño del modelo es :math:`O( M * N * log (N) )`. donde :math:`M` es el número de árboles y :math:`N` es el número de muestras. Si se desea reducir el tamaño del modelo, se pueden cambiar estos parámetros: ``min_samples_split``, ``max_leaf_nodes``, ``max_depth`` y ``min_samples_leaf``.

source: Parallelization
es_es: Paralelización

source: Finally, this module also features the parallel construction of the trees and the parallel computation of the predictions through the ``n_jobs`` parameter. If ``n_jobs=k`` then computations are partitioned into ``k`` jobs, and run on ``k`` cores of the machine. If ``n_jobs=-1`` then all cores available on the machine are used. Note that because of inter-process communication overhead, the speedup might not be linear (i.e., using ``k`` jobs will unfortunately not be ``k`` times as fast). Significant speedup can still be achieved though when building a large number of trees, or when building a single tree requires a fair amount of time (e.g., on large datasets).
es_es: Finalmente, este modulo también permite la construcción en paralelo de los árboles y el calculo en paralelo de las predicciones mediante el parámetro ``n_jobs``. Si ``n_jobs=k``, entonces los calculos son partidos en ``k`` trabajos, y corren en ``k`` núcleos. Si ``n_jobs=-1``, entonces todos los núcleos disponibles en la máquina seran utilizados. Note que debido a la sobrecarga de la comunicación entre procesos, la aceleración no sera lineal (es decir, usar ``k`` trabajos desafortunadamente no sera ``k`` veces rápido). Sin embargo, la aceleración igualmente puede ser significativa cuando se construye un número grande de árboles, o cuando se construye un solo árbol que requiere una buena cantidad de tiempo (p. ej. en conjuntos de datos grandes).

source: Feature importance evaluation
es_es: Evaluación de importancia de características

source: The relative rank (i.e. depth) of a feature used as a decision node in a tree can be used to assess the relative importance of that feature with respect to the predictability of the target variable. Features used at the top of the tree contribute to the final prediction decision of a larger fraction of the input samples. The **expected fraction of the samples** they contribute to can thus be used as an estimate of the **relative importance of the features**. In scikit-learn, the fraction of samples a feature contributes to is combined with the decrease in impurity from splitting them to create a normalized estimate of the predictive power of that feature.
es_es: El rango relativo (es decir, la profundidad) de una característica usada como nodo de decisión en un árbol puede ser utilizada para estimar la importancia relativa de esa característica con respecto a la previsibilidad de la variable objetivo. Las características usadas en la cima del árbol contribuyen a la decisión final de predicción en una fracción grande de las muestras de entrada. La **fracción esperada de las muestras** a la cual contribuyen puede entonces ser usada como un estimado de la **importancia relativa de las características**. En scikit-learn, la fracción de muestras a la cual una característica contribuye es combinada con la reducción en impuridad que produce su división para crear una estimación normalizada del poder predictivo de esa característica.

source: By **averaging** the estimates of predictive ability over several randomized trees one can **reduce the variance** of such an estimate and use it for feature selection. This is known as the mean decrease in impurity, or MDI. Refer to [L2014]_ for more information on MDI and feature importance evaluation with Random Forests.
es_es: Mediante la **promediación** de los estimados de habilidad predictiva sobre varios árboles aleatorizados, uno puede **reducir la varianza** de dicho estimado y usarlo para seleccionar características. Esto se conoce como la disminución media de la impureza, o DMI (MDI, en ingles). Ver [L2014]_ para más información sobre la DMI y la evaluación de importancia de características con Bosques Aleatorios.

source: The impurity-based feature importances computed on tree-based models suffer from two flaws that can lead to misleading conclusions. First they are computed on statistics derived from the training dataset and therefore **do not necessarily inform us on which features are most important to make good predictions on held-out dataset**. Secondly, **they favor high cardinality features**, that is features with many unique values. :ref:`permutation_importance` is an alternative to impurity-based feature importance that does not suffer from these flaws. These two methods of obtaining feature importance are explored in: :ref:`sphx_glr_auto_examples_inspection_plot_permutation_importance.py`.
es_es: Las importancias de característica basadas en impureza calculadas en modelos basados en árboles sufren de dos defectos clave que pueden llevar a conclusiones engañosas. Primero, son calculados en estadísticas derivadas del conjunto de datos de entrenamiento y por lo tanto **no necesariamente nos informan acerca de cuales características son las mas importantes para hacer buenas predicciones en los conjuntos de datos retenidos**. Segundo, **prefieren características de alta cardinalidad**, es decir, características con muchos valores únicos. :ref:`permutation_importance` es una alternativa a la importancia de característica basada en impureza que no sufre de estos defectos. Estos dos métodos para obtener la importancia de características se exploran en: :ref:`sphx_glr_auto_examples_inspection_plot_permutation_importance.py`.

source: The following example shows a color-coded representation of the relative importances of each individual pixel for a face recognition task using a :class:`ExtraTreesClassifier` model.
es_es: El siguiente ejemplo presenta una representación codificada en color de la importancia relativa de cada pixel para una tarea de reconocimiento de caras utilizando un modelo :class:`ExtraTreesClassifier`.
