Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/ensemble.po
Languages: es_es

source: The quantity :math:`\left[ \frac{\partial l(y_i, F(x_i))}{\partial F(x_i)} \right]_{F=F_{m - 1}}` is the derivative of the loss with respect to its second parameter, evaluated at :math:`F_{m-1}(x)`. It is easy to compute for any given :math:`F_{m - 1}(x_i)` in a closed form since the loss is differentiable. We will denote it by :math:`g_i`.
es_es: La cantidad :math:`\left[ \frac{\parcial l(y_i, F(x_i))}{\parcial F(x_i)} \right]_{F=F_{m - 1}}` es la derivada de la pérdida con respecto a su segundo parámetro, evaluado en :math:`F_{m-1}(x)`. Es fácil calcular por cualquier :math:`F_{m - 1}(x_i)` dado en una forma cerrada, ya que la pérdida es diferenciable. Lo denotaremos por :math:`g_i`.

source: Removing the constant terms, we have:
es_es: Eliminando los términos constantes, tenemos:

source: This is minimized if :math:`h(x_i)` is fitted to predict a value that is proportional to the negative gradient :math:`-g_i`. Therefore, at each iteration, **the estimator** :math:`h_m` **is fitted to predict the negative gradients of the samples**. The gradients are updated at each iteration. This can be considered as some kind of gradient descent in a functional space.
es_es: Esto es minimizado si :math:`h(x_i)` es ajustado para predecir un valor que es proporcional al gradiente negativo :math:`-g_i`. Por lo tanto, en cada iteración, **el estimador** :math:`h_m` **es ajustado para predecir los gradientes negativos de las muestras**. Los gradientes son actualizados en cada iteración. Esto se puede considerar como alguna especie de descenso por gradiente en un espacio funcional.

source: For some losses, e.g. the least absolute deviation (LAD) where the gradients are :math:`\pm 1`, the values predicted by a fitted :math:`h_m` are not accurate enough: the tree can only output integer values. As a result, the leaves values of the tree :math:`h_m` are modified once the tree is fitted, such that the leaves values minimize the loss :math:`L_m`. The update is loss-dependent: for the LAD loss, the value of a leaf is updated to the median of the samples in that leaf.
es_es: Para algunas pérdidas, por ejemplo la menor desviación absoluta (MDA, o LAD en íngles) donde los gradientes son :math:`\pm 1`, los valores predichos por un :math:`h_m` ajustado no son lo suficientemente precisos: el árbol solo puede generar valores enteros. Como resultado, los valores de las hojas del árbol :math:`h_m` se modifícan una vez que el árbol es ajustado, de tal forma que los valores de las hojas minimizan la perdida :math:`L_m`. Su actualización depende de las perdidas, para la pérdida LAD, el valor de una hoja se actualiza a la mediana de las muestras en esa hoja.

source: Gradient boosting for classification is very similar to the regression case. However, the sum of the trees :math:`F_M(x_i) = \sum_m h_m(x_i)` is not homogeneous to a prediction: it cannot be a class, since the trees predict continuous values.
es_es: El boosting por gradiente para la clasificación es muy similar al caso de regresión. Sin embargo, la suma de los árboles :math:`F_M(x_i) = \sum_m h_m(x_i)` no es homogénea a una predicción: no puede ser una clase, ya que los árboles predicen valores continuos.

source: The mapping from the value :math:`F_M(x_i)` to a class or a probability is loss-dependent. For the deviance (or log-loss), the probability that :math:`x_i` belongs to the positive class is modeled as :math:`p(y_i = 1 | x_i) = \sigma(F_M(x_i))` where :math:`\sigma` is the sigmoid function.
es_es: El mapeo desde el valor :math:`F_M(x_i)` a una clase o una probabilidad es dependiente de pérdidas. Para la desviación (o log-loss, es decir, perdida de logistica), la probabilidad de que :math:`x_i` pertenezca a la clase positiva está modelada como :math:`p(y_i = 1 | x_i) = \sigma(F_M(x_i)` donde :math:`\sigma` es la función sigmoid.

source: For multiclass classification, K trees (for K classes) are built at each of the :math:`M` iterations. The probability that :math:`x_i` belongs to class k is modeled as a softmax of the :math:`F_{M,k}(x_i)` values.
es_es: Para la clasificación multiclase, los árboles K (para clases K) se construyen en cada una de las iteraciones :math:`M`. La probabilidad de que :math:`x_i` pertenezca a la clase k se modela como un softmax de los valores :math:`F_{M,k}(x_i)`.

source: Note that even for a classification task, the :math:`h_m` sub-estimator is still a regressor, not a classifier. This is because the sub-estimators are trained to predict (negative) *gradients*, which are always continuous quantities.
es_es: Tenga en cuenta que incluso para una tarea de clasificación, el sub-estimador :math:`h_m` sigue siendo un regresor, no un clasificador. Esto es debido a que los sub-estimadores estan entrenados para predecir *gradientes* (negativos), los cuales siempre son cantidades continuas.

source: Loss Functions
es_es: Funciones de pérdida

source: The following loss functions are supported and can be specified using the parameter ``loss``:
es_es: Las siguientes funciones de pérdida son soportadas y se pueden especificar usando el parámetro ``loss``:

source: Least squares (``'ls'``): The natural choice for regression due to its superior computational properties. The initial model is given by the mean of the target values.
es_es: Mínimos cuadrados (``'ls'``): La elección natural para la regresión debido a sus propiedades computacionales superiores. El modelo inicial es dado por la media de los valores objetivo.

source: Least absolute deviation (``'lad'``): A robust loss function for regression. The initial model is given by the median of the target values.
es_es: Menor desviación absoluta (``'lad'``): Una función de pérdida robusta para la regresión. El modelo inicial es dado por la mediana de los valores objetivo.

source: Huber (``'huber'``): Another robust loss function that combines least squares and least absolute deviation; use ``alpha`` to control the sensitivity with regards to outliers (see [F2001]_ for more details).
es_es: Huber (``'huber'``): Otra función de pérdida robusta que combina mínimos cuadrados y menor desviación absoluta; utilice ``alpha`` para controlar la sensibilidad con respecto a los valores atípicos (ver [F2001]_ para más detalles).

source: Quantile (``'quantile'``): A loss function for quantile regression. Use ``0 < alpha < 1`` to specify the quantile. This loss function can be used to create prediction intervals (see :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_quantile.py`).
es_es: Quantile (``'quantile'``): Una función de pérdida para regresión de cuantiles. Utilice ``0 < alfa < 1`` para especificar el cuantil. Esta función de pérdida puede utilizarse para crear intervalos de predicción (ver :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_quantile.py`).

source: Binomial deviance (``'deviance'``): The negative binomial log-likelihood loss function for binary classification (provides probability estimates). The initial model is given by the log odds-ratio.
es_es: Desviación binomial (``'deviance'``): La función de pérdida de probabilidad logarítmica binomial negativa para la clasificación binaria (provee estimados de probabilidad). El modelo inicial viene dado por el logaritmo de la razón de momios.

source: Multinomial deviance (``'deviance'``): The negative multinomial log-likelihood loss function for multi-class classification with ``n_classes`` mutually exclusive classes. It provides probability estimates. The initial model is given by the prior probability of each class. At each iteration ``n_classes`` regression trees have to be constructed which makes GBRT rather inefficient for data sets with a large number of classes.
es_es: Desviación multinomial (``'deviance'``): La función de pérdida de probabilidad logarítmica multinomial negativa para clasificación multiclase con ``n_classes`` clases mutuamente exclusivas. Proporciona estimados de probabilidad. El modelo inicial es dado por la anterior probabilidad de cada clase. En cada iteración ``n_classes`` los árboles de regresión deben ser construidos, lo que hace que GBRT sea algo ineficiente para conjuntos de datos con un gran número de clases.

source: Exponential loss (``'exponential'``): The same loss function as :class:`AdaBoostClassifier`. Less robust to mislabeled examples than ``'deviance'``; can only be used for binary classification.
es_es: Pérdida exponencial (``'exponential'``): La misma función de perdida que :class:`AdaBoostClassifier`. Menos robusta para los ejemplos mal etiquetados que ``'deviance'``, solo puede ser usada para la clasificación binaria.

source: Shrinkage via learning rate
es_es: Reducción a través de la tasa de aprendizaje

source: [F2001]_ proposed a simple regularization strategy that scales the contribution of each weak learner by a constant factor :math:`\nu`:
es_es: [F2001]_ propuso una sencilla estrategia de regularización que escala la contribución de cada aprendiz débil por un factor constante :math:`\nu`:

source: The parameter :math:`\nu` is also called the **learning rate** because it scales the step length the gradient descent procedure; it can be set via the ``learning_rate`` parameter.
es_es: El parámetro :math:`\nu` es también llamado la **tasa de aprendizaje** porque escala la longitud de paso del procedimiento de descenso de gradiente; se puede establecer a través del parámetro ``learning_rate``.

source: The parameter ``learning_rate`` strongly interacts with the parameter ``n_estimators``, the number of weak learners to fit. Smaller values of ``learning_rate`` require larger numbers of weak learners to maintain a constant training error. Empirical evidence suggests that small values of ``learning_rate`` favor better test error. [HTF]_ recommend to set the learning rate to a small constant (e.g. ``learning_rate <= 0.1``) and choose ``n_estimators`` by early stopping. For a more detailed discussion of the interaction between ``learning_rate`` and ``n_estimators`` see [R2007]_.
es_es: El parámetro ``learning_rate`` interactúa fuertemente con el parámetro ``n_estimators``, el número de aprendices débiles a ajustar. Valores mas pequeños de ``learning_rate`` requieren de grandes números de aprendices débiles para mantener un error de entrenamiento constante. La evidencia empírica sugiere que valores pequeños de ``learning_rate`` favorecen un mejor error de pruebas. [HTF]_ recomiendan establecer la tasa de aprendizaje a una constante pequeña (por ejemplo, ``learning_rate <= 0.1``), y escoger ``n_estimators`` por parada anticipada. Para una discusión mas detallada de la interacción entre ``learning_rate`` y ``n_estimators`` vea [R2007]_.

source: Subsampling
es_es: Submuestreo

source: [F1999]_ proposed stochastic gradient boosting, which combines gradient boosting with bootstrap averaging (bagging). At each iteration the base classifier is trained on a fraction ``subsample`` of the available training data. The subsample is drawn without replacement. A typical value of ``subsample`` is 0.5.
es_es: [F1999]_ propone boosting por gradiente estocástico, lo cual combina el boosting por gradiente con el promediado de bootstrap (bagging). En cada iteración el clasificador base es entrenado en una fracción ``subsamples`` de los datos de entrenamiento disponibles. La submuestra es escogida sin reemplazo. Un valor típico de ``subsamples`` es 0.5.

source: The figure below illustrates the effect of shrinkage and subsampling on the goodness-of-fit of the model. We can clearly see that shrinkage outperforms no-shrinkage. Subsampling with shrinkage can further increase the accuracy of the model. Subsampling without shrinkage, on the other hand, does poorly.
es_es: La figura a continuación ilustra el efecto de la reducción y el submuestreo sobre la calidad del ajuste del modelo. Podemos ver claramente que el rendimiento es mayor con reducción que sín reducción. El submuestreo con reducción puede aumentar aún mas la precisión del modelo. Sin embargo, el submuestreo sín reducción tiene un resultado pobre.

source: Another strategy to reduce the variance is by subsampling the features analogous to the random splits in :class:`RandomForestClassifier` . The number of subsampled features can be controlled via the ``max_features`` parameter.
es_es: Otra estrategia para reducir la varianza es mediante el submuestreo de las características análogas a las divisiones aleatorias en :class:`RandomForestClassifier` . El número de características submuestradas puede ser controlado mediante el parámetro ``max_features``.

source: Using a small ``max_features`` value can significantly decrease the runtime.
es_es: Usar un valor ``max_features`` pequeño puede reducir significativamente el tiempo de ejecución.

source: Stochastic gradient boosting allows to compute out-of-bag estimates of the test deviance by computing the improvement in deviance on the examples that are not included in the bootstrap sample (i.e. the out-of-bag examples). The improvements are stored in the attribute :attr:`~GradientBoostingRegressor.oob_improvement_`. ``oob_improvement_[i]`` holds the improvement in terms of the loss on the OOB samples if you add the i-th stage to the current predictions. Out-of-bag estimates can be used for model selection, for example to determine the optimal number of iterations. OOB estimates are usually very pessimistic thus we recommend to use cross-validation instead and only use OOB if cross-validation is too time consuming.
es_es: El boosting por gradiente stocástico permite la computación de estimados fuera-de-bolsa de la desviación prueba mediante el calculo de la mejore en desviación de los ejemplos que no son incluidos en la muestra de bootstrap (es decir, los ejemplos fuera-de-bolsa). Las mejoras son almacenadas en el atributo :attr:`~GradientBoostingRegressor.oob_improvement_`. ``oob_improvement_[i]`` guarda la mejora en terminos de la pérdida en las muestras fuera-de-bolsa (OOB) si añades la i-ésima etapa a las predicciones actuales. Los estimados fuera-de-bolsa pueden ser utilizados para la selección de modelos, por ejemplo, para determinar el número de iteraciones original. Los estimados OOB suelen ser bastante pesimistas, por lo que recomendamos recurrir a ella solamente si la validación cruzada utiliza demasiado tiempo.

source: Interpretation with feature importance
es_es: Interpretación con importancia de característica

source: Individual decision trees can be interpreted easily by simply visualizing the tree structure. Gradient boosting models, however, comprise hundreds of regression trees thus they cannot be easily interpreted by visual inspection of the individual trees. Fortunately, a number of techniques have been proposed to summarize and interpret gradient boosting models.
es_es: Los árboles de decisión individuales se pueden interpretar fácilmente si se visualiza la estructura del árbol. Los modelos de boosting por gradiente, sin embargo, comprenden cientos de árboles de regresión, por lo que no pueden ser fácilmente interpretados por inspección visual de los árboles individuales. Afortunadamente, una diversidad de técnicas han sido propuestas para resumir e interpretar modelos de boosting por gradiente.

source: Often features do not contribute equally to predict the target response; in many situations the majority of the features are in fact irrelevant. When interpreting a model, the first question usually is: what are those important features and how do they contributing in predicting the target response?
es_es: A menudo las características no contribuyen de manera equitativa para predecir la respuesta objetivo; en muchas situaciones la mayoría de las características, son de hecho irrelevantes. Cuando se interpreta un modelo, la primera pregunta suele ser: cuales son estas características importantes y como contribuyen a predecir la respuesta objetivo?

source: Individual decision trees intrinsically perform feature selection by selecting appropriate split points. This information can be used to measure the importance of each feature; the basic idea is: the more often a feature is used in the split points of a tree the more important that feature is. This notion of importance can be extended to decision tree ensembles by simply averaging the impurity-based feature importance of each tree (see :ref:`random_forest_feature_importance` for more details).
es_es: Los árboles de decisión individuales realizan de manera intrínseca una selección de características al elegir puntos de división apropiados. Esta información puede ser utilizada para medir la importancia de cada característica; la idea fundamental es: mientras mas seguido se utilice una característica en los puntos de división de un árbol mas importante sera esta característica. Esta noción de importancia puede ser extendida a los conjuntos de árboles de decisión si simplemente se promedia la importancia de característica basadas en la impureza de cada árbol (see :ref:`random_forest_feature_importance` for more details).

source: The feature importance scores of a fit gradient boosting model can be accessed via the ``feature_importances_`` property::
es_es: Los puntajes de importancia de característica de un modelo de boosting por gradientes ya ajustado puede ser accedido mediante la propiedad ``feature_importances_``::

source: Note that this computation of feature importance is based on entropy, and it is distinct from :func:`sklearn.inspection.permutation_importance` which is based on permutation of the features.
es_es: Tenga en cuenta que este cálculo de la importancia de características esta basado en la entropía, y es distinto a :func:`sklearn.inspection.permutation_importance` el cual esta basado en la permutación de las características.

source: Histogram-Based Gradient Boosting
es_es: Boosting por gradientes basado en Histogramas

source: Scikit-learn 0.21 introduced two new experimental implementations of gradient boosting trees, namely :class:`HistGradientBoostingClassifier` and :class:`HistGradientBoostingRegressor`, inspired by `LightGBM <https://github.com/Microsoft/LightGBM>`__ (See [LightGBM]_).
es_es: Scikit-learn 0.21 introduce dos nuevas implementaciones experimentales de árboles de boosting por gradientes, :class:`HistGradientBoostingClassifier` y :class:`HistGradientBoostingRegressor`, inspirado por `LightGBM <https://github.com/Microsoft/LightGBM>`__ (Ver [LightGBM]_).

source: These fast estimators first bin the input samples ``X`` into integer-valued bins (typically 256 bins) which tremendously reduces the number of splitting points to consider, and allows the algorithm to leverage integer-based data structures (histograms) instead of relying on sorted continuous values when building the trees. The API of these estimators is slightly different, and some of the features from :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor` are not yet supported, for instance some loss functions.
es_es: Estos estimadores rápidos primero recolectan las muestras de entrada ``X`` en contenedores de valores enteros (usualmente 256 contenedores) lo cual reduce tremendamente el número de puntos de división a considerar, y permite al algoritmo aprovechar estructuras de datos basadas en enteros (histrogramas) en lugar de confiar en valores continuos ordenados cuando se construyen los árboles. El API de estos estimdaores es ligeramente distinto, y algunas de las funciones de :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor` aún no se soportan, como por ejemplo algunas funciones de perdida.

source: These estimators are still **experimental**: their predictions and their API might change without any deprecation cycle. To use them, you need to explicitly import ``enable_hist_gradient_boosting``::
es_es: Estos estimadores aún son **experimentales**: sus predicciones y su API quizás tenga que cambiar sin ningún ciclo de depreciación. Para utilizarlas, tienes que importar de manera explicita ``enable_hist_gradient_boosting``::

source: Most of the parameters are unchanged from :class:`GradientBoostingClassifier` and :class:`GradientBoostingRegressor`. One exception is the ``max_iter`` parameter that replaces ``n_estimators``, and controls the number of iterations of the boosting process::
es_es: La mayoría de los parámetros no cambian de :class:`GradientBoostingClassifier` y :class:`GradientBoostingRegressor`. Una excepción es el parámetro ``max_iter`` que sustituye a ``n_estimators``, y controla el número de iteraciones del proceso de boosting::

source: Available losses for regression are 'least_squares', 'least_absolute_deviation', which is less sensitive to outliers, and 'poisson', which is well suited to model counts and frequencies. For classification, 'binary_crossentropy' is used for binary classification and 'categorical_crossentropy' is used for multiclass classification. By default the loss is 'auto' and will select the appropriate loss depending on :term:`y` passed to :term:`fit`.
es_es: Las pérdidas disponibles para la regresión son 'least_squares', 'least_absolute_deviation', que es menos sensible a los valores atípicos, y 'poisson', que se adapta bien a las cuentas de modelos y frecuencias. Para la clasificación, 'binary_crossentropy' se utiliza para la clasificación binaria y 'categorical_crossentropy' se utiliza para la clasificación multiclase. Por defecto, la pérdida es 'auto' y seleccionará la pérdida apropiada dependiendo de :term:`y` pasado a :term:`fit`.

source: The size of the trees can be controlled through the ``max_leaf_nodes``, ``max_depth``, and ``min_samples_leaf`` parameters.
es_es: El tamaño de los árboles puede controlarse a través de los parámetros ``max_leaf_nodes``, ``max_depth``, y ``min_samples_leaf``.

source: The number of bins used to bin the data is controlled with the ``max_bins`` parameter. Using less bins acts as a form of regularization. It is generally recommended to use as many bins as possible, which is the default.
es_es: El número de contenedores usados para recolectar los datos se controla con el parámetro ``max_bins``. Usar menos contenedores actúa como una forma de regularización. Generalmente se recomienda utilizar el mayor número posible de contenedores, el cual es el valor predeterminado.

source: The ``l2_regularization`` parameter is a regularizer on the loss function and corresponds to :math:`\lambda` in equation (2) of [XGBoost]_.
es_es: El parámetro ``l2_regularization`` es un regularizador en la función de pérdida y corresponde a :math:`\lambda` en la ecuación (2) de [XGBoost]_.

source: Note that **early-stopping is enabled by default if the number of samples is larger than 10,000**. The early-stopping behaviour is controlled via the ``early-stopping``, ``scoring``, ``validation_fraction``, ``n_iter_no_change``, and ``tol`` parameters. It is possible to early-stop using an arbitrary :term:`scorer`, or just the training or validation loss. Note that for technical reasons, using a scorer is significantly slower than using the loss. By default, early-stopping is performed if there are at least 10,000 samples in the training set, using the validation loss.
es_es: Ten en cuenta que **el parado temprano esta habilitado por defecto si el número de muestras es mayor que 10,000**. El comportamiento del parado temprano es controlado mediante los parámetros ``validation_fraction``, ``n_iter_no_change``, y ``tol``. Es posible parar temprano usando un :term:`scorer` arbitrario, o simplemente la perdida de entrenamiento o validación. Sin embargo, por razones técnicas, usar un scorer es significativamente mas lento que utilizar la perdida. Por defecto, se utiliza el parado temprano si hay por lo menos 10,000 muestras en el conjunto de entrenamiento, utilizando la pérdida por validación.

source: Missing values support
es_es: Soporte para valores faltantes
