Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/feature_extraction.po
Languages: es_es

source: In order to address the wider task of Natural Language Understanding, the local structure of sentences and paragraphs should thus be taken into account. Many such models will thus be casted as "Structured output" problems which are currently outside of the scope of scikit-learn.
es_es: Con el fin de abordar la tarea más amplia de la comprensión del lenguaje natural, debe tenerse en cuenta la estructura local de frases y párrafos. Muchos de estos modelos serán, por lo tanto, considerados como problemas de "salida estructurada" que actualmente están fuera del alcance de scikit-learn.

source: Vectorizing a large text corpus with the hashing trick
es_es: Vectorizando un corpus de texto grande con el truco de hashing

source: The above vectorization scheme is simple but the fact that it holds an **in- memory mapping from the string tokens to the integer feature indices** (the ``vocabulary_`` attribute) causes several **problems when dealing with large datasets**:
es_es: El esquema de vectorización anterior es simple, pero el hecho de que contenga **un mapeo de memoria de los tokens de cadena a los índices de características enteras** (el atributo ``vocabulary_`) causa varios **problemas al tratar con conjuntos de datos grandes**:

source: the larger the corpus, the larger the vocabulary will grow and hence the memory use too,
es_es: cuanto más grande sea el corpus, mayor será el vocabulario y, por tanto, también el uso de memoria,

source: fitting requires the allocation of intermediate data structures of size proportional to that of the original dataset.
es_es: el ajuste requiere la asignación de estructuras de datos intermedias de tamaño proporcional al del conjunto de datos original.

source: building the word-mapping requires a full pass over the dataset hence it is not possible to fit text classifiers in a strictly online manner.
es_es: la construcción del mapeo de palabras requiere un pase completo sobre el conjunto de datos, por lo que no es posible ajustar los clasificadores de texto de una manera estrictamente en línea.

source: pickling and un-pickling vectorizers with a large ``vocabulary_`` can be very slow (typically much slower than pickling / un-pickling flat data structures such as a NumPy array of the same size),
es_es: pickling y un-pickling vectorizadores con un ``vocabulary_`` extenso puede llegar a ser muy lento (típicamente mucho más lento que el pickling / un-pickling de estructuras de datos planas como un arreglo de NumPy del mismo tamaño),

source: it is not easily possible to split the vectorization work into concurrent sub tasks as the ``vocabulary_`` attribute would have to be a shared state with a fine grained synchronization barrier: the mapping from token string to feature index is dependent on ordering of the first occurrence of each token hence would have to be shared, potentially harming the concurrent workers' performance to the point of making them slower than the sequential variant.
es_es: no es posible dividir fácilmente el trabajo de vectorización en subtareas simultáneas, ya que el atributo ``vocabulary_`` tendría que ser un estado compartido con una barrera de sincronización de granularidad fina: el mapeo de la cadena del token al índice de características depende del orden de la primera ocurrencia de cada token, por lo que tendría que ser compartido, perjudicando potencialmente el rendimiento simultáneo de los trabajadores hasta el punto de hacerlos más lentos que la variante secuencial.

source: It is possible to overcome those limitations by combining the "hashing trick" (:ref:`Feature_hashing`) implemented by the :class:`~sklearn.feature_extraction.FeatureHasher` class and the text preprocessing and tokenization features of the :class:`CountVectorizer`.
es_es: Es posible superar esas limitaciones combinando el "truco de hashing" (:ref:`Feature_hashing`) implementado por la clase :class:`~sklearn.feature_extraction.FeatureHasher` y el preprocesamiento de texto y tokenización de características de :class:`CountVectorizer`.

source: This combination is implementing in :class:`HashingVectorizer`, a transformer class that is mostly API compatible with :class:`CountVectorizer`. :class:`HashingVectorizer` is stateless, meaning that you don't have to call ``fit`` on it::
es_es: Esta combinación está implementada en :class:`HashingVectorizer`, una clase transformadora que es mayormente compatible con la API de :class:`CountVectorizer`. :class:`HashingVectorizer` no tiene estado, lo que significa que no hay que llamar a ``fit`` en ella::

source: You can see that 16 non-zero feature tokens were extracted in the vector output: this is less than the 19 non-zeros extracted previously by the :class:`CountVectorizer` on the same toy corpus. The discrepancy comes from hash function collisions because of the low value of the ``n_features`` parameter.
es_es: Puedes ver que se extrajeron 16 tokens de características no nulas en el vector de salida: esto es menor que los 19 no ceros extraídos previamente por :class:`CountVectorizer` en el mismo corpus de juego. La discrepancia proviene de las colisiones de la función hash debido al bajo valor del parámetro ``n_features``.

source: In a real world setting, the ``n_features`` parameter can be left to its default value of ``2 ** 20`` (roughly one million possible features). If memory or downstream models size is an issue selecting a lower value such as ``2 ** 18`` might help without introducing too many additional collisions on typical text classification tasks.
es_es: En un entorno del mundo real, el parámetro `` n_features '' se puede dejar en su valor predeterminado de `` 2 ** 20 '' (aproximadamente un millón de características posibles). Si la memoria o el tamaño de los modelos posteriores es un problema, seleccionar un valor inferior como `` 2 ** 18 '' podría ayudar sin introducir demasiadas colisiones adicionales en las tareas típicas de clasificación de texto.

source: Note that the dimensionality does not affect the CPU training time of algorithms which operate on CSR matrices (``LinearSVC(dual=True)``, ``Perceptron``, ``SGDClassifier``, ``PassiveAggressive``) but it does for algorithms that work with CSC matrices (``LinearSVC(dual=False)``, ``Lasso()``, etc).
es_es: Ten en cuenta que la dimensionalidad no afecta al tiempo de entrenamiento de la CPU de algoritmos que operan con matrices CSR (``LinearSVC(dual=True)``, ``Perceptron``, ``SGDClassifier``, ``PassiveAggressive``), pero sí lo hace para algoritmos que trabajan con matrices CSC (``LinearSVC(dual=False)``, ``Lasso()``, etc).

source: Let's try again with the default setting::
es_es: Intentemos de nuevo con la configuración por defecto::

source: We no longer get the collisions, but this comes at the expense of a much larger dimensionality of the output space. Of course, other terms than the 19 used here might still collide with each other.
es_es: Ya no tenemos las colisiones, pero esto se produce a costa de una dimensionalidad mucho mayor del espacio de salida. Por supuesto, otros términos distintos de los 19 utilizados aquí podrían seguir colisionando entre sí.

source: The :class:`HashingVectorizer` also comes with the following limitations:
es_es: El :class:`HashingVectorizer` también viene con las siguientes limitaciones:

source: it is not possible to invert the model (no ``inverse_transform`` method), nor to access the original string representation of the features, because of the one-way nature of the hash function that performs the mapping.
es_es: no es posible invertir el modelo (no hay método ``inverse_transform``), ni acceder a la representación original de cadenas de las características, debido a la naturaleza unidireccional de la función hash que realiza el mapeo.

source: it does not provide IDF weighting as that would introduce statefulness in the model. A :class:`TfidfTransformer` can be appended to it in a pipeline if required.
es_es: no proporciona ponderación de IDF, ya que esto introduciría la condición de admitir diferentes estados en el modelo. Un :class:`TfidfTransformer` puede ser anexado a él en un pipeline si es necesario.

source: Performing out-of-core scaling with HashingVectorizer
es_es: Realizando escalado fuera del núcleo con HashingVectorizer

source: An interesting development of using a :class:`HashingVectorizer` is the ability to perform `out-of-core`_ scaling. This means that we can learn from data that does not fit into the computer's main memory.
es_es: Un desarrollo interesante de usar un :class:`HashingVectorizer` es la capacidad de realizar un escalado `out-of-core`_. Esto significa que podemos aprender de datos que no encajan en la memoria principal del computador.

source: A strategy to implement out-of-core scaling is to stream data to the estimator in mini-batches. Each mini-batch is vectorized using :class:`HashingVectorizer` so as to guarantee that the input space of the estimator has always the same dimensionality. The amount of memory used at any time is thus bounded by the size of a mini-batch. Although there is no limit to the amount of data that can be ingested using such an approach, from a practical point of view the learning time is often limited by the CPU time one wants to spend on the task.
es_es: Una estrategia para implementar el escalado fuera del núcleo es enviar los datos al estimador en mini lotes. Cada mini lote es vectorizado usando :class:`HashingVectorizer` para garantizar que el espacio de entrada del estimador tenga siempre la misma dimensionalidad. La cantidad de memoria utilizada en cualquier momento está así limitada por el tamaño de un mini lote. Aunque no hay límite para la cantidad de datos que se pueden ingerir utilizando este enfoque, desde un punto de vista práctico el tiempo de aprendizaje a menudo está limitado por el tiempo de CPU que se quiera dedicar a la tarea.

source: For a full-fledged example of out-of-core scaling in a text classification task see :ref:`sphx_glr_auto_examples_applications_plot_out_of_core_classification.py`.
es_es: Para un ejemplo completo de escalado fuera del núcleo en una tarea de clasificación de texto, consulta :ref:`sphx_glr_auto_examples_applications_plot_out_of_core_classification.py`.

source: Customizing the vectorizer classes
es_es: Personalización de las clases del vectorizador

source: It is possible to customize the behavior by passing a callable to the vectorizer constructor::
es_es: Es posible personalizar el comportamiento pasando una llamada al constructor del vectorizador::

source: In particular we name:
es_es: En particular, nombramos:

source: ``preprocessor``: a callable that takes an entire document as input (as a single string), and returns a possibly transformed version of the document, still as an entire string. This can be used to remove HTML tags, lowercase the entire document, etc.
es_es: ``preprocessor``: una llamada que toma un documento entero como entrada (como una sola cadena), y devuelve una versión posiblemente transformada del documento, todavía como una cadena completa. Esto se puede utilizar para eliminar etiquetas HTML, poner en minúsculas todo el documento, etc.

source: ``tokenizer``: a callable that takes the output from the preprocessor and splits it into tokens, then returns a list of these.
es_es: ``tokenizer``: una llamada que toma la salida del preprocesador y la divide en tokens, luego devuelve una lista de estos.

source: ``analyzer``: a callable that replaces the preprocessor and tokenizer. The default analyzers all call the preprocessor and tokenizer, but custom analyzers will skip this. N-gram extraction and stop word filtering take place at the analyzer level, so a custom analyzer may have to reproduce these steps.
es_es: ``analyzer``: una llamada que reemplaza al preprocesador y al tokenizador. Todos los analizadores por defecto llaman al preprocesador y al tokenizador, pero los analizadores personalizados se saltarán esto. La extracción de N-gramas y el filtrado de palabras funcionales tienen lugar en el nivel del analizador, por lo que un analizador personalizado puede tener que reproducir estos pasos.

source: (Lucene users might recognize these names, but be aware that scikit-learn concepts may not map one-to-one onto Lucene concepts.)
es_es: (Los usuarios de Lucene pueden reconocer estos nombres, pero ten en cuenta que los conceptos de scikit-learn pueden no coincidir uno a uno con los conceptos de Lucene.)

source: To make the preprocessor, tokenizer and analyzers aware of the model parameters it is possible to derive from the class and override the ``build_preprocessor``, ``build_tokenizer`` and ``build_analyzer`` factory methods instead of passing custom functions.
es_es: Para que el preprocesador, el tokenizador y los analizadores sean conscientes de los parámetros del modelo es posible derivar de la clase y anular los métodos de fábrica ``build_preprocessor``, ``build_tokenizer`` y ``build_analyzer`` en lugar de pasar funciones personalizadas.

source: Some tips and tricks:
es_es: Algunos consejos y trucos:

source: If documents are pre-tokenized by an external package, then store them in files (or strings) with the tokens separated by whitespace and pass ``analyzer=str.split``
es_es: Si los documentos están pre-tokenizados por un paquete externo, entonces almacénalos en archivos (o cadenas) con los tokens separados por espacios en blanco y pasa ``analyzer=str.split``

source: Fancy token-level analysis such as stemming, lemmatizing, compound splitting, filtering based on part-of-speech, etc. are not included in the scikit-learn codebase, but can be added by customizing either the tokenizer or the analyzer. Here's a ``CountVectorizer`` with a tokenizer and lemmatizer using `NLTK <https://www.nltk.org/>`_::
es_es: El análisis sofisticado a nivel de tokens, como el stemming, la lematización, la división compuesta, el filtrado basado en etiquetas part-of-speech, etc., no se incluyen en la base de código de scikit-learn, pero puede añadirse personalizando el tokenizador o el analizador. Aquí hay un ``CountVectorizer`` con un tokenizador y lematizador usando `NLTK <https://www.nltk.org/>`_::

source: (Note that this will not filter out punctuation.)
es_es: (Nota que esto no filtrará los signos de puntuación.)

source: The following example will, for instance, transform some British spelling to American spelling::
es_es: El siguiente ejemplo transformará, por ejemplo, algunas ortografías Británicas en ortografías Americanas::

source: for other styles of preprocessing; examples include stemming, lemmatization, or normalizing numerical tokens, with the latter illustrated in:
es_es: para otros estilos de preprocesamiento; los ejemplos incluyen stemming, lematización o normalización de tokens numéricos, con estos últimos ilustrados en:

source: Customizing the vectorizer can also be useful when handling Asian languages that do not use an explicit word separator such as whitespace.
es_es: La personalización del vectorizador también puede ser útil cuando se manejan idiomas asiáticos que no utilizan un separador de palabras explícito, como los espacios en blanco.

source: Image feature extraction
es_es: Extracción de características de imagen

source: Patch extraction
es_es: Extracción de parches

source: The :func:`extract_patches_2d` function extracts patches from an image stored as a two-dimensional array, or three-dimensional with color information along the third axis. For rebuilding an image from all its patches, use :func:`reconstruct_from_patches_2d`. For example let use generate a 4x4 pixel picture with 3 color channels (e.g. in RGB format)::
es_es: La función :func:`extract_patches_2d` extrae parches de una imagen almacenada como un arreglo bidimensional o tridimensional con información de color a lo largo del tercer eje. Para reconstruir una imagen a partir de todos sus parches, utiliza :func:`reconstruct_from_patches_2d`. Por ejemplo, generemos una imagen de 4x4 píxeles con 3 canales de color (por ejemplo, en formato RGB)::

source: Let us now try to reconstruct the original image from the patches by averaging on overlapping areas::
es_es: Intentemos ahora reconstruir la imagen original a partir de los parches promediando en áreas superpuestas::

source: The :class:`PatchExtractor` class works in the same way as :func:`extract_patches_2d`, only it supports multiple images as input. It is implemented as an estimator, so it can be used in pipelines. See::
es_es: La clase :class:`PatchExtractor` funciona de la misma manera que :func:`extract_patches_2d`, sólo que soporta múltiples imágenes como entrada. Se implementa como un estimador, así que puede ser utilizado en pipelines. Ver ::

source: Connectivity graph of an image
es_es: Grafo de conectividad de una imagen

source: Several estimators in the scikit-learn can use connectivity information between features or samples. For instance Ward clustering (:ref:`hierarchical_clustering`) can cluster together only neighboring pixels of an image, thus forming contiguous patches:
es_es: Varios estimadores de scikit-learn pueden utilizar la información de conectividad entre características o muestras. Por ejemplo, el agrupamiento de Ward (:ref:`hierarchical_clustering`) puede agrupar sólo los píxeles vecinos de una imagen, formando así parches contiguos:

source: For this purpose, the estimators use a 'connectivity' matrix, giving which samples are connected.
es_es: Para ello, los estimadores utilizan una matriz "conectividad", que indica las muestras que están conectadas.

source: The function :func:`img_to_graph` returns such a matrix from a 2D or 3D image. Similarly, :func:`grid_to_graph` build a connectivity matrix for images given the shape of these image.
es_es: La función :func:`img_to_graph` devuelve una matriz de este tipo a partir de una imagen 2D o 3D. Del mismo modo, :func:`grid_to_graph` construye una matriz de conectividad para imágenes dada la forma de estas.

source: These matrices can be used to impose connectivity in estimators that use connectivity information, such as Ward clustering (:ref:`hierarchical_clustering`), but also to build precomputed kernels, or similarity matrices.
es_es: Estas matrices pueden utilizarse para imponer conectividad en estimadores que utilizan información de conectividad, tales como el agrupamiento de Ward (:ref:`hierarchical_clustering`), pero también para construir kernels precalculados, o matrices de similaridad.

source: **Examples**
es_es: **Ejemplos**
