Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/feature_extraction.po
Languages: es_es

source: There are several known issues in our provided 'english' stop word list. It does not aim to be a general, 'one-size-fits-all' solution as some tasks may require a more custom solution. See [NQY18]_ for more details.
es_es: Hay varios problemas conocidos en nuestra lista de palabras funcionales 'inglés' proporcionada. No tiene como objetivo ser una solución general, de "talla única", ya que algunas tareas pueden requerir una solución más personalizada. Consulta [NQY18]_ para más detalles.

source: Please take care in choosing a stop word list. Popular stop word lists may include words that are highly informative to some tasks, such as *computer*.
es_es: Por favor, ten cuidado al elegir una lista de palabras funcionales. Las listas populares de palabras funcionales pueden incluir palabras que son altamente informativas para algunas tareas, como *computadora*.

source: You should also make sure that the stop word list has had the same preprocessing and tokenization applied as the one used in the vectorizer. The word *we've* is split into *we* and *ve* by CountVectorizer's default tokenizer, so if *we've* is in ``stop_words``, but *ve* is not, *ve* will be retained from *we've* in transformed text. Our vectorizers will try to identify and warn about some kinds of inconsistencies.
es_es: También asegúrate de que a la lista de palabras funcionales se le ha aplicado el mismo preprocesamiento y tokenización que el utilizado en el vectorizador. La palabra *we've* está dividida en *we* y *ve* por el tokenizador por defecto CountVectorizer, así que si *we've* está en ``stop_words``, pero *ve* no lo está, *ve* será retenido de *we've* en el texto transformado. Nuestros vectorizadores tratarán de identificar y advertir sobre algunos tipos de inconsistencias.

source: Tf–idf term weighting
es_es: Ponderación de términos Tf-idf

source: In a large text corpus, some words will be very present (e.g. "the", "a", "is" in English) hence carrying very little meaningful information about the actual contents of the document. If we were to feed the direct count data directly to a classifier those very frequent terms would shadow the frequencies of rarer yet more interesting terms.
es_es: En un corpus de texto extenso, algunas palabras estarán muy presentes (p. ej. "the", "a", "is" en inglés), por lo que contienen muy poca información significativa sobre el contenido real del documento. Si tuviéramos que suministrar los datos de recuento directo directamente a un clasificador, esos términos muy frecuentes ensombrecerían las frecuencias de términos más raros pero más interesantes.

source: In order to re-weight the count features into floating point values suitable for usage by a classifier it is very common to use the tf–idf transform.
es_es: Para reponderar las características de conteo en valores de punto flotante adecuados para su uso por un clasificador, es muy común utilizar la transformación tf-idf.

source: Tf means **term-frequency** while tf–idf means term-frequency times **inverse document-frequency**: :math:`\text{tf-idf(t,d)}=\text{tf(t,d)} \times \text{idf(t)}`.
es_es: Tf significa **frecuencia de términos** mientras que tf-idf significa frecuencia de términos por **frecuencia inversa de documentos**: :math:`\text{tf-idf(t,d)}=\text{tf(t,d)} \times \text{idf(t)}`.

source: Using the ``TfidfTransformer``'s default settings, ``TfidfTransformer(norm='l2', use_idf=True, smooth_idf=True, sublinear_tf=False)`` the term frequency, the number of times a term occurs in a given document, is multiplied with idf component, which is computed as
es_es: Utilizando la configuración por defecto del ``TfidfTransformer``, ``TfidfTransformer(norm='l2', use_idf=True, smooth_idf=True, sublinear_tf=False)`` la frecuencia de términos, el número de veces que un término aparece en un documento determinado, se multiplica por el componente idf, que se calcula como

source: where :math:`n` is the total number of documents in the document set, and :math:`\text{df}(t)` is the number of documents in the document set that contain term :math:`t`. The resulting tf-idf vectors are then normalized by the Euclidean norm:
es_es: donde :math:`n` es el número total de documentos en el conjunto de documentos, y :math:`\text{df}(t)` es el número de documentos en el conjunto de documentos que contienen el término :math:`t`. Los vectores tf-idf resultantes son normalizados por la norma Euclideana:

source: This was originally a term weighting scheme developed for information retrieval (as a ranking function for search engines results) that has also found good use in document classification and clustering.
es_es: Originalmente se trataba de un esquema de ponderación de términos desarrollado para la recuperación de la información (como una función de clasificación para los resultados de los motores de búsqueda) que también ha encontrado un buen uso en la clasificación y conglomeración de documentos.

source: The following sections contain further explanations and examples that illustrate how the tf-idfs are computed exactly and how the tf-idfs computed in scikit-learn's :class:`TfidfTransformer` and :class:`TfidfVectorizer` differ slightly from the standard textbook notation that defines the idf as
es_es: Las siguientes secciones contienen más explicaciones y ejemplos que ilustran cómo se calculan exactamente los tf-idfs y cómo los tf-idfs calculados en scikit-learn :class:`TfidfTransformer` y :class:`TfidfVectorizer` difieren ligeramente de la notación estándar de los libros de texto que definen el idf como

source: In the :class:`TfidfTransformer` and :class:`TfidfVectorizer` with ``smooth_idf=False``, the "1" count is added to the idf instead of the idf's denominator:
es_es: En :class:`TfidfTransformer` y el :class:`TfidfVectorizer` con ``smooth_idf=False``, el conteo "1" se añade al idf en lugar del denominador del idf:

source: This normalization is implemented by the :class:`TfidfTransformer` class::
es_es: Esta normalización es implementada por la clase :class:`TfidfTransformer`::

source: Again please see the :ref:`reference documentation <text_feature_extraction_ref>` for the details on all the parameters.
es_es: De nuevo, por favor consulta la :ref:`documentación de referencia <text_feature_extraction_ref>` para los detalles de todos los parámetros.

source: Let's take an example with the following counts. The first term is present 100% of the time hence not very interesting. The two other features only in less than 50% of the time hence probably more representative of the content of the documents::
es_es: Tomemos un ejemplo con los siguientes conteos. El primer término está presente el 100% de las veces, por lo tanto, no es muy interesante. Las otras dos características sólo en menos del 50% de las ocasiones, por lo que probablemente sean más representativas del contenido de los documentos::

source: Each row is normalized to have unit Euclidean norm:
es_es: Cada fila está normalizada para tener una norma Euclideana unitaria:

source: For example, we can compute the tf-idf of the first term in the first document in the `counts` array as follows:
es_es: Por ejemplo, podemos calcular el tf-idf del primer término del primer documento en el arreglo `counts` de la siguiente manera:

source: Now, if we repeat this computation for the remaining 2 terms in the document, we get
es_es: Ahora, si repetimos este cálculo para los 2 términos restantes en el documento, obtenemos

source: and the vector of raw tf-idfs:
es_es: y el vector de tf-idfs en bruto:

source: Then, applying the Euclidean (L2) norm, we obtain the following tf-idfs for document 1:
es_es: Luego, aplicando la norma Euclideana (L2) obtenemos los siguientes tf-idfs para el documento 1:

source: Furthermore, the default parameter ``smooth_idf=True`` adds "1" to the numerator and denominator as if an extra document was seen containing every term in the collection exactly once, which prevents zero divisions:
es_es: Además, el parámetro por defecto ``smooth_idf=True`` añade "1" al numerador y al denominador como si se viera un documento extra que contiene cada término de la colección exactamente una vez, lo que evita las divisiones cero:

source: Using this modification, the tf-idf of the third term in document 1 changes to 1.8473:
es_es: Usando esta modificación, el tf-idf del tercer término del documento 1 cambia a 1.8473:

source: And the L2-normalized tf-idf changes to
es_es: Y el tf-idf L2-normalizado cambia a

source: The weights of each feature computed by the ``fit`` method call are stored in a model attribute::
es_es: Los pesos de cada característica calculados por la llamada al método ``fit`` se almacenan en un atributo del modelo::

source: As tf–idf is very often used for text features, there is also another class called :class:`TfidfVectorizer` that combines all the options of :class:`CountVectorizer` and :class:`TfidfTransformer` in a single model::
es_es: Como tf-idf se utiliza muy a menudo para las características de texto, también hay otra clase llamada :class:`TfidfVectorizer` que combina todas las opciones de :class:`CountVectorizer` y :class:`TfidfTransformer` en un solo modelo::

source: While the tf–idf normalization is often very useful, there might be cases where the binary occurrence markers might offer better features. This can be achieved by using the ``binary`` parameter of :class:`CountVectorizer`. In particular, some estimators such as :ref:`bernoulli_naive_bayes` explicitly model discrete boolean random variables. Also, very short texts are likely to have noisy tf–idf values while the binary occurrence info is more stable.
es_es: Aunque la normalización tf-idf suele ser muy útil, puede haber casos en los que los marcadores de ocurrencia binarios podrían ofrecer mejores características. Esto se puede lograr usando el parámetro ``binary`` de :class:`CountVectorizer`. En particular, algunos estimadores como :ref:`bernoulli_naive_bayes` modelan explícitamente variables aleatorias booleanas discretas. Además, es probable que los textos muy cortos tengan valores tf-idf ruidosos, mientras que la información de la ocurrencia binaria es más estable.

source: As usual the best way to adjust the feature extraction parameters is to use a cross-validated grid search, for instance by pipelining the feature extractor with a classifier:
es_es: Como es habitual, la mejor manera de ajustar los parámetros de extracción de características es utilizar una búsqueda de cuadrícula con validación cruzada, por ejemplo, canalizando el extractor de características con un clasificador:

source: Decoding text files
es_es: Decodificación de archivos de texto

source: Text is made of characters, but files are made of bytes. These bytes represent characters according to some *encoding*. To work with text files in Python, their bytes must be *decoded* to a character set called Unicode. Common encodings are ASCII, Latin-1 (Western Europe), KOI8-R (Russian) and the universal encodings UTF-8 and UTF-16. Many others exist.
es_es: El texto está hecho de caracteres, pero los archivos están hechos de bytes. Estos bytes representan caracteres de acuerdo a alguna *codificación*. Para trabajar con archivos de texto en Python, sus bytes deben ser *decodificados* a un conjunto de caracteres llamado Unicode. Las codificaciones comunes son ASCII, Latin-1 (Europa Occidental), KOI8-R (Ruso) y las codificaciones universales UTF-8 y UTF-16. Existen muchas otras.

source: An encoding can also be called a 'character set', but this term is less accurate: several encodings can exist for a single character set.
es_es: Una codificación también puede llamarse 'conjunto de caracteres', pero este término es menos preciso: pueden existir varias codificaciones para un mismo conjunto de caracteres.

source: The text feature extractors in scikit-learn know how to decode text files, but only if you tell them what encoding the files are in. The :class:`CountVectorizer` takes an ``encoding`` parameter for this purpose. For modern text files, the correct encoding is probably UTF-8, which is therefore the default (``encoding="utf-8"``).
es_es: Los extractores de características de texto en scikit-learn saben cómo decodificar archivos de texto, pero sólo si se les dice en qué codificación están los archivos. El :class:`CountVectorizer` toma un parámetro ``encoding`` para este propósito. Para archivos de texto modernos, la codificación correcta es probablemente UTF-8, que es por lo tanto el valor por defecto (``encoding="utf-8"``).

source: If the text you are loading is not actually encoded with UTF-8, however, you will get a ``UnicodeDecodeError``. The vectorizers can be told to be silent about decoding errors by setting the ``decode_error`` parameter to either ``"ignore"`` or ``"replace"``. See the documentation for the Python function ``bytes.decode`` for more details (type ``help(bytes.decode)`` at the Python prompt).
es_es: Sin embargo, si el texto que estás cargando no está codificado con UTF-8, obtendrás un ``UnicodeDecodeError``. Se puede indicar a los vectorizadores que guarden silencio sobre los errores de decodificación estableciendo el parámetro ``decode_error`` como ``"ignore"`` o ``"replace"``. Consulta la documentación de la función de Python ``bytes.decode`` para más detalles (escribe ``help(bytes.decode)`` en la consola de Python).

source: If you are having trouble decoding text, here are some things to try:
es_es: Si estás teniendo problemas para decodificar texto, aquí tienes algunas cosas para probar:

source: Find out what the actual encoding of the text is. The file might come with a header or README that tells you the encoding, or there might be some standard encoding you can assume based on where the text comes from.
es_es: Averigua cuál es la codificación real del texto. El archivo puede venir con un encabezado o README que te diga la codificación, o puede haber alguna codificación estándar que puedas asumir basándote en la procedencia del texto.

source: You may be able to find out what kind of encoding it is in general using the UNIX command ``file``. The Python ``chardet`` module comes with a script called ``chardetect.py`` that will guess the specific encoding, though you cannot rely on its guess being correct.
es_es: Puedes averiguar qué tipo de codificación es en general usando el comando UNIX ``file``. El módulo ``chardet`` de Python viene con un script llamado ``chardetect.py`` que adivinará la codificación específica, aunque no puedes confiar en que su conjetura sea correcta.

source: You could try UTF-8 and disregard the errors. You can decode byte strings with ``bytes.decode(errors='replace')`` to replace all decoding errors with a meaningless character, or set ``decode_error='replace'`` in the vectorizer. This may damage the usefulness of your features.
es_es: Puedes intentar con UTF-8 e ignorar los errores. Puedes decodificar cadenas de bytes con ``bytes.decode(errors='replace')`` para reemplazar todos los errores de decodificación con un carácter sin sentido, o establecer ``decode_error='replace'`` en el vectorizador. Esto puede dañar la utilidad de tus características.

source: Real text may come from a variety of sources that may have used different encodings, or even be sloppily decoded in a different encoding than the one it was encoded with. This is common in text retrieved from the Web. The Python package `ftfy`_ can automatically sort out some classes of decoding errors, so you could try decoding the unknown text as ``latin-1`` and then using ``ftfy`` to fix errors.
es_es: El texto real puede provenir de una variedad de fuentes que pueden haber utilizado diferentes codificaciones, o incluso ser decodificado de forma descuidada en una codificación diferente a la que fue codificado. Esto es común en textos recuperados de la web. El paquete de Python `ftfy`_ puede ordenar automáticamente algunas clases de errores de decodificación, así que puedes intentar decodificar el texto desconocido como ``latin-1`` y luego usar ``ftfy`` para corregir errores.

source: If the text is in a mish-mash of encodings that is simply too hard to sort out (which is the case for the 20 Newsgroups dataset), you can fall back on a simple single-byte encoding such as ``latin-1``. Some text may display incorrectly, but at least the same sequence of bytes will always represent the same feature.
es_es: Si el texto se encuentra en una mezcla de codificaciones que es simplemente demasiado difícil de ordenar (como es el caso del conjunto de datos 20 Newsgroups), puede recurrir a una codificación simple de un solo byte como ``latin-1``. Algún texto puede mostrarse incorrectamente, pero al menos la misma secuencia de bytes siempre representará la misma característica.

source: For example, the following snippet uses ``chardet`` (not shipped with scikit-learn, must be installed separately) to figure out the encoding of three texts. It then vectorizes the texts and prints the learned vocabulary. The output is not shown here.
es_es: Por ejemplo, el siguiente fragmento de código utiliza ``chardet`` (no se incluye con scikit-learn, debe ser instalado por separado) para determinar la codificación de tres textos. Luego vectoriza los textos e imprime el vocabulario aprendido. La salida no se muestra aquí.

source: (Depending on the version of ``chardet``, it might get the first one wrong.)
es_es: (Dependiendo de la versión de ``chardet``, puede que se equivoque en la primera.)

source: For an introduction to Unicode and character encodings in general, see Joel Spolsky's `Absolute Minimum Every Software Developer Must Know About Unicode <https://www.joelonsoftware.com/articles/Unicode.html>`_.
es_es: Para una introducción a Unicode y las codificaciones de caracteres en general, consulta Joel Spolsky `Absolute Minimum Every Software Developer Must Know About Unicode <https://www.joelonsoftware.com/articles/Unicode.html>`_.

source: Applications and examples
es_es: Aplicaciones y ejemplos

source: The bag of words representation is quite simplistic but surprisingly useful in practice.
es_es: La representación bolsa de palabras es bastante simplista pero sorprendentemente útil en la práctica.

source: In particular in a **supervised setting** it can be successfully combined with fast and scalable linear models to train **document classifiers**, for instance:
es_es: En particular en una **situación de clasificación supervisada** puede combinarse con éxito con modelos lineales rápidos y escalables para entrenar **clasificadores de documentos**, por ejemplo:

source: In an **unsupervised setting** it can be used to group similar documents together by applying clustering algorithms such as :ref:`k_means`:
es_es: En una **situación de clasificación no supervisada* se puede utilizar para agrupar documentos similares aplicando algoritmos de análisis de conglomerados como :ref:`k_means`:

source: Finally it is possible to discover the main topics of a corpus by relaxing the hard assignment constraint of clustering, for instance by using :ref:`NMF`:
es_es: Finalmente, es posible descubrir los temas principales de un corpus relajando la restricción de asignación estricta del análisis de conglomerados, por ejemplo, usando: :ref:`NMF`:

source: Limitations of the Bag of Words representation
es_es: Limitaciones de la representación Bolsa de palabras

source: A collection of unigrams (what bag of words is) cannot capture phrases and multi-word expressions, effectively disregarding any word order dependence. Additionally, the bag of words model doesn't account for potential misspellings or word derivations.
es_es: Una colección de unigramas (lo que es la bolsa de palabras) no puede capturar frases y expresiones de varias palabras, ignorando efectivamente cualquier dependencia del orden de las palabras. Además, el modelo de bolsa de palabras no tiene en cuenta posibles errores ortográficos ni las derivaciones de las palabras.

source: N-grams to the rescue! Instead of building a simple collection of unigrams (n=1), one might prefer a collection of bigrams (n=2), where occurrences of pairs of consecutive words are counted.
es_es: ¡N-gramas al rescate! En lugar de construir una simple colección de unigramas (n=1), se puede preferir una colección de bigramas (n=2), donde se cuentan las ocurrencias de pares de palabras consecutivas.

source: One might alternatively consider a collection of character n-grams, a representation resilient against misspellings and derivations.
es_es: Se puede considerar alternativamente una colección de n-gramas de caracteres, una representación resistente a errores ortográficos y derivaciones.

source: For example, let's say we're dealing with a corpus of two documents: ``['words', 'wprds']``. The second document contains a misspelling of the word 'words'. A simple bag of words representation would consider these two as very distinct documents, differing in both of the two possible features. A character 2-gram representation, however, would find the documents matching in 4 out of 8 features, which may help the preferred classifier decide better::
es_es: Por ejemplo, digamos que estamos tratando con un corpus de dos documentos: ``['words', 'wprds']``. El segundo documento contiene una falta de ortografía de la palabra 'words'. Una simple representación Bolsa de palabras consideraría estos dos como documentos muy distintos, que difieren en las dos características posibles. Una representación de bigramas de caracteres, sin embargo, encontraría los documentos que coincidan en 4 de las 8 características, lo que puede ayudar al clasificador preferido a decidir mejor::

source: In the above example, ``char_wb`` analyzer is used, which creates n-grams only from characters inside word boundaries (padded with space on each side). The ``char`` analyzer, alternatively, creates n-grams that span across words::
es_es: En el ejemplo anterior, se utiliza el analizador ``char_wb``, que crea n-gramas sólo a partir de caracteres dentro de los límites de las palabras (rellenados con espacio a cada lado). El analizador ``char```, alternativamente, crea n-gramas que se extienden a través de palabras::

source: The word boundaries-aware variant ``char_wb`` is especially interesting for languages that use white-spaces for word separation as it generates significantly less noisy features than the raw ``char`` variant in that case. For such languages it can increase both the predictive accuracy and convergence speed of classifiers trained using such features while retaining the robustness with regards to misspellings and word derivations.
es_es: La variante ``char_wb`` que conoce los límites de las palabras es especialmente interesante para los idiomas que usan espacios en blanco para la separación de palabras, ya que en ese caso genera características mucho menos ruidosas que la variante ``char`` en bruto. Para estos idiomas, puede aumentar tanto la precisión predictiva como la velocidad de convergencia de los clasificadores entrenados con estas características, al tiempo que mantiene la robustez con respecto a errores ortográficos y derivaciones de palabras.

source: While some local positioning information can be preserved by extracting n-grams instead of individual words, bag of words and bag of n-grams destroy most of the inner structure of the document and hence most of the meaning carried by that internal structure.
es_es: Mientras que la información de posicionamiento local se puede preservar extrayendo n-gramas en lugar de palabras individuales, la bolsa de palabras y la bolsa de n-gramas destruyen la mayor parte de la estructura interna del documento y, por tanto, la mayor parte del significado que conlleva esa estructura interna.
