Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/feature_extraction.po
Languages: es_es

source: Feature extraction
es_es: Extracción de características

source: The :mod:`sklearn.feature_extraction` module can be used to extract features in a format supported by machine learning algorithms from datasets consisting of formats such as text and image.
es_es: El módulo :mod:`sklearn.feature_extraction` puede utilizarse para extraer características en un formato soportado por algoritmos de aprendizaje automático a partir de conjuntos de datos que consisten en formatos como texto e imagen.

source: Feature extraction is very different from :ref:`feature_selection`: the former consists in transforming arbitrary data, such as text or images, into numerical features usable for machine learning. The latter is a machine learning technique applied on these features.
es_es: La extracción de características es muy diferente de la :ref:`feature_selection`: la primera consiste en transformar datos arbitrarios, como texto o imágenes, en características numéricas que se pueden utilizar para el aprendizaje automático. La segunda es una técnica de aprendizaje automático aplicada a estas características.

source: Loading features from dicts
es_es: Cargando características desde diccionarios

source: The class :class:`DictVectorizer` can be used to convert feature arrays represented as lists of standard Python ``dict`` objects to the NumPy/SciPy representation used by scikit-learn estimators.
es_es: La clase :class:`DictVectorizer` puede utilizarse para convertir arreglos de características representadas como listas de objetos estándar de Python ``dict`` a la representación NumPy/SciPy utilizada por los estimadores de scikit-learn.

source: While not particularly fast to process, Python's ``dict`` has the advantages of being convenient to use, being sparse (absent features need not be stored) and storing feature names in addition to values.
es_es: Si bien no es particularmente rápido de procesar, el ``dict`` de Python tiene las ventajas de ser cómodo de usar, ser escaso (las características ausentes no necesitan ser almacenadas) y almacenar los nombres de las características además de los valores.

source: :class:`DictVectorizer` implements what is called one-of-K or "one-hot" coding for categorical (aka nominal, discrete) features. Categorical features are "attribute-value" pairs where the value is restricted to a list of discrete of possibilities without ordering (e.g. topic identifiers, types of objects, tags, names...).
es_es: :class:`DictVectorizer` implementa lo que se denomina codificación "one-of-K" o "one-hot" para características categóricas (también conocidas como nominales, discretas). Las características categóricas son pares "atributo-valor" donde el valor está restringido a una lista de posibilidades discretas sin ordenar (p. ej. identificadores de temas, tipos de objetos, etiquetas, nombres...).

source: In the following, "city" is a categorical attribute while "temperature" is a traditional numerical feature::
es_es: En lo siguiente, "city" es un atributo categórico mientras que "temperature" es una característica numérica tradicional::

source: :class:`DictVectorizer` accepts multiple string values for one feature, like, e.g., multiple categories for a movie.
es_es: :class:`DictVectorizer` acepta múltiples valores de cadena para una característica, como, por ejemplo, múltiples categorías para una película.

source: Assume a database classifies each movie using some categories (not mandatories) and its year of release.
es_es: Suponte que una base de datos clasifica cada película usando algunas categorías (no obligatorias) y su año de estreno.

source: :class:`DictVectorizer` is also a useful representation transformation for training sequence classifiers in Natural Language Processing models that typically work by extracting feature windows around a particular word of interest.
es_es: :class:`DictVectorizer` también es una transformación de representación útil para el entrenamiento de clasificadores de secuencias en modelos de Procesamiento de Lenguaje Natural que normalmente trabajan extrayendo ventanas de características alrededor de una palabra de interés particular.

source: For example, suppose that we have a first algorithm that extracts Part of Speech (PoS) tags that we want to use as complementary tags for training a sequence classifier (e.g. a chunker). The following dict could be such a window of features extracted around the word 'sat' in the sentence 'The cat sat on the mat.'::
es_es: Por ejemplo, supongamos que tenemos un primer algoritmo que extrae las etiquetas Part of Speech (PoS) que queremos usar como etiquetas complementarias para entrenar un clasificador de secuencias (p. ej. un chunker). El siguiente diccionario podría ser una ventana de características extraídas alrededor de la palabra "sat" en la frase 'The cat sat on the mat.'::

source: This description can be vectorized into a sparse two-dimensional matrix suitable for feeding into a classifier (maybe after being piped into a :class:`~text.TfidfTransformer` for normalization)::
es_es: Esta descripción puede ser vectorizada en una matriz bidimensional dispersa adecuada para alimentar a un clasificador (tal vez después de ser canalizada en un :class:`~text.TfidfTransformer` para su normalización)::

source: As you can imagine, if one extracts such a context around each individual word of a corpus of documents the resulting matrix will be very wide (many one-hot-features) with most of them being valued to zero most of the time. So as to make the resulting data structure able to fit in memory the ``DictVectorizer`` class uses a ``scipy.sparse`` matrix by default instead of a ``numpy.ndarray``.
es_es: Como puedes imaginar, si se extrae un contexto de este tipo alrededor de cada palabra individual de un corpus de documentos, la matriz resultante será muy amplia (muchas características one-hot) y la mayoría de ellas con valor cero la mayor parte del tiempo. Para que la estructura de datos resultante pueda encajar en la memoria, la clase ``DictVectorizer`` utiliza por defecto una matriz ``scipy. parse`` en lugar de una ``numpy.ndarray``.

source: Feature hashing
es_es: Hashing de características

source: The class :class:`FeatureHasher` is a high-speed, low-memory vectorizer that uses a technique known as `feature hashing <https://en.wikipedia.org/wiki/Feature_hashing>`_, or the "hashing trick". Instead of building a hash table of the features encountered in training, as the vectorizers do, instances of :class:`FeatureHasher` apply a hash function to the features to determine their column index in sample matrices directly. The result is increased speed and reduced memory usage, at the expense of inspectability; the hasher does not remember what the input features looked like and has no ``inverse_transform`` method.
es_es: La clase :class:`FeatureHasher` es un vectorizador de alta velocidad y baja memoria que utiliza una técnica conocida como `hashing de características <https://en.wikipedia.org/wiki/Feature_hashing>`_, o el "truco de hashing. En lugar de construir una tabla hash de las características encontradas en el entrenamiento, como hacen los vectorizadores, las instancias de :class:`FeatureHasher` aplican una función hash a las características para determinar su índice de columna en las matrices de muestra directamente. El resultado es una mayor velocidad y un menor uso de la memoria, a expensas de la inspeccionabilidad; el hasher no recuerda el aspecto de las características de entrada y no tiene un método ``inverse_transform``.

source: Since the hash function might cause collisions between (unrelated) features, a signed hash function is used and the sign of the hash value determines the sign of the value stored in the output matrix for a feature. This way, collisions are likely to cancel out rather than accumulate error, and the expected mean of any output feature's value is zero. This mechanism is enabled by default with ``alternate_sign=True`` and is particularly useful for small hash table sizes (``n_features < 10000``). For large hash table sizes, it can be disabled, to allow the output to be passed to estimators like :class:`~sklearn.naive_bayes.MultinomialNB` or :class:`~sklearn.feature_selection.chi2` feature selectors that expect non-negative inputs.
es_es: Dado que la función hash puede causar colisiones entre características (no relacionadas), se utiliza una función hash con signo y el signo del valor hash determina el signo del valor almacenado en la matriz de salida para una característica. De esta manera, es probable que las colisiones se cancelen en lugar de acumular errores, y que la media esperada del valor de cualquier característica de salida es cero. Este mecanismo está activado por defecto con ``alternate_sign=True`` y es particularmente útil para tamaños de tabla hash pequeños (``n_features < 10000``). Para tamaños de tabla hash grandes, se puede desactivar, para permitir que la salida se pase a estimadores como :class:`~sklearn.naive_bayes.MultinomialNB` o :class:`~sklearn.feature_selection.chi2` selectores de características que esperan entradas no negativas.

source: :class:`FeatureHasher` accepts either mappings (like Python's ``dict`` and its variants in the ``collections`` module), ``(feature, value)`` pairs, or strings, depending on the constructor parameter ``input_type``. Mapping are treated as lists of ``(feature, value)`` pairs, while single strings have an implicit value of 1, so ``['feat1', 'feat2', 'feat3']`` is interpreted as ``[('feat1', 1), ('feat2', 1), ('feat3', 1)]``. If a single feature occurs multiple times in a sample, the associated values will be summed (so ``('feat', 2)`` and ``('feat', 3.5)`` become ``('feat', 5.5)``). The output from :class:`FeatureHasher` is always a ``scipy.sparse`` matrix in the CSR format.
es_es: :class:`FeatureHasher` acepta cualquier mapeo (como el ``dict`` de Python y sus variantes en el módulo ``collections``), pares ``(feature, value)``, o cadenas, dependiendo del parámetro constructor ``input_type``. El mapeo se trata como listas de pares ``(feature, value)``, mientras que las cadenas simples tienen un valor implícito de 1, por lo que ``['feat1', 'feat2', 'feat3']`` se interpreta como ``[('feat1', 1), ('feat2', 1), ('feat3', 1)]``. Si una misma característica aparece varias veces en una muestra, los valores asociados serán sumados (así ``('feat', 2)`` y ``('feat', 3.5 )`` se convierten en ``('feat', 5.5)``). La salida de :class:`FeatureHasher` es siempre una matriz ``scipy.sparse`` en el formato CSR.

source: Feature hashing can be employed in document classification, but unlike :class:`~text.CountVectorizer`, :class:`FeatureHasher` does not do word splitting or any other preprocessing except Unicode-to-UTF-8 encoding; see :ref:`hashing_vectorizer`, below, for a combined tokenizer/hasher.
es_es: El hashing de características puede emplearse en la clasificación de documentos, pero a diferencia de :class:`~text.CountVectorizer`, :class:`FeatureHasher` no hace la división de palabras ni ningún otro preprocesamiento excepto la codificación Unicode-to-UTF-8; ver :ref:`hashing_vectorizer`, más abajo, para un tokenizador/hasher combinado.

source: As an example, consider a word-level natural language processing task that needs features extracted from ``(token, part_of_speech)`` pairs. One could use a Python generator function to extract features::
es_es: Como ejemplo, considera una tarea de procesamiento de lenguaje natural a nivel de palabras que necesite características extraídas de pares ``(token, part_of_speech )``. Se podría utilizar una función generadora de Python para extraer características::

source: Then, the ``raw_X`` to be fed to ``FeatureHasher.transform`` can be constructed using::
es_es: Entonces, el ``raw_X`` para ser suministrado a ``FeatureHasher.transform`` puede ser construido usando::

source: and fed to a hasher with::
es_es: y suministrado a un hasher con::

source: to get a ``scipy.sparse`` matrix ``X``.
es_es: para obtener una matriz ``scipy.sparse`` ``X``.

source: Note the use of a generator comprehension, which introduces laziness into the feature extraction: tokens are only processed on demand from the hasher.
es_es: Nota que el uso de una comprensión generadora, introduce la holgura en la extracción de características: los tokens sólo se procesan bajo demanda del hasher.

source: Implementation details
es_es: Detalles de implementación

source: :class:`FeatureHasher` uses the signed 32-bit variant of MurmurHash3. As a result (and because of limitations in ``scipy.sparse``), the maximum number of features supported is currently :math:`2^{31} - 1`.
es_es: :class:`FeatureHasher` utiliza la variante de 32 bits con signo de MurmurHash3. Como resultado (y debido a las limitaciones en ``scipy. parse``), el número máximo de características soportadas es actualmente :math:`2^{31} - 1`.

source: The original formulation of the hashing trick by Weinberger et al. used two separate hash functions :math:`h` and :math:`\xi` to determine the column index and sign of a feature, respectively. The present implementation works under the assumption that the sign bit of MurmurHash3 is independent of its other bits.
es_es: La formulación original del truco de hashing de Weinberger et al. usó dos funciones hash separadas :math:`h` y :math:`\xi` para determinar el índice de columna y el signo de una característica, respectivamente. La implementación actual funciona bajo el supuesto de que el bit de signo de MurmurHash3 es independiente de sus otros bits.

source: Since a simple modulo is used to transform the hash function to a column index, it is advisable to use a power of two as the ``n_features`` parameter; otherwise the features will not be mapped evenly to the columns.
es_es: Dado que se utiliza un modulo simple para transformar la función hash en un índice de columnas, es recomendable utilizar una potencia de dos como el parámetro ``n_features``; de lo contrario, las características no serán asignadas uniformemente a las columnas.

source: Text feature extraction
es_es: Extracción de característica de texto

source: The Bag of Words representation
es_es: La representación Bolsa de Palabras

source: Text Analysis is a major application field for machine learning algorithms. However the raw data, a sequence of symbols cannot be fed directly to the algorithms themselves as most of them expect numerical feature vectors with a fixed size rather than the raw text documents with variable length.
es_es: El análisis de textos es uno de los principales campos de aplicación de los algoritmos de aprendizaje automático. Sin embargo, los datos en bruto, una secuencia de símbolos no puede ser suministrada directamente a los propios algoritmos, ya que la mayoría de ellos esperan vectores de características numéricas con un tamaño fijo en lugar de los documentos de texto sin formato con longitud variable.

source: In order to address this, scikit-learn provides utilities for the most common ways to extract numerical features from text content, namely:
es_es: Para abordar esto, scikit-learn proporciona utilidades para las formas más comunes de extraer características numéricas del contenido del texto, a saber:

source: **tokenizing** strings and giving an integer id for each possible token, for instance by using white-spaces and punctuation as token separators.
es_es: **tokenizar** las cadenas y dar un identificador entero para cada token posible, por ejemplo, usando espacios en blanco y signos de puntuación como separadores de token.

source: **counting** the occurrences of tokens in each document.
es_es: **conteo** de las ocurrencias de tokens en cada documento.

source: **normalizing** and weighting with diminishing importance tokens that occur in the majority of samples / documents.
es_es: **normalizar** y ponderar con importancia decreciente los tokens que aparecen en la mayoría de las muestras / documentos.

source: In this scheme, features and samples are defined as follows:
es_es: En este esquema, las características y muestras se definen de la siguiente manera:

source: each **individual token occurrence frequency** (normalized or not) is treated as a **feature**.
es_es: cada ** frecuencia de ocurrencia de token individual ** (normalizada o no) se trata como una ** característica **.

source: the vector of all the token frequencies for a given **document** is considered a multivariate **sample**.
es_es: el vector de todas las frecuencias de tokens para un **documento** dado se considera una **muestra** multivariante.

source: A corpus of documents can thus be represented by a matrix with one row per document and one column per token (e.g. word) occurring in the corpus.
es_es: Por lo tanto, un corpus de documentos puede representarse mediante una matriz con una fila por documento y una columna por token (p. ej. palabra) que aparezca en el corpus.

source: We call **vectorization** the general process of turning a collection of text documents into numerical feature vectors. This specific strategy (tokenization, counting and normalization) is called the **Bag of Words** or "Bag of n-grams" representation. Documents are described by word occurrences while completely ignoring the relative position information of the words in the document.
es_es: Llamamos **vectorización** al proceso general de convertir una colección de documentos de texto en vectores de características numéricas. Esta estrategia específica (tokenization, conteo y normalización) se denomina representación **Bolsa de palabras** o "Bolsa de n-gramas". Los documentos se describen por las ocurrencias de las palabras, ignorando por completo la información sobre la posición relativa de las palabras en el documento.

source: Sparsity
es_es: Dispersión

source: As most documents will typically use a very small subset of the words used in the corpus, the resulting matrix will have many feature values that are zeros (typically more than 99% of them).
es_es: Como la mayoría de los documentos suelen utilizar un subconjunto muy pequeño de las palabras utilizadas en el corpus, la matriz resultante tendrá muchos valores de características que son ceros (normalmente más del 99% de ellos).

source: For instance a collection of 10,000 short text documents (such as emails) will use a vocabulary with a size in the order of 100,000 unique words in total while each document will use 100 to 1000 unique words individually.
es_es: Por ejemplo, una colección de 10.000 documentos de texto cortos (como correos electrónicos) utilizará un vocabulario con un tamaño del orden de 100.000 palabras únicas en total, mientras que cada documento utilizará entre 100 y 1000 palabras únicas individualmente.

source: In order to be able to store such a matrix in memory but also to speed up algebraic operations matrix / vector, implementations will typically use a sparse representation such as the implementations available in the ``scipy.sparse`` package.
es_es: Para poder almacenar una matriz de este tipo en la memoria, pero también para acelerar las operaciones algebraicas matriz / vector, las implementaciones suelen utilizar una representación dispersa, como las implementaciones disponibles en el paquete ``scipy.sparse``.

source: Common Vectorizer usage
es_es: Uso común del Vectorizador

source: :class:`CountVectorizer` implements both tokenization and occurrence counting in a single class::
es_es: :class:`CountVectorizer` implementa tanto la tokenización como el conteo de ocurrencias en una sola clase::

source: This model has many parameters, however the default values are quite reasonable (please see the :ref:`reference documentation <text_feature_extraction_ref>` for the details)::
es_es: Este modelo tiene muchos parámetros, sin embargo los valores por defecto son bastante razonables (por favor consulta la :ref:`documentación de referencia <text_feature_extraction_ref>` para los detalles)::

source: Let's use it to tokenize and count the word occurrences of a minimalistic corpus of text documents::
es_es: Vamos a utilizarlo para tokenizar y contar las ocurrencias de palabras de un corpus minimalista de documentos de texto::

source: The default configuration tokenizes the string by extracting words of at least 2 letters. The specific function that does this step can be requested explicitly::
es_es: La configuración por defecto tokeniza la cadena extrayendo palabras de al menos 2 letras. La función específica que realiza este paso puede solicitarse explícitamente::

source: Each term found by the analyzer during the fit is assigned a unique integer index corresponding to a column in the resulting matrix. This interpretation of the columns can be retrieved as follows::
es_es: A cada término encontrado por el analizador durante el ajuste se le asigna un índice entero único correspondiente a una columna en la matriz resultante. Esta interpretación de las columnas se puede recuperar de la siguiente manera::

source: The converse mapping from feature name to column index is stored in the ``vocabulary_`` attribute of the vectorizer::
es_es: El mapeo de conversión del nombre de característica al índice de columna se almacena en el atributo ``vocabulary_`` del vectorizador::

source: Hence words that were not seen in the training corpus will be completely ignored in future calls to the transform method::
es_es: Por lo tanto, las palabras que no se hayan visto en el corpus de entrenamiento se ignorarán por completo en futuras llamadas al método de transformación::

source: Note that in the previous corpus, the first and the last documents have exactly the same words hence are encoded in equal vectors. In particular we lose the information that the last document is an interrogative form. To preserve some of the local ordering information we can extract 2-grams of words in addition to the 1-grams (individual words)::
es_es: Tenga en cuenta que en el corpus anterior, el primer y el último documento tienen exactamente las mismas palabras, por lo tanto, están codificados en vectores iguales. En particular, perdemos la información de que el último documento es una forma interrogativa. Para preservar parte de la información de pedido local, podemos extraer bigramas de palabras además de unigramas (palabras individuales)::

source: The vocabulary extracted by this vectorizer is hence much bigger and can now resolve ambiguities encoded in local positioning patterns::
es_es: El vocabulario extraído por este vectorizador es, por lo tanto, mucho más grande y ahora puede resolver las ambigüedades codificadas en patrones de posicionamiento local::

source: In particular the interrogative form "Is this" is only present in the last document::
es_es: En particular, la forma interrogativa "Is this" sólo está presente en el último documento::

source: Using stop words
es_es: Usando palabras funcionales (stop words)

source: Stop words are words like "and", "the", "him", which are presumed to be uninformative in representing the content of a text, and which may be removed to avoid them being construed as signal for prediction. Sometimes, however, similar words are useful for prediction, such as in classifying writing style or personality.
es_es: Las palabras funcionales son palabras como "y", "el", "él", que se suponen poco informativas para representar el contenido de un texto, y que pueden eliminarse para evitar que sean interpretadas como señal para la predicción. Sin embargo, a veces palabras similares son útiles para la predicción, como en la clasificación del estilo de escritura o la personalidad.
