Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/gaussian_process.po
Languages: es_es

source: The :class:`Matern` kernel is a stationary kernel and a generalization of the :class:`RBF` kernel. It has an additional parameter :math:`\nu` which controls the smoothness of the resulting function. It is parameterized by a length-scale parameter :math:`l>0`, which can either be a scalar (isotropic variant of the kernel) or a vector with the same number of dimensions as the inputs :math:`x` (anisotropic variant of the kernel). The kernel is given by:
es_es: El núcleo :class:`Matern` es un núcleo estacionario y una generalización del núcleo :class:`RBF`. Tiene un parámetro adicional :math:`\nu` que controla la suavidad de la función resultante. Está parametrizado por un parámetro de escala de longitud :math:`l>0`, que puede ser un escalar (variante isotrópica del núcleo) o un vector con el mismo número de dimensiones que las entradas :math:`x` (variante anisotrópica del núcleo). El núcleo viene dado por:

source: where :math:`d(\cdot,\cdot)` is the Euclidean distance, :math:`K_\nu(\cdot)` is a modified Bessel function and :math:`\Gamma(\cdot)` is the gamma function. As :math:`\nu\rightarrow\infty`, the Matérn kernel converges to the RBF kernel. When :math:`\nu = 1/2`, the Matérn kernel becomes identical to the absolute exponential kernel, i.e.,
es_es: donde :math:`d(\cdot,\cdot)` es la distancia euclidiana, :math:`K_\nu(\cdot)` es una función de Bessel modificada y :math:`\Gamma(\cdot)` es la función gamma. Como :math:`\nu\rightarrow\infty`, el núcleo Matérn converge al núcleo RBF. Cuando :math:`\nu = 1/2`, el núcleo de Matérn se vuelve idéntico al núcleo exponencial absoluto, es decir

source: In particular, :math:`\nu = 3/2`:
es_es: En particular, :math:`\nu = 3/2`:

source: are popular choices for learning functions that are not infinitely differentiable (as assumed by the RBF kernel) but at least once (:math:`\nu = 3/2`) or twice differentiable (:math:`\nu = 5/2`).
es_es: son opciones populares para funciones de aprendizaje que no son infinitamente diferenciables (como asume el núcleo RBF), pero al menos una vez (:math:`\nu = 3/2`) o dos veces diferenciables (:math:`\nu = 5/2`).

source: The flexibility of controlling the smoothness of the learned function via :math:`\nu` allows adapting to the properties of the true underlying functional relation. The prior and posterior of a GP resulting from a Matérn kernel are shown in the following figure:
es_es: La flexibilidad de controlar la suavidad de la función aprendida a través de :math:`\nu` permite adaptarse a las propiedades de la verdadera relación funcional subyacente. En la siguiente figura se muestran los valores a priori y a posteriori de una GP resultante de un núcleo de Matérn:

source: See [RW2006]_, pp84 for further details regarding the different variants of the Matérn kernel.
es_es: Ver [RW2006]_, pp84 para más detalles sobre las diferentes variantes del núcleo de Matérn.

source: Rational quadratic kernel
es_es: Núcleo cuadrático racional

source: The :class:`RationalQuadratic` kernel can be seen as a scale mixture (an infinite sum) of :class:`RBF` kernels with different characteristic length-scales. It is parameterized by a length-scale parameter :math:`l>0` and a scale mixture parameter :math:`\alpha>0` Only the isotropic variant where :math:`l` is a scalar is supported at the moment. The kernel is given by:
es_es: El núcleo :class:`RationalQuadratic` puede verse como una mezcla de escalas (una suma infinita) de núcleos :class:`RBF` con diferentes escalas de longitud características. Está parametrizado por un parámetro de escala de longitud :math:`l>0` y un parámetro de mezcla de escalas :math:`alpha>0` Por el momento sólo se admite la variante isotrópica en la que :math:`l` es un escalar. El núcleo viene dado por:

source: The prior and posterior of a GP resulting from a :class:`RationalQuadratic` kernel are shown in the following figure:
es_es: En la siguiente figura se muestran los valores a priori y a posteriori de una GP resultante de un núcleo :class:`RationalQuadratic`:

source: Exp-Sine-Squared kernel
es_es: Núcleo exponencial sinusoidal cuadrático

source: The :class:`ExpSineSquared` kernel allows modeling periodic functions. It is parameterized by a length-scale parameter :math:`l>0` and a periodicity parameter :math:`p>0`. Only the isotropic variant where :math:`l` is a scalar is supported at the moment. The kernel is given by:
es_es: El núcleo :class:`ExpSineSquared` permite modelar funciones periódicas. Está parametrizado por un parámetro de escala de longitud :math:`l>0` y un parámetro de periodicidad :math:`p>0`. Sólo la variante isotrópica donde :math:`l` es un escalar es soportada por el momento. El núcleo viene dado por:

source: The prior and posterior of a GP resulting from an ExpSineSquared kernel are shown in the following figure:
es_es: Los valores a priori y a posteriori de una GP resultante de un núcleo ExpSineSquared se muestran en la siguiente figura:

source: Dot-Product kernel
es_es: Núcleo de producto punto

source: The :class:`DotProduct` kernel is non-stationary and can be obtained from linear regression by putting :math:`N(0, 1)` priors on the coefficients of :math:`x_d (d = 1, . . . , D)` and a prior of :math:`N(0, \sigma_0^2)` on the bias. The :class:`DotProduct` kernel is invariant to a rotation of the coordinates about the origin, but not translations. It is parameterized by a parameter :math:`\sigma_0^2`. For :math:`\sigma_0^2 = 0`, the kernel is called the homogeneous linear kernel, otherwise it is inhomogeneous. The kernel is given by
es_es: El núcleo :class:`DotProduct` no es estacionario y puede obtenerse a partir de la regresión lineal poniendo los a priori (priors) de :math:`N(0, 1)` en los coeficientes de :math:`x_d (d = 1, . . , D)` y un a priori de :math:`N(0, \sigma_0^2)` en el sesgo. El núcleo :class:`DotProduct` es invariante a una rotación de las coordenadas sobre el origen, pero no a las traslaciones. Está parametrizado por un parámetro :math:`\sigma_0^2`. Para :math:`\sigma_0^2 = 0`, el núcleo se denomina núcleo lineal homogéneo, en caso contrario es no homogéneo. El núcleo viene dado por

source: The :class:`DotProduct` kernel is commonly combined with exponentiation. An example with exponent 2 is shown in the following figure:
es_es: El núcleo :class:`DotProduct` se combina habitualmente con la exponenciación. Un ejemplo con exponente 2 se muestra en la siguiente figura:

source: References
es_es: Referencias

source: Carl Eduard Rasmussen and Christopher K.I. Williams, "Gaussian Processes for Machine Learning", MIT Press 2006, Link to an official complete PDF version of the book `here <http://www.gaussianprocess.org/gpml/chapters/RW.pdf>`_ .
es_es: Carl Eduard Rasmussen y Christopher K.I. Williams, "Gaussian Processes for Machine Learning", MIT Press 2006, Vínculo al PDF completo y versión oficial del libro `aquí <http://www.gaussianprocess.org/gpml/chapters/RW.pdf>`_ .
