Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/gaussian_process.po
Languages: es_es

source: The GP prior mean is assumed to be zero. The prior's covariance is specified by passing a :ref:`kernel <gp_kernels>` object. The hyperparameters of the kernel are optimized during fitting of GaussianProcessRegressor by maximizing the log-marginal-likelihood (LML) based on the passed ``optimizer``. As the LML may have multiple local optima, the optimizer can be started repeatedly by specifying ``n_restarts_optimizer``. The first run is always conducted starting from the initial hyperparameter values of the kernel; subsequent runs are conducted from hyperparameter values that have been chosen randomly from the range of allowed values. If the initial hyperparameters should be kept fixed, `None` can be passed as optimizer.
es_es: Se asume que la media de la prioridad GP es cero. La covarianza de la prioridad se especifica pasando un objeto :ref:`kernel <gp_kernels>`. Los hiperparámetros del kernel se optimizan durante el ajuste de GaussianProcessRegressor maximizando la verosimilitud marginal logarítmica (LML) basado en el ``optimizer`` que se le pasa. Como el LML puede tener múltiples óptimos locales, el optimizador puede iniciarse repetidamente especificando ``n_restarts_optimizer``. La primera ejecución se realiza siempre a partir de los valores iniciales de los hiperparámetros del núcleo; las ejecuciones posteriores se realizan a partir de los valores de los hiperparámetros que se han elegido aleatoriamente del rango de valores permitidos. Si los hiperparámetros iniciales deben mantenerse fijos, se puede pasar `None` como optimizador.

source: :class:`GaussianProcessClassifier` supports multi-class classification by performing either one-versus-rest or one-versus-one based training and prediction. In one-versus-rest, one binary Gaussian process classifier is fitted for each class, which is trained to separate this class from the rest. In "one_vs_one", one binary Gaussian process classifier is fitted for each pair of classes, which is trained to separate these two classes. The predictions of these binary predictors are combined into multi-class predictions. See the section on :ref:`multi-class classification <multiclass>` for more details.
es_es: :class:`GaussianProcessClassifier` admite la clasificación multiclase mediante el entrenamiento y la predicción basados en uno-contra-el-resto o uno-contra-uno. En uno-contra-resto, se ajusta un clasificador de proceso gaussiano binario para cada clase, que se entrena para separar esta clase del resto. En "one_vs_one", se ajusta un clasificador de proceso gaussiano binario para cada par de clases, que se entrena para separar estas dos clases. Las predicciones de estos predictores binarios se combinan en predicciones multiclase. Consulte la sección de :ref:`clasificación multiclase <multiclass>` para obtener más detalles.

source: In the case of Gaussian process classification, "one_vs_one" might be computationally cheaper since it has to solve many problems involving only a subset of the whole training set rather than fewer problems on the whole dataset. Since Gaussian process classification scales cubically with the size of the dataset, this might be considerably faster. However, note that "one_vs_one" does not support predicting probability estimates but only plain predictions. Moreover, note that :class:`GaussianProcessClassifier` does not (yet) implement a true multi-class Laplace approximation internally, but as discussed above is based on solving several binary classification tasks internally, which are combined using one-versus-rest or one-versus-one.
es_es: En el caso de la clasificación del proceso gaussiano, "one_vs_one" podría ser computacionalmente más económico, ya que tiene que resolver muchos problemas que implican sólo un subconjunto del conjunto de entrenamiento, en lugar de menos problemas en todo el conjunto de datos. Dado que la clasificación del proceso gaussiano se escala cúbicamente con el tamaño del conjunto de datos, esto podría ser considerablemente más rápido. Sin embargo, ten en cuenta que "one_vs_one" no admite la predicción de estimaciones de probabilidad, sino sólo predicciones directas. Además, ten en cuenta que :class:`GaussianProcessClassifier` no implementa (todavía) una verdadera aproximación de Laplace multiclase internamente, sino que, como se ha comentado anteriormente, se basa en la resolución de varias tareas de clasificación binaria internamente, que se combinan utilizando uno-versus-el-resto o uno-versus-uno.

source: GPC examples
es_es: Ejemplos de GPC

source: Probabilistic predictions with GPC
es_es: Predicciones probabilísticas con GPC

source: This example illustrates the predicted probability of GPC for an RBF kernel with different choices of the hyperparameters. The first figure shows the predicted probability of GPC with arbitrarily chosen hyperparameters and with the hyperparameters corresponding to the maximum log-marginal-likelihood (LML).
es_es: Este ejemplo ilustra la probabilidad pronosticada de GPC para un núcleo RBF con diferentes elecciones de los hiperparámetros. La primera figura muestra la probabilidad predicha de GPC con hiperparámetros elegidos arbitrariamente y con los hiperparámetros correspondientes a la máxima verosimilitud marginal logarítmica (LML).

source: While the hyperparameters chosen by optimizing LML have a considerably larger LML, they perform slightly worse according to the log-loss on test data. The figure shows that this is because they exhibit a steep change of the class probabilities at the class boundaries (which is good) but have predicted probabilities close to 0.5 far away from the class boundaries (which is bad) This undesirable effect is caused by the Laplace approximation used internally by GPC.
es_es: Aunque los hiperparámetros elegidos mediante la optimización de LML tienen un LML considerablemente mayor, su rendimiento es ligeramente inferior de acuerdo con la pérdida logarítmica en los datos de prueba. La figura muestra que esto se debe a que exhiben un cambio pronunciado de las probabilidades de clase en los límites de la clase (lo cual es bueno) pero tienen probabilidades predichas cercanas a 0,5 lejos de los límites de la clase (lo cual es malo) Este efecto indeseable es causado por la aproximación de Laplace utilizada internamente por GPC.

source: The second figure shows the log-marginal-likelihood for different choices of the kernel's hyperparameters, highlighting the two choices of the hyperparameters used in the first figure by black dots.
es_es: La segunda figura muestra la verosimilitud marginal logarítmica para diferentes opciones de los hiperparámetros del núcleo, destacando las dos opciones de los hiperparámetros utilizados en la primera figura mediante puntos negros.

source: Illustration of GPC on the XOR dataset
es_es: Ejemplo de GPC en el conjunto de datos XOR

source: This example illustrates GPC on XOR data. Compared are a stationary, isotropic kernel (:class:`RBF`) and a non-stationary kernel (:class:`DotProduct`). On this particular dataset, the :class:`DotProduct` kernel obtains considerably better results because the class-boundaries are linear and coincide with the coordinate axes. In practice, however, stationary kernels such as :class:`RBF` often obtain better results.
es_es: Este ejemplo ilustra la GPC en datos XOR. Se comparan un núcleo estacionario e isotrópico (:class:`RBF`) y un núcleo no estacionario (:class:`DotProduct`). En este conjunto de datos concreto, el núcleo :class:`DotProduct` obtiene resultados considerablemente mejores porque los límites de la clase son lineales y coinciden con los ejes de coordenadas. En la práctica, sin embargo, los núcleos estacionarios como :class:`RBF` suelen obtener mejores resultados.

source: Gaussian process classification (GPC) on iris dataset
es_es: Clasificación de procesos gaussianos (GPC) en el conjunto de datos iris

source: This example illustrates the predicted probability of GPC for an isotropic and anisotropic RBF kernel on a two-dimensional version for the iris-dataset. This illustrates the applicability of GPC to non-binary classification. The anisotropic RBF kernel obtains slightly higher log-marginal-likelihood by assigning different length-scales to the two feature dimensions.
es_es: Este ejemplo muestra la probabilidad predicha de GPC para un núcleo RBF isotrópico y anisotrópico en una versión bidimensional para el conjunto de datos del iris. Esto muestra la aplicabilidad de la GPC a la clasificación no binaria. El núcleo RBF anisotrópico obtiene una verosimilitud marginal logarítmica (log-marginal-likelihood) ligeramente superior al asignar diferentes escalas de longitud a las dos dimensiones de características.

source: Kernels for Gaussian Processes
es_es: Núcleos para procesos gaussianos

source: Kernels (also called "covariance functions" in the context of GPs) are a crucial ingredient of GPs which determine the shape of prior and posterior of the GP. They encode the assumptions on the function being learned by defining the "similarity" of two datapoints combined with the assumption that similar datapoints should have similar target values. Two categories of kernels can be distinguished: stationary kernels depend only on the distance of two datapoints and not on their absolute values :math:`k(x_i, x_j)= k(d(x_i, x_j))` and are thus invariant to translations in the input space, while non-stationary kernels depend also on the specific values of the datapoints. Stationary kernels can further be subdivided into isotropic and anisotropic kernels, where isotropic kernels are also invariant to rotations in the input space. For more details, we refer to Chapter 4 of [RW2006]_. For guidance on how to best combine different kernels, we refer to [Duv2014]_.
es_es: Los núcleos (también llamados "funciones de covarianza" en el contexto de las GP) son un ingrediente crucial de las GP que determinan la forma de la probabilidad a priori (prior) y a posteriori (posterior) de la GP. Codifican las suposiciones sobre la función que se aprende definiendo la "similitud" de dos puntos de datos combinada con la suposición de que los puntos de datos similares deberían tener valores objetivo similares. Se pueden distinguir dos categorías de núcleos: los núcleos estacionarios dependen sólo de la distancia de dos puntos de datos y no de sus valores absolutos :math:`k(x_i, x_j)= k(d(x_i, x_j))` y, por tanto, son invariables a las traslaciones en el espacio de entrada, mientras que los núcleos no estacionarios dependen también de los valores específicos de los puntos de datos. Los núcleos estacionarios pueden subdividirse en núcleos isotrópicos y anisotrópicos, donde los núcleos isotrópicos también son invariantes a las rotaciones en el espacio de entrada. Para más detalles, nos remitimos al capítulo 4 de [RW2006]_. Para obtener orientación sobre la mejor manera de combinar diferentes núcleos, nos remitimos a [Duv2014]_.

source: Gaussian Process Kernel API
es_es: API del núcleo de proceso gaussiano

source: The main usage of a :class:`Kernel` is to compute the GP's covariance between datapoints. For this, the method ``__call__`` of the kernel can be called. This method can either be used to compute the "auto-covariance" of all pairs of datapoints in a 2d array X, or the "cross-covariance" of all combinations of datapoints of a 2d array X with datapoints in a 2d array Y. The following identity holds true for all kernels k (except for the :class:`WhiteKernel`): ``k(X) == K(X, Y=X)``
es_es: El uso principal de un :class:`Kernel` es calcular la covarianza de la GP entre puntos de datos. Para ello, se puede llamar al método ``__call__`` del núcleo. Este método puede utilizarse para calcular la "autocovarianza" de todos los pares de puntos de datos de un arreglo 2D X, o la "covarianza cruzada" de todas las combinaciones de puntos de datos de un arreglo 2D X con puntos de datos de una matriz 2D Y. La siguiente identidad es válida para todos los núcleos k (excepto para el :class:`WhiteKernel`): ``k(X) == K(X, Y=X)``

source: If only the diagonal of the auto-covariance is being used, the method ``diag()`` of a kernel can be called, which is more computationally efficient than the equivalent call to ``__call__``: ``np.diag(k(X, X)) == k.diag(X)``
es_es: Si sólo se utiliza la diagonal de la autocovarianza, se puede llamar al método ``diag()`` de un núcleo, que es más eficiente computacionalmente que la llamada equivalente a ``__call__``: ``np.diag(k(X, X)) == k.diag(X)``

source: Kernels are parameterized by a vector :math:`\theta` of hyperparameters. These hyperparameters can for instance control length-scales or periodicity of a kernel (see below). All kernels support computing analytic gradients of the kernel's auto-covariance with respect to :math:`log(\theta)` via setting ``eval_gradient=True`` in the ``__call__`` method. That is, a ``(len(X), len(X), len(theta))`` array is returned where the entry ``[i, j, l]`` contains :math:`\frac{\partial k_\theta(x_i, x_j)}{\partial log(\theta_l)}`. This gradient is used by the Gaussian process (both regressor and classifier) in computing the gradient of the log-marginal-likelihood, which in turn is used to determine the value of :math:`\theta`, which maximizes the log-marginal-likelihood, via gradient ascent. For each hyperparameter, the initial value and the bounds need to be specified when creating an instance of the kernel. The current value of :math:`\theta` can be get and set via the property ``theta`` of the kernel object. Moreover, the bounds of the hyperparameters can be accessed by the property ``bounds`` of the kernel. Note that both properties (theta and bounds) return log-transformed values of the internally used values since those are typically more amenable to gradient-based optimization. The specification of each hyperparameter is stored in the form of an instance of :class:`Hyperparameter` in the respective kernel. Note that a kernel using a hyperparameter with name "x" must have the attributes self.x and self.x_bounds.
es_es: Los núcleos están parametrizados por un vector :math:`\theta` de hiperparámetros. Estos hiperparámetros pueden, por ejemplo, controlar las escalas de longitud o la periodicidad de un núcleo (véase más adelante). Todos los núcleos soportan el cálculo de gradientes analíticos de la autocovarianza del núcleo con respecto a :math:`log(\theta)` mediante la configuración de ``eval_gradient=True`` en el método ``__call__``. Es decir, se devuelve una matriz ``(len(X), len(X), len(theta))`` donde la entrada ``[i, j, l]`` contiene :math:`\frac{parcial k_\theta(x_i, x_j)}{\parcial log(\theta_l)}`. Este gradiente es utilizado por el proceso gaussiano (tanto el regresor como el clasificador) en el cálculo del gradiente de la verosimilitud marginal logarítmica (log-marginal-likelihood), que a su vez se utiliza para determinar el valor de :math:`\theta`, que maximiza el logaritmo de probabilidad marginal, a través del ascenso del gradiente. Para cada hiperparámetro, es necesario especificar el valor inicial y los límites al crear una instancia del núcleo. El valor actual de :math:`\theta` puede obtenerse y establecerse mediante la propiedad ``theta`` del objeto Kernel. Además, se puede acceder a los límites de los hiperparámetros mediante la propiedad ``bounds`` del núcleo. Observa que ambas propiedades (theta y bounds) devuelven valores transformados logarítmicamente de los valores utilizados internamente, ya que suelen ser más susceptibles de una optimización basada en el gradiente. La especificación de cada hiperparámetro se almacena en forma de una instancia de :class:`Hyperparameter` en el núcleo respectivo. Ten en cuenta que un núcleo que utiliza un hiperparámetro con nombre "x" debe tener los atributos self.x y self.x_bounds.

source: The abstract base class for all kernels is :class:`Kernel`. Kernel implements a similar interface as :class:`Estimator`, providing the methods ``get_params()``, ``set_params()``, and ``clone()``. This allows setting kernel values also via meta-estimators such as :class:`Pipeline` or :class:`GridSearch`. Note that due to the nested structure of kernels (by applying kernel operators, see below), the names of kernel parameters might become relatively complicated. In general, for a binary kernel operator, parameters of the left operand are prefixed with ``k1__`` and parameters of the right operand with ``k2__``. An additional convenience method is ``clone_with_theta(theta)``, which returns a cloned version of the kernel but with the hyperparameters set to ``theta``. An illustrative example:
es_es: La clase base abstracta para todos los núcleos es :class:`Kernel`. El núcleo implementa una interfaz similar a la de :class:`Estimator`, proporcionando los métodos ``get_params()``, ``set_params()``, y ``clone()``. Esto permite establecer los valores del núcleo también a través de metaestimadores como :class:`Pipeline` o :class:`GridSearch`. Ten en cuenta que, debido a la estructura anidada de los núcleos (al aplicar operadores del núcleo, como podrás ver más adelante), los nombres de los parámetros del núcleo pueden resultar relativamente complicados. En general, para un operador de núcleo binario, los parámetros del operando izquierdo llevan el prefijo ``k1__`` y los parámetros del operando derecho el prefijo ``k2__``. Un método adicional de utilidad es ``clone_with_theta(theta)``, que devuelve una versión clonada del núcleo pero con los hiperparámetros ajustados a ``theta``. Un ejemplo de ello:

source: All Gaussian process kernels are interoperable with :mod:`sklearn.metrics.pairwise` and vice versa: instances of subclasses of :class:`Kernel` can be passed as ``metric`` to ``pairwise_kernels`` from :mod:`sklearn.metrics.pairwise`. Moreover, kernel functions from pairwise can be used as GP kernels by using the wrapper class :class:`PairwiseKernel`. The only caveat is that the gradient of the hyperparameters is not analytic but numeric and all those kernels support only isotropic distances. The parameter ``gamma`` is considered to be a hyperparameter and may be optimized. The other kernel parameters are set directly at initialization and are kept fixed.
es_es: Todos los núcleos de procesos gaussianos son interoperables con :mod:`sklearn.metrics.pairwise` y viceversa: las instancias de las subclases de :class:`Kernel` pueden pasarse como ``metric`` a ``pairwise_kernels`` de :mod:`sklearn.metrics.pairwise`. Además, las funciones del núcleo de pares (pairwise) pueden utilizarse como núcleos de GP utilizando la clase envolvente :class:`PairwiseKernel`. La única advertencia es que el gradiente de los hiperparámetros no es analítico, sino numérico, y todos esos núcleos sólo admiten distancias isotrópicas. El parámetro ``gamma`` se considera un hiperparámetro y puede ser optimizado. Los demás parámetros del núcleo se establecen directamente en la inicialización y se mantienen fijos.

source: Basic kernels
es_es: Núcleos (kernels) básicos

source: The :class:`ConstantKernel` kernel can be used as part of a :class:`Product` kernel where it scales the magnitude of the other factor (kernel) or as part of a :class:`Sum` kernel, where it modifies the mean of the Gaussian process. It depends on a parameter :math:`constant\_value`. It is defined as:
es_es: El núcleo :class:`ConstantKernel` puede utilizarse como parte de un núcleo :class:`Product` en el que se escala la magnitud del otro factor (núcleo) o como parte de un núcleo :class:`Sum`, en el que se modifica la media del proceso gaussiano. Depende de un parámetro :math:`constant\_value`. Se define como:

source: The main use-case of the :class:`WhiteKernel` kernel is as part of a sum-kernel where it explains the noise-component of the signal. Tuning its parameter :math:`noise\_level` corresponds to estimating the noise-level. It is defined as:
es_es: El principal caso de uso del núcleo :class:`WhiteKernel` es como parte de un núcleo de suma en el que explica el componente de ruido de la señal. El ajuste de su parámetro :math:`noise\_level` corresponde a la estimación del nivel de ruido. Se define como:

source: Kernel operators
es_es: Operadores de núcleo

source: Kernel operators take one or two base kernels and combine them into a new kernel. The :class:`Sum` kernel takes two kernels :math:`k_1` and :math:`k_2` and combines them via :math:`k_{sum}(X, Y) = k_1(X, Y) + k_2(X, Y)`. The :class:`Product` kernel takes two kernels :math:`k_1` and :math:`k_2` and combines them via :math:`k_{product}(X, Y) = k_1(X, Y) * k_2(X, Y)`. The :class:`Exponentiation` kernel takes one base kernel and a scalar parameter :math:`p` and combines them via :math:`k_{exp}(X, Y) = k(X, Y)^p`. Note that magic methods ``__add__``, ``__mul___`` and ``__pow__`` are overridden on the Kernel objects, so one can use e.g. ``RBF() + RBF()`` as a shortcut for ``Sum(RBF(), RBF())``.
es_es: Los operadores de núcleo toman uno o dos núcleos base y los combinan en un nuevo núcleo. El núcleo :class:`Suma` toma dos núcleos :math:`k_1` y :math:`k_2` y los combina mediante :math:`k_{sum}(X, Y) = k_1(X, Y) + k_2(X, Y)`. El núcleo :class:`Product` toma dos núcleos :math:`k_1` y :math:`k_2` y los combina mediante :math:`k_{product}(X, Y) = k_1(X, Y) * k_2(X, Y)`. El núcleo :class:`Exponentiation` toma un núcleo base y un parámetro escalar :math:`p` y los combina mediante :math:`k_{exp}(X, Y) = k(X, Y)^p`. Tenga en cuenta que los métodos mágicos ``__add__``, ``__mul___`` y ``__pow__`` se anulan en los objetos Kernel, por lo que se puede utilizar, por ejemplo, ``RBF() + RBF()`` como un atajo para ``Sum(RBF(), RBF())``.

source: Radial-basis function (RBF) kernel
es_es: Núcleo de la Función de Base Radial (RBF)

source: The :class:`RBF` kernel is a stationary kernel. It is also known as the "squared exponential" kernel. It is parameterized by a length-scale parameter :math:`l>0`, which can either be a scalar (isotropic variant of the kernel) or a vector with the same number of dimensions as the inputs :math:`x` (anisotropic variant of the kernel). The kernel is given by:
es_es: El núcleo :class:`RBF` es un núcleo estacionario. También se conoce como núcleo "exponencial cuadrado". Está parametrizado por un parámetro de escala de longitud :math:`l>0`, que puede ser un escalar (variante isotrópica del núcleo) o un vector con el mismo número de dimensiones que las entradas :math:`x` (variante anisotrópica del núcleo). El núcleo viene dado por:

source: where :math:`d(\cdot, \cdot)` is the Euclidean distance. This kernel is infinitely differentiable, which implies that GPs with this kernel as covariance function have mean square derivatives of all orders, and are thus very smooth. The prior and posterior of a GP resulting from an RBF kernel are shown in the following figure:
es_es: donde :math:`d(\cdot, \cdot)` es la distancia euclidiana. Este núcleo es infinitamente diferenciable, lo que implica que las GP con este núcleo como función de covarianza tienen derivadas cuadráticas medias de todos los órdenes, y por tanto resultan muy suavizadas (smooth). En la siguiente figura se muestran los valores a priori y a posteriori de una GP resultante de un núcleo RBF:

source: Matérn kernel
es_es: Núcleo Matérn
