Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/grid_search.po
Languages: es_es

source: Tuning the hyper-parameters of an estimator
es_es: Ajustar los hiperparámetros de un estimador

source: Hyper-parameters are parameters that are not directly learnt within estimators. In scikit-learn they are passed as arguments to the constructor of the estimator classes. Typical examples include ``C``, ``kernel`` and ``gamma`` for Support Vector Classifier, ``alpha`` for Lasso, etc.
es_es: Los hiperparámetros son parámetros que no se aprenden directamente dentro de los estimadores. En scikit-learn se pasan como argumentos al constructor de las clases de estimadores. Los ejemplos típicos incluyen ``C``, ``kernel`` y ``gamma`` para el Clasificador de Vectores de Soporte, ``alpha`` para Lasso, etc.

source: It is possible and recommended to search the hyper-parameter space for the best :ref:`cross validation <cross_validation>` score.
es_es: Es posible y recomendable buscar en el espacio de hiperparámetros la mejor puntuación de :ref:`validación cruzada <cross_validation>`.

source: Any parameter provided when constructing an estimator may be optimized in this manner. Specifically, to find the names and current values for all parameters for a given estimator, use::
es_es: Cualquier parámetro proporcionado al construir un estimador puede ser optimizado de esta manera. Específicamente, para encontrar los nombres y valores actuales de todos los parámetros de un estimador determinado, utiliza::

source: A search consists of:
es_es: Una búsqueda consiste en:

source: an estimator (regressor or classifier such as ``sklearn.svm.SVC()``);
es_es: un estimador (regresor o clasificador como ``sklearn.svm.SVC()``);

source: a parameter space;
es_es: un espacio de parámetros;

source: a method for searching or sampling candidates;
es_es: un método de búsqueda o muestreo de candidatos;

source: a cross-validation scheme; and
es_es: un esquema de validación cruzada; y

source: a :ref:`score function <gridsearch_scoring>`.
es_es: una :ref:`función de puntuación <gridsearch_scoring>`.

source: Two generic approaches to parameter search are provided in scikit-learn: for given values, :class:`GridSearchCV` exhaustively considers all parameter combinations, while :class:`RandomizedSearchCV` can sample a given number of candidates from a parameter space with a specified distribution. Both these tools have successive halving counterparts :class:`HalvingGridSearchCV` and :class:`HalvingRandomSearchCV`, which can be much faster at finding a good parameter combination.
es_es: En scikit-learn se proporcionan dos enfoques genéricos para la búsqueda de parámetros: para valores dados, :class:`GridSearchCV` considera exhaustivamente todas las combinaciones de parámetros, mientras que :class:`RandomizedSearchCV` puede muestrear un número determinado de candidatos de un espacio de parámetros con una distribución especificada. Ambas herramientas tienen sus homólogos sucesivos :class:`HalvingGridSearchCV` y :class:`HalvingRandomSearchCV`, que pueden ser mucho más rápidos a la hora de encontrar una buena combinación de parámetros.

source: After describing these tools we detail :ref:`best practices <grid_search_tips>` applicable to these approaches. Some models allow for specialized, efficient parameter search strategies, outlined in :ref:`alternative_cv`.
es_es: Después de describir estas herramientas, detallamos las :ref:`mejores prácticas <grid_search_tips>` aplicables a estos enfoques. Algunos modelos permiten estrategias de búsqueda de parámetros especializadas y eficientes, descritas en :ref:`alternative_cv`.

source: Note that it is common that a small subset of those parameters can have a large impact on the predictive or computation performance of the model while others can be left to their default values. It is recommended to read the docstring of the estimator class to get a finer understanding of their expected behavior, possibly by reading the enclosed reference to the literature.
es_es: Ten en cuenta que es habitual que un pequeño subconjunto de esos parámetros pueda tener un gran impacto en el rendimiento predictivo o de cálculo del modelo, mientras que otros pueden dejarse con sus valores por defecto. Se recomienda leer la cadena de documentación de la clase del estimador para obtener una comprensión más fina de su comportamiento esperado, posiblemente leyendo la referencia adjunta a la literatura.

source: Exhaustive Grid Search
es_es: Búsqueda exhaustiva en Cuadrícula

source: The grid search provided by :class:`GridSearchCV` exhaustively generates candidates from a grid of parameter values specified with the ``param_grid`` parameter. For instance, the following ``param_grid``::
es_es: La búsqueda en cuadrícula proporcionada por :class:`GridSearchCV` genera exhaustivamente candidatos a partir de una cuadrícula de valores de parámetros especificados con el parámetro ``param_grid``. Por ejemplo, la siguiente ``param_grid``::

source: specifies that two grids should be explored: one with a linear kernel and C values in [1, 10, 100, 1000], and the second one with an RBF kernel, and the cross-product of C values ranging in [1, 10, 100, 1000] and gamma values in [0.001, 0.0001].
es_es: especifica que se deben explorar dos cuadrículas: una con un kernel lineal y valores de C en [1, 10, 100, 1000], y la segunda con un kernel RBF, y el producto cruzado de valores de C en [1, 10, 100, 1000] y valores de gamma en [0.001, 0.0001].

source: The :class:`GridSearchCV` instance implements the usual estimator API: when "fitting" it on a dataset all the possible combinations of parameter values are evaluated and the best combination is retained.
es_es: La instancia :class:`GridSearchCV` implementa la API de estimadores habitual: al "ajustarla" a un conjunto de datos se evalúan todas las combinaciones posibles de valores de los parámetros y se retiene la mejor combinación.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` for an example of Grid Search computation on the digits dataset.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` para ver un ejemplo de cálculo de Búsqueda en Cuadrícula en el conjunto de datos de dígitos.

source: See :ref:`sphx_glr_auto_examples_model_selection_grid_search_text_feature_extraction.py` for an example of Grid Search coupling parameters from a text documents feature extractor (n-gram count vectorizer and TF-IDF transformer) with a classifier (here a linear SVM trained with SGD with either elastic net or L2 penalty) using a :class:`pipeline.Pipeline` instance.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_grid_search_text_feature_extraction.py` para ver un ejemplo de cómo Grid Search (búsqueda en cuadrícula) acopla los parámetros de un extractor de características de documentos de texto (vectorizador de recuento de n-gramas y transformador TF-IDF) con un clasificador (en este caso un SVM lineal entrenado con SGD con red elástica o penalización L2) utilizando una instancia :class:`pipeline.Pipeline`.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_nested_cross_validation_iris.py` for an example of Grid Search within a cross validation loop on the iris dataset. This is the best practice for evaluating the performance of a model with grid search.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_plot_nested_cross_validation_iris.py` para ver un ejemplo de Grid Search (búsqueda en cuadrícula) dentro de un bucle de validación cruzada en el conjunto de datos iris. Esta es la mejor práctica para evaluar el rendimiento de un modelo con búsqueda en cuadrícula.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_multi_metric_evaluation.py` for an example of :class:`GridSearchCV` being used to evaluate multiple metrics simultaneously.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_plot_multi_metric_evaluation.py` para ver un ejemplo de :class:`GridSearchCV` utilizado para evaluar múltiples métricas simultáneamente.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_refit_callable.py` for an example of using ``refit=callable`` interface in :class:`GridSearchCV`. The example shows how this interface adds certain amount of flexibility in identifying the "best" estimator. This interface can also be used in multiple metrics evaluation.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_refit_callable.py` para ver un ejemplo de uso de la interfaz ``refit=callable`` en :class:`GridSearchCV`. El ejemplo muestra cómo esta interfaz añade cierta flexibilidad a la hora de identificar el "mejor" estimador. Esta interfaz también puede utilizarse en la evaluación de múltiples métricas.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_stats.py` for an example of how to do a statistical comparison on the outputs of :class:`GridSearchCV`.
es_es: Consulta :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_stats.py` para ver un ejemplo de cómo hacer una comparación estadística de las salidas de :class:`GridSearchCV`.

source: Randomized Parameter Optimization
es_es: Optimización Aleatoria de Parámetros

source: While using a grid of parameter settings is currently the most widely used method for parameter optimization, other search methods have more favourable properties. :class:`RandomizedSearchCV` implements a randomized search over parameters, where each setting is sampled from a distribution over possible parameter values. This has two main benefits over an exhaustive search:
es_es: Aunque el uso de una cuadrícula de ajustes de parámetros es el método más utilizado actualmente para la optimización de parámetros, otros métodos de búsqueda tienen propiedades más favorables. :class:`RandomizedSearchCV` implementa una búsqueda aleatoria sobre los parámetros, donde cada ajuste se muestrea a partir de una distribución sobre los posibles valores de los parámetros. Esto tiene dos ventajas principales sobre una búsqueda exhaustiva:

source: A budget can be chosen independent of the number of parameters and possible values.
es_es: Se puede elegir un presupuesto independientemente del número de parámetros y de los valores posibles.

source: Adding parameters that do not influence the performance does not decrease efficiency.
es_es: Añadir parámetros que no influyen en el rendimiento no disminuye la eficiencia.

source: Specifying how parameters should be sampled is done using a dictionary, very similar to specifying parameters for :class:`GridSearchCV`. Additionally, a computation budget, being the number of sampled candidates or sampling iterations, is specified using the ``n_iter`` parameter. For each parameter, either a distribution over possible values or a list of discrete choices (which will be sampled uniformly) can be specified::
es_es: La especificación de cómo se deben muestrear los parámetros se realiza mediante un diccionario, de forma muy similar a la especificación de parámetros para :class:`GridSearchCV`. Además, se especifica un presupuesto de cálculo, que es el número de candidatos muestreados o iteraciones de muestreo, utilizando el parámetro ``n_iter``. Para cada parámetro, se puede especificar una distribución sobre posibles valores o una lista de opciones discretas (que se muestrearán uniformemente)::

source: This example uses the ``scipy.stats`` module, which contains many useful distributions for sampling parameters, such as ``expon``, ``gamma``, ``uniform`` or ``randint``.
es_es: Este ejemplo utiliza el módulo ``scipy.stats``, que contiene muchas distribuciones útiles para el muestreo de parámetros, como ``expon``, ``gamma``, ``uniform`` o ``randint``.

source: In principle, any function can be passed that provides a ``rvs`` (random variate sample) method to sample a value. A call to the ``rvs`` function should provide independent random samples from possible parameter values on consecutive calls.
es_es: En principio, se puede pasar cualquier función que proporcione un método ``rvs`` (muestra de variante aleatoria) para muestrear un valor. Una llamada a la función ``rvs`` debe proporcionar muestras aleatorias independientes de los posibles valores de los parámetros en llamadas consecutivas.

source: The distributions in ``scipy.stats`` prior to version scipy 0.16 do not allow specifying a random state. Instead, they use the global numpy random state, that can be seeded via ``np.random.seed`` or set using ``np.random.set_state``. However, beginning scikit-learn 0.18, the :mod:`sklearn.model_selection` module sets the random state provided by the user if scipy >= 0.16 is also available.
es_es: Las distribuciones en ``scipy.stats`` anteriores a la versión scipy 0.16 no permiten especificar un estado aleatorio. En su lugar, utilizan el estado aleatorio global de numpy, que puede ser sembrado a través de ``np.random.seed`` o establecido utilizando ``np.random.set_state``. Sin embargo, a partir de scikit-learn 0.18, el módulo :mod:`sklearn.model_selection` establece el estado aleatorio proporcionado por el usuario si scipy >= 0.16 también está disponible.

source: For continuous parameters, such as ``C`` above, it is important to specify a continuous distribution to take full advantage of the randomization. This way, increasing ``n_iter`` will always lead to a finer search.
es_es: Para los parámetros continuos, como ``C`` arriba, es importante especificar una distribución continua para aprovechar al máximo la aleatorización. De esta manera, el aumento de ``n_iter`` siempre conducirá a una búsqueda más fina.

source: A continuous log-uniform random variable is available through :class:`~sklearn.utils.fixes.loguniform`. This is a continuous version of log-spaced parameters. For example to specify ``C`` above, ``loguniform(1, 100)`` can be used instead of ``[1, 10, 100]`` or ``np.logspace(0, 2, num=1000)``. This is an alias to SciPy's `stats.reciprocal <https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.reciprocal.html>`_.
es_es: Una variable aleatoria continua log-uniforme está disponible a través de :class:`~sklearn.utils.fixes.loguniform`. Esta es una versión continua de los parámetros log-espaciados. Por ejemplo, para especificar ``C`` arriba, se puede usar ``loguniform(1, 100)`` en lugar de ``[1, 10, 100]`` o ``np.logspace(0, 2, num=1000)``. Este es un alias de `stats.reciprocal <https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.reciprocal.html>`_ de SciPy.

source: Mirroring the example above in grid search, we can specify a continuous random variable that is log-uniformly distributed between ``1e0`` and ``1e3``::
es_es: Reflejando el ejemplo anterior en la búsqueda en cuadrícula, podemos especificar una variable aleatoria continua que se distribuye log-uniformemente entre ``1e0`` y ``1e3``::

source: :ref:`sphx_glr_auto_examples_model_selection_plot_randomized_search.py` compares the usage and efficiency of randomized search and grid search.
es_es: :ref:`sphx_glr_auto_examples_model_selection_plot_randomized_search.py` compara el uso y la eficiencia de la búsqueda aleatoria y la búsqueda en cuadrícula.

source: Bergstra, J. and Bengio, Y., Random search for hyper-parameter optimization, The Journal of Machine Learning Research (2012)
es_es: Bergstra, J. y Bengio, Y., Random search for hyper-parameter optimization, The Journal of Machine Learning Research (2012)

source: Searching for optimal parameters with successive halving
es_es: Búsqueda de los parámetros óptimos con la reducción sucesiva a la mitad

source: Scikit-learn also provides the :class:`HalvingGridSearchCV` and :class:`HalvingRandomSearchCV` estimators that can be used to search a parameter space using successive halving [1]_ [2]_. Successive halving (SH) is like a tournament among candidate parameter combinations. SH is an iterative selection process where all candidates (the parameter combinations) are evaluated with a small amount of resources at the first iteration. Only some of these candidates are selected for the next iteration, which will be allocated more resources. For parameter tuning, the resource is typically the number of training samples, but it can also be an arbitrary numeric parameter such as `n_estimators` in a random forest.
es_es: Scikit-learn también proporciona los estimadores :class:`HalvingGridSearchCV` y :class:`HalvingRandomSearchCV` que se pueden utilizar para buscar un espacio de parámetros utilizando la reducción sucesiva a la mitad [1]_ [2]_. La reducción sucesiva a la mitad (successive halving, SH) es como un torneo entre combinaciones de parámetros candidatos. SH es un proceso de selección iterativo en el que todos los candidatos (las combinaciones de parámetros) se evalúan con una pequeña cantidad de recursos en la primera iteración. Sólo algunos de estos candidatos se seleccionan para la siguiente iteración, a la que se asignan más recursos. Para el ajuste de parámetros, el recurso suele ser el número de muestras de entrenamiento, pero también puede ser un parámetro numérico arbitrario como `n_estimators` en un bosque aleatorio.

source: As illustrated in the figure below, only a subset of candidates 'survive' until the last iteration. These are the candidates that have consistently ranked among the top-scoring candidates across all iterations. Each iteration is allocated an increasing amount of resources per candidate, here the number of samples.
es_es: Como se ilustra en la siguiente figura, sólo un subconjunto de candidatos 'sobrevive' hasta la última iteración. Se trata de los candidatos que se han clasificado sistemáticamente entre los candidatos con mayor puntuación en todas las iteraciones. A cada iteración se le asigna una cantidad creciente de recursos por candidato, en este caso el número de muestras.

source: We here briefly describe the main parameters, but each parameter and their interactions are described in more details in the sections below. The ``factor`` (> 1) parameter controls the rate at which the resources grow, and the rate at which the number of candidates decreases. In each iteration, the number of resources per candidate is multiplied by ``factor`` and the number of candidates is divided by the same factor. Along with ``resource`` and ``min_resources``, ``factor`` is the most important parameter to control the search in our implementation, though a value of 3 usually works well. ``factor`` effectively controls the number of iterations in :class:`HalvingGridSearchCV` and the number of candidates (by default) and iterations in :class:`HalvingRandomSearchCV`. ``aggressive_elimination=True`` can also be used if the number of available resources is small. More control is available through tuning the ``min_resources`` parameter.
es_es: Aquí describimos brevemente los parámetros principales, pero cada parámetro y sus interacciones se describen con más detalle en las siguientes secciones. El parámetro ``factor`` (> 1) controla la tasa de crecimiento de los recursos y la tasa de disminución del número de candidatos. En cada iteración, el número de recursos por candidato se multiplica por ``factor`` y el número de candidatos se divide por el mismo factor. Junto con ``resource`` y ``min_resources``, ``factor`` es el parámetro más importante para controlar la búsqueda en nuestra implementación, aunque un valor de 3 suele funcionar bien. ``factor`` controla efectivamente el número de iteraciones en :class:`HalvingGridSearchCV` y el número de candidatos (por defecto) e iteraciones en :class:`HalvingRandomSearchCV`. También se puede utilizar ``aggressive_elimination=True`` si el número de recursos disponibles es pequeño. Hay más control disponible mediante el ajuste del parámetro ``min_resources``.

source: These estimators are still **experimental**: their predictions and their API might change without any deprecation cycle. To use them, you need to explicitly import ``enable_halving_search_cv``::
es_es: Estos estimadores son todavía **experimentales**: sus predicciones y su API podrían cambiar sin ningún ciclo de obsolescencia. Para utilizarlos, es necesario importar explícitamente ``enable_halving_search_cv``::

source: Choosing ``min_resources`` and the number of candidates
es_es: Elegir ``min_resources`` y el número de candidatos

source: Beside ``factor``, the two main parameters that influence the behaviour of a successive halving search are the ``min_resources`` parameter, and the number of candidates (or parameter combinations) that are evaluated. ``min_resources`` is the amount of resources allocated at the first iteration for each candidate. The number of candidates is specified directly in :class:`HalvingRandomSearchCV`, and is determined from the ``param_grid`` parameter of :class:`HalvingGridSearchCV`.
es_es: Además de ``factor``, los dos parámetros principales que influyen en el comportamiento de una búsqueda sucesiva a la mitad son el parámetro ``min_resources`` y el número de candidatos (o combinaciones de parámetros) que se evalúan. ``min_resources`` es la cantidad de recursos asignados en la primera iteración para cada candidato. El número de candidatos se especifica directamente en :class:`HalvingRandomSearchCV`, y se determina a partir del parámetro ``param_grid`` de :class:`HalvingGridSearchCV`.

source: Consider a case where the resource is the number of samples, and where we have 1000 samples. In theory, with ``min_resources=10`` and ``factor=2``, we are able to run **at most** 7 iterations with the following number of samples: ``[10, 20, 40, 80, 160, 320, 640]``.
es_es: Consideremos un caso en el que el recurso es el número de muestras, y en el que tenemos 1000 muestras. En teoría, con ``min_resources=10`` y ``factor=2``, podemos ejecutar **como máximo** 7 iteraciones con el siguiente número de muestras: ``[10, 20, 40, 80, 160, 320, 640]``.

source: But depending on the number of candidates, we might run less than 7 iterations: if we start with a **small** number of candidates, the last iteration might use less than 640 samples, which means not using all the available resources (samples). For example if we start with 5 candidates, we only need 2 iterations: 5 candidates for the first iteration, then `5 // 2 = 2` candidates at the second iteration, after which we know which candidate performs the best (so we don't need a third one). We would only be using at most 20 samples which is a waste since we have 1000 samples at our disposal. On the other hand, if we start with a **high** number of candidates, we might end up with a lot of candidates at the last iteration, which may not always be ideal: it means that many candidates will run with the full resources, basically reducing the procedure to standard search.
es_es: Pero dependiendo del número de candidatos, podríamos realizar menos de 7 iteraciones: si empezamos con un **pequeño** número de candidatos, la última iteración podría utilizar menos de 640 muestras, lo que significa no utilizar todos los recursos disponibles (muestras). Por ejemplo, si empezamos con 5 candidatos, sólo necesitaremos 2 iteraciones: 5 candidatos para la primera iteración, y luego `5 // 2 = 2` candidatos en la segunda iteración, después de la que sabremos cuál es el mejor candidato (por lo que no necesitamos una tercera). Sólo estaríamos utilizando como máximo 20 muestras, lo cual es un desperdicio ya que tenemos 1000 muestras a nuestra disposición. Por otro lado, si empezamos con un **número elevado** de candidatos, podríamos acabar con muchos candidatos en la última iteración, lo que no siempre es ideal: significa que muchos candidatos correrán con todos los recursos, reduciendo básicamente el procedimiento a una búsqueda estándar.
