Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/grid_search.po
Languages: es_es

source: In the case of :class:`HalvingRandomSearchCV`, the number of candidates is set by default such that the last iteration uses as much of the available resources as possible. For :class:`HalvingGridSearchCV`, the number of candidates is determined by the `param_grid` parameter. Changing the value of ``min_resources`` will impact the number of possible iterations, and as a result will also have an effect on the ideal number of candidates.
es_es: En el caso de :class:`HalvingRandomSearchCV`, el número de candidatos se establece por defecto de forma que la última iteración utilice la mayor cantidad posible de recursos disponibles. Para :class:`HalvingGridSearchCV`, el número de candidatos viene determinado por el parámetro `param_grid`. Cambiar el valor de ``min_resources`` afectará al número de iteraciones posibles, y como resultado también tendrá un efecto en el número ideal de candidatos.

source: Another consideration when choosing ``min_resources`` is whether or not it is easy to discriminate between good and bad candidates with a small amount of resources. For example, if you need a lot of samples to distinguish between good and bad parameters, a high ``min_resources`` is recommended. On the other hand if the distinction is clear even with a small amount of samples, then a small ``min_resources`` may be preferable since it would speed up the computation.
es_es: Otra consideración a la hora de elegir ``min_recursos`` es si es fácil o no discriminar entre candidatos buenos y malos con una pequeña cantidad de recursos. Por ejemplo, si se necesitas muchas muestras para distinguir entre parámetros buenos y malos, se recomienda un ``min_resources`` alto. Por otro lado, si la distinción es clara incluso con una pequeña cantidad de muestras, entonces puede ser preferible un ``min_resources`` pequeño, ya que aceleraría el cálculo.

source: Notice in the example above that the last iteration does not use the maximum amount of resources available: 1000 samples are available, yet only 640 are used, at most. By default, both :class:`HalvingRandomSearchCV` and :class:`HalvingGridSearchCV` try to use as many resources as possible in the last iteration, with the constraint that this amount of resources must be a multiple of both `min_resources` and `factor` (this constraint will be clear in the next section). :class:`HalvingRandomSearchCV` achieves this by sampling the right amount of candidates, while :class:`HalvingGridSearchCV` achieves this by properly setting `min_resources`. Please see :ref:`exhausting_the_resources` for details.
es_es: Observa en el ejemplo anterior que la última iteración no utiliza el máximo de recursos disponibles: Hay 1000 muestras disponibles, pero sólo se utilizan 640, como máximo. Por defecto, tanto :class:`HalvingRandomSearchCV` como :class:`HalvingGridSearchCV` intentan utilizar la mayor cantidad de recursos posible en la última iteración, con la restricción de que esta cantidad de recursos debe ser un múltiplo tanto de `min_resources` como de `factor` (esta restricción quedará clara en la siguiente sección). :class:`HalvingRandomSearchCV` logra esto mediante el muestreo de la cantidad correcta de candidatos, mientras que :class:`HalvingGridSearchCV` lo logra estableciendo adecuadamente `min_resources`. Por favor, consulta :ref:`exhausting_the_resources` para más detalles.

source: Amount of resource and number of candidates at each iteration
es_es: Cantidad de recursos y número de candidatos en cada iteración

source: At any iteration `i`, each candidate is allocated a given amount of resources which we denote `n_resources_i`. This quantity is controlled by the parameters ``factor`` and ``min_resources`` as follows (`factor` is strictly greater than 1)::
es_es: En cualquier iteración `i`, a cada candidato se le asigna una cantidad determinada de recursos que denotamos `n_resources_i`. Esta cantidad está controlada por los parámetros ``factor`` y ``min_resources`` como sigue (`factor` es estrictamente mayor que 1)::

source: or equivalently::
es_es: o, de forma equivalente::

source: where ``min_resources == n_resources_0`` is the amount of resources used at the first iteration. ``factor`` also defines the proportions of candidates that will be selected for the next iteration::
es_es: donde ``min_resources == n_resources_0`` es la cantidad de recursos utilizados en la primera iteración. ``factor`` también define las proporciones de candidatos que se seleccionarán para la siguiente iteración::

source: So in the first iteration, we use ``min_resources`` resources ``n_candidates`` times. In the second iteration, we use ``min_resources * factor`` resources ``n_candidates // factor`` times. The third again multiplies the resources per candidate and divides the number of candidates. This process stops when the maximum amount of resource per candidate is reached, or when we have identified the best candidate. The best candidate is identified at the iteration that is evaluating `factor` or less candidates (see just below for an explanation).
es_es: Así que en la primera iteración, utilizamos ``min_resources`` recursos ``n_candidates`` veces. En la segunda iteración, utilizamos ``min_resources * factor`` recursos ``n_candidates // factor`` veces. La tercera vuelve a multiplicar los recursos por candidato y divide el número de candidatos. Este proceso se detiene cuando se alcanza la cantidad máxima de recursos por candidato, o cuando hemos identificado al mejor candidato. El mejor candidato se identifica en la iteración que está evaluando `factor` o menos candidatos (ver justo debajo para una explicación).

source: Here is an example with ``min_resources=3`` and ``factor=2``, starting with 70 candidates:
es_es: Aquí hay un ejemplo con ``min_resources=3`` y ``factor=2``, empezando con 70 candidatos:

source: We can note that:
es_es: Podemos notar que:

source: the process stops at the first iteration which evaluates `factor=2` candidates: the best candidate is the best out of these 2 candidates. It is not necessary to run an additional iteration, since it would only evaluate one candidate (namely the best one, which we have already identified). For this reason, in general, we want the last iteration to run at most ``factor`` candidates. If the last iteration evaluates more than `factor` candidates, then this last iteration reduces to a regular search (as in :class:`RandomizedSearchCV` or :class:`GridSearchCV`).
es_es: el proceso se detiene en la primera iteración que evalúa `factor=2` candidatos: el mejor candidato es el mejor de estos 2 candidatos. No es necesario ejecutar una iteración adicional, ya que sólo evaluaría un candidato (el mejor, que ya hemos identificado). Por esta razón, en general, queremos que la última iteración ejecute como máximo ``factor`` candidatos. Si la última iteración evalúa más de `factor` candidatos, entonces esta última iteración se reduce a una búsqueda regular (como en :class:`RandomizedSearchCV` o :class:`GridSearchCV`).

source: each ``n_resources_i`` is a multiple of both ``factor`` and ``min_resources`` (which is confirmed by its definition above).
es_es: cada ``n_resources_i`` es un múltiplo tanto de ``factor`` como de ``min_resources`` (lo cual se confirma por su definición anterior).

source: The amount of resources that is used at each iteration can be found in the `n_resources_` attribute.
es_es: La cantidad de recursos que se utilizan en cada iteración se puede encontrar en el atributo `n_resources_`.

source: Choosing a resource
es_es: Elegir un recurso

source: By default, the resource is defined in terms of number of samples. That is, each iteration will use an increasing amount of samples to train on. You can however manually specify a parameter to use as the resource with the ``resource`` parameter. Here is an example where the resource is defined in terms of the number of estimators of a random forest::
es_es: Por defecto, el recurso se define en términos del número de muestras. Es decir, cada iteración utilizará una cantidad creciente de muestras para entrenar. Sin embargo, puedes especificar manualmente un parámetro para utilizarlo como recurso con el parámetro ``resource``. Aquí hay un ejemplo donde el recurso se define en términos del número de estimadores de un bosque aleatorio::

source: Note that it is not possible to budget on a parameter that is part of the parameter grid.
es_es: Ten en cuenta que no es posible presupuestar en un parámetro que es parte de la cuadrícula del parámetro.

source: Exhausting the available resources
es_es: Agotar los recursos disponibles

source: As mentioned above, the number of resources that is used at each iteration depends on the `min_resources` parameter. If you have a lot of resources available but start with a low number of resources, some of them might be wasted (i.e. not used)::
es_es: Como se ha mencionado anteriormente, el número de recursos que se utiliza en cada iteración depende del parámetro `min_resources`. Si tienes muchos recursos disponibles pero empiezas con un número bajo de recursos, algunos de ellos podrían ser desperdiciados (es decir, no utilizados)::

source: The search process will only use 80 resources at most, while our maximum amount of available resources is ``n_samples=1000``. Here, we have ``min_resources = r_0 = 20``.
es_es: El proceso de búsqueda sólo utilizará 80 recursos como máximo, mientras que nuestra cantidad máxima de recursos disponibles es ``n_samples=1000``. Aquí, tenemos ``min_resources = r_0 = 20``.

source: For :class:`HalvingGridSearchCV`, by default, the `min_resources` parameter is set to 'exhaust'. This means that `min_resources` is automatically set such that the last iteration can use as many resources as possible, within the `max_resources` limit::
es_es: Para :class:`HalvingGridSearchCV`, por defecto, el parámetro `min_resources` se establece en 'exhaust'. Esto significa que `min_resources` se establece automáticamente de forma que la última iteración pueda utilizar tantos recursos como sea posible, dentro del límite de `max_resources`::

source: `min_resources` was here automatically set to 250, which results in the last iteration using all the resources. The exact value that is used depends on the number of candidate parameter, on `max_resources` and on `factor`.
es_es: `min_resources` se estableció aquí automáticamente en 250, lo que hace que la última iteración utilice todos los recursos. El valor exacto que se utiliza depende del número de parámetros candidatos, en `max_resources` y en `factor`.

source: For :class:`HalvingRandomSearchCV`, exhausting the resources can be done in 2 ways:
es_es: Para :class:`HalvingRandomSearchCV`, el agotamiento de los recursos puede hacerse de dos maneras:

source: by setting `min_resources='exhaust'`, just like for :class:`HalvingGridSearchCV`;
es_es: estableciendo `min_resources='exhaust'`, al igual que para :class:`HalvingGridSearchCV`;

source: by setting `n_candidates='exhaust'`.
es_es: estableciendo `n_candidates='exhaust'`.

source: Both options are mutally exclusive: using `min_resources='exhaust'` requires knowing the number of candidates, and symmetrically `n_candidates='exhaust'` requires knowing `min_resources`.
es_es: Ambas opciones son mutuamente excluyentes: usar `min_resources='exhaust'` requiere conocer el número de candidatos, y simétricamente `n_candidates='exhaust'` requiere conocer `min_resources`.

source: In general, exhausting the total number of resources leads to a better final candidate parameter, and is slightly more time-intensive.
es_es: En general, agotar el número total de recursos conduce a un mejor parámetro candidato final, y requiere ligeramente más tiempo.

source: Aggressive elimination of candidates
es_es: Eliminación agresiva de candidatos

source: Ideally, we want the last iteration to evaluate ``factor`` candidates (see :ref:`amount_of_resource_and_number_of_candidates`). We then just have to pick the best one. When the number of available resources is small with respect to the number of candidates, the last iteration may have to evaluate more than ``factor`` candidates::
es_es: Idealmente, queremos que la última iteración evalúe ``factor`` candidatos (ver :ref:`amount_of_resource_and_number_of_candidates`). Luego sólo tenemos que elegir el mejor. Cuando el número de recursos disponibles es pequeño respecto al número de candidatos, es posible que la última iteración tenga que evaluar más de ``factor`` candidatos::

source: Since we cannot use more than ``max_resources=40`` resources, the process has to stop at the second iteration which evaluates more than ``factor=2`` candidates.
es_es: Como no podemos utilizar más de ``max_resources=40`` recursos, el proceso tiene que detenerse en la segunda iteración que evalúa más de ``factor=2`` candidatos.

source: Using the ``aggressive_elimination`` parameter, you can force the search process to end up with less than ``factor`` candidates at the last iteration. To do this, the process will eliminate as many candidates as necessary using ``min_resources`` resources::
es_es: Usando el parámetro ``aggressive_elimination``, puedes forzar el proceso de búsqueda para que termine con menos de ``factor`` candidatos en la última iteración. Para ello, el proceso eliminará tantos candidatos como sea necesario utilizando ``min_resources`` recursos::

source: Notice that we end with 2 candidates at the last iteration since we have eliminated enough candidates during the first iterations, using ``n_resources = min_resources = 20``.
es_es: Observa que terminamos con 2 candidatos en la última iteración ya que hemos eliminado suficientes candidatos durante las primeras iteraciones, utilizando ``n_resources = min_resources = 20``.

source: Analysing results with the `cv_results_` attribute
es_es: Analizar resultados con el atributo `cv_results_`

source: The ``cv_results_`` attribute contains useful information for analysing the results of a search. It can be converted to a pandas dataframe with ``df = pd.DataFrame(est.cv_results_)``. The ``cv_results_`` attribute of :class:`HalvingGridSearchCV` and :class:`HalvingRandomSearchCV` is similar to that of :class:`GridSearchCV` and :class:`RandomizedSearchCV`, with additional information related to the successive halving process.
es_es: El atributo ``cv_results_`` contiene información útil para analizar los resultados de una búsqueda. Se puede convertir en un dataframe de pandas con ``df = pd.DataFrame(est.cv_results_)``. El atributo ``cv_results_`` de :class:`HalvingGridSearchCV` y :class:`HalvingRandomSearchCV` es similar al de :class:`GridSearchCV` y :class:`RandomizedSearchCV`, con información adicional relacionada con el proceso de reducción sucesiva a la mitad.

source: Here is an example with some of the columns of a (truncated) dataframe:
es_es: A continuación se muestra un ejemplo con algunas de las columnas de un dataframe (truncado):

source: Each row corresponds to a given parameter combination (a candidate) and a given iteration. The iteration is given by the ``iter`` column. The ``n_resources`` column tells you how many resources were used.
es_es: Cada fila corresponde a una combinación de parámetros dada (un candidato) y a una iteración determinada. La iteración viene dada por la columna ``iter``. La columna ``n_resources`` indica el número de recursos utilizados.

source: In the example above, the best parameter combination is ``{'criterion': 'entropy', 'max_depth': None, 'max_features': 9, 'min_samples_split': 10}`` since it has reached the last iteration (3) with the highest score: 0.96.
es_es: En el ejemplo anterior, la mejor combinación de parámetros es ``{'criterion': 'entropy', 'max_depth': None, 'max_features': 9, 'min_samples_split': 10}`` ya que ha alcanzado la última iteración (3) con la mayor puntuación: 0.96.

source: Tips for parameter search
es_es: Tips para la búsqueda de parámetros

source: Specifying an objective metric
es_es: Especificar una métrica objetiva

source: By default, parameter search uses the ``score`` function of the estimator to evaluate a parameter setting. These are the :func:`sklearn.metrics.accuracy_score` for classification and :func:`sklearn.metrics.r2_score` for regression. For some applications, other scoring functions are better suited (for example in unbalanced classification, the accuracy score is often uninformative). An alternative scoring function can be specified via the ``scoring`` parameter of most parameter search tools. See :ref:`scoring_parameter` for more details.
es_es: Por defecto, la búsqueda de parámetros utiliza la función ``score`` del estimador para evaluar una configuración de parámetros. Estas son :func:`sklearn.metrics.accuracy_score` para la clasificación y :func:`sklearn.metrics.r2_score` para la regresión. Para algunas aplicaciones, otras funciones de puntuación son más adecuadas (por ejemplo, en la clasificación no balanceada, la puntuación de exactitud es a menudo poco informativa). Se puede especificar una función de puntuación alternativa a través del parámetro ``scoring`` de la mayoría de las herramientas de búsqueda de parámetros. Ver :ref:`scoring_parameter` para más detalles.

source: Specifying multiple metrics for evaluation
es_es: Especificar múltiples métricas para la evaluación

source: :class:`GridSearchCV` and :class:`RandomizedSearchCV` allow specifying multiple metrics for the ``scoring`` parameter.
es_es: :class:`GridSearchCV` y :class:`RandomizedSearchCV` permiten especificar múltiples métricas para el parámetro ``scoring``.

source: Multimetric scoring can either be specified as a list of strings of predefined scores names or a dict mapping the scorer name to the scorer function and/or the predefined scorer name(s). See :ref:`multimetric_scoring` for more details.
es_es: La puntuación multimétrica puede especificarse como una lista de cadenas de nombres de puntuaciones predefinidos o como un dict que mapea el nombre del puntuador a la función de puntuación y/o el nombre o los nombres predefinidos del puntuador. Ver :ref:`multimetric_scoring` para más detalles.

source: When specifying multiple metrics, the ``refit`` parameter must be set to the metric (string) for which the ``best_params_`` will be found and used to build the ``best_estimator_`` on the whole dataset. If the search should not be refit, set ``refit=False``. Leaving refit to the default value ``None`` will result in an error when using multiple metrics.
es_es: Cuando se especifican múltiples métricas, el parámetro ``refit`` debe establecerse en la métrica (cadena) para la cual se encontrará ``best_params_`` y se utilizará para construir el ``best_estimator_`` en todo el conjunto de datos. Si la búsqueda no debe ser reajustada, establece ``refit=False``. Si se deja ``refit`` con el valor por defecto ``None`` se producirá un error cuando se utilicen múltiples métricas.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_multi_metric_evaluation.py` for an example usage.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_multi_metric_evaluation.py` para un ejemplo de uso.

source: :class:`HalvingRandomSearchCV` and :class:`HalvingGridSearchCV` do not support multimetric scoring.
es_es: :class:`HalvingRandomSearchCV` y :class:`HalvingGridSearchCV` no soportan la puntuación multimétrica.

source: Composite estimators and parameter spaces
es_es: Estimadores compuestos y espacios de parámetros

source: :class:`GridSearchCV` and :class:`RandomizedSearchCV` allow searching over parameters of composite or nested estimators such as :class:`~sklearn.pipeline.Pipeline`, :class:`~sklearn.compose.ColumnTransformer`, :class:`~sklearn.ensemble.VotingClassifier` or :class:`~sklearn.calibration.CalibratedClassifierCV` using a dedicated ``<estimator>__<parameter>`` syntax::
es_es: :class:`GridSearchCV` y :class:`RandomizedSearchCV` permiten buscar sobre parámetros de estimadores compuestos o anidados como :class:`~sklearn.pipeline.Pipeline`, :class:`~sklearn.compose.ColumnTransformer`, :class:`~sklearn.ensemble.VotingClassifier` o :class:`~sklearn.calibration.CalibratedClassifierCV` utilizando una sintaxis dedicada ``<estimator>__<parameter>``::

source: Here, ``<estimator>`` is the parameter name of the nested estimator, in this case ``base_estimator``. If the meta-estimator is constructed as a collection of estimators as in `pipeline.Pipeline`, then ``<estimator>`` refers to the name of the estimator, see :ref:`pipeline_nested_parameters`. In practice, there can be several levels of nesting::
es_es: Aquí, ``<estimator>` es el nombre del parámetro del estimador anidado, en este caso ``base_estimator``. Si el metaestimador se construye como una colección de estimadores como en `pipeline.Pipeline`, entonces ``<estimator>`` se refiere al nombre del estimador, ver :ref:`pipeline_nested_parameters`. En la práctica, puede haber varios niveles de anidación::

source: Please refer to :ref:`pipeline` for performing parameter searches over pipelines.
es_es: Consulta :ref:`pipeline` para realizar búsquedas de parámetros sobre pipelines.

source: Model selection: development and evaluation
es_es: Selección de modelos: desarrollo y evaluación

source: Model selection by evaluating various parameter settings can be seen as a way to use the labeled data to "train" the parameters of the grid.
es_es: La selección del modelo mediante la evaluación de varios ajustes de los parámetros puede verse como una forma de utilizar los datos etiquetados para "entrenar" los parámetros de la cuadrícula.

source: When evaluating the resulting model it is important to do it on held-out samples that were not seen during the grid search process: it is recommended to split the data into a **development set** (to be fed to the :class:`GridSearchCV` instance) and an **evaluation set** to compute performance metrics.
es_es: A la hora de evaluar el modelo resultante, es importante hacerlo sobre las muestras retenidas que no se han visto durante el proceso de búsqueda en cuadrícula: se recomienda dividir los datos en un **conjunto de desarrollo** (para alimentar la instancia :class:`GridSearchCV`) y un **conjunto de evaluación** para calcular las métricas de rendimiento.

source: This can be done by using the :func:`train_test_split` utility function.
es_es: Esto puede hacerse utilizando la función de utilidad :func:`train_test_split`.

source: Parallelism
es_es: Paralelismo

source: The parameter search tools evaluate each parameter combination on each data fold independently. Computations can be run in parallel by using the keyword ``n_jobs=-1``. See function signature for more details, and also the Glossary entry for :term:`n_jobs`.
es_es: Las herramientas de búsqueda de parámetros evalúan cada combinación de parámetros en cada pliegue de datos de forma independiente. Los cálculos pueden ejecutarse en paralelo utilizando la palabra clave ``n_jobs=-1``. Consulta la definición de la función para más detalles, y también la entrada del Glosario para :term:`n_jobs`.

source: Robustness to failure
es_es: Robustez frente a los fallos
