Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/grid_search.po
Languages: es_es

source: Some parameter settings may result in a failure to ``fit`` one or more folds of the data. By default, this will cause the entire search to fail, even if some parameter settings could be fully evaluated. Setting ``error_score=0`` (or `=np.NaN`) will make the procedure robust to such failure, issuing a warning and setting the score for that fold to 0 (or `NaN`), but completing the search.
es_es: Algunos ajustes de los parámetros pueden provocar un fallo en ``fit`` de uno o más pliegues de los datos. Por defecto, esto hará que toda la búsqueda falle, incluso si algunos ajustes de los parámetros pueden ser evaluados completamente. Si se establece ``error_score=0`` (o `=np.NaN`), el procedimiento será más robusto ante este tipo de fallos, emitiendo una advertencia y estableciendo la puntuación para ese pliegue en 0 (o `NaN`), pero completando la búsqueda.

source: Alternatives to brute force parameter search
es_es: Alternativas a la búsqueda de parámetros por fuerza bruta

source: Model specific cross-validation
es_es: Validación cruzada específica del modelo

source: Some models can fit data for a range of values of some parameter almost as efficiently as fitting the estimator for a single value of the parameter. This feature can be leveraged to perform a more efficient cross-validation used for model selection of this parameter.
es_es: Algunos modelos pueden ajustarse a los datos para un rango de valores de algún parámetro casi con la misma eficacia que el ajuste del estimador para un único valor del parámetro. Esta característica puede aprovecharse para realizar una validación cruzada más eficiente utilizada para la selección del modelo de este parámetro.

source: The most common parameter amenable to this strategy is the parameter encoding the strength of the regularizer. In this case we say that we compute the **regularization path** of the estimator.
es_es: El parámetro más común que se presta a esta estrategia es el que codifica la fuerza del regularizador. En este caso decimos que calculamos el **camino de regularización** del estimador.

source: Here is the list of such models:
es_es: Esta es la lista de estos modelos:

source: Elastic Net model with iterative fitting along a regularization path.
es_es: Modelo de Red Elástica con ajuste iterativo a lo largo de una trayectoria de regularización.

source: Cross-validated Least Angle Regression model.
es_es: Modelo de Regresión de Ángulo Mínimo con Validación Cruzada.

source: Lasso linear model with iterative fitting along a regularization path.
es_es: Modelo lineal Lasso con ajuste iterativo a lo largo del camino de regularización.

source: Cross-validated Lasso, using the LARS algorithm.
es_es: Validación cruzada Lasso, utilizando el algoritmo LARS.

source: Logistic Regression CV (aka logit, MaxEnt) classifier.
es_es: Clasificador de Regresión Logística CV (también conocido como logit, MaxEnt).

source: Multi-task L1/L2 ElasticNet with built-in cross-validation.
es_es: ElasticNet multitarea L1/L2 con validación cruzada incorporada.

source: Multi-task Lasso model trained with L1/L2 mixed-norm as regularizer.
es_es: Modelo Lasso multitarea entrenado con la norma mixta L1/L2 como regularizador.

source: Cross-validated Orthogonal Matching Pursuit model (OMP).
es_es: Modelo de búsqueda de correspondencias ortogonales (Orthogonal Matching Pursuit, OMP) con validación cruzada.

source: Ridge regression with built-in cross-validation.
es_es: Regresión de cresta con validación cruzada incorporada.

source: Ridge classifier with built-in cross-validation.
es_es: Clasificador de cresta con validación cruzada incorporada.

source: Information Criterion
es_es: Criterio de Información

source: Some models can offer an information-theoretic closed-form formula of the optimal estimate of the regularization parameter by computing a single regularization path (instead of several when using cross-validation).
es_es: Algunos modelos pueden ofrecer una fórmula de forma cerrada teórica de la información de la estimación óptima del parámetro de regularización mediante el cálculo de un solo camino de regularización (en lugar de varios cuando se utiliza la validación cruzada).

source: Here is the list of models benefiting from the Akaike Information Criterion (AIC) or the Bayesian Information Criterion (BIC) for automated model selection:
es_es: Esta es la lista de modelos que se benefician del Criterio de Información de Akaike (Akaike Information Criterion, AIC) o del Criterio de Información Bayesiano (Criterio de Información Bayesiano, BIC) para la selección automática de modelos:

source: Lasso model fit with Lars using BIC or AIC for model selection
es_es: Ajuste del modelo Lasso con Lars utilizando BIC o AIC para la selección del modelo

source: Out of Bag Estimates
es_es: Estimaciones Fuera de la Bolsa (Out of Bag)

source: When using ensemble methods base upon bagging, i.e. generating new training sets using sampling with replacement, part of the training set remains unused. For each classifier in the ensemble, a different part of the training set is left out.
es_es: Cuando se utilizan métodos de ensemble basados en el empaquetado (bagging), es decir, la generación de nuevos conjuntos de entrenamiento mediante muestreo con reemplazo, parte del conjunto de entrenamiento queda sin utilizar. Para cada clasificador de ensemble, se omite una parte diferente del conjunto de entrenamiento.

source: This left out portion can be used to estimate the generalization error without having to rely on a separate validation set. This estimate comes "for free" as no additional data is needed and can be used for model selection.
es_es: Esta porción omitida puede utilizarse para estimar el error de generalización sin tener que depender de un conjunto de validación separado. Esta estimación es "gratuita", ya que no se necesitan datos adicionales y puede utilizarse para la selección del modelo.

source: This is currently implemented in the following classes:
es_es: Esto está actualmente implementado en las siguientes clases:

source: A random forest classifier.
es_es: Un clasificador de bosque aleatorio.

source: A random forest regressor.
es_es: Un regresor de bosque aleatorio.

source: An extra-trees classifier.
es_es: Un clasificador de árboles extra (extra-trees).

source: An extra-trees regressor.
es_es: Un regresor de árboles extra (extra-trees).

source: Gradient Boosting for classification.
es_es: Potenciación del gradiente para clasificación.

source: Gradient Boosting for regression.
es_es: Potenciación del Gradiente para regresión.
