Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/kernel_approximation.po
Languages: es_es

source: Kernel Approximation
es_es: Aproximación de núcleo

source: This submodule contains functions that approximate the feature mappings that correspond to certain kernels, as they are used for example in support vector machines (see :ref:`svm`). The following feature functions perform non-linear transformations of the input, which can serve as a basis for linear classification or other algorithms.
es_es: Este submódulo contiene funciones que aproximan los mapeos de características que corresponden a ciertos núcleos (kernels), tal y como se utilizan, por ejemplo, en las máquinas de vectores de soporte (véase :ref:`svm`). Las siguientes funciones de características realizan transformaciones no lineales de la entrada, que pueden servir de base para la clasificación lineal u otros algoritmos.

source: The advantage of using approximate explicit feature maps compared to the `kernel trick <https://en.wikipedia.org/wiki/Kernel_trick>`_, which makes use of feature maps implicitly, is that explicit mappings can be better suited for online learning and can significantly reduce the cost of learning with very large datasets. Standard kernelized SVMs do not scale well to large datasets, but using an approximate kernel map it is possible to use much more efficient linear SVMs. In particular, the combination of kernel map approximations with :class:`SGDClassifier` can make non-linear learning on large datasets possible.
es_es: La ventaja de utilizar mapas de características explícitas (explicit feature maps) aproximados en comparación con el truco del núcleo `kernel trick <https://en.wikipedia.org/wiki/Kernel_trick>`_, que hace uso de los mapas de características de forma implícita, es que los mapeos explícitos pueden ser más adecuados para el aprendizaje en línea (online learning) y pueden reducir significativamente el coste del aprendizaje con conjuntos de datos muy grandes. Las SVM de núcleo estándar no se escalan bien en grandes conjuntos de datos, pero utilizando un mapa de núcleo aproximado es posible utilizar SVM lineales mucho más eficientes. En particular, la combinación de aproximaciones del mapa del núcleo con :class:`SGDClassifier` puede hacer posible el aprendizaje no lineal en grandes conjuntos de datos.

source: Since there has not been much empirical work using approximate embeddings, it is advisable to compare results against exact kernel methods when possible.
es_es: Dado que no se han realizado muchos trabajos empíricos utilizando embeddings aproximados, es aconsejable comparar los resultados con los métodos de núcleos exactos cuando sea posible.

source: :ref:`polynomial_regression` for an exact polynomial transformation.
es_es: :ref:`polynomial_regression` para una transformación polinómica exacta.

source: Nystroem Method for Kernel Approximation
es_es: Método Nystroem para la aproximación de núcleos

source: The Nystroem method, as implemented in :class:`Nystroem` is a general method for low-rank approximations of kernels. It achieves this by essentially subsampling the data on which the kernel is evaluated. By default :class:`Nystroem` uses the ``rbf`` kernel, but it can use any kernel function or a precomputed kernel matrix. The number of samples used - which is also the dimensionality of the features computed - is given by the parameter ``n_components``.
es_es: El método Nystroem, tal y como se implementa en :class:`Nystroem` es un método general para aproximaciones de bajo nivel de los núcleos. Lo consigue esencialmente mediante el submuestreo de los datos sobre los que se evalúa el núcleo. Por defecto, :class:`Nystroem` utiliza el kernel ``rbf``, pero puede utilizar cualquier función del kernel o una matriz del kernel precalculada. El número de muestras utilizadas - que es también la dimensionalidad de las características calculadas - viene dado por el parámetro ``n_components``.

source: Radial Basis Function Kernel
es_es: Núcleo de la función de base radial

source: The :class:`RBFSampler` constructs an approximate mapping for the radial basis function kernel, also known as *Random Kitchen Sinks* [RR2007]_. This transformation can be used to explicitly model a kernel map, prior to applying a linear algorithm, for example a linear SVM::
es_es: La :class:`RBFSampler` construye un mapeo aproximado para el núcleo de la función de base radial (radial basis function kernel, RBF), también conocido como *Random Kitchen Sinks* [RR2007]_. Esta transformación puede utilizarse para modelar explícitamente un mapa de núcleo, antes de aplicar un algoritmo lineal, por ejemplo una SVM lineal::

source: The mapping relies on a Monte Carlo approximation to the kernel values. The ``fit`` function performs the Monte Carlo sampling, whereas the ``transform`` method performs the mapping of the data. Because of the inherent randomness of the process, results may vary between different calls to the ``fit`` function.
es_es: El mapeo se basa en una aproximación de Monte Carlo a los valores del núcleo. La función ``fit`` realiza el muestreo de Monte Carlo, mientras que el método ``transform`` realiza el mapeo de los datos. Debido a la aleatoriedad inherente al proceso, los resultados pueden variar entre diferentes llamadas a la función ``fit``.

source: The ``fit`` function takes two arguments: ``n_components``, which is the target dimensionality of the feature transform, and ``gamma``, the parameter of the RBF-kernel. A higher ``n_components`` will result in a better approximation of the kernel and will yield results more similar to those produced by a kernel SVM. Note that "fitting" the feature function does not actually depend on the data given to the ``fit`` function. Only the dimensionality of the data is used. Details on the method can be found in [RR2007]_.
es_es: La función ``fit`` toma dos argumentos: ``n_components``, que es la dimensionalidad objetivo de la transformación de características, y ``gamma``, el parámetro del núcleo RBF. Un ``n_components`` más alto dará lugar a una mejor aproximación del núcleo y producirá resultados más similares a los producidos por un núcleo SVM. Ten en cuenta que el "ajuste" de la función característica no depende realmente de los datos dados a la función ``fit``. Sólo se utiliza la dimensionalidad de los datos. Los detalles del método se pueden encontrar en [RR2007]_.

source: For a given value of ``n_components`` :class:`RBFSampler` is often less accurate as :class:`Nystroem`. :class:`RBFSampler` is cheaper to compute, though, making use of larger feature spaces more efficient.
es_es: Para un valor determinado de ``n_components`` :class:`RBFSampler` suele ser menos preciso que :class:`Nystroem`. Sin embargo, :class:`RBFSampler` es menos costoso de calcular, lo que hace más eficiente el uso de espacios de características más grandes.

source: Comparing an exact RBF kernel (left) with the approximation (right)
es_es: Comparación de un núcleo RBF exacto (izquierda) con la aproximación (derecha)

source: Additive Chi Squared Kernel
es_es: Núcleo aditivo de chi cuadrado

source: The additive chi squared kernel is a kernel on histograms, often used in computer vision.
es_es: El núcleo chi cuadrado aditivo es un núcleo basado en histogramas que se utiliza a menudo en la visión por computadora.

source: The additive chi squared kernel as used here is given by
es_es: El núcleo aditivo de chi-cuadrado utilizado aquí viene dado por

source: This is not exactly the same as :func:`sklearn.metrics.additive_chi2_kernel`. The authors of [VZ2010]_ prefer the version above as it is always positive definite. Since the kernel is additive, it is possible to treat all components :math:`x_i` separately for embedding. This makes it possible to sample the Fourier transform in regular intervals, instead of approximating using Monte Carlo sampling.
es_es: Esto no es exactamente lo mismo que :func:`sklearn.metrics.additive_chi2_kernel`. Los autores de [VZ2010]_ prefieren la versión anterior ya que siempre es definida positiva. Como el núcleo es aditivo, es posible tratar todos los componentes :math:`x_i` por separado para la incrustación (embedding). Esto hace posible muestrear la transformada de Fourier en intervalos regulares, en lugar de aproximar utilizando el muestreo de Monte Carlo.

source: The class :class:`AdditiveChi2Sampler` implements this component wise deterministic sampling. Each component is sampled :math:`n` times, yielding :math:`2n+1` dimensions per input dimension (the multiple of two stems from the real and complex part of the Fourier transform). In the literature, :math:`n` is usually chosen to be 1 or 2, transforming the dataset to size ``n_samples * 5 * n_features`` (in the case of :math:`n=2`).
es_es: La clase :class:`AdditiveChi2Sampler` implementa este muestreo determinista por componentes. Cada componente se muestrea :math:`n` veces, dando lugar a :math:`2n+1` dimensiones por dimensión de entrada (el múltiplo de dos proviene de la parte real y compleja de la transformada de Fourier). En la bibliografía, :math:`n` suele elegirse como 1 o 2, lo que transforma el conjunto de datos en un tamaño de ``n_samples * 5 * n_features`` (en el caso de :math:`n=2`).

source: The approximate feature map provided by :class:`AdditiveChi2Sampler` can be combined with the approximate feature map provided by :class:`RBFSampler` to yield an approximate feature map for the exponentiated chi squared kernel. See the [VZ2010]_ for details and [VVZ2010]_ for combination with the :class:`RBFSampler`.
es_es: El mapa de características aproximado proporcionado por :class:`AdditiveChi2Sampler` puede combinarse con el mapa de características aproximado proporcionado por :class:`RBFSampler` para obtener un mapa de características aproximado para el núcleo de chi cuadrado exponenciado. Véase el documento [VZ2010]_ para más detalles y [VVZ2010]_ para la combinación con la :clase:`RBFSampler`.

source: Skewed Chi Squared Kernel
es_es: Núcleo de chi cuadrado sesgado

source: The skewed chi squared kernel is given by:
es_es: El núcleo de chi cuadrado sesgado viene dado por:

source: It has properties that are similar to the exponentiated chi squared kernel often used in computer vision, but allows for a simple Monte Carlo approximation of the feature map.
es_es: Tiene propiedades similares al núcleo de chi cuadrado exponenciado que se utiliza a menudo en la visión por computadora, pero permite una aproximación simple de Monte Carlo del mapa de características.

source: The usage of the :class:`SkewedChi2Sampler` is the same as the usage described above for the :class:`RBFSampler`. The only difference is in the free parameter, that is called :math:`c`. For a motivation for this mapping and the mathematical details see [LS2010]_.
es_es: El uso del :class:`SkewedChi2Sampler` es el mismo que el descrito anteriormente para el :class:`RBFSampler`. La única diferencia está en el parámetro independiente, que se llama :math:`c`. Para conocer la motivación de este mapeo y los detalles matemáticos, véase [LS2010]_.

source: Polynomial Kernel Approximation via Tensor Sketch
es_es: Aproximación de núcleos polinómicos a través de Tensor Sketch

source: The :ref:`polynomial kernel <polynomial_kernel>` is a popular type of kernel function given by:
es_es: El :ref:`núcleo polinómico <polynomial_kernel>` es un tipo popular de función de núcleo dada por:

source: where:
es_es: donde:

source: ``x``, ``y`` are the input vectors
es_es: ``x``, ``y`` son los vectores de entrada

source: ``d`` is the kernel degree
es_es: ``d`` es el grado (degree) del núcleo

source: Intuitively, the feature space of the polynomial kernel of degree `d` consists of all possible degree-`d` products among input features, which enables learning algorithms using this kernel to account for interactions between features.
es_es: Intuitivamente, el espacio de características del núcleo polinómico de grado `d` consiste en todos los posibles productos de grado `d` entre las características de entrada, lo que permite a los algoritmos de aprendizaje que utilizan este núcleo tener en cuenta las interacciones entre las características.

source: The TensorSketch [PP2013]_ method, as implemented in :class:`PolynomialCountSketch`, is a scalable, input data independent method for polynomial kernel approximation. It is based on the concept of Count sketch [WIKICS]_ [CCF2002]_ , a dimensionality reduction technique similar to feature hashing, which instead uses several independent hash functions. TensorSketch obtains a Count Sketch of the outer product of two vectors (or a vector with itself), which can be used as an approximation of the polynomial kernel feature space. In particular, instead of explicitly computing the outer product, TensorSketch computes the Count Sketch of the vectors and then uses polynomial multiplication via the Fast Fourier Transform to compute the Count Sketch of their outer product.
es_es: El método TensorSketch [PP2013]_, implementado en :class:`PolynomialCountSketch`, es un método escalable e independiente de los datos de entrada para la aproximación de núcleos polinómicos. Se basa en el concepto de Count Sketch [WIKICS]_ [CCF2002]_ , una técnica de reducción de la dimensionalidad similar al feature hashing, que en cambio utiliza varias funciones hash independientes. TensorSketch obtiene un Count Sketch del producto exterior (outer product) de dos vectores (o de un vector consigo mismo), que puede utilizarse como una aproximación del espacio de características del núcleo polinómico. En concreto, en lugar de calcular explícitamente el producto exterior, TensorSketch calcula el Count Sketch de los vectores y luego utiliza la multiplicación polinómica a través de la Transformada Rápida de Fourier para calcular el Count Sketch de su producto exterior.

source: Conveniently, the training phase of TensorSketch simply consists of initializing some random variables. It is thus independent of the input data, i.e. it only depends on the number of input features, but not the data values. In addition, this method can transform samples in :math:`\mathcal{O}(n_{\text{samples}}(n_{\text{features}} + n_{\text{components}} \log(n_{\text{components}})))` time, where :math:`n_{\text{components}}` is the desired output dimension, determined by ``n_components``.
es_es: Convenientemente, la fase de entrenamiento de TensorSketch consiste simplemente en inicializar algunas variables aleatorias. Por tanto, es independiente de los datos de entrada, es decir, sólo depende del número de características de entrada, pero no de los valores de los datos. Además, este método puede transformar muestras en tiempo :math:`\mathcal{O}(n_{\text{samples}}(n_{\text{features}} + n_{\text{components}} \log(n_{\text{components}})))`, donde :math:`n_{\text{components}}` es la dimensión de salida deseada, determinada por ``n_components``.

source: Mathematical Details
es_es: Detalles matemáticos

source: Kernel methods like support vector machines or kernelized PCA rely on a property of reproducing kernel Hilbert spaces. For any positive definite kernel function :math:`k` (a so called Mercer kernel), it is guaranteed that there exists a mapping :math:`\phi` into a Hilbert space :math:`\mathcal{H}`, such that
es_es: Los métodos de núcleo, como las máquinas de vectores soporte o el PCA "kernelizado", se basan en una propiedad de reproducción de los espacios de Hilbert del núcleo. Para cualquier función de núcleo definida positiva :math:`k` (también llamada núcleo de Mercer), se garantiza que existe un mapeo :math:`\phi` en un espacio de Hilbert :math:`\mathcal{H}`, tal que

source: Where :math:`\langle \cdot, \cdot \rangle` denotes the inner product in the Hilbert space.
es_es: Donde :math:`\langle \cdot, \cdot \rangle` indica el producto interno en el espacio Hilbert.

source: If an algorithm, such as a linear support vector machine or PCA, relies only on the scalar product of data points :math:`x_i`, one may use the value of :math:`k(x_i, x_j)`, which corresponds to applying the algorithm to the mapped data points :math:`\phi(x_i)`. The advantage of using :math:`k` is that the mapping :math:`\phi` never has to be calculated explicitly, allowing for arbitrary large features (even infinite).
es_es: Si un algoritmo, tal como una máquina de vectores de soporte lineal o PCA, se basa sólo en el producto escalar de los puntos de datos :math:`x_i`, se puede utilizar el valor de :math:`k(x_i, x_j)`, que corresponde a la aplicación del algoritmo a los puntos de datos mapeados :math:`\phi(x_i)`. La ventaja de utilizar :math:`k` es que el mapeo :math:`\phi` nunca tiene que ser calculado explícitamente, lo que permite características de tamaño arbitrario (incluso infinito).

source: One drawback of kernel methods is, that it might be necessary to store many kernel values :math:`k(x_i, x_j)` during optimization. If a kernelized classifier is applied to new data :math:`y_j`, :math:`k(x_i, y_j)` needs to be computed to make predictions, possibly for many different :math:`x_i` in the training set.
es_es: Una desventaja de los métodos de núcleo es que puede ser necesario almacenar muchos valores de núcleo :math:`k(x_i, x_j)` durante la optimización. Si un clasificador "kernelizado" se aplica a nuevos datos :math:`y_j`, es necesario calcular :math:`k(x_i, y_j)` para hacer predicciones, posiblemente para muchos :math:`x_i` diferentes en el conjunto de entrenamiento.

source: The classes in this submodule allow to approximate the embedding :math:`\phi`, thereby working explicitly with the representations :math:`\phi(x_i)`, which obviates the need to apply the kernel or store training examples.
es_es: Las clases de este submódulo permiten aproximar el embedding :math:`\phi`, trabajando así explícitamente con las representaciones :math:`\phi(x_i)`, lo que evita la necesidad de aplicar el núcleo o almacenar ejemplos de entrenamiento.
