Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/lda_qda.po
Languages: es_es

source: Linear and Quadratic Discriminant Analysis
es_es: Análisis Discriminante Lineal y Cuadrático

source: Linear Discriminant Analysis (:class:`~discriminant_analysis.LinearDiscriminantAnalysis`) and Quadratic Discriminant Analysis (:class:`~discriminant_analysis.QuadraticDiscriminantAnalysis`) are two classic classifiers, with, as their names suggest, a linear and a quadratic decision surface, respectively.
es_es: El análisis lineal de discriminantes (:class:`~discriminant_analysis.LinearDiscriminantAnalysis`) y el análisis discriminante cuadrático (:class:`~discriminant_analysis.QuadraticDiscriminantAnalysis`) son dos clasificadores clásicos que tienen, como su nombre lo indica, una superficie de decisión lineal y cuadrática, respectivamente.

source: These classifiers are attractive because they have closed-form solutions that can be easily computed, are inherently multiclass, have proven to work well in practice, and have no hyperparameters to tune.
es_es: Estos clasificadores son atractivos porque tienen soluciones de forma cerrada que pueden ser calculadas fácilmente, son inherentemente multiclase, se ha demostrado que funcionan bien en la practica, y no tienen hiperparámetros que ajustar.

source: The plot shows decision boundaries for Linear Discriminant Analysis and Quadratic Discriminant Analysis. The bottom row demonstrates that Linear Discriminant Analysis can only learn linear boundaries, while Quadratic Discriminant Analysis can learn quadratic boundaries and is therefore more flexible.
es_es: El gráfico muestra los límites de decisión para el Análisis Discriminante Lineal y el Análisis Discriminante Cuadrático. La fila de abajo demuestra que el Análisis Discriminante Lineal solo puede aprender límites lineales, mientras que el Análisis Discriminante Cuadrático puede aprender límites cuadráticos y es por lo tanto mas flexible.

source: Examples:
es_es: Ejemplos:

source: :ref:`sphx_glr_auto_examples_classification_plot_lda_qda.py`: Comparison of LDA and QDA on synthetic data.
es_es: :ref:`sphx_glr_auto_examples_classification_plot_lda_qda.py`: Comparación de ADL y ADQ en datos sintéticos.

source: Dimensionality reduction using Linear Discriminant Analysis
es_es: Reducción de dimensionalidad usando el Análisis Discriminante Lineal

source: :class:`~discriminant_analysis.LinearDiscriminantAnalysis` can be used to perform supervised dimensionality reduction, by projecting the input data to a linear subspace consisting of the directions which maximize the separation between classes (in a precise sense discussed in the mathematics section below). The dimension of the output is necessarily less than the number of classes, so this is in general a rather strong dimensionality reduction, and only makes sense in a multiclass setting.
es_es: El :class:`~discriminant_analysis.LinearDiscriminantAnalysis` puede ser utilizado para realizar una reducción de dimensionalidad supervisada, mediante la proyección de los datos de entrada a un subespacio lineal consistiendo de las direcciones que maximizen la separación entre las clases (en un sentido preciso discutido en la sección de matemáticas abajo). La dimensión de la salida es necesariamente menor que el número de las clases, por lo que esto es en general una reducción de dimensionalidad bastante fuerte, y solo tiene sentido en un ajustamiento multiclase.

source: This is implemented in the `transform` method. The desired dimensionality can be set using the ``n_components`` parameter. This parameter has no influence on the `fit` and `predict` methods.
es_es: Esto está implementado en el método `transform`. La dimensionalidad deseada puede establecerse usando el parámetro ``n_components``. Este parámetro no tiene influencia en los métodos `fit` y `predict`.

source: :ref:`sphx_glr_auto_examples_decomposition_plot_pca_vs_lda.py`: Comparison of LDA and PCA for dimensionality reduction of the Iris dataset
es_es: :ref:`sphx_glr_auto_examples_decomposition_plot_pca_vs_lda.py`: Comparación de ADL y PCA para la reducción de dimensionalidad del conjunto de datos Iris

source: Mathematical formulation of the LDA and QDA classifiers
es_es: Formulación matemática de los clasificadores ADL y ADQ

source: Both LDA and QDA can be derived from simple probabilistic models which model the class conditional distribution of the data :math:`P(X|y=k)` for each class :math:`k`. Predictions can then be obtained by using Bayes' rule, for each training sample :math:`x \in \mathcal{R}^d`:
es_es: Tanto ADL como ADQ pueden ser derivados de modelos probabilisticos sencillos que modelan la distribución condicionada por la clase de los datos :math:`P(X|y=k)` por cada clase :math:`k`. Las predicciones pueden entonces ser obtenidas usando la regla de Bayes, para cada muestra de entrenamiento :math:`x \in \mathcal{R}^d`:

source: and we select the class :math:`k` which maximizes this posterior probability.
es_es: y seleccionamos la clase :math:`k` que maximiza esta probabilidad posterior.

source: More specifically, for linear and quadratic discriminant analysis, :math:`P(x|y)` is modeled as a multivariate Gaussian distribution with density:
es_es: Más específicamente, para el análisis discriminante lineal y cuadrático, :math:`P(x|y)` está modelado como una distribución Gaussiana multivariante con densidad:

source: where :math:`d` is the number of features.
es_es: donde :math:`d` es el número de características.

source: QDA
es_es: ADQ

source: According to the model above, the log of the posterior is:
es_es: De acuerdo con el modelo anterior, el log del posterior es:

source: where the constant term :math:`Cst` corresponds to the denominator :math:`P(x)`, in addition to other constant terms from the Gaussian. The predicted class is the one that maximises this log-posterior.
es_es: donde el termino constante :math:`Cst` corresponde al denominador :math:`P(x)`, junto a los otros terminos constantes del Gaussiano. La clase predicha es aquella que maximiza este log-posterior.

source: **Relation with Gaussian Naive Bayes**
es_es: **Relación con Bayes ingenuo Gaussiano**

source: If in the QDA model one assumes that the covariance matrices are diagonal, then the inputs are assumed to be conditionally independent in each class, and the resulting classifier is equivalent to the Gaussian Naive Bayes classifier :class:`naive_bayes.GaussianNB`.
es_es: Si en el modelo ADQ uno asumo que las matrices de covarianza son diagonales, entonces se asume que las entradas son condicionalmente independientes en cada clase, y que el clasificador resultante es equivalente al clasificador Bayesiano Ingenuo Gaussiano :class:`naive_bayes.GaussianNB`.

source: LDA
es_es: ADL

source: LDA is a special case of QDA, where the Gaussians for each class are assumed to share the same covariance matrix: :math:`\Sigma_k = \Sigma` for all :math:`k`. This reduces the log posterior to:
es_es: El ADL es un caso especial de ADQ, donde se asume que los Gaussianos de cada clase comparten la misma matriz de covarianza: :math:`\Sigma_k = \Sigma` para todo :math:`k`. Esto reduce el log posterior a:

source: The term :math:`(x-\mu_k)^t \Sigma^{-1} (x-\mu_k)` corresponds to the `Mahalanobis Distance <https://en.wikipedia.org/wiki/Mahalanobis_distance>`_ between the sample :math:`x` and the mean :math:`\mu_k`. The Mahalanobis distance tells how close :math:`x` is from :math:`\mu_k`, while also accounting for the variance of each feature. We can thus interpret LDA as assigning :math:`x` to the class whose mean is the closest in terms of Mahalanobis distance, while also accounting for the class prior probabilities.
es_es: El termino :math:`(x-\mu_k)^t \Sigma^{-1} (x-\mu_k)` corresponde a la Distancia de Mahalanobis <https://es.wikipedia.org/wiki/Distancia_de_Mahalanobis>`_ desde la muestra :math:`x` y la media :math:`\mu_k`. La distancia de Mahalanobis nos dice que tan cerca esta :math:`x` desde :math:`\mu_k`, mientras que se toma en cuenta la varianza de cada característica. Podemos entonces interpretar al ADL como asignar :math:`x` a aquella clase cuya media es la mas cercana en terminos de distancia de Mahalanobis, mientras también se contabilizan las probabilidades previas de la clase.

source: The log-posterior of LDA can also be written [3]_ as:
es_es: El log-posterior de ADL también se puede escribir [3]_ como:

source: where :math:`\omega_k = \Sigma^{-1} \mu_k` and :math:`\omega_{k0} = -\frac{1}{2} \mu_k^t\Sigma^{-1}\mu_k + \log P (y = k)`. These quantities correspond to the `coef_` and `intercept_` attributes, respectively.
es_es: donde :math:`\omega_k = \Sigma^{-1} \mu_k` y :math:`\omega_{k0} = -\frac{1}{2} \mu_k^t\Sigma^{-1}\mu_k + \log P (y = k)`. Estas cantidades corresponden a los atributos `coef_` y `intercept_`, respectivamente.

source: From the above formula, it is clear that LDA has a linear decision surface. In the case of QDA, there are no assumptions on the covariance matrices :math:`\Sigma_k` of the Gaussians, leading to quadratic decision surfaces. See [1]_ for more details.
es_es: De la fórmula anterior, está claro que el ADL tiene una superficie de decisión lineal. En el caso del ADQ, no hay suposiciones sobre las matrices de covarianza :math:`\Sigma_k` de los gaussianos, lo que lleva a superficies cuadráticas de decisión. Ver [1]_ para más detalles.

source: Mathematical formulation of LDA dimensionality reduction
es_es: Formulación matemática de la reducción de dimensionalidad del ADL

source: First note that the K means :math:`\mu_k` are vectors in :math:`\mathcal{R}^d`, and they lie in an affine subspace :math:`H` of dimension at least :math:`K - 1` (2 points lie on a line, 3 points lie on a plane, etc).
es_es: Primero note que la K significa que :math:`\mu_k` son vectores en :math:`\mathcal{R}^d`, y que se encuentran en un subespacio afino :math:`H` de dimensión al menos :math:`K - 1` (2 puntos yacen en una linea, 3 points en un plano, etc).

source: As mentioned above, we can interpret LDA as assigning :math:`x` to the class whose mean :math:`\mu_k` is the closest in terms of Mahalanobis distance, while also accounting for the class prior probabilities. Alternatively, LDA is equivalent to first *sphering* the data so that the covariance matrix is the identity, and then assigning :math:`x` to the closest mean in terms of Euclidean distance (still accounting for the class priors).
es_es: Como se mencionó anteriormente, podemos interpretar ADL como asignar :math:`x` a la clase cuya media :math:`\mu_k` es la mas cercana en terminos de distancia de Mahalanobis, también contabilizando por las probabilidades previas de la clase. Alternativamente, LDA es equivalente a primero *esferificar* los datos para que la matriz de covarianza sea la identidad, luego asignando :math:`x` a la media mas cercana en terminos de distancia Euclidiana (igualmente tomando en cuenta las previas clases).

source: Computing Euclidean distances in this d-dimensional space is equivalent to first projecting the data points into :math:`H`, and computing the distances there (since the other dimensions will contribute equally to each class in terms of distance). In other words, if :math:`x` is closest to :math:`\mu_k` in the original space, it will also be the case in :math:`H`. This shows that, implicit in the LDA classifier, there is a dimensionality reduction by linear projection onto a :math:`K-1` dimensional space.
es_es: Calcular distancias Euclídeas en este espacio d-dimensional es equivalente a primero proyectar los puntos de datos en :math:`H`, y calcular las distancias ahí (ya que las otras dimensiones van a contribuir de manera igual a cada clase en termínos de distancia). En otras palabras, si :math:`k` es el mas cercano a :math:`\mu_k` en el espacio original, también sera el caso en :math:`H`. Esto nos muestra que hay una reducción de dimensionalidad por proyección lineal hacía un espacio de :math:`K-1` dimensiones implícita en el clasificador ADL.

source: We can reduce the dimension even more, to a chosen :math:`L`, by projecting onto the linear subspace :math:`H_L` which maximizes the variance of the :math:`\mu^*_k` after projection (in effect, we are doing a form of PCA for the transformed class means :math:`\mu^*_k`). This :math:`L` corresponds to the ``n_components`` parameter used in the :func:`~discriminant_analysis.LinearDiscriminantAnalysis.transform` method. See [1]_ for more details.
es_es: Podemos reducir la dimensión aún mas, a un :math:`L` elegido, si proyectamos hacia el subespacio lineal :math:`H_L` que maximiza la varianza de :math:`\mu^*_k` después de la proyección (en efecto, estamos haciendo una forma de PCA para las medias de clase transformadas :math:`\mu^*_k`). Este :math:`L` corresponde al parámetro ``n_components`` usado en el método :func:`~discriminant_analysis.LinearDiscriminantAnalysis.transform`. Ver [1]_ para más detalles.

source: Shrinkage and Covariance Estimator
es_es: Estimador de Reducción y Covarianza

source: Shrinkage is a form of regularization used to improve the estimation of covariance matrices in situations where the number of training samples is small compared to the number of features. In this scenario, the empirical sample covariance is a poor estimator, and shrinkage helps improving the generalization performance of the classifier. Shrinkage LDA can be used by setting the ``shrinkage`` parameter of the :class:`~discriminant_analysis.LinearDiscriminantAnalysis` class to 'auto'. This automatically determines the optimal shrinkage parameter in an analytic way following the lemma introduced by Ledoit and Wolf [2]_. Note that currently shrinkage only works when setting the ``solver`` parameter to 'lsqr' or 'eigen'.
es_es: La reducción es una forma de regularización usada para mejorar la estimación de matrices de covarianza en situaciones donde el número de muestras de entrenamiento es pequeño comparado al número de características. En este escenario, la covarianza de muestras empírica es un estimador pobre, y la reducción ayuda a mejorar el rendimiento de generalización del clasificador. El ADL de reducción se puede utilizar estableciendo el parámetro ``shrinkage`` de la clase :class:`~discriminant_analysis.LinearDiscriminantAnalysis` como 'auto'. Esto automáticamente determina que el parámetro óptimo de reducción siguiendo el lemma introducido por Ledoit y Wolf [2]_. Note que por el momento la reducción solo funciona cuando el parámetro ``solver`` esta configurado como 'lsqr' o 'eigen'.

source: The ``shrinkage`` parameter can also be manually set between 0 and 1. In particular, a value of 0 corresponds to no shrinkage (which means the empirical covariance matrix will be used) and a value of 1 corresponds to complete shrinkage (which means that the diagonal matrix of variances will be used as an estimate for the covariance matrix). Setting this parameter to a value between these two extrema will estimate a shrunk version of the covariance matrix.
es_es: El parámetro ``shrinkage`` también puede establecerse manualmente entre 0 y 1. En particular, un valor de 0 corresponde a ninguna reducción (lo cual significa que la matriz de covarianza empírica sera utilizada), y un valor de 1 corresponde a reducción total (lo cual significa que la matriz diagonal de varianzas sera utilizada como un estimado para la matriz de covarianza). Si se pasa un valor entre estos dos extremos a este parámetro, se estimara una versión reducida del matriz de covarianza.

source: The shrinked Ledoit and Wolf estimator of covariance may not always be the best choice. For example if the distribution of the data is normally distributed, the Oracle Shrinkage Approximating estimator :class:`sklearn.covariance.OAS` yields a smaller Mean Squared Error than the one given by Ledoit and Wolf's formula used with shrinkage="auto". In LDA, the data are assumed to be gaussian conditionally to the class. If these assumptions hold, using LDA with the OAS estimator of covariance will yield a better classification accuracy than if Ledoit and Wolf or the empirical covariance estimator is used.
es_es: El estimador de covarianza Ledoit y Wolf reducido quizás no sea siempre la mejor opción. Por ejemplo, si la distribución de lo datos esta normalmente distribuida, el estimador Oracle Shrinkage Approximating :class:`sklearn.covariance.OAS` da un menor error cuadrático medio que el dado por la formula de Ledoit y Wolf usada con shrinkage="auto". En ADL, los datos se presumen que son condicionalmente gaussianos a la clase. Si estos supuestos se cumplen, usar ADL con el estimador de covarianza OAS dará una mejor precisión de clasificación que si se usan los estimadores Lediot y Wolf o de covarianza empírica.

source: The covariance estimator can be chosen using with the ``covariance_estimator`` parameter of the :class:`discriminant_analysis.LinearDiscriminantAnalysis` class. A covariance estimator should have a :term:`fit` method and a ``covariance_`` attribute like all covariance estimators in the :mod:`sklearn.covariance` module.
es_es: El estimador de covarianza se puede escoger utilizando el parámetro ``covariance_estimator`` de la clase :class:`discriminant_analysis.LinearDiscriminantAnalysis`. Un estimador de covarianza debería tener un método :term:`fit` y un atributo ``covariance_`` como todos los estimadores de covarianza en el módulo :mod:`sklearn.covariance`.

source: shrinkage
es_es: reducción

source: :ref:`sphx_glr_auto_examples_classification_plot_lda.py`: Comparison of LDA classifiers with Empirical, Ledoit Wolf and OAS covariance estimator.
es_es: :ref:`sphx_glr_auto_examples_classification_plot_lda.py`: Comparación de los clasificadores ADL con los estimadores de covarianza Empíricos, Ledoit Wolf y OAS.

source: Estimation algorithms
es_es: Algoritmos de estimación

source: Using LDA and QDA requires computing the log-posterior which depends on the class priors :math:`P(y=k)`, the class means :math:`\mu_k`, and the covariance matrices.
es_es: Usar ADL y ADQ requiere calcular el log-posterior que depende en los antecedentes de clase :math:`P(y=k)`, los medios de clase :math:`\mu_k` y las matrices de covarianza.

source: The 'svd' solver is the default solver used for :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`, and it is the only available solver for :class:`~sklearn.discriminant_analysis.QuadraticDiscriminantAnalysis`. It can perform both classification and transform (for LDA). As it does not rely on the calculation of the covariance matrix, the 'svd' solver may be preferable in situations where the number of features is large. The 'svd' solver cannot be used with shrinkage. For QDA, the use of the SVD solver relies on the fact that the covariance matrix :math:`\Sigma_k` is, by definition, equal to :math:`\frac{1}{n - 1} X_k^tX_k = V S^2 V^t` where :math:`V` comes from the SVD of the (centered) matrix: :math:`X_k = U S V^t`. It turns out that we can compute the log-posterior above without having to explictly compute :math:`\Sigma`: computing :math:`S` and :math:`V` via the SVD of :math:`X` is enough. For LDA, two SVDs are computed: the SVD of the centered input matrix :math:`X` and the SVD of the class-wise mean vectors.
es_es: El solucionador 'svd' es el solucionador por defecto utilizado por :class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`, y es el único solucionador disponible para :class:`~sklearn.discriminant_analysis.QuadraticDiscriminantAnalysis`. Puede realizar tanto clasificación como transformación (para ADL). Ya que no se basa en el calculo de la matriz de covarianza, el solucionador 'svd' podría ser preferible en situaciones donde el número de características es grande. El solucionador 'svd' no puede ser utilizado con reducción. Para el ADQ, el uso del solucionador SVD se sostiene en el hecho de que la matriz de covarianza :math:`\Sigma_k` es, por definición, igual a :math:`\frac{1}{n - 1} X_k^tX_k = V S^2 V^t`, donde :math:`V` viene del SVD de la matriz (centrada): :math:`X_k = U S V^t`. Resulta que podemos calcular el log-posterior anterior sin necesitar calcular explícitamente :math:`\Sigma`: calcular :math:`S` y :math:`V` mediante el SVD de :math:`X` es suficiente. Para el ADL, se calculan dos SVD: el SVD de la matríz de entrada centrada :math:`X` y el SVD de los vectores medios por clase.

source: The 'lsqr' solver is an efficient algorithm that only works for classification. It needs to explicitly compute the covariance matrix :math:`\Sigma`, and supports shrinkage and custom covariance estimators. This solver computes the coefficients :math:`\omega_k = \Sigma^{-1}\mu_k` by solving for :math:`\Sigma \omega = \mu_k`, thus avoiding the explicit computation of the inverse :math:`\Sigma^{-1}`.
es_es: El solucionador 'lsqr' es un algoritmo eficiente que sólo funciona para la clasificación. Necesita calcular explicitamente la covarianza de matriz :math:`\Sigma`, y soporta estimadores de reducción y covarianza personalizada. Este solucionador calcula los coeficientes :math:`\omega_k = \Sigma^{-1}\mu_k` resolviendo :math:`\Sigma \omega = \mu_k`, así evitando el calculo explicito de la inversa :math:`\Sigma^{-1}`.

source: The 'eigen' solver is based on the optimization of the between class scatter to within class scatter ratio. It can be used for both classification and transform, and it supports shrinkage. However, the 'eigen' solver needs to compute the covariance matrix, so it might not be suitable for situations with a high number of features.
es_es: El solucionador 'eigen' esta basado en la optimización de la razón entre la dispersión entre clases y la dispersión dentro de clases. Puede ser utilizada tanto para clasificación como transformación, y soporta la reducción. Sin embargo, el solucionador 'eigen' necesita calcular la matriz de covarianza, así que quizás no sea adecuado para situaciones con un gran número de características.
