Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/linear_model.po
Languages: es_es

source: :ref:`RANSAC <ransac_regression>` is faster than :ref:`Theil Sen <theil_sen_regression>` and scales much better with the number of samples.
es_es: :ref:`RANSAC <ransac_regression>` es más rápido que :ref:`Theil Sen <theil_sen_regression>` y se escala mucho mejor con el número de muestras.

source: :ref:`RANSAC <ransac_regression>` will deal better with large outliers in the y direction (most common situation).
es_es: :ref:`RANSAC <ransac_regression>` se ocupará mejor de los valores atípicos grandes en la dirección y (la situación más común).

source: :ref:`Theil Sen <theil_sen_regression>` will cope better with medium-size outliers in the X direction, but this property will disappear in high-dimensional settings.
es_es: :ref:`Theil Sen <theil_sen_regression>` se ocupará mejor de los valores atípicos de tamaño medio en la dirección X, pero esta propiedad desaparecerá en entornos de alta dimensión.

source: When in doubt, use :ref:`RANSAC <ransac_regression>`.
es_es: En caso de duda, utilice :ref:`RANSAC <ransac_regression>`.

source: RANSAC: RANdom SAmple Consensus
es_es: RANSAC: Consenso RANdom SAmple

source: RANSAC (RANdom SAmple Consensus) fits a model from random subsets of inliers from the complete data set.
es_es: RANSAC (RANdom SAmple Consensus) ajusta un modelo a partir de subconjuntos aleatorios de valores típicos del conjunto completo de datos.

source: RANSAC is a non-deterministic algorithm producing only a reasonable result with a certain probability, which is dependent on the number of iterations (see `max_trials` parameter). It is typically used for linear and non-linear regression problems and is especially popular in the field of photogrammetric computer vision.
es_es: RANSAC es un algoritmo no determinista que sólo produce un resultado razonable con una cierta probabilidad, que depende del número de iteraciones (véase el parámetro `max_trials`). Se suele utilizar para problemas de regresión lineal y no lineal y es especialmente popular en el campo de la visión fotogramétrica por computadora.

source: The algorithm splits the complete input sample data into a set of inliers, which may be subject to noise, and outliers, which are e.g. caused by erroneous measurements or invalid hypotheses about the data. The resulting model is then estimated only from the determined inliers.
es_es: El algoritmo divide los datos completos de la muestra de entrada en un conjunto de valores típicos, que pueden estar sujetos a ruido, y valores atípicos, que están causados, por ejemplo, por mediciones erróneas o hipótesis no válidas sobre los datos. A continuación, el modelo resultante se estima sólo a partir de los valores típicos determinados.

source: Details of the algorithm
es_es: Detalles del algoritmo

source: Each iteration performs the following steps:
es_es: Cada iteración realiza los siguientes pasos:

source: Select ``min_samples`` random samples from the original data and check whether the set of data is valid (see ``is_data_valid``).
es_es: Seleccionar muestras aleatorias ``min_samples`` de los datos originales y comprobar si el conjunto de datos es válido (véase ``is_data_valid``).

source: Fit a model to the random subset (``base_estimator.fit``) and check whether the estimated model is valid (see ``is_model_valid``).
es_es: Ajustar un modelo al subconjunto aleatorio (``base_estimator.fit``) y comprobar si el modelo estimado es válido (véase ``is_model_valid``).

source: Classify all data as inliers or outliers by calculating the residuals to the estimated model (``base_estimator.predict(X) - y``) - all data samples with absolute residuals smaller than the ``residual_threshold`` are considered as inliers.
es_es: Clasificar todos los datos como valores típicos o valores atípicos calculando los residuos del modelo estimado (``base_estimator.predict(X) - y``) - todas las muestras de datos con residuos absolutos menores que el ``residual_threshold`` se consideran valores atipicos.

source: Save fitted model as best model if number of inlier samples is maximal. In case the current estimated model has the same number of inliers, it is only considered as the best model if it has better score.
es_es: Guardar el modelo ajustado como el mejor modelo si el número de muestras de valores típicos es máximo. En caso de que el modelo estimado actual tenga el mismo número de valores típicos, sólo se considera como el mejor modelo si tiene mejor puntuación.

source: These steps are performed either a maximum number of times (``max_trials``) or until one of the special stop criteria are met (see ``stop_n_inliers`` and ``stop_score``). The final model is estimated using all inlier samples (consensus set) of the previously determined best model.
es_es: Estos pasos se realizan un número máximo de veces (``max_trials``) o hasta que se cumpla uno de los criterios especiales de parada (ver ``stop_n_inliers`` y ``stop_score``). El modelo final se estima utilizando todas las muestras de valores típicos (conjunto de consenso) del mejor modelo determinado previamente.

source: The ``is_data_valid`` and ``is_model_valid`` functions allow to identify and reject degenerate combinations of random sub-samples. If the estimated model is not needed for identifying degenerate cases, ``is_data_valid`` should be used as it is called prior to fitting the model and thus leading to better computational performance.
es_es: Las funciones ``is_data_valid`` y ``is_model_valid`` permiten identificar y rechazar combinaciones degeneradas de submuestras aleatorias. Si no se necesita el modelo estimado para identificar los casos degenerados, debería utilizarse ``is_data_valid``, ya que se llama antes de ajustar el modelo y, por tanto, se obtiene un mejor rendimiento computacional.

source: https://en.wikipedia.org/wiki/RANSAC
es_es: https://es.wikipedia.org/wiki/RANSAC

source: `"Random Sample Consensus: A Paradigm for Model Fitting with Applications to Image Analysis and Automated Cartography" <https://www.sri.com/sites/default/files/publications/ransac-publication.pdf>`_ Martin A. Fischler and Robert C. Bolles - SRI International (1981)
es_es: :ref:`sphx_glr_auto_examples_linear_model_plot_ransac.py`

source: Theil-Sen estimator: generalized-median-based estimator
es_es: Estimador Theil-Sen: estimador basado en la mediana generalizada

source: The :class:`TheilSenRegressor` estimator uses a generalization of the median in multiple dimensions. It is thus robust to multivariate outliers. Note however that the robustness of the estimator decreases quickly with the dimensionality of the problem. It loses its robustness properties and becomes no better than an ordinary least squares in high dimension.
es_es: El estimador :class:`TheilSenRegressor` utiliza una generalización de la mediana en múltiples dimensiones. Por lo tanto, es robusto a los valores atípicos multivariados. Sin embargo, la robustez del estimador disminuye rápidamente con la dimensionalidad del problema. Pierde sus propiedades de robustez y no es mejor que un mínimo cuadrado ordinario en una dimensión alta.

source: Theoretical considerations
es_es: Consideraciones teóricas

source: :class:`TheilSenRegressor` is comparable to the :ref:`Ordinary Least Squares (OLS) <ordinary_least_squares>` in terms of asymptotic efficiency and as an unbiased estimator. In contrast to OLS, Theil-Sen is a non-parametric method which means it makes no assumption about the underlying distribution of the data. Since Theil-Sen is a median-based estimator, it is more robust against corrupted data aka outliers. In univariate setting, Theil-Sen has a breakdown point of about 29.3% in case of a simple linear regression which means that it can tolerate arbitrary corrupted data of up to 29.3%.
es_es: :class:`TheilSenRegressor` es comparable al :ref:`Mínimos cuadrados ordinarios (OLS) <ordinary_least_squares>` en términos de eficiencia asintótica y como estimador insesgado. En contraste con OLS, Theil-Sen es un método no paramétrico, lo que significa que no hace ninguna suposición sobre la distribución subyacente de los datos. Dado que Theil-Sen es un estimador basado en la mediana, es más robusto frente a los datos corruptos y los valores atípicos. En un entorno univariante, Theil-Sen tiene un punto de ruptura de aproximadamente el 29,3% en el caso de una regresión lineal simple, lo que significa que puede tolerar datos corruptos arbitrarios de hasta el 29,3%.

source: The implementation of :class:`TheilSenRegressor` in scikit-learn follows a generalization to a multivariate linear regression model [#f1]_ using the spatial median which is a generalization of the median to multiple dimensions [#f2]_.
es_es: La implementación de :class:`TheilSenRegressor` en scikit-learn sigue una generalización a un modelo de regresión lineal multivariante [#f1]_ utilizando la mediana espacial que es una generalización de la mediana a múltiples dimensiones [#f2]_.

source: In terms of time and space complexity, Theil-Sen scales according to
es_es: En términos de complejidad temporal y espacial, Theil-Sen escala según

source: which makes it infeasible to be applied exhaustively to problems with a large number of samples and features. Therefore, the magnitude of a subpopulation can be chosen to limit the time and space complexity by considering only a random subset of all possible combinations.
es_es: lo que hace inviable su aplicación exhaustiva a problemas con un gran número de muestras y características. Por lo tanto, la magnitud de una subpoblación puede elegirse para limitar la complejidad temporal y espacial considerando sólo un subconjunto aleatorio de todas las combinaciones posibles.

source: Huber Regression
es_es: Regresión Huber

source: The :class:`HuberRegressor` is different to :class:`Ridge` because it applies a linear loss to samples that are classified as outliers. A sample is classified as an inlier if the absolute error of that sample is lesser than a certain threshold. It differs from :class:`TheilSenRegressor` and :class:`RANSACRegressor` because it does not ignore the effect of the outliers but gives a lesser weight to them.
es_es: El :class:`HuberRegressor` es diferente al :class:`Ridge` porque aplica una pérdida lineal a las muestras que se clasifican como valores atípicos. Una muestra se clasifica como un valor típico si el error absoluto de esa muestra es menor que un determinado umbral. Se diferencia de :class:`TheilSenRegressor` y de :class:`RANSACRegressor` porque no ignora el efecto de los valores atípicos sino que les da un peso menor.

source: The loss function that :class:`HuberRegressor` minimizes is given by
es_es: La función de pérdida que minimiza :class:`HuberRegressor` viene dada por

source: where
es_es: donde

source: It is advised to set the parameter ``epsilon`` to 1.35 to achieve 95% statistical efficiency.
es_es: Se aconseja ajustar el parámetro ``epsilon`` a 1,35 para conseguir una eficacia estadística del 95%.

source: Notes
es_es: Notas

source: The :class:`HuberRegressor` differs from using :class:`SGDRegressor` with loss set to `huber` in the following ways.
es_es: El :class:`HuberRegressor` difiere del uso de :class:`SGDRegressor` con la pérdida establecida en `huber` en los siguientes aspectos.

source: :class:`HuberRegressor` is scaling invariant. Once ``epsilon`` is set, scaling ``X`` and ``y`` down or up by different values would produce the same robustness to outliers as before. as compared to :class:`SGDRegressor` where ``epsilon`` has to be set again when ``X`` and ``y`` are scaled.
es_es: :class:`HuberRegressor` es invariante de la escala. Una vez que ``epsilon`` se establece, escalando ``X`` y ``y`` por diferentes valores produciría la misma robustez a los valores atípicos como antes. en comparación con :class:`SGDRegressor` donde ``epsilon`` tiene que ser establecido de nuevo cuando ``X`` y ``y`` se escalan.

source: :class:`HuberRegressor` should be more efficient to use on data with small number of samples while :class:`SGDRegressor` needs a number of passes on the training data to produce the same robustness.
es_es: : class:`HuberRegressor` debería ser más eficiente para usar en datos con un pequeño número de muestras mientras que :class:`SGDRegressor` necesita varias pasadas en los datos de entrenamiento para producir la misma robustez.

source: Note that this estimator is different from the R implementation of Robust Regression (http://www.ats.ucla.edu/stat/r/dae/rreg.htm) because the R implementation does a weighted least squares implementation with weights given to each sample on the basis of how much the residual is greater than a certain threshold.
es_es: Tenga en cuenta que este estimador es diferente de la implementación de R de la Regresión Robusta (http://www.ats.ucla.edu/stat/r/dae/rreg.htm) porque la implementación de R hace una aplicación de mínimos cuadrados ponderados con pesos dados a cada muestra sobre la base de cuánto el residuo es mayor que un cierto umbral.

source: Polynomial regression: extending linear models with basis functions
es_es: Regresión polinómica: ampliación de los modelos lineales con funciones de base

source: One common pattern within machine learning is to use linear models trained on nonlinear functions of the data. This approach maintains the generally fast performance of linear methods, while allowing them to fit a much wider range of data.
es_es: Un patrón común dentro del aprendizaje automático es utilizar modelos lineales entrenados en funciones no lineales de los datos. Este enfoque mantiene el rendimiento generalmente rápido de los métodos lineales, al tiempo que les permite ajustarse a una gama mucho más amplia de datos.

source: For example, a simple linear regression can be extended by constructing **polynomial features** from the coefficients. In the standard linear regression case, you might have a model that looks like this for two-dimensional data:
es_es: Por ejemplo, una regresión lineal simple puede ampliarse construyendo **funciones polinómicas** a partir de los coeficientes. En el caso de la regresión lineal estándar, se podría tener un modelo como éste para datos bidimensionales:

source: If we want to fit a paraboloid to the data instead of a plane, we can combine the features in second-order polynomials, so that the model looks like this:
es_es: Si queremos ajustar un paraboloide a los datos en lugar de un plano, podemos combinar las características en polinomios de segundo orden, de forma que el modelo tenga este aspecto:

source: The (sometimes surprising) observation is that this is *still a linear model*: to see this, imagine creating a new set of features
es_es: La observación (a veces sorprendente) es que éste es *un modelo lineal*: para verlo, imaginemos que creamos un nuevo conjunto de características

source: With this re-labeling of the data, our problem can be written
es_es: Con este reetiquetado de los datos, nuestro problema se puede escribir

source: We see that the resulting *polynomial regression* is in the same class of linear models we considered above (i.e. the model is linear in :math:`w`) and can be solved by the same techniques. By considering linear fits within a higher-dimensional space built with these basis functions, the model has the flexibility to fit a much broader range of data.
es_es: Vemos que la *regresión polinómica* resultante pertenece a la misma clase de modelos lineales que hemos considerado anteriormente (es decir, el modelo es lineal en :math:`w`) y puede resolverse con las mismas técnicas. Al considerar los ajustes lineales dentro de un espacio de mayor dimensión construido con estas funciones base, el modelo tiene la flexibilidad de ajustarse a una gama de datos mucho más amplia.

source: Here is an example of applying this idea to one-dimensional data, using polynomial features of varying degrees:
es_es: He aquí un ejemplo de aplicación de esta idea a datos unidimensionales, utilizando funciones polinómicas de distintos grados:

source: This figure is created using the :class:`PolynomialFeatures` transformer, which transforms an input data matrix into a new data matrix of a given degree. It can be used as follows::
es_es: Esta figura se crea utilizando el transformador :class:`PolynomialFeatures`, que transforma una matriz de datos de entrada en una nueva matriz de datos de un grado determinado. Se puede utilizar de la siguiente manera::

source: The features of ``X`` have been transformed from :math:`[x_1, x_2]` to :math:`[1, x_1, x_2, x_1^2, x_1 x_2, x_2^2]`, and can now be used within any linear model.
es_es: Las características de ``X`` se han transformado de :math:`[x_1, x_2]` a :math:`[1, x_1, x_2, x_1^2, x_1 x_2, x_2^2]`, y ahora pueden utilizarse dentro de cualquier modelo lineal.

source: This sort of preprocessing can be streamlined with the :ref:`Pipeline <pipeline>` tools. A single object representing a simple polynomial regression can be created and used as follows::
es_es: Este tipo de preprocesamiento puede agilizarse con las herramientas :ref:`Pipeline <pipeline>`. Un único objeto que representa una regresión polinómica simple puede crearse y utilizarse de la siguiente manera::

source: The linear model trained on polynomial features is able to exactly recover the input polynomial coefficients.
es_es: El modelo lineal entrenado en características polinómicas es capaz de recuperar exactamente los coeficientes polinómicos de entrada.

source: In some cases it's not necessary to include higher powers of any single feature, but only the so-called *interaction features* that multiply together at most :math:`d` distinct features. These can be gotten from :class:`PolynomialFeatures` with the setting ``interaction_only=True``.
es_es: En algunos casos no es necesario incluir las potencias más altas de ninguna característica, sino sólo las llamadas *características de interacción* que multiplican a lo sumo :math:`d` características distintas. Estas pueden obtenerse de :class:`PolynomialFeatures` con el ajuste ``interaction_only=True``.

source: For example, when dealing with boolean features, :math:`x_i^n = x_i` for all :math:`n` and is therefore useless; but :math:`x_i x_j` represents the conjunction of two booleans. This way, we can solve the XOR problem with a linear classifier::
es_es: Por ejemplo, cuando se trata de características booleanas, :math:`x_i^n = x_i` para todos los :math:`n` y, por tanto, es inútil; pero :math:`x_i x_j` representa la conjunción de dos booleanos. De este modo, podemos resolver el problema XOR con un clasificador lineal::

source: And the classifier "predictions" are perfect::
es_es: Y las "predicciones" del clasificador son perfectas::
