Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/linear_model.po
Languages: es_es

source: Linear Models
es_es: Modelos lineales

source: The following are a set of methods intended for regression in which the target value is expected to be a linear combination of the features. In mathematical notation, if :math:`\hat{y}` is the predicted value.
es_es: Los siguientes son un conjunto de métodos destinados a la regresión en el que se espera que el valor objetivo sea una combinación lineal de las características. En notación matemática, si :math:`\hat{y}` es el valor predicho.

source: Across the module, we designate the vector :math:`w = (w_1, ..., w_p)` as ``coef_`` and :math:`w_0` as ``intercept_``.
es_es: En el módulo, designamos el vector :math:`w = (w_1, ..., w_p)` como ``coef_`` y :math:`w_0` como ``intercept_``.

source: To perform classification with generalized linear models, see :ref:`Logistic_regression`.
es_es: Para realizar la clasificación con modelos lineales generalizados, véase :ref:`Logistic_regression`.

source: Ordinary Least Squares
es_es: Mínimos Cuadrados Ordinarios

source: :class:`LinearRegression` fits a linear model with coefficients :math:`w = (w_1, ..., w_p)` to minimize the residual sum of squares between the observed targets in the dataset, and the targets predicted by the linear approximation. Mathematically it solves a problem of the form:
es_es: :class:`LinearRegression` se ajusta a un modelo lineal con coeficientes :math:`w = (w_1, ... w_p)` para minimizar la suma residual de cuadrados entre los objetivos observados en el conjunto de datos, y los objetivos predichos por la aproximación lineal. Matemáticamente resuelve un problema de la forma:

source: :class:`LinearRegression` will take in its ``fit`` method arrays X, y and will store the coefficients :math:`w` of the linear model in its ``coef_`` member::
es_es: :class:`LinearRegression` tomará en su método ``fit`` las matrices X, y y almacenará los coeficientes :math:`w` del modelo lineal en su miembro ``coef_``::

source: The coefficient estimates for Ordinary Least Squares rely on the independence of the features. When features are correlated and the columns of the design matrix :math:`X` have an approximate linear dependence, the design matrix becomes close to singular and as a result, the least-squares estimate becomes highly sensitive to random errors in the observed target, producing a large variance. This situation of *multicollinearity* can arise, for example, when data are collected without an experimental design.
es_es: Las estimaciones de los coeficientes de los Mínimos Cuadrados Ordinarios se basan en la independencia de las características. Cuando las características están correlacionadas y las columnas de la matriz de diseño :math:`X` tienen una dependencia lineal aproximada, la matriz de diseño se vuelve casi singular y, como resultado, la estimación por mínimos cuadrados se vuelve muy sensible a los errores aleatorios en el objetivo observado, produciendo una gran varianza. Esta situación de *colinealidad múltiple* puede surgir, por ejemplo, cuando los datos se recogen sin un diseño experimental.

source: Non-Negative Least Squares
es_es: Mínimos Cuadrados No-Negativos

source: It is possible to constrain all the coefficients to be non-negative, which may be useful when they represent some physical or naturally non-negative quantities (e.g., frequency counts or prices of goods). :class:`LinearRegression` accepts a boolean ``positive`` parameter: when set to `True` `Non Negative Least Squares <https://en.wikipedia.org/wiki/Non-negative_least_squares>`_ are then applied.
es_es: Es posible restringir todos los coeficientes para que sean no negativos, lo que puede ser útil cuando representan algunas cantidades físicas o naturalmente no negativas (por ejemplo, recuentos de frecuencia o precios de bienes). :class:`LinearRegression` acepta un parámetro booleano ``positive``: cuando se establece en `True` se aplican entonces los `Mínimos Cuadrados No Negativos <https://en.wikipedia.org/wiki/Non-negative_least_squares>`_.

source: Ordinary Least Squares Complexity
es_es: Complejidad de Mínimos Cuadrados Ordinarios

source: The least squares solution is computed using the singular value decomposition of X. If X is a matrix of shape `(n_samples, n_features)` this method has a cost of :math:`O(n_{\text{samples}} n_{\text{features}}^2)`, assuming that :math:`n_{\text{samples}} \geq n_{\text{features}}`.
es_es: La solución de mínimos cuadrados se calcula utilizando la descomposición del valor singular de X. Si X es una matriz de la forma`(n_samples, n_features)` este método tiene un costo de :math:`O(n_{\text{samples}} n_{\text{features}}^2)`, asumiendo que :math:`n_{\text{samples}} \geq n_{\text{features}}`.

source: Ridge regression and classification
es_es: Regresión de cresta y clasificación

source: Regression
es_es: Regresión

source: :class:`Ridge` regression addresses some of the problems of :ref:`ordinary_least_squares` by imposing a penalty on the size of the coefficients. The ridge coefficients minimize a penalized residual sum of squares:
es_es: La regresión de cresta aborda algunos de los problemas de los mínimos cuadrados ordinarios imponiendo una penalización al tamaño de los coeficientes. Los coeficientes de cresta minimizan una suma residual penalizada de cuadrados:

source: The complexity parameter :math:`\alpha \geq 0` controls the amount of shrinkage: the larger the value of :math:`\alpha`, the greater the amount of shrinkage and thus the coefficients become more robust to collinearity.
es_es: El parámetro de complejidad :math:`\alpha \geq 0` controla la cantidad de contracción: cuanto mayor sea el valor de :math:`\alpha`, mayor será la cantidad de contracción y, por tanto, los coeficientes serán más robustos a la colinealidad.

source: As with other linear models, :class:`Ridge` will take in its ``fit`` method arrays X, y and will store the coefficients :math:`w` of the linear model in its ``coef_`` member::
es_es: Al igual que con otros modelos lineales, :class:`Ridge` tomará en su método ``fit`` las matrices X, y y almacenará los coeficientes :math:`w` del modelo lineal en su miembro ``coef_``::

source: Classification
es_es: Clasificación

source: The :class:`Ridge` regressor has a classifier variant: :class:`RidgeClassifier`. This classifier first converts binary targets to ``{-1, 1}`` and then treats the problem as a regression task, optimizing the same objective as above. The predicted class corresponds to the sign of the regressor's prediction. For multiclass classification, the problem is treated as multi-output regression, and the predicted class corresponds to the output with the highest value.
es_es: El regresor :class:`Ridge` tiene una variante de clasificador: :class:`RidgeClassifier`. Este clasificador primero convierte los objetivos binarios a ``{-1, 1}`` y luego trata el problema como una tarea de regresión, optimizando el mismo objetivo que el anterior. La clase predicha corresponde al signo de la predicción del regresor. Para la clasificación multiclase, el problema se trata como una regresión con salida múltiple, y la clase predicha corresponde a la salida con el valor más alto.

source: It might seem questionable to use a (penalized) Least Squares loss to fit a classification model instead of the more traditional logistic or hinge losses. However in practice all those models can lead to similar cross-validation scores in terms of accuracy or precision/recall, while the penalized least squares loss used by the :class:`RidgeClassifier` allows for a very different choice of the numerical solvers with distinct computational performance profiles.
es_es: Podría parecer cuestionable utilizar una pérdida de mínimos cuadrados (penalizada) para ajustar un modelo de clasificación en lugar de las pérdidas logísticas o de bisagra más tradicionales. Sin embargo, en la práctica todos esos modelos pueden conducir a puntuaciones de validación cruzada similares en términos de exactitud o precisión/recuperación, mientras que la pérdida de mínimos cuadrados penalizada utilizada por el :class:`RidgeClassifier` permite una elección muy diferente de los solucionadores numéricos con distintos perfiles de rendimiento computacional.

source: The :class:`RidgeClassifier` can be significantly faster than e.g. :class:`LogisticRegression` with a high number of classes, because it is able to compute the projection matrix :math:`(X^T X)^{-1} X^T` only once.
es_es: El :class:`RidgeClassifier` puede ser significativamente más rápido que, por ejemplo, :class:`LogisticRegression` con un elevado número de clases, porque es capaz de calcular la matriz de proyección :math:`(X^T X)^{-1} X^T` sólo una vez.

source: This classifier is sometimes referred to as a `Least Squares Support Vector Machines <https://en.wikipedia.org/wiki/Least-squares_support-vector_machine>`_ with a linear kernel.
es_es: Este clasificador se denomina a veces `Máquinas de vectores de soporte de mínimos cuadrados <https://en.wikipedia.org/wiki/Least-squares_support-vector_machine>`_ con un núcleo lineal.

source: Ridge Complexity
es_es: Complejidad cresta

source: This method has the same order of complexity as :ref:`ordinary_least_squares`.
es_es: Este método tiene el mismo orden de complejidad que :ref:`ordinary_least_squares`.

source: Setting the regularization parameter: leave-one-out Cross-Validation
es_es: Ajuste del parámetro de regularización: Validación cruzada con exclusión (leave-one-out)

source: :class:`RidgeCV` implements ridge regression with built-in cross-validation of the alpha parameter. The object works in the same way as GridSearchCV except that it defaults to Leave-One-Out Cross-Validation::
es_es: :class:`RidgeCV` implementa la regresión de cresta con validación cruzada incorporada del parámetro alfa. El objeto funciona de la misma manera que GridSearchCV, excepto que por defecto utiliza la validación cruzada con exclusión::

source: Specifying the value of the :term:`cv` attribute will trigger the use of cross-validation with :class:`~sklearn.model_selection.GridSearchCV`, for example `cv=10` for 10-fold cross-validation, rather than Leave-One-Out Cross-Validation.
es_es: Si se especifica el valor del atributo :term:`cv` se activará el uso de la validación cruzada con :class:`~sklearn.model_selection.GridSearchCV`, por ejemplo `cv=10` para la validación cruzada de 10 veces, en lugar de la validación cruzada Leave-One-Out.

source: "Notes on Regularized Least Squares", Rifkin & Lippert (`technical report <http://cbcl.mit.edu/publications/ps/MIT-CSAIL-TR-2007-025.pdf>`_, `course slides <https://www.mit.edu/~9.520/spring07/Classes/rlsslides.pdf>`_).
es_es: "Notes on Regularized Least Squares", Rifkin & Lippert (`reporte técnico <http://cbcl.mit.edu/publications/ps/MIT-CSAIL-TR-2007-025.pdf>`_, `láminas del curso <https://www.mit.edu/~9.520/spring07/Classes/rlsslides.pdf>`_).

source: The :class:`Lasso` is a linear model that estimates sparse coefficients. It is useful in some contexts due to its tendency to prefer solutions with fewer non-zero coefficients, effectively reducing the number of features upon which the given solution is dependent. For this reason Lasso and its variants are fundamental to the field of compressed sensing. Under certain conditions, it can recover the exact set of non-zero coefficients (see :ref:`sphx_glr_auto_examples_applications_plot_tomography_l1_reconstruction.py`).
es_es: El :clase:`Lasso` es un modelo lineal que estima coeficientes dispersos. Es útil en algunos contextos debido a su tendencia a preferir soluciones con menos coeficientes distintos de cero, reduciendo efectivamente el número de características de las que depende la solución dada. Por esta razón, Lasso y sus variantes son fundamentales en el campo de la detección comprimida. Bajo ciertas condiciones, puede recuperar el conjunto exacto de coeficientes no nulos (ver :ref:`sphx_glr_auto_examples_applications_plot_tomography_l1_reconstruction.py`).

source: Mathematically, it consists of a linear model with an added regularization term. The objective function to minimize is:
es_es: Matemáticamente, consiste en un modelo lineal con un término de regularización añadido. La función objetivo a minimizar es:

source: The lasso estimate thus solves the minimization of the least-squares penalty with :math:`\alpha ||w||_1` added, where :math:`\alpha` is a constant and :math:`||w||_1` is the :math:`\ell_1`-norm of the coefficient vector.
es_es: La estimación lasso resuelve así la minimización de la penalización por mínimos cuadrados con :math:`\alpha ||w|_1` añadido, donde :math:`\alpha` es una constante y :math:`|w||_1` es la norma :math:`\ell_1` del vector de coeficientes.

source: The implementation in the class :class:`Lasso` uses coordinate descent as the algorithm to fit the coefficients. See :ref:`least_angle_regression` for another implementation::
es_es: La implementación en la clase :class:`Lasso` utiliza el descenso por coordenadas como algoritmo para ajustar los coeficientes. Véase :ref:`least_angle_regression` para otra implementación::

source: The function :func:`lasso_path` is useful for lower-level tasks, as it computes the coefficients along the full path of possible values.
es_es: La función :func:`lasso_path` es útil para tareas de nivel inferior, ya que calcula los coeficientes a lo largo de todo el recorrido de valores posibles.

source: **Feature selection with Lasso**
es_es: **Selección de características con Lasso**

source: As the Lasso regression yields sparse models, it can thus be used to perform feature selection, as detailed in :ref:`l1_feature_selection`.
es_es: Como la regresión Lasso produce modelos dispersos, puede utilizarse para realizar la selección de características, como se detalla en :ref:`l1_feature_selection`.

source: The following two references explain the iterations used in the coordinate descent solver of scikit-learn, as well as the duality gap computation used for convergence control.
es_es: Las siguientes dos referencias explican las iteraciones utilizadas en el solucionador de descenso de coordenadas de scikit-learn, así como el cálculo de la brecha de dualidad utilizado para el control de la convergencia.

source: "An Interior-Point Method for Large-Scale L1-Regularized Least Squares," S. J. Kim, K. Koh, M. Lustig, S. Boyd and D. Gorinevsky, in IEEE Journal of Selected Topics in Signal Processing, 2007 (`Paper <https://web.stanford.edu/~boyd/papers/pdf/l1_ls.pdf>`__)
es_es: "An Interior-Point Method for Large-Scale L1-Regularized Least Squares," S. J. Kim, K. Koh, M. Lustig, S. Boyd and D. Gorinevsky, en IEEE Journal of Selected Topics in Signal Processing, 2007 (`Paper <https://web.stanford.edu/~boyd/papers/pdf/l1_ls.pdf>`__)

source: Setting regularization parameter
es_es: Ajuste del parámetro de regularización

source: The ``alpha`` parameter controls the degree of sparsity of the estimated coefficients.
es_es: El parámetro ``alpha`` controla el grado de dispersión de los coeficientes estimados.

source: Using cross-validation
es_es: Utilizando validación cruzada

source: scikit-learn exposes objects that set the Lasso ``alpha`` parameter by cross-validation: :class:`LassoCV` and :class:`LassoLarsCV`. :class:`LassoLarsCV` is based on the :ref:`least_angle_regression` algorithm explained below.
es_es: scikit-learn expone objetos que establecen el parámetro ``alpha`` de Lasso por validación cruzada: :class:`LassoCV` y :class:`LassoLarsCV`. :class:`LassoLarsCV` se basa en el algoritmo :ref:`least_angle_regression` que se explica a continuación.

source: For high-dimensional datasets with many collinear features, :class:`LassoCV` is most often preferable. However, :class:`LassoLarsCV` has the advantage of exploring more relevant values of `alpha` parameter, and if the number of samples is very small compared to the number of features, it is often faster than :class:`LassoCV`.
es_es: Para conjuntos de datos de alta dimensión con muchas características colineales, :class:`LassoCV` suele ser preferible. Sin embargo, :class:`LassoLarsCV` tiene la ventaja de explorar valores más relevantes del parámetro `alpha`, y si el número de muestras es muy pequeño comparado con el número de características, suele ser más rápido que :class:`LassoCV`.

source: Information-criteria based model selection
es_es: Selección de modelos basada en criterios de información

source: Alternatively, the estimator :class:`LassoLarsIC` proposes to use the Akaike information criterion (AIC) and the Bayes Information criterion (BIC). It is a computationally cheaper alternative to find the optimal value of alpha as the regularization path is computed only once instead of k+1 times when using k-fold cross-validation. However, such criteria needs a proper estimation of the degrees of freedom of the solution, are derived for large samples (asymptotic results) and assume the model is correct, i.e. that the data are actually generated by this model. They also tend to break when the problem is badly conditioned (more features than samples).
es_es: Como alternativa, el estimador :class:`LassoLarsIC` propone utilizar el criterio de información de Akaike (AIC) y el criterio de información de Bayes (BIC). Se trata de una alternativa computacionalmente más barata para encontrar el valor óptimo de alfa, ya que el camino de regularización se calcula sólo una vez en lugar de k+1 veces cuando se utiliza la validación cruzada k-fold. Sin embargo, estos criterios necesitan una estimación adecuada de los grados de libertad de la solución, se derivan para muestras grandes (resultados asintóticos) y suponen que el modelo es correcto, es decir, que los datos son realmente generados por este modelo. También tienden a fallar cuando el problema está mal condicionado (más características que muestras).

source: Comparison with the regularization parameter of SVM
es_es: Comparación con el parámetro de regularización de SVM

source: The equivalence between ``alpha`` and the regularization parameter of SVM, ``C`` is given by ``alpha = 1 / C`` or ``alpha = 1 / (n_samples * C)``, depending on the estimator and the exact objective function optimized by the model.
es_es: La equivalencia entre ``alpha`` y el parámetro de regularización de SVM, ``C`` viene dada por ``alpha = 1 / C`` o ``alpha = 1 / (n/samples * C)``, dependiendo del estimador y de la función objetivo exacta optimizada por el modelo.

source: Multi-task Lasso
es_es: Lasso multitarea

source: The :class:`MultiTaskLasso` is a linear model that estimates sparse coefficients for multiple regression problems jointly: ``y`` is a 2D array, of shape ``(n_samples, n_tasks)``. The constraint is that the selected features are the same for all the regression problems, also called tasks.
es_es: La :clase:`MultiTaskLasso` es un modelo lineal que estima coeficientes dispersos para problemas de regresión múltiple de forma conjunta: ``y`` es un arreglo 2D, de forma ``(n_samples, n_tasks)``. La restricción es que las características seleccionadas son las mismas para todos los problemas de regresión, también llamados tareas.

source: The following figure compares the location of the non-zero entries in the coefficient matrix W obtained with a simple Lasso or a MultiTaskLasso. The Lasso estimates yield scattered non-zeros while the non-zeros of the MultiTaskLasso are full columns.
es_es: La siguiente figura compara la ubicación de las entradas no nulas en la matriz de coeficientes W obtenida con un Lasso simple o un MultiTaskLasso. Las estimaciones de Lasso producen no ceros dispersos mientras que los no ceros del MultiTaskLasso son columnas completas.

source: Fitting a time-series model, imposing that any active feature be active at all times.
es_es: Ajustar un modelo de serie de tiempo, imponiendo que cualquier característica activa esté presente en todo momento.

source: Mathematically, it consists of a linear model trained with a mixed :math:`\ell_1` :math:`\ell_2`-norm for regularization. The objective function to minimize is:
es_es: Matemáticamente, consiste en un modelo lineal entrenado con una norma mixta :math:`\ell_1` :math:`\ell_2` para la regularización. La función objetivo a minimizar es:

source: where :math:`\text{Fro}` indicates the Frobenius norm
es_es: donde :math:`\text{Fro}` indica la norma de Frobenius

source: and :math:`\ell_1` :math:`\ell_2` reads
es_es: y :math:`\ell_1` :math:`\ell_2` se lee

source: The implementation in the class :class:`MultiTaskLasso` uses coordinate descent as the algorithm to fit the coefficients.
es_es: La implementación en la clase :class:`MultiTaskLasso` utiliza el descenso de coordenadas como algoritmo para ajustar los coeficientes.

source: :class:`ElasticNet` is a linear regression model trained with both :math:`\ell_1` and :math:`\ell_2`-norm regularization of the coefficients. This combination allows for learning a sparse model where few of the weights are non-zero like :class:`Lasso`, while still maintaining the regularization properties of :class:`Ridge`. We control the convex combination of :math:`\ell_1` and :math:`\ell_2` using the ``l1_ratio`` parameter.
es_es: La clase :class:`ElasticNet` es un modelo de regresión lineal entrenado con la regularización de los coeficientes mediante las normas :math:`\ell_1` y :math:`\ell_2`. Esta combinación permite aprender un modelo disperso en el que pocos pesos son distintos de cero, como en :class:`Lasso`, pero manteniendo las propiedades de regularización de :class:`Ridge`. Controlamos la combinación convexa de :math:`\ell_1` y :math:`\ell_2` utilizando el parámetro ``l1_ratio``.

source: Elastic-net is useful when there are multiple features which are correlated with one another. Lasso is likely to pick one of these at random, while elastic-net is likely to pick both.
es_es: Elastic-net es útil cuando hay múltiples características que están correlacionadas entre sí. Lasso es probable que elija una de ellas al azar, mientras que elastic-net es probable que elija ambas.

source: A practical advantage of trading-off between Lasso and Ridge is that it allows Elastic-Net to inherit some of Ridge's stability under rotation.
es_es: Una ventaja práctica del intercambio entre Lasso y Cresta es que permite que Elastic-Net herede parte de la estabilidad de Cresta bajo la rotación.

source: The objective function to minimize is in this case
es_es: La función objetivo a minimizar es en este caso

source: The class :class:`ElasticNetCV` can be used to set the parameters ``alpha`` (:math:`\alpha`) and ``l1_ratio`` (:math:`\rho`) by cross-validation.
es_es: La clase :class:`ElasticNetCV` puede utilizarse para establecer los parámetros ``alpha`` (:math:`\alpha`) y ``l1_ratio`` (:math:`\rho`) mediante validación cruzada.

source: Multi-task Elastic-Net
es_es: Elastic-Net multitarea

source: The :class:`MultiTaskElasticNet` is an elastic-net model that estimates sparse coefficients for multiple regression problems jointly: ``Y`` is a 2D array of shape ``(n_samples, n_tasks)``. The constraint is that the selected features are the same for all the regression problems, also called tasks.
es_es: El :class:`MultiTaskElasticNet` es un modelo de red elástica que estima coeficientes dispersos para problemas de regresión múltiple de forma conjunta: ``Y`` es una arreglo 2D de forma ``(n_samples, n_tasks)``. La restricción es que las características seleccionadas son las mismas para todos los problemas de regresión, también llamados tareas.

source: Mathematically, it consists of a linear model trained with a mixed :math:`\ell_1` :math:`\ell_2`-norm and :math:`\ell_2`-norm for regularization. The objective function to minimize is:
es_es: Matemáticamente, consiste en un modelo lineal entrenado con una norma mixta :math:`\ell_1` :math:`\ell_2 y una norma :math:`\ell_2` para la regularización. La función objetivo a minimizar es:
