Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/linear_model.po
Languages: es_es

source: The implementation in the class :class:`MultiTaskElasticNet` uses coordinate descent as the algorithm to fit the coefficients.
es_es: La implementación en la clase :class:`MultiTaskElasticNet` utiliza el descenso por coordenadas como algoritmo para ajustar los coeficientes.

source: The class :class:`MultiTaskElasticNetCV` can be used to set the parameters ``alpha`` (:math:`\alpha`) and ``l1_ratio`` (:math:`\rho`) by cross-validation.
es_es: La clase :class:`MultiTaskElasticNetCV` puede utilizarse para establecer los parámetros ``alpha`` (:math:`\alpha`) y ``l1_ratio`` (:math:`\rho`) mediante validación cruzada.

source: Least Angle Regression
es_es: Regresión de ángulo mínimo

source: Least-angle regression (LARS) is a regression algorithm for high-dimensional data, developed by Bradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani. LARS is similar to forward stepwise regression. At each step, it finds the feature most correlated with the target. When there are multiple features having equal correlation, instead of continuing along the same feature, it proceeds in a direction equiangular between the features.
es_es: La regresión de ángulo mínimo (LARS) es un algoritmo de regresión para datos de alta dimensión, desarrollado por Bradley Efron, Trevor Hastie, Iain Johnstone y Robert Tibshirani. LARS es similar a la regresión escalonada. En cada paso, encuentra la característica más correlacionada con el objetivo. Cuando hay varias características que tienen la misma correlación, en lugar de continuar a lo largo de la misma característica, procede en una dirección equiangular entre las características.

source: The advantages of LARS are:
es_es: Las ventajas de LARS son:

source: It is numerically efficient in contexts where the number of features is significantly greater than the number of samples.
es_es: Es numéricamente eficiente en contextos donde el número de características es significativamente mayor que el número de muestras.

source: It is computationally just as fast as forward selection and has the same order of complexity as ordinary least squares.
es_es: Es computacionalmente tan rápido como la selección directa y tiene el mismo orden de complejidad que los mínimos cuadrados ordinarios.

source: It produces a full piecewise linear solution path, which is useful in cross-validation or similar attempts to tune the model.
es_es: Produce una ruta de solución lineal completa a trozos, que es útil en la validación cruzada o en intentos similares de ajustar el modelo.

source: If two features are almost equally correlated with the target, then their coefficients should increase at approximately the same rate. The algorithm thus behaves as intuition would expect, and also is more stable.
es_es: Si dos características están casi igualmente correlacionadas con el objetivo, sus coeficientes deberían aumentar aproximadamente al mismo ritmo. Así, el algoritmo se comporta como la intuición espera, y además es más estable.

source: It is easily modified to produce solutions for other estimators, like the Lasso.
es_es: Se puede modificar fácilmente para producir soluciones para otros estimadores, como el Lasso.

source: The disadvantages of the LARS method include:
es_es: Las desventajas del método LARS son:

source: Because LARS is based upon an iterative refitting of the residuals, it would appear to be especially sensitive to the effects of noise. This problem is discussed in detail by Weisberg in the discussion section of the Efron et al. (2004) Annals of Statistics article.
es_es: Dado que el LARS se basa en un reajuste iterativo de los residuos, parece ser especialmente sensible a los efectos del ruido. Este problema es discutido en detalle por Weisberg en la sección de discusión del artículo de Efron et al. (2004) Annals of Statistics.

source: The LARS model can be used using estimator :class:`Lars`, or its low-level implementation :func:`lars_path` or :func:`lars_path_gram`.
es_es: El modelo LARS puede emplearse utilizando el estimador :class:`Lars`, o su implementación de bajo nivel :func:`lars_path` o :func:`lars_path_gram`.

source: :class:`LassoLars` is a lasso model implemented using the LARS algorithm, and unlike the implementation based on coordinate descent, this yields the exact solution, which is piecewise linear as a function of the norm of its coefficients.
es_es: :class:`LassoLars` es un modelo lasso implementado mediante el algoritmo LARS, y a diferencia de la implementación basada en el descenso de coordenadas, éste proporciona la solución exacta, que es lineal a trozos en función de la norma de sus coeficientes.

source: The Lars algorithm provides the full path of the coefficients along the regularization parameter almost for free, thus a common operation is to retrieve the path with one of the functions :func:`lars_path` or :func:`lars_path_gram`.
es_es: El algoritmo Lars proporciona la trayectoria completa de los coeficientes a lo largo del parámetro de regularización casi sin esfuerzo, por lo que una operación común es recuperar la trayectoria con una de las funciones :func:`lars_path` o :func:`lars_path_gram`.

source: Mathematical formulation
es_es: Formulación matemática

source: The algorithm is similar to forward stepwise regression, but instead of including features at each step, the estimated coefficients are increased in a direction equiangular to each one's correlations with the residual.
es_es: El algoritmo es similar al de la regresión escalonada hacia adelante, pero en lugar de incluir características en cada paso, los coeficientes estimados se incrementan en una dirección equiangular a las correlaciones de cada uno con el residuo.

source: Instead of giving a vector result, the LARS solution consists of a curve denoting the solution for each value of the :math:`\ell_1` norm of the parameter vector. The full coefficients path is stored in the array ``coef_path_``, which has size (n_features, max_features+1). The first column is always zero.
es_es: En lugar de dar un resultado vectorial, la solución LARS consiste en una curva que denota la solución para cada valor de la norma :math:`\ell_1` del vector de parámetros. La ruta completa de los coeficientes se almacena en la matriz ``coef_path_``, que tiene un tamaño (n_figuras, max_figuras+1). La primera columna es siempre cero.

source: Original Algorithm is detailed in the paper `Least Angle Regression <https://www-stat.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf>`_ by Hastie et al.
es_es: El algoritmo original se detalla en el artículo `Least Angle Regression <https://www-stat.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf>`_ de Hastie et al.

source: Orthogonal Matching Pursuit (OMP)
es_es: Búsqueda de coincidencias ortogonales (OMP)

source: :class:`OrthogonalMatchingPursuit` and :func:`orthogonal_mp` implements the OMP algorithm for approximating the fit of a linear model with constraints imposed on the number of non-zero coefficients (ie. the :math:`\ell_0` pseudo-norm).
es_es: :class:`OrthogonalMatchingPursuit` y :func:`orthogonal_mp` implementan el algoritmo OMP para aproximar el ajuste de un modelo lineal con restricciones impuestas en el número de coeficientes no nulos (es decir, la pseudo-norma :math:`\ell_0`).

source: Being a forward feature selection method like :ref:`least_angle_regression`, orthogonal matching pursuit can approximate the optimum solution vector with a fixed number of non-zero elements:
es_es: Al ser un método de selección de características hacia adelante, como :ref:`regresión_del_menor_ángulo`, la búsqueda de coincidencias ortogonales puede aproximar el vector de solución óptima con un número fijo de elementos distintos de cero:

source: Alternatively, orthogonal matching pursuit can target a specific error instead of a specific number of non-zero coefficients. This can be expressed as:
es_es: Alternativamente, la búsqueda ortogonal de coincidencias puede tener como objetivo un error específico en lugar de un número específico de coeficientes distintos de cero. Esto puede expresarse como:

source: OMP is based on a greedy algorithm that includes at each step the atom most highly correlated with the current residual. It is similar to the simpler matching pursuit (MP) method, but better in that at each iteration, the residual is recomputed using an orthogonal projection on the space of the previously chosen dictionary elements.
es_es: OMP se basa en un algoritmo ambicioso que incluye en cada paso el átomo más correlacionado con el residuo actual. Es similar al método más sencillo de búsqueda de coincidencias (MP), pero mejor en el sentido de que, en cada iteración, el residuo se vuelve a calcular utilizando una proyección ortogonal sobre el espacio de los elementos del diccionario elegido previamente.

source: Bayesian Regression
es_es: Regresión bayesiana

source: Bayesian regression techniques can be used to include regularization parameters in the estimation procedure: the regularization parameter is not set in a hard sense but tuned to the data at hand.
es_es: Las técnicas de regresión bayesiana pueden utilizarse para incluir parámetros de regularización en el procedimiento de estimación: el parámetro de regularización no se establece en un sentido estricto, sino que se ajusta a los datos disponibles.

source: This can be done by introducing `uninformative priors <https://en.wikipedia.org/wiki/Non-informative_prior#Uninformative_priors>`__ over the hyper parameters of the model. The :math:`\ell_{2}` regularization used in :ref:`ridge_regression` is equivalent to finding a maximum a posteriori estimation under a Gaussian prior over the coefficients :math:`w` with precision :math:`\lambda^{-1}`. Instead of setting `\lambda` manually, it is possible to treat it as a random variable to be estimated from the data.
es_es: Esto se puede hacer introduciendo `valores a priori no informativos<https://en.wikipedia.org/wiki/Non-informative_prior#Uninformative_priors>`__ sobre los hiperparámetros del modelo. La regularización :math:`\ell_{2}` utilizada en :ref:`ridge_regression` es equivalente a encontrar una estimación máxima a posteriori bajo una prioridad gaussiana sobre los coeficientes :math:`w` con precisión :math:`\lambda^{-1}`. En lugar de establecer manualmente `\lambda`, es posible tratarla como una variable aleatoria que debe estimarse a partir de los datos.

source: To obtain a fully probabilistic model, the output :math:`y` is assumed to be Gaussian distributed around :math:`X w`:
es_es: Para obtener un modelo totalmente probabilístico, se supone que la salida :math:`y` se distribuye de forma gaussiana alrededor de :math:`X w`:

source: where :math:`\alpha` is again treated as a random variable that is to be estimated from the data.
es_es: donde :math:`\alpha` se trata de nuevo como una variable aleatoria que debe estimarse a partir de los datos.

source: The advantages of Bayesian Regression are:
es_es: Las ventajas de la regresión bayesiana son:

source: It adapts to the data at hand.
es_es: Se adapta a los datos en cuestión.

source: It can be used to include regularization parameters in the estimation procedure.
es_es: Puede utilizarse para incluir parámetros de regularización en el procedimiento de estimación.

source: The disadvantages of Bayesian regression include:
es_es: Las desventajas de la regresión bayesiana son:

source: Inference of the model can be time consuming.
es_es: La inferencia del modelo puede llevar mucho tiempo.

source: A good introduction to Bayesian methods is given in C. Bishop: Pattern Recognition and Machine learning
es_es: Una buena introducción a los métodos bayesianos se encuentra en C. Bishop: Pattern Recognition and Machine learning

source: Original Algorithm is detailed in the book `Bayesian learning for neural networks` by Radford M. Neal
es_es: El algoritmo original se detalla en el libro `Bayesian learning for neural networks` by Radford M. Neal

source: Bayesian Ridge Regression
es_es: Regresión Bayesiana de Cresta

source: :class:`BayesianRidge` estimates a probabilistic model of the regression problem as described above. The prior for the coefficient :math:`w` is given by a spherical Gaussian:
es_es: :class:`BayesianRidge` estima un modelo probabilístico del problema de regresión como se ha descrito anteriormente. La prioridad para el coeficiente :math:`w` viene dada por una gaussiana esférica:

source: The priors over :math:`\alpha` and :math:`\lambda` are chosen to be `gamma distributions <https://en.wikipedia.org/wiki/Gamma_distribution>`__, the conjugate prior for the precision of the Gaussian. The resulting model is called *Bayesian Ridge Regression*, and is similar to the classical :class:`Ridge`.
es_es: Los valores a priori sobre :math:`\alpha` y :math:`lambda` se eligen para ser `distribuciones gamma <https://en.wikipedia.org/wiki/Gamma_distribution>`__, el conjugado a priori para la precisión de la gaussiana. El modelo resultante se llama *Regresión Bayesiana de Cresta*, y es similar al clásico :class:`Ridge`.

source: The parameters :math:`w`, :math:`\alpha` and :math:`\lambda` are estimated jointly during the fit of the model, the regularization parameters :math:`\alpha` and :math:`\lambda` being estimated by maximizing the *log marginal likelihood*. The scikit-learn implementation is based on the algorithm described in Appendix A of (Tipping, 2001) where the update of the parameters :math:`\alpha` and :math:`\lambda` is done as suggested in (MacKay, 1992). The initial value of the maximization procedure can be set with the hyperparameters ``alpha_init`` and ``lambda_init``.
es_es: Los parámetros :math:`w`, :math:`\alpha` y :math:`lambda` se estiman conjuntamente durante el ajuste del modelo, los parámetros de regularización :math:`\alpha` y :math:`lambda` se estiman maximizando la *verosimilitud marginal log*. La implementación de scikit-learn se basa en el algoritmo descrito en el Apéndice A de (Tipping, 2001) donde la actualización de los parámetros :math:`\alpha` y :math:`lambda` se realiza como se sugiere en (MacKay, 1992). El valor inicial del procedimiento de maximización se puede establecer con los hiperparámetros ``alpha_init`` y ``lambda_init``.

source: There are four more hyperparameters, :math:`\alpha_1`, :math:`\alpha_2`, :math:`\lambda_1` and :math:`\lambda_2` of the gamma prior distributions over :math:`\alpha` and :math:`\lambda`. These are usually chosen to be *non-informative*. By default :math:`\alpha_1 = \alpha_2 = \lambda_1 = \lambda_2 = 10^{-6}`.
es_es: Hay cuatro hiperparámetros más, :math:`\alpha_1`, :math:`\alpha_2`, :math:`lambda_1` y :math:`lambda_2` de las distribuciones previas gamma sobre :math:`\alpha` y :math:`lambda`. Normalmente se eligen para que sean *no informativas*. Por defecto :math:`\alpha_1 = \alpha_2 = \lambda_1 = \lambda_2 = 10^{-6}`.

source: Bayesian Ridge Regression is used for regression::
es_es: La regresión Bayesiana de Cresta se utiliza para la regresión::

source: After being fitted, the model can then be used to predict new values::
es_es: Después de ser ajustado, el modelo puede ser utilizado para predecir nuevos valores::

source: The coefficients :math:`w` of the model can be accessed::
es_es: Se puede acceder a los coeficientes :math:`w` del modelo::

source: Due to the Bayesian framework, the weights found are slightly different to the ones found by :ref:`ordinary_least_squares`. However, Bayesian Ridge Regression is more robust to ill-posed problems.
es_es: Debido al framework bayesiano, los pesos encontrados son ligeramente diferentes a los encontrados por :ref:`ordinary_least_squares`. Sin embargo, la regresión Bayesiana de Cresta es más robusta frente a los problemas mal definidos.

source: Section 3.3 in Christopher M. Bishop: Pattern Recognition and Machine Learning, 2006
es_es: Sección 3.3 en Christopher M. Bishop: Pattern Recognition and Machine Learning, 2006

source: Automatic Relevance Determination - ARD
es_es: Determinación automática de la relevancia - ARD

source: :class:`ARDRegression` is very similar to `Bayesian Ridge Regression`_, but can lead to sparser coefficients :math:`w` [1]_ [2]_. :class:`ARDRegression` poses a different prior over :math:`w`, by dropping the assumption of the Gaussian being spherical.
es_es: :class:`ARDRegression` es muy similar a la `Regresión Bayesiana de Cresta`_, pero puede dar lugar a coeficientes :math:`w` más dispersos [1]_ [2]_. :class:`ARDRegression` plantea una prioridad diferente sobre :math:`w`, al abandonar la suposición de que la gaussiana es esférica.

source: Instead, the distribution over :math:`w` is assumed to be an axis-parallel, elliptical Gaussian distribution.
es_es: En su lugar, se asume que la distribución sobre :math:`w` es una distribución Gaussiana elíptica paralela al eje.

source: This means each coefficient :math:`w_{i}` is drawn from a Gaussian distribution, centered on zero and with a precision :math:`\lambda_{i}`:
es_es: Esto significa que cada coeficiente :math:`w_{i}` se extrae de una distribución Gaussiana, centrada en cero y con una precisión :math:`\lambda_{i}`:

source: In contrast to `Bayesian Ridge Regression`_, each coordinate of :math:`w_{i}` has its own standard deviation :math:`\lambda_i`. The prior over all :math:`\lambda_i` is chosen to be the same gamma distribution given by hyperparameters :math:`\lambda_1` and :math:`\lambda_2`.
es_es: En contraste con la `Regresión Bayesiana de Cresta`_, cada coordenada de :math:`w_{i}` tiene su propia desviación estándar :math:`lambda_i`. La prioridad sobre todos los :math:`lambda_i` se elige para ser la misma distribución gamma dada por los hiperparámetros :math:`lambda_1` y :math:`lambda_2`.

source: ARD is also known in the literature as *Sparse Bayesian Learning* and *Relevance Vector Machine* [3]_ [4]_.
es_es: El ARD también se conoce en la literatura como *Aprendizaje Bayesiano Disperso* y *Máquina de Vectores de Relevancia* [3]_ [4]_.

source: Christopher M. Bishop: Pattern Recognition and Machine Learning, Chapter 7.2.1
es_es: Christopher M. Bishop: Pattern Recognition and Machine Learning, Capítulo 7.2.1

source: Logistic regression
es_es: Regresión logística

source: Logistic regression, despite its name, is a linear model for classification rather than regression. Logistic regression is also known in the literature as logit regression, maximum-entropy classification (MaxEnt) or the log-linear classifier. In this model, the probabilities describing the possible outcomes of a single trial are modeled using a `logistic function <https://en.wikipedia.org/wiki/Logistic_function>`_.
es_es: La regresión logística, a pesar de su nombre, es un modelo lineal de clasificación más que de regresión. La regresión logística también se conoce en la literatura como regresión logit, clasificación de máxima entropía (MaxEnt) o clasificador log-lineal. En este modelo, las probabilidades que describen los posibles resultados de un único ensayo se modelan mediante una función `logística <https://en.wikipedia.org/wiki/Logistic_function>`_.

source: Logistic regression is implemented in :class:`LogisticRegression`. This implementation can fit binary, One-vs-Rest, or multinomial logistic regression with optional :math:`\ell_1`, :math:`\ell_2` or Elastic-Net regularization.
es_es: La regresión logística se implementa en :class:`LogisticRegression`. Esta implementación puede ajustar la regresión logística binaria, One-vs-Rest o multinomial con regularización opcional :math:`\ell_1`, :math:`\ell_2` o Elastic-Net.

source: Regularization is applied by default, which is common in machine learning but not in statistics. Another advantage of regularization is that it improves numerical stability. No regularization amounts to setting C to a very high value.
es_es: La regularización se aplica por defecto, lo que es habitual en el aprendizaje automático pero no en la estadística. Otra ventaja de la regularización es que mejora la estabilidad numérica. La ausencia de regularización equivale a fijar C en un valor muy alto.

source: As an optimization problem, binary class :math:`\ell_2` penalized logistic regression minimizes the following cost function:
es_es: Como problema de optimización, la regresión logística penalizada de clase binaria :math:`\ell_2` minimiza la siguiente función de coste:

source: Similarly, :math:`\ell_1` regularized logistic regression solves the following optimization problem:
es_es: Del mismo modo, la regresión logística regularizada :math:`\ell_1` resuelve el siguiente problema de optimización:

source: Elastic-Net regularization is a combination of :math:`\ell_1` and :math:`\ell_2`, and minimizes the following cost function:
es_es: La regularización Elastic-Net es una combinación de :math:`\ell_1` y :math:`\ell_2`, y minimiza la siguiente función de costo:

source: where :math:`\rho` controls the strength of :math:`\ell_1` regularization vs. :math:`\ell_2` regularization (it corresponds to the `l1_ratio` parameter).
es_es: donde :math:`\rho` controla la fuerza de la regularización :math:`\ell_1` frente a la regularización :math:`\ell_2` (corresponde al parámetro `l1_ratio`).

source: Note that, in this notation, it's assumed that the target :math:`y_i` takes values in the set :math:`{-1, 1}` at trial :math:`i`. We can also see that Elastic-Net is equivalent to :math:`\ell_1` when :math:`\rho = 1` and equivalent to :math:`\ell_2` when :math:`\rho=0`.
es_es: Ten en cuenta que, en esta notación, se supone que el objetivo :math:`y_i` toma valores en el conjunto :math:`{-1, 1}` en el ensayo :math:`i`. También podemos ver que Elastic-Net es equivalente a :math:`\ell_1` cuando :math:`\rho = 1` y equivalente a :math:`\ell_2` cuando :math:`\rho=0`.

source: The solvers implemented in the class :class:`LogisticRegression` are "liblinear", "newton-cg", "lbfgs", "sag" and "saga":
es_es: Los solucionadores implementados en la clase :class:`LogisticRegression` son "liblinear", "newton-cg", "lbfgs", "sag" y "saga":

source: The solver "liblinear" uses a coordinate descent (CD) algorithm, and relies on the excellent C++ `LIBLINEAR library <https://www.csie.ntu.edu.tw/~cjlin/liblinear/>`_, which is shipped with scikit-learn. However, the CD algorithm implemented in liblinear cannot learn a true multinomial (multiclass) model; instead, the optimization problem is decomposed in a "one-vs-rest" fashion so separate binary classifiers are trained for all classes. This happens under the hood, so :class:`LogisticRegression` instances using this solver behave as multiclass classifiers. For :math:`\ell_1` regularization :func:`sklearn.svm.l1_min_c` allows to calculate the lower bound for C in order to get a non "null" (all feature weights to zero) model.
es_es: El solucionador "liblinear" utiliza un algoritmo de descenso de coordenadas (CD), y se basa en la excelente biblioteca C++ `LIBLINEAR <https://www.csie.ntu.edu.tw/~cjlin/liblinear/>`_, que se entrega con scikit-learn. Sin embargo, el algoritmo CD implementado en liblinear no puede aprender un verdadero modelo multinomial (multiclase); en su lugar, el problema de optimización se descompone de una manera "uno-vs-resto" para que se entrenen clasificadores binarios separados para todas las clases. Esto sucede lejos de la vista del usuario, así que las instancias de :class:`LogisticRegression` que utilizan este solucionador se comportan como clasificadores multiclase. Para la regularización :math:`\ell_1` :func:`sklearn.svm.l1_min_c` permite calcular el límite inferior de C para obtener un modelo no "nulo" (todos los pesos de las características a cero).
