Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/linear_model.po
Languages: es_es

source: The "lbfgs", "sag" and "newton-cg" solvers only support :math:`\ell_2` regularization or no regularization, and are found to converge faster for some high-dimensional data. Setting `multi_class` to "multinomial" with these solvers learns a true multinomial logistic regression model [5]_, which means that its probability estimates should be better calibrated than the default "one-vs-rest" setting.
es_es: Los solucionadores "lbfgs", "sag" y "newton-cg" sólo admiten la regularización :math:`\ell_2` o ninguna regularización, y se considera que convergen más rápidamente para algunos datos de alta dimensión. Al establecer `multi_class` a "multinomial" con estos solucionadores se aprende un verdadero modelo de regresión logística multinomial [5]_, lo que significa que sus estimaciones de probabilidad deberían estar mejor calibradas que la configuración por defecto "one-vs-rest".

source: The "sag" solver uses Stochastic Average Gradient descent [6]_. It is faster than other solvers for large datasets, when both the number of samples and the number of features are large.
es_es: El solucionador "sag" utiliza el descenso de gradiente promedio estocástico [6]_. Es más rápido que otros solucionadores para grandes conjuntos de datos, cuando tanto el número de muestras como el número de características son grandes.

source: The "saga" solver [7]_ is a variant of "sag" that also supports the non-smooth `penalty="l1"`. This is therefore the solver of choice for sparse multinomial logistic regression. It is also the only solver that supports `penalty="elasticnet"`.
es_es: El solucionador "saga" [7]_ es una variante de "sag" que también admite la opción no suave `penalty="l1"`. Por lo tanto, este es el solucionador de elección para la regresión logística multinomial dispersa. También es el único solucionador que admite `penalty="elasticnet"`.

source: The "lbfgs" is an optimization algorithm that approximates the Broyden–Fletcher–Goldfarb–Shanno algorithm [8]_, which belongs to quasi-Newton methods. The "lbfgs" solver is recommended for use for small data-sets but for larger datasets its performance suffers. [9]_
es_es: El "lbfgs" es un algoritmo de optimización que se aproxima al algoritmo Broyden-Fletcher-Goldfarb-Shanno [8]_, que pertenece a los métodos quasi-Newton. El solucionador "lbfgs" se recomienda para conjuntos de datos pequeños, pero para conjuntos de datos más grandes su rendimiento se reduce. [9]_

source: The following table summarizes the penalties supported by each solver:
es_es: La siguiente tabla resume las penalizaciones que admite cada solucionador:

source: **Solvers**
es_es: **Solucionadores**

source: **Penalties**
es_es: **Penalizaciones**

source: Multinomial + L2 penalty
es_es: Multinomial + penalización L2

source: yes
es_es: si

source: OVR + L2 penalty
es_es: OVR + penalización L2

source: Multinomial + L1 penalty
es_es: Multinomial + penalización L1

source: OVR + L1 penalty
es_es: OVR + penalización L1

source: No penalty ('none')
es_es: Ninguna penalización ('none')

source: **Behaviors**
es_es: **Comportamientos**

source: Penalize the intercept (bad)
es_es: Penalizar el intercepto (malo)

source: Faster for large datasets
es_es: Más rápido para conjuntos de datos grandes

source: Robust to unscaled datasets
es_es: Robusto para conjuntos de datos no escalados

source: The "lbfgs" solver is used by default for its robustness. For large datasets the "saga" solver is usually faster. For large dataset, you may also consider using :class:`SGDClassifier` with 'log' loss, which might be even faster but requires more tuning.
es_es: El solucionador "lbfgs" se utiliza por defecto por su robustez. Para conjuntos de datos grandes, el solucionador "saga" suele ser más rápido. Para conjuntos de datos grandes, también se puede considerar el uso de :class:`SGDClassifier` con pérdida 'log', que puede ser incluso más rápido pero requiere más ajustes.

source: Differences from liblinear:
es_es: Diferencias con liblinear:

source: There might be a difference in the scores obtained between :class:`LogisticRegression` with ``solver=liblinear`` or :class:`LinearSVC` and the external liblinear library directly, when ``fit_intercept=False`` and the fit ``coef_`` (or) the data to be predicted are zeroes. This is because for the sample(s) with ``decision_function`` zero, :class:`LogisticRegression` and :class:`LinearSVC` predict the negative class, while liblinear predicts the positive class. Note that a model with ``fit_intercept=False`` and having many samples with ``decision_function`` zero, is likely to be a underfit, bad model and you are advised to set ``fit_intercept=True`` and increase the intercept_scaling.
es_es: Puede haber una diferencia en las puntuaciones obtenidas entre :class:`LogisticRegression` con ``solver=liblinear`` o :class:`LinearSVC` y la librería externa liblinear directamente, cuando ``fit_intercept=False`` y el ajuste ``coef_`` (o) los datos a predecir son ceros. Esto se debe a que para la(s) muestra(s) con ``decision_function`` cero, :class:`LogisticRegression` y :class:`LinearSVC` predicen la clase negativa, mientras que liblinear predice la clase positiva. Tenga en cuenta que un modelo con ``fit_intercept=False`` y que tiene muchas muestras con ``decision_function`` cero, es probable que sea un modelo mal ajustado y se aconseja establecer ``fit_intercept=True`` y aumentar el intercept_scaling.

source: **Feature selection with sparse logistic regression**
es_es: **Selección de características con regresión logística dispersa**

source: A logistic regression with :math:`\ell_1` penalty yields sparse models, and can thus be used to perform feature selection, as detailed in :ref:`l1_feature_selection`.
es_es: Una regresión logística con penalización :math:`\ell_1` produce modelos dispersos, y por lo tanto puede ser utilizada para realizar la selección de características, como se detalla en :ref:`l1_feature_selection`.

source: **P-value estimation**
es_es: **Estimación del valor p**

source: It is possible to obtain the p-values and confidence intervals for coefficients in cases of regression without penalization. The `statsmodels package <https://pypi.org/project/statsmodels/>` natively supports this. Within sklearn, one could use bootstrapping instead as well.
es_es: Es posible obtener los valores p y los intervalos de confianza de los coeficientes en los casos de regresión sin penalidad. El paquete `statsmodels <https://pypi.org/project/statsmodels/>` soporta esto de forma nativa. Dentro de sklearn, uno podría utilizar bootstrapping en su lugar también.

source: :class:`LogisticRegressionCV` implements Logistic Regression with built-in cross-validation support, to find the optimal `C` and `l1_ratio` parameters according to the ``scoring`` attribute. The "newton-cg", "sag", "saga" and "lbfgs" solvers are found to be faster for high-dimensional dense data, due to warm-starting (see :term:`Glossary <warm_start>`).
es_es: :class:`LogisticRegressionCV` implementa la Regresión Logística con soporte de validación cruzada incorporado, para encontrar los parámetros óptimos `C` y `l1_ratio` según el atributo ``scoring``. Los solucionadores "newton-cg", "sag", "saga" y "lbfgs" son más rápidos para los datos densos de alta dimensión, debido al arranque en caliente (véase :term:`Glossary <warm_start>`).

source: Generalized Linear Regression
es_es: Regresión lineal generalizada

source: Generalized Linear Models (GLM) extend linear models in two ways [10]_. First, the predicted values :math:`\hat{y}` are linked to a linear combination of the input variables :math:`X` via an inverse link function :math:`h` as
es_es: Los modelos lineales generalizados (GLM) amplían los modelos lineales de dos maneras [10]_. En primer lugar, los valores predichos :math:`hat{y}` están vinculados a una combinación lineal de las variables de entrada :math:`X` a través de una función de enlace inversa :math:`h` como

source: Secondly, the squared loss function is replaced by the unit deviance :math:`d` of a distribution in the exponential family (or more precisely, a reproductive exponential dispersion model (EDM) [11]_).
es_es: En segundo lugar, la función de pérdida al cuadrado se sustituye por la desviación unitaria :math:`d` de una distribución de la familia exponencial (o más exactamente, un modelo de dispersión exponencial reproductiva (EDM) [11]_).

source: The minimization problem becomes:
es_es: El problema de minimización se convierte en:

source: where :math:`\alpha` is the L2 regularization penalty. When sample weights are provided, the average becomes a weighted average.
es_es: donde :math:`\alpha` es la penalización de regularización L2. Cuando se proporcionan los pesos de la muestra, la media se convierte en una media promedio.

source: The following table lists some specific EDMs and their unit deviance (all of these are instances of the Tweedie family):
es_es: La siguiente tabla enumera algunas EDM específicas y su desviación unitaria (todas ellas son instancias de la familia Tweedie):

source: Distribution
es_es: Distribución

source: Target Domain
es_es: Dominio objetivo

source: Unit Deviance :math:`d(y, \hat{y})`
es_es: Desviación unitaria :math:`d(y, \hat{y})`

source: Inverse Gaussian
es_es: Gaussiana inversa

source: The Probability Density Functions (PDF) of these distributions are illustrated in the following figure,
es_es: Las Funciones de Densidad de Probabilidad (PDF) de estas distribuciones se ilustran en la siguiente figura,

source: PDF of a random variable Y following Poisson, Tweedie (power=1.5) and Gamma distributions with different mean values (:math:`\mu`). Observe the point mass at :math:`Y=0` for the Poisson distribution and the Tweedie (power=1.5) distribution, but not for the Gamma distribution which has a strictly positive target domain.
es_es: PDF de una variable aleatoria Y que sigue las distribuciones Poisson, Tweedie (potencia=1,5) y Gamma con diferentes valores medios (:math:`\mu`). Observa la masa puntual en :math:`Y=0` para la distribución de Poisson y la de Tweedie (potencia=1,5), pero no para la distribución Gamma que tiene un dominio objetivo estrictamente positivo.

source: The choice of the distribution depends on the problem at hand:
es_es: La elección de la distribución depende del problema en cuestión:

source: If the target values :math:`y` are counts (non-negative integer valued) or relative frequencies (non-negative), you might use a Poisson deviance with log-link.
es_es: Si los valores objetivo :math:`y` son recuentos (con valor entero no negativo) o frecuencias relativas (no negativas), podrías utilizar una desviación de Poisson con enlace log.

source: If the target values are positive valued and skewed, you might try a Gamma deviance with log-link.
es_es: Si los valores objetivo tienen un valor positivo y son asimétricos, puedes probar una desviación Gamma con enlace logarítmico.

source: If the target values seem to be heavier tailed than a Gamma distribution, you might try an Inverse Gaussian deviance (or even higher variance powers of the Tweedie family).
es_es: Si los valores objetivo parecen tener una cola más pesada que la de una distribución Gamma, podrías probar con una desviación Gaussiana Inversa (o incluso con las potencias de varianza más altas de la familia Tweedie).

source: Examples of use cases include:
es_es: Algunos ejemplos de casos de uso son:

source: Agriculture / weather modeling: number of rain events per year (Poisson), amount of rainfall per event (Gamma), total rainfall per year (Tweedie / Compound Poisson Gamma).
es_es: Agricultura / modelización meteorológica: número de eventos de lluvia por año (Poisson), cantidad de lluvia por evento (Gamma), lluvia total por año (Tweedie / Compuesta Poisson Gamma).

source: Risk modeling / insurance policy pricing: number of claim events / policyholder per year (Poisson), cost per event (Gamma), total cost per policyholder per year (Tweedie / Compound Poisson Gamma).
es_es: Modelización de riesgos / tarificación de pólizas de seguros: número de siniestros / asegurado al año (Poisson), costo por siniestro (Gamma), costo total por asegurado al año (Tweedie / Compuesta Poisson Gamma).

source: Predictive maintenance: number of production interruption events per year (Poisson), duration of interruption (Gamma), total interruption time per year (Tweedie / Compound Poisson Gamma).
es_es: Mantenimiento predictivo: número de eventos de interrupción de la producción por año (Poisson), duración de la interrupción (Gamma), tiempo total de interrupción por año (Tweedie / Compuesta Poisson Gamma).

source: McCullagh, Peter; Nelder, John (1989). Generalized Linear Models, Second Edition. Boca Raton: Chapman and Hall/CRC. ISBN 0-412-31760-5.
es_es: McCullagh, Peter; Nelder, John (1989). Generalized Linear Models, Segunda Edición. Boca Raton: Chapman and Hall/CRC. ISBN 0-412-31760-5.

source: Usage
es_es: Uso

source: :class:`TweedieRegressor` implements a generalized linear model for the Tweedie distribution, that allows to model any of the above mentioned distributions using the appropriate ``power`` parameter. In particular:
es_es: :class:`TweedieRegressor` implementa un modelo lineal generalizado para la distribución de Tweedie, que permite modelar cualquiera de las distribuciones mencionadas utilizando el parámetro ``power`` apropiado. En particular:

source: ``power = 0``: Normal distribution. Specific estimators such as :class:`Ridge`, :class:`ElasticNet` are generally more appropriate in this case.
es_es: ``power = 0``: Distribución normal. Los estimadores específicos como :class:`Ridge`, :class:`ElasticNet` suelen ser más apropiados en este caso.

source: ``power = 1``: Poisson distribution. :class:`PoissonRegressor` is exposed for convenience. However, it is strictly equivalent to `TweedieRegressor(power=1, link='log')`.
es_es: ``power = 1``: Distribución de Poisson. :class:`PoissonRegressor` se expone por comodidad. Sin embargo, es estrictamente equivalente a `TweedieRegressor(power=1, link='log')`.

source: ``power = 2``: Gamma distribution. :class:`GammaRegressor` is exposed for convenience. However, it is strictly equivalent to `TweedieRegressor(power=2, link='log')`.
es_es: potencia = 2``: La distribución Gamma. :class:`GammaRegressor` se expone por conveniencia. Sin embargo, es estrictamente equivalente a `TweedieRegressor(power=2, link='log')`.

source: ``power = 3``: Inverse Gaussian distribution.
es_es: ``poder = 3``: Distribución Gaussiana Inversa.

source: The link function is determined by the `link` parameter.
es_es: La función de enlace está determinada por el parámetro `link`.

source: Usage example::
es_es: Ejemplo de uso::

source: Practical considerations
es_es: Consideraciones prácticas

source: The feature matrix `X` should be standardized before fitting. This ensures that the penalty treats features equally.
es_es: La matriz de características `X` debe normalizarse antes del ajuste. Esto asegura que la penalización trata las características por igual.

source: Since the linear predictor :math:`Xw` can be negative and Poisson, Gamma and Inverse Gaussian distributions don't support negative values, it is necessary to apply an inverse link function that guarantees the non-negativeness. For example with `link='log'`, the inverse link function becomes :math:`h(Xw)=\exp(Xw)`.
es_es: Como el predictor lineal :math:`Xw` puede ser negativo y las distribuciones Poisson, Gamma y Gaussiana Inversa no admiten valores negativos, es necesario aplicar una función de enlace inversa que garantice la no negatividad. Por ejemplo, con `link='log'`, la función de enlace inversa se convierte en :math:`h(Xw)=\exp(Xw)`.

source: If you want to model a relative frequency, i.e. counts per exposure (time, volume, ...) you can do so by using a Poisson distribution and passing :math:`y=\frac{\mathrm{counts}}{\mathrm{exposure}}` as target values together with :math:`\mathrm{exposure}` as sample weights. For a concrete example see e.g. :ref:`sphx_glr_auto_examples_linear_model_plot_tweedie_regression_insurance_claims.py`.
es_es: Si desea modelar una frecuencia relativa, es decir, recuentos por exposición (tiempo, volumen, ...) puede hacerlo utilizando una distribución de Poisson y pasando :math:`y=\frac{mathrm{counts}}{mathrm{exposure}}` como valores objetivo junto con :math:`mathrm{exposure}` como pesos de la muestra. Para un ejemplo concreto, ver: :ref:`sphx_glr_auto_examples_linear_model_plot_tweedie_regression_insurance_claims.py`.

source: When performing cross-validation for the `power` parameter of `TweedieRegressor`, it is advisable to specify an explicit `scoring` function, because the default scorer :meth:`TweedieRegressor.score` is a function of `power` itself.
es_es: Cuando se realiza una validación cruzada para el parámetro `power` de `TweedieRegressor`, es aconsejable especificar una función de `puntuación` explícita, ya que el puntuador por defecto :meth:`TweedieRegressor.score` es una función de la propia `power`.

source: Stochastic Gradient Descent - SGD
es_es: Descenso de gradiente estocástico - SGD

source: Stochastic gradient descent is a simple yet very efficient approach to fit linear models. It is particularly useful when the number of samples (and the number of features) is very large. The ``partial_fit`` method allows online/out-of-core learning.
es_es: El descenso de gradiente estocástico es un método sencillo pero muy eficaz para ajustar modelos lineales. Es especialmente útil cuando el número de muestras (y el número de características) es muy grande. El método ``partial_fit`` permite el aprendizaje en línea y fuera del núcleo.

source: The classes :class:`SGDClassifier` and :class:`SGDRegressor` provide functionality to fit linear models for classification and regression using different (convex) loss functions and different penalties. E.g., with ``loss="log"``, :class:`SGDClassifier` fits a logistic regression model, while with ``loss="hinge"`` it fits a linear support vector machine (SVM).
es_es: Las clases :class:`SGDClassifier` y :class:`SGDRegressor` proporcionan funcionalidad para ajustar modelos lineales de clasificación y regresión utilizando diferentes funciones de pérdida (convexas) y diferentes penalizaciones. Por ejemplo, con ``loss="log"``, :class:`SGDClassifier` se ajusta a un modelo de regresión logística, mientras que con ``loss="hinge"`` se ajusta a una máquina lineal de vectores de soporte (SVM).

source: Perceptron
es_es: Perceptrón

source: The :class:`Perceptron` is another simple classification algorithm suitable for large scale learning. By default:
es_es: El :class:`Perceptron` es otro algoritmo de clasificación simple adecuado para el aprendizaje a gran escala. Por defecto:

source: It does not require a learning rate.
es_es: No requiere una tasa de aprendizaje.

source: It is not regularized (penalized).
es_es: No está regularizado (penalizado).

source: It updates its model only on mistakes.
es_es: Actualiza su modelo sólo en caso de error.

source: The last characteristic implies that the Perceptron is slightly faster to train than SGD with the hinge loss and that the resulting models are sparser.
es_es: La última característica implica que el Perceptrón es ligeramente más rápido de entrenar que el SGD con la pérdida de bisagra y que los modelos resultantes son más dispersos.

source: Passive Aggressive Algorithms
es_es: Algoritmos pasivo-agresivos

source: The passive-aggressive algorithms are a family of algorithms for large-scale learning. They are similar to the Perceptron in that they do not require a learning rate. However, contrary to the Perceptron, they include a regularization parameter ``C``.
es_es: Los algoritmos pasivo-agresivos son una familia de algoritmos para el aprendizaje a gran escala. Son similares al Perceptrón en el sentido de que no requieren una tasa de aprendizaje. Sin embargo, a diferencia del Perceptrón, incluyen un parámetro de regularización ``C``.

source: For classification, :class:`PassiveAggressiveClassifier` can be used with ``loss='hinge'`` (PA-I) or ``loss='squared_hinge'`` (PA-II). For regression, :class:`PassiveAggressiveRegressor` can be used with ``loss='epsilon_insensitive'`` (PA-I) or ``loss='squared_epsilon_insensitive'`` (PA-II).
es_es: Para la clasificación, :class:`PassiveAggressiveClassifier` puede utilizarse con ``loss='hinge'`` (PA-I) o ``loss='squared_hinge'`` (PA-II). Para la regresión, :class:`PassiveAggressiveRegressor` puede utilizarse con ``loss='epsilon_insensitive'`` (PA-I) o ``loss='squared_epsilon_insensitive'`` (PA-II).

source: Robustness regression: outliers and modeling errors
es_es: Regresión robusta: valores atípicos y errores de modelización,

source: Robust regression aims to fit a regression model in the presence of corrupt data: either outliers, or error in the model.
es_es: La regresión robusta tiene como objetivo ajustar un modelo de regresión en presencia de datos corruptos: ya sean valores atípicos o errores en el modelo.

source: Different scenario and useful concepts
es_es: Diferentes escenarios y conceptos útiles

source: There are different things to keep in mind when dealing with data corrupted by outliers:
es_es: Hay diferentes cosas que hay que tener en cuenta cuando se trata de datos corruptos por valores atípicos:

source: **Outliers in X or in y**?
es_es: **¿Valores atípicos en X o en y**?

source: Outliers in the y direction
es_es: Valores atípicos en la dirección y

source: Outliers in the X direction
es_es: Valores atípicos en la dirección X

source: **Fraction of outliers versus amplitude of error**
es_es: **Fracción de valores atípicos frente a la amplitud del error**

source: The number of outlying points matters, but also how much they are outliers.
es_es: El número de puntos atípicos es importante, pero también lo son los valores atípicos.

source: Small outliers
es_es: Valores atípicos pequeños

source: Large outliers
es_es: Valores atípicos grandes

source: An important notion of robust fitting is that of breakdown point: the fraction of data that can be outlying for the fit to start missing the inlying data.
es_es: |large_y_outliers|

source: Note that in general, robust fitting in high-dimensional setting (large `n_features`) is very hard. The robust models here will probably not work in these settings.
es_es: Ten en cuenta que, en general, el ajuste robusto en un entorno de alta dimensión (grandes "características") es muy difícil. Los modelos robustos aquí probablemente no funcionarán en estos escenarios.

source: **Trade-offs: which estimator?**
es_es: **En balance: ¿cuál estimador?**

source: :ref:`HuberRegressor <huber_regression>` should be faster than :ref:`RANSAC <ransac_regression>` and :ref:`Theil Sen <theil_sen_regression>` unless the number of samples are very large, i.e ``n_samples`` >> ``n_features``. This is because :ref:`RANSAC <ransac_regression>` and :ref:`Theil Sen <theil_sen_regression>` fit on smaller subsets of the data. However, both :ref:`Theil Sen <theil_sen_regression>` and :ref:`RANSAC <ransac_regression>` are unlikely to be as robust as :ref:`HuberRegressor <huber_regression>` for the default parameters.
es_es: :ref:`HuberRegressor <huber_regression>` debería ser más rápido que :ref:`RANSAC <ransac_regression>` y :ref:`Theil Sen <theil_sen_regression>` a menos que el número de muestras sea muy grande, es decir, ``n_samples`` >> ``n_features``. Esto se debe a que :ref:`RANSAC <ransac_regression>` y :ref:`Theil Sen <theil_sen_regression>` se ajustan a subconjuntos más pequeños de los datos. Sin embargo, tanto :ref:`Theil Sen <theil_sen_regression>` como :ref:`RANSAC <ransac_regression>` probablemente no sean tan robustos como :ref:`HuberRegressor <huber_regression>` para los parámetros por defecto.
