Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/manifold.po
Languages: es_es

source: There exists two types of MDS algorithm: metric and non metric. In the scikit-learn, the class :class:`MDS` implements both. In Metric MDS, the input similarity matrix arises from a metric (and thus respects the triangular inequality), the distances between output two points are then set to be as close as possible to the similarity or dissimilarity data. In the non-metric version, the algorithms will try to preserve the order of the distances, and hence seek for a monotonic relationship between the distances in the embedded space and the similarities/dissimilarities.
es_es: Existen dos tipos del algoritmo EMD: métrico y no métrico. En scikit-learn, la clase :class:`MDS` implementa ambos. En el EMD métrico, la matriz de similitud de entrada viene de una métrica (y por lo tanto respeta la desigualdad triangular), las distancias entre dos puntos de salida son entonces establecidas para ser tan cercanas como es posible a los datos de similitud o disimilitud. En la versión no métrica, los algoritmos intentaran preservar el orden de las distancias, y entonces buscaran una relación monotonica entre las distancias en el espacio con embedding y las similitudes/disimilitudes.

source: Let :math:`S` be the similarity matrix, and :math:`X` the coordinates of the :math:`n` input points. Disparities :math:`\hat{d}_{ij}` are transformation of the similarities chosen in some optimal ways. The objective, called the stress, is then defined by :math:`\sum_{i < j} d_{ij}(X) - \hat{d}_{ij}(X)`
es_es: Sea :math:`S` la matriz de similitud, y :math:`X` las coordenadas de los :math:`n` puntos de entrada. La disparidades :math:`\hat{d}_{ij}` son transformaciones de las similitudes escogidas en ciertas maneras óptimas. El objetivo, llamado el estrés, entonces es definido por :math:`\sum_{i < j} d_{ij}(X) - \hat{d}_{ij}(X)`

source: Metric MDS
es_es: EMD Métrico

source: The simplest metric :class:`MDS` model, called *absolute MDS*, disparities are defined by :math:`\hat{d}_{ij} = S_{ij}`. With absolute MDS, the value :math:`S_{ij}` should then correspond exactly to the distance between point :math:`i` and :math:`j` in the embedding point.
es_es: En el modelo :class:`MDS` métrico mas simple, llamado *EMD absoluto*, las disparidades son definidas por :math:`\hat{d}_{ij} = S_{ij}`. Con el EMD absoluto, el valor :math:`S_{ij}` debería entonces corresponder exactamente a la distancia entre el punto :math:`i` y :math:`j` en el punto de embedding.

source: Most commonly, disparities are set to :math:`\hat{d}_{ij} = b S_{ij}`.
es_es: Mas comúnmente, las disparidades están configuradas como :math:`\hat{d}_{ij} = b S_{ij}`.

source: Nonmetric MDS
es_es: EMD No métrico

source: Non metric :class:`MDS` focuses on the ordination of the data. If :math:`S_{ij} < S_{jk}`, then the embedding should enforce :math:`d_{ij} < d_{jk}`. A simple algorithm to enforce that is to use a monotonic regression of :math:`d_{ij}` on :math:`S_{ij}`, yielding disparities :math:`\hat{d}_{ij}` in the same order as :math:`S_{ij}`.
es_es: El :class:`MDS` no métrico se enfoca en la ordenación de los datos. Si :math:`S_{ij} < S_{jk}`, entonces el embedding debería imponer :math:`d_{ij} < d_{jk}`. Un algoritmo simple para imponerlo es el uso de una regresión monotónica de :math:`d_{ij}` en :math:`S_{ij}`, dando las disparidades :math:`\hat{d}_{ij}` en el mismo orden que :math:`S_{ij}`.

source: A trivial solution to this problem is to set all the points on the origin. In order to avoid that, the disparities :math:`\hat{d}_{ij}` are normalized.
es_es: Una solución trivial a este problema es fijar todos los puntos en el origen. Para evitar eso, las disparidades :math:`\hat{d}_{ij}` son normalizadas.

source: t-distributed Stochastic Neighbor Embedding (t-SNE)
es_es: Embedding Estocástico de Vecinos distribuido en t (t-EEV, o t-SNE en inglés)

source: t-SNE (:class:`TSNE`) converts affinities of data points to probabilities. The affinities in the original space are represented by Gaussian joint probabilities and the affinities in the embedded space are represented by Student's t-distributions. This allows t-SNE to be particularly sensitive to local structure and has a few other advantages over existing techniques:
es_es: t-EEV (:class:`TSNE`) convierte las afinidades de puntos de datos a probabilidades. Las afinidades en el espacio original están representadas por probabilidades conjuntas Gaussianas y las afinidades en el espacio con embedding son representadas por las distribuciones en t del estudiante. Esto permite al t-EEV ser particularmente sensible a la estructura local y tiene algunas otras ventajas sobre técnicas existentes:

source: Revealing the structure at many scales on a single map
es_es: Revelar la estructura en muchas escalas en un solo mapa

source: Revealing data that lie in multiple, different, manifolds or clusters
es_es: Revelar datos que yacen en múltiples, distintos colectores o clústers

source: Reducing the tendency to crowd points together at the center
es_es: Reducir la tendencia a la acumular puntos juntos en el centro

source: While Isomap, LLE and variants are best suited to unfold a single continuous low dimensional manifold, t-SNE will focus on the local structure of the data and will tend to extract clustered local groups of samples as highlighted on the S-curve example. This ability to group samples based on the local structure might be beneficial to visually disentangle a dataset that comprises several manifolds at once as is the case in the digits dataset.
es_es: Mientras que Isomap, ELL y sus variantes son más adecuadas para desplegar un solo colector continuo de dimensionalidad baja, el t-EEV se enfocara en la estructura local de los datos y va a tender a extraer grupos locales de muestras conglomerados como se resalta en el ejemplo de la curva en S. Esta habilidad de agrupas muestras basadas en la estructura local quizás sea beneficiosa para desenredar un conjunto de datos visualmente que compromete múltiples colectores al mismo tiempo como es el caso en el conjunto de datos digits.

source: The Kullback-Leibler (KL) divergence of the joint probabilities in the original space and the embedded space will be minimized by gradient descent. Note that the KL divergence is not convex, i.e. multiple restarts with different initializations will end up in local minima of the KL divergence. Hence, it is sometimes useful to try different seeds and select the embedding with the lowest KL divergence.
es_es: La divergencia Kullback-Leibler (KL) de las probabilidades conjuntas en el espacio original y en el espacio con embedding sera minimizada por descenso por gradiente. Note que la divergencia KL no es convexa, es decir, multiples reinicios con inicializaciones distintas van a terminar en los mínimos locales de la divergencia KL. Por lo tanto, a veces es útil utilizar diferentes semillas y seleccionar el embedding con la menor divergencia KL.

source: The disadvantages to using t-SNE are roughly:
es_es: Las desventajas de usar t-EEV son aproximadamente:

source: t-SNE is computationally expensive, and can take several hours on million-sample datasets where PCA will finish in seconds or minutes
es_es: el t-EEV es computacionalmente costoso, y puede tomar varias horas en conjuntos de datos con millones de muestras, donde el APC terminaría en segundos o minutos

source: The Barnes-Hut t-SNE method is limited to two or three dimensional embeddings.
es_es: El método t-EEV Barnes-Hut está limitado a embeddings de dos o tres dimensiones.

source: The algorithm is stochastic and multiple restarts with different seeds can yield different embeddings. However, it is perfectly legitimate to pick the embedding with the least error.
es_es: El algoritmo es estocástico y varios reinicios con diferentes semillas pueden producir embeddings distintos. Sin embargo, es perfectamente legítimo elegir el embedding con el menor error.

source: Global structure is not explicitly preserved. This problem is mitigated by initializing points with PCA (using `init='pca'`).
es_es: La estructura global no se preserva explícitamente, Este problema se puede mitigar inicializando puntos con APC (utilizando `init='pca'`).

source: Optimizing t-SNE
es_es: Optimizando t-EEV

source: The main purpose of t-SNE is visualization of high-dimensional data. Hence, it works best when the data will be embedded on two or three dimensions.
es_es: El principal objetivo del t-EEV es la visualización de datos de alta dimensión. Por lo tanto, funciona mejor cuando los datos serán integrados en dos o tres dimensiones.

source: Optimizing the KL divergence can be a little bit tricky sometimes. There are five parameters that control the optimization of t-SNE and therefore possibly the quality of the resulting embedding:
es_es: Optimizar la divergencia KL puede ser un poco complicado a veces. Hay 5 parámetros que controlan la optimización del t-EEV y entonces posiblemente la calidad del embedding resultante:

source: perplexity
es_es: perplejidad

source: early exaggeration factor
es_es: factor de exageración temprana

source: learning rate
es_es: tasa de aprendizaje

source: maximum number of iterations
es_es: número máximo de iteraciones

source: angle (not used in the exact method)
es_es: ángulo (no usado en el método exacto)

source: The perplexity is defined as :math:`k=2^{(S)}` where :math:`S` is the Shannon entropy of the conditional probability distribution. The perplexity of a :math:`k`-sided die is :math:`k`, so that :math:`k` is effectively the number of nearest neighbors t-SNE considers when generating the conditional probabilities. Larger perplexities lead to more nearest neighbors and less sensitive to small structure. Conversely a lower perplexity considers a smaller number of neighbors, and thus ignores more global information in favour of the local neighborhood. As dataset sizes get larger more points will be required to get a reasonable sample of the local neighborhood, and hence larger perplexities may be required. Similarly noisier datasets will require larger perplexity values to encompass enough local neighbors to see beyond the background noise.
es_es: La perplejidad esta definida como :math:`k=2^{(S)}` donde :math:`S` es la entropía de Shannon de la distribución de probabilidad condicional. La perplejidad de un dado de :math:`k` lados es :math:`k`, por lo que :math:`k` es efectivamente el número de vecinos mas cercanos que considera t-EEV cuando genera las probabilidades condicionales. Las perplejidades mas grandes llevan a mas vecinos cercanos y menor sensibilidad a estructuras pequeñas. Por el contrario, una perplejidad menor considera un número pequeño de vecinos, y por lo tanto ignora mas información global a favor de la vecindad local. Mientras los conjuntos de datos se vuelven mas grandes, mas puntos serán requeridos para obtener una muestra razonable de la vecindad local, y por lo tanto quizás sean requeridas perplejidades mas grandes. Similarmente, conjuntos de datos con mas ruido van a requerir valores de perplejidad mas grandes para abarcar suficientes vecinos locales para ver mas allá del ruido de fondo.

source: The maximum number of iterations is usually high enough and does not need any tuning. The optimization consists of two phases: the early exaggeration phase and the final optimization. During early exaggeration the joint probabilities in the original space will be artificially increased by multiplication with a given factor. Larger factors result in larger gaps between natural clusters in the data. If the factor is too high, the KL divergence could increase during this phase. Usually it does not have to be tuned. A critical parameter is the learning rate. If it is too low gradient descent will get stuck in a bad local minimum. If it is too high the KL divergence will increase during optimization. More tips can be found in Laurens van der Maaten's FAQ (see references). The last parameter, angle, is a tradeoff between performance and accuracy. Larger angles imply that we can approximate larger regions by a single point, leading to better speed but less accurate results.
es_es: El número maximo de iteraciones suele ser lo suficientemente alto y no requiere ningún ajuste. La optimización consiste en dos fases: la fase de exageración temprana y la última optimización. Durante la exageración temprana las probabilidades de conjunto en el espacio original serán incrementadas artificialmente mediante la multiplicación con un factor dado. Los factores mas grandes resultan en brechas mas grandes entre clusters naturales en los datos. Si el factor es demasiado grande, la divergencia KL podría incrementar en esta fase. Normalmente no requiere ser ajustado. Un parámetro crítico es la tasa de aprendizaje. Si es demasiado alta, la divergencia KL incrementara durante la optimización. Mas tips pueden ser encontrados en el FAQ de Laurens van der Maaten (ver referencias). El último parámetro, el ángulo, es un intercambio entre precisión y rendimiento. Ángulos mas grandes implican que podemos aproximar regiones mas grandes por un punto único, llevando a una mejor velocidad pero resultados menos precisos.

source: `"How to Use t-SNE Effectively" <https://distill.pub/2016/misread-tsne/>`_ provides a good discussion of the effects of the various parameters, as well as interactive plots to explore the effects of different parameters.
es_es: `"Como usar t-EEV efectivamente" <https://distill.pub/2016/misread-tsne/>`_ proporciona una buena discusión de los efectos de los diferentes parámetros, así como gráficos interactivos para explorar los efectos de diferentes parámetros.

source: Barnes-Hut t-SNE
es_es: t-EEV Barnes-Hut

source: The Barnes-Hut t-SNE that has been implemented here is usually much slower than other manifold learning algorithms. The optimization is quite difficult and the computation of the gradient is :math:`O[d N log(N)]`, where :math:`d` is the number of output dimensions and :math:`N` is the number of samples. The Barnes-Hut method improves on the exact method where t-SNE complexity is :math:`O[d N^2]`, but has several other notable differences:
es_es: El t-EEV Barnes-Hut que se ha implementado aquí es normalmente mucho más lento que otros algoritmos de aprendizaje de colectores. La optimización es bastante difícil y la computación del gradiente es :math:`O[d N log(N)]`, donde :math:`d` es el número de dimensiones de salida y :math:`N` es el número de muestras. El método Barnes-Hut mejora en el método exacto donde la complejidad t-EEV es :math:`O[d N^2]`, pero tiene otras diferencias notables:

source: The Barnes-Hut implementation only works when the target dimensionality is 3 or less. The 2D case is typical when building visualizations.
es_es: La implementación Barnes-Hut sólo funciona cuando la dimensionalidad objetivo es 3 o menos. El caso 2D es típico cuando se construyen visualizaciones.

source: Barnes-Hut only works with dense input data. Sparse data matrices can only be embedded with the exact method or can be approximated by a dense low rank projection for instance using :class:`~sklearn.decomposition.TruncatedSVD`
es_es: Barnes-Hut solo funciona con datos de entrada densos. A las matrices de datos dispersas solo se les puede realizar embedding con el método exacto o pueden ser aproximadas por una proyección de bajo rango densa, por ejemplo usando :class:`~sklearn.decomposition.TruncatedSVD`

source: Barnes-Hut is an approximation of the exact method. The approximation is parameterized with the angle parameter, therefore the angle parameter is unused when method="exact"
es_es: Barnes-Hut es una aproximación del método exacto. La aproximación se parametriza con el parámetro del ángulo, por lo tanto el parámetro angle no se utiliza cuando method="exact"

source: Barnes-Hut is significantly more scalable. Barnes-Hut can be used to embed hundred of thousands of data points while the exact method can handle thousands of samples before becoming computationally intractable
es_es: Barnes-Hut es significativamente más escalable. Barnes-Hut puede ser usado para realizar embedding en cientos de miles de puntos de datos, mientras que el método exacto solo puede manejar miles de muestras antes de volverse inmanejable computacionalmente

source: For visualization purpose (which is the main use case of t-SNE), using the Barnes-Hut method is strongly recommended. The exact t-SNE method is useful for checking the theoretically properties of the embedding possibly in higher dimensional space but limit to small datasets due to computational constraints.
es_es: Para fines de visualización (el cual es el principal uso del t-EEV) se recomienda encarecidamente utilizar el método Barnes-Hut. El método exacto t-EEV es útil para comprobar las propiedades teóricas del embedding, posiblemente en espacio de alta dimensionalidad pero limitado a conjuntos de datos pequeños debido a restricciones computacionales.

source: Also note that the digits labels roughly match the natural grouping found by t-SNE while the linear 2D projection of the PCA model yields a representation where label regions largely overlap. This is a strong clue that this data can be well separated by non linear methods that focus on the local structure (e.g. an SVM with a Gaussian RBF kernel). However, failing to visualize well separated homogeneously labeled groups with t-SNE in 2D does not necessarily imply that the data cannot be correctly classified by a supervised model. It might be the case that 2 dimensions are not low enough to accurately represents the internal structure of the data.
es_es: También note que las etiquetas de los digitos mas o menos corresponden al agrupamiento natural encontrado por t-EEV mientras que la proyección 2D lineal del modelo APC da una representación donde gran parte de las regiones de etiqueta se solapan. Esta es una pista importante de que estos datos pueden ser bien separados por métodos no lineales que se enfocan en la estructural local (por ejemplo, un SVM con un kernel RBF Gaussiana). Sin embargo, no visualizar grupos bien separados etiquetados de forma homogénea con t-EEV en 2D no implica necesariamente que los datos no pueden ser clasificados correctamente por un modelo supervisado. Quizás sea el caso que 2 dimensiones no son lo suficientemente bajas como para representar de manera precisa la estructura interna de los datos.

source: Tips on practical use
es_es: Consejos sobre el uso práctico

source: Make sure the same scale is used over all features. Because manifold learning methods are based on a nearest-neighbor search, the algorithm may perform poorly otherwise. See :ref:`StandardScaler <preprocessing_scaler>` for convenient ways of scaling heterogeneous data.
es_es: Asegúrese que la misma escala se usa en toda las características, Debido a que los métodos de aprendizaje de colector están basados en una búsqueda de vecino más cercano. el algoritmo podría tener un rendimiento deficiente si no es así. Vea :ref:`StandardScaler <preprocessing_scaler>` para formas convenientes de escalar datos heterogéneos.

source: The reconstruction error computed by each routine can be used to choose the optimal output dimension. For a :math:`d`-dimensional manifold embedded in a :math:`D`-dimensional parameter space, the reconstruction error will decrease as ``n_components`` is increased until ``n_components == d``.
es_es: El error de reconstrucción calculado por cada rutina se puede utilizar para escoger la dimensión de salida óptima. Para un colector :math:`d`-dimensional incrustado en un espacio de parámetro :math:`D`-dimensional, el error de reconstrucción disminuirá a medida que ``n_componentes`` se incremente hasta que ``n_components == d``.

source: Note that noisy data can "short-circuit" the manifold, in essence acting as a bridge between parts of the manifold that would otherwise be well-separated. Manifold learning on noisy and/or incomplete data is an active area of research.
es_es: Tenga en cuenta que los datos ruidosos pueden hacerle un "cortocircuito" al colector, en esencia actuando como un puente entre partes del colector que de otro modo estarían bien separadas. El aprendizaje del colector en datos incompletos o ruidosos es una área activa de investigación.

source: Certain input configurations can lead to singular weight matrices, for example when more than two points in the dataset are identical, or when the data is split into disjointed groups. In this case, ``solver='arpack'`` will fail to find the null space. The easiest way to address this is to use ``solver='dense'`` which will work on a singular matrix, though it may be very slow depending on the number of input points. Alternatively, one can attempt to understand the source of the singularity: if it is due to disjoint sets, increasing ``n_neighbors`` may help. If it is due to identical points in the dataset, removing these points may help.
es_es: Ciertas configuraciones de entrada pueden llevar a matrices de ponderado singulares, por ejemplo cuando mas de dos puntos en el conjunto de datos son idénticos, o cuando los datos son divididos en grupos disociados. En este caso, ``solver='arpack'`` no logrará encontrar el espacio nulo. La forma mas sencilla de abordar esto es usar ``solver='dense'``, lo cual funcionara en una matriz singular, aunque quizás sea muy lento dependiendo del número de puntos de entrada. Alternativamente, uno puede intentar entender la fuente de la singularidad: si es debido a conjuntos disjuntos, incrementar ``n_neighbors`` quizás ayude. Si es debido a puntos idénticos en el conjunto de datos, quitar estos puntos quizás ayude.

source: :ref:`random_trees_embedding` can also be useful to derive non-linear representations of feature space, also it does not perform dimensionality reduction.
es_es: :ref:`random_trees_embedding` también puede ser útil para derivar representaciones no lineales del espacio de característica, y no realiza una reducción de dimensionalidad.
