Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/manifold.po
Languages: es_es

source: Manifold learning
es_es: Aprendizaje múltiple

source: Look for the bare necessities
es_es: Busca lo más vital, no más

source: The simple bare necessities
es_es: Lo que es necesidad no más

source: Forget about your worries and your strife
es_es: Y olvídate de la preocupación

source: I mean the bare necessities
es_es: Tan sólo, lo muy esencial

source: Old Mother Nature's recipes
es_es: Para vivir sin batallar

source: That bring the bare necessities of life
es_es: Y la naturaleza te lo da

source: -- Baloo's song [The Jungle Book]
es_es: -- Canción de Baloo [El Libro de la Selva]

source: Manifold learning is an approach to non-linear dimensionality reduction. Algorithms for this task are based on the idea that the dimensionality of many data sets is only artificially high.
es_es: El aprendizaje múltiple es un acercamiento a la reducción de dimensionalidad no lineal. Los algoritmos para esta tarea se basan en la idea de que la dimensionalidad de muchos conjuntos de datos es sólo alta artificialmente.

source: Introduction
es_es: Introducción

source: High-dimensional datasets can be very difficult to visualize. While data in two or three dimensions can be plotted to show the inherent structure of the data, equivalent high-dimensional plots are much less intuitive. To aid visualization of the structure of a dataset, the dimension must be reduced in some way.
es_es: Los conjuntos de datos de alta dimensión pueden ser muy difíciles de visualizar. Mientras que los datos en dos o tres dimensiones se pueden graficar para mostrar la estructura inherente de los datos, los graficos equivalentes de alta dimensión son mucho menos intuitivos. Para ayudar a la visualización de la estructura de un conjunto de datos, la dimensión debe ser reducida de alguna forma.

source: The simplest way to accomplish this dimensionality reduction is by taking a random projection of the data. Though this allows some degree of visualization of the data structure, the randomness of the choice leaves much to be desired. In a random projection, it is likely that the more interesting structure within the data will be lost.
es_es: La forma mas sencilla de lograr esta reducción de dimensionalidad es tomando una proyección aleatoria de los datos. Aunque esto permite cierto grado de visualización de la estructura de datos, la aleatoridad de la elección deja mucho que ser deseado. En una proyección aleatoria, es probable que las estructuras mas interesantes dentro de los datos se pierdan.

source: To address this concern, a number of supervised and unsupervised linear dimensionality reduction frameworks have been designed, such as Principal Component Analysis (PCA), Independent Component Analysis, Linear Discriminant Analysis, and others. These algorithms define specific rubrics to choose an "interesting" linear projection of the data. These methods can be powerful, but often miss important non-linear structure in the data.
es_es: Para abordar esta inquietud, un número de frameworks de reducción de dimensionalidad lineal supervisada y no supervisada han sido diseñados, como el Análisis Principal de Componentes (APC, o PCA en ingles), Análisis Independiente de Componentes, Análisis Discriminante Lineal, y otros. Estos algoritmos definen rubricas especificas para escoger una proyección lineal "interesante" de los datos. Estos métodos pueden ser poderosos, pero frecuentemente pierden estructuras importantes no lineales en los datos.

source: Manifold Learning can be thought of as an attempt to generalize linear frameworks like PCA to be sensitive to non-linear structure in data. Though supervised variants exist, the typical manifold learning problem is unsupervised: it learns the high-dimensional structure of the data from the data itself, without the use of predetermined classifications.
es_es: El aprendizaje múltiple puede ser considerado como un intento de generalizar frameworks lineales como el APC para ser sensibles a estructuras no lineales en los datos. Aunque existen variantes supervisadas, el problema típico de aprendizaje múltiple es sin supervisión, aprende la estructura de alta-dimensionalidad de los datos dentro de los propios datos, sin el uso de clasificaciones predeterminadas.

source: See :ref:`sphx_glr_auto_examples_manifold_plot_lle_digits.py` for an example of dimensionality reduction on handwritten digits.
es_es: Vea :ref:`sphx_glr_auto_examples_manifold_plot_lle_digits.py` para un ejemplo de reducción de dimensionalidad en dígitos escritos a mano.

source: See :ref:`sphx_glr_auto_examples_manifold_plot_compare_methods.py` for an example of dimensionality reduction on a toy "S-curve" dataset.
es_es: Vea :ref:`sphx_glr_auto_examples_manifold_plot_compare_methods.py` para un ejemplo de reducción de dimensionalidad en un conjunto de datos "S-curve" de juguete.

source: The manifold learning implementations available in scikit-learn are summarized below
es_es: Las implementaciones del aprendizaje múltiple disponibles en scikit-learn se resumen a continuación

source: One of the earliest approaches to manifold learning is the Isomap algorithm, short for Isometric Mapping. Isomap can be viewed as an extension of Multi-dimensional Scaling (MDS) or Kernel PCA. Isomap seeks a lower-dimensional embedding which maintains geodesic distances between all points. Isomap can be performed with the object :class:`Isomap`.
es_es: Uno de los acercamientos más antiguos al aprendizaje múltiple es el algoritmo Isomap, abreviatura de Mapeo Isometrico. Isomap puede ser visto como una extensión del Escalado Multi-dimensional (EMD, o MDS en inglés) o APC Kernel. Isomap busca un embedding de dimensionalidad mas baja que mantiene distancias geodésicas entre todos los puntos. Se puede utilizar Isomap con el objeto :class:`Isomap`.

source: Complexity
es_es: Complejidad

source: The Isomap algorithm comprises three stages:
es_es: El algoritmo Isomap comprende tres etapas:

source: **Nearest neighbor search.** Isomap uses :class:`~sklearn.neighbors.BallTree` for efficient neighbor search. The cost is approximately :math:`O[D \log(k) N \log(N)]`, for :math:`k` nearest neighbors of :math:`N` points in :math:`D` dimensions.
es_es: **Búsqueda de vecino más cercana.** Isomap utiliza :class:`~sklearn.neighbors.BallTree` para una búsqueda eficiente de vecinos. El costo es de aproximadamente :math:`O[D \log(k) N \log(N)]`, para :math:`k` vecinos más cercanos de :math:`N` en :math:`D` dimensiones.

source: **Shortest-path graph search.** The most efficient known algorithms for this are *Dijkstra's Algorithm*, which is approximately :math:`O[N^2(k + \log(N))]`, or the *Floyd-Warshall algorithm*, which is :math:`O[N^3]`. The algorithm can be selected by the user with the ``path_method`` keyword of ``Isomap``. If unspecified, the code attempts to choose the best algorithm for the input data.
es_es: **Búsqueda en el gráfico del camino más corto.** Los algoritmos conocidos más eficientes para esto son el *Algoritmo de Dijkstra*, el cual es aproximadamente :math:`O[N^2(k + \log(N))]`, o el *Algoritmo Floyd-Warshall*, que es :math:`O[N^3]`. El algoritmo puede ser seleccionado por el usuario con la palabra clave ``path_method`` de ``Isomap``. Si se deja sin especificar, el código intenta escoger el mejor algoritmo para los dato de entrada.

source: **Partial eigenvalue decomposition.** The embedding is encoded in the eigenvectors corresponding to the :math:`d` largest eigenvalues of the :math:`N \times N` isomap kernel. For a dense solver, the cost is approximately :math:`O[d N^2]`. This cost can often be improved using the ``ARPACK`` solver. The eigensolver can be specified by the user with the ``eigen_solver`` keyword of ``Isomap``. If unspecified, the code attempts to choose the best algorithm for the input data.
es_es: **Descomposición parcial del autovalor.** El embedding está codificado en los autovectores correspondiendo a los autovalores más altos :math:`d` del kernel isomap :math:`N \times N`. Para un solucionador denso, el costo es aproximadamente :math:`O[d N^2]`. Este costo puede frecuentemente ser mejorado utilizando el solucionador ``ARPACK``. El autosolucionador puede ser especificado por el usuario con la palabra clave ``eigen_solver`` de ``Isomap``. Si se deja sin especificar, el código intenta escoger el mejor algoritmo para los datos de entrada.

source: The overall complexity of Isomap is :math:`O[D \log(k) N \log(N)] + O[N^2(k + \log(N))] + O[d N^2]`.
es_es: La complejidad general de Isomap es :math:`O[D \\log(k) N \\log(N)] + O[N^2(k + \\log(N))] + O[d N^2]`.

source: :math:`N` : number of training data points
es_es: :math:`N` : número de puntos de datos de entrenamiento

source: :math:`D` : input dimension
es_es: :math:`D`: dimensión de entrada

source: :math:`k` : number of nearest neighbors
es_es: :math:`k` : número de vecinos más cercanos

source: :math:`d` : output dimension
es_es: :math:`d`: dimensión de salida

source: Locally Linear Embedding
es_es: Embedding localmente lineal

source: Locally linear embedding (LLE) seeks a lower-dimensional projection of the data which preserves distances within local neighborhoods. It can be thought of as a series of local Principal Component Analyses which are globally compared to find the best non-linear embedding.
es_es: El embedding localmente lineal (ELL, o LLE en inglés) busca una proyección de menor dimensionalidad de los datos que preserva distancias dentro de los vecindarios locales. Puede ser pensado como una serie de Análisis Principales de Componentes, los cuales son comparados globalmente para encontrar la mejor incrustación no lineal.

source: Locally linear embedding can be performed with function :func:`locally_linear_embedding` or its object-oriented counterpart :class:`LocallyLinearEmbedding`.
es_es: El embedding localmente lineal puede ser realizado con la función :func:`locally_linear_embedding` o su contraparte orientada a objetos :class:`LocallyLinearEmbedding`.

source: The standard LLE algorithm comprises three stages:
es_es: El algoritmo ELL estándar comprende tres etapas:

source: **Nearest Neighbors Search**. See discussion under Isomap above.
es_es: **Búsqueda de vecinos más cercanos**. Ver la discusión bajo Isomap más arriba.

source: **Weight Matrix Construction**. :math:`O[D N k^3]`. The construction of the LLE weight matrix involves the solution of a :math:`k \times k` linear equation for each of the :math:`N` local neighborhoods
es_es: **Construcción de la matriz de ponderados**. :math:`O[D N k^3]`. La construcción de la matriz de ponderados ELL involucra la solución de una ecuación lineal :math:`k \times k` para cada uno de los :math:`N` vecindarios locales

source: **Partial Eigenvalue Decomposition**. See discussion under Isomap above.
es_es: **Decomposición de Autovalores Parcial**. Ver la discusión bajo Isomap más arriba.

source: The overall complexity of standard LLE is :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[d N^2]`.
es_es: La complejidad general del ELL estándar es :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[d N^2]`.

source: Modified Locally Linear Embedding
es_es: Embedding modificado localmente lineal

source: One well-known issue with LLE is the regularization problem. When the number of neighbors is greater than the number of input dimensions, the matrix defining each local neighborhood is rank-deficient. To address this, standard LLE applies an arbitrary regularization parameter :math:`r`, which is chosen relative to the trace of the local weight matrix. Though it can be shown formally that as :math:`r \to 0`, the solution converges to the desired embedding, there is no guarantee that the optimal solution will be found for :math:`r > 0`. This problem manifests itself in embeddings which distort the underlying geometry of the manifold.
es_es: Un problema bastante bien conocida con ELL es el problema de regularización. Cuando el número de vecinos es mayor que el número de dimensiones de entrada, la matriz definiendo cada vecindario local es deficiente de rango. Para abordar esto, el ELL estándar aplica un parámetro de regularización arbitraria :math:`r`, que se escoge en función del trazo de la matriz de ponderados local. Aunque puede comprobarse formalmente que cuando :math:`r \to 0`, la solución converge al embedding buscado, no hay garantía de que la solución óptima se encontrara para :math:`r > 0`. Este problema se manifiesta en embeddings que distorsionan la geometría subyacente del colector.

source: One method to address the regularization problem is to use multiple weight vectors in each neighborhood. This is the essence of *modified locally linear embedding* (MLLE). MLLE can be performed with function :func:`locally_linear_embedding` or its object-oriented counterpart :class:`LocallyLinearEmbedding`, with the keyword ``method = 'modified'``. It requires ``n_neighbors > n_components``.
es_es: Un método para abordar el problema de regularización es usar multiples ponderados de vectores en cada vecindario. Esta es la esencia del *embedding modíficado localmente lineal* (EMLL). El EMLL puede ser utilizado con la función :func:`locally_linear_embedding`, y también su contraparte orientada a objetos :class:`LocallyLinearEmbedding`, con la palabra clave ``method = 'modified'``. Requiere que ``n_neighbors > n_components``.

source: The MLLE algorithm comprises three stages:
es_es: El algoritmo EMLL comprende tres etapas:

source: **Nearest Neighbors Search**. Same as standard LLE
es_es: **Búsqueda de vecinos más cercanos**. Igual que el ELL estándar

source: **Weight Matrix Construction**. Approximately :math:`O[D N k^3] + O[N (k-D) k^2]`. The first term is exactly equivalent to that of standard LLE. The second term has to do with constructing the weight matrix from multiple weights. In practice, the added cost of constructing the MLLE weight matrix is relatively small compared to the cost of stages 1 and 3.
es_es: **Construcción de matríz de ponderados**. Aproximadamente :math:`O[D N k^3] + O[N (k-D) k^2]`. El primer termino es exactamente equivalente a aquél del ELL estándar. El segundo termino tiene que ver con la construcción de la matriz de ponderados desde multiples ponderados. En la practica, el costo añadido de construir la matriz de ponderados EMLL es relativamente pequeña comparada al costo de las etapas 1 y 3.

source: **Partial Eigenvalue Decomposition**. Same as standard LLE
es_es: **Decomposición de Autovalores Parcial**. Igual que el ELL estándar

source: The overall complexity of MLLE is :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[N (k-D) k^2] + O[d N^2]`.
es_es: La complejidad general del EMLL es :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[N (k-D) k^2] + O[d N^2]`.

source: Hessian Eigenmapping
es_es: Eigenmapeo Hessiano

source: Hessian Eigenmapping (also known as Hessian-based LLE: HLLE) is another method of solving the regularization problem of LLE. It revolves around a hessian-based quadratic form at each neighborhood which is used to recover the locally linear structure. Though other implementations note its poor scaling with data size, ``sklearn`` implements some algorithmic improvements which make its cost comparable to that of other LLE variants for small output dimension. HLLE can be performed with function :func:`locally_linear_embedding` or its object-oriented counterpart :class:`LocallyLinearEmbedding`, with the keyword ``method = 'hessian'``. It requires ``n_neighbors > n_components * (n_components + 3) / 2``.
es_es: El Eigenmapeo Hessiano (también conocido como ELL basado en Hessians: ELLH) es otro método para resolver el problema de regularización del ELL. Revuelve alrededor de una forma cuadrática basada en hessianos en cada vecindad que es usada para recuperar la estructura localmente lineal. Aunque otras implementaciones señalan su mal escalamiento con el tamaño de los datos, ``sklearn`` implementa algunas mejoras algorítmicas que hacen que su costo sea comparable a aquel de otras variantes ELL para dimensiones de salida pequeñas. Se puede realizar el ELLH con la función :func:`locally_linear_embedding` o su contraparte orientada a objetos :class:`LocallyLinearEmbedding`, con la palabra clave ``method = 'hessian'``. Requiere que ``n_neighbors > n_components * (n_components + 3) / 2``.

source: The HLLE algorithm comprises three stages:
es_es: El algoritmo ELLH comprende tres etapas:

source: **Weight Matrix Construction**. Approximately :math:`O[D N k^3] + O[N d^6]`. The first term reflects a similar cost to that of standard LLE. The second term comes from a QR decomposition of the local hessian estimator.
es_es: **Construcción de la Matriz de Ponderado**. Aproximadamente :math:`O[D N k^3] + O[N d^6]`. El primer término refleja un costo similar a aquel del ELL estándar. El segundo término viene de una descomposición QR del estimador local de hessianos.

source: The overall complexity of standard HLLE is :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[N d^6] + O[d N^2]`.
es_es: La complejidad general del ELLH estándar es :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[N d^6] + O[d N^2]`.

source: Spectral Embedding
es_es: Embedding Espectral

source: Spectral Embedding is an approach to calculating a non-linear embedding. Scikit-learn implements Laplacian Eigenmaps, which finds a low dimensional representation of the data using a spectral decomposition of the graph Laplacian. The graph generated can be considered as a discrete approximation of the low dimensional manifold in the high dimensional space. Minimization of a cost function based on the graph ensures that points close to each other on the manifold are mapped close to each other in the low dimensional space, preserving local distances. Spectral embedding can be performed with the function :func:`spectral_embedding` or its object-oriented counterpart :class:`SpectralEmbedding`.
es_es: El Embedding Espectral es un acercamiento al calculo de un embedding no lineal. Scikit-learn implementa Eigenmaps Laplacianos, los cuales encuentran una representación de baja dimensión de los datos usando una descomposición espectral del Laplaciano del gráfico. El gráfico generado puede considerarse una aproximación discreta del colector de baja dimensión en el espacio de alta dimensión. La minimización de una función de costo basada en el gráfico asegura que los puntos cercanos en el colector son mapeados cerca uno de los otros en el espacio de baja dimensión, preservando distancias locales. El Embedding Espectral puede realizarse con la función :func:`spectral_embedding` o con su contraparte orientada a objetos :class:`SpectralEmbedding`.

source: The Spectral Embedding (Laplacian Eigenmaps) algorithm comprises three stages:
es_es: El algoritmo de Embedding Espectral (Eigenmaps Laplacianos) comprende tres etapas:

source: **Weighted Graph Construction**. Transform the raw input data into graph representation using affinity (adjacency) matrix representation.
es_es: **Construcción de gráfico ponderado**. Transforma los datos de entrada en bruto en una representación gráfica usando una representación de matriz por afinidad (adyacencia).

source: **Graph Laplacian Construction**. unnormalized Graph Laplacian is constructed as :math:`L = D - A` for and normalized one as :math:`L = D^{-\frac{1}{2}} (D - A) D^{-\frac{1}{2}}`.
es_es: **Construcción del Grafo Laplaciano**. El grafo Laplaciano sin normalizar se construye como :math:`L = D - A` y el normalizado se construye como :math:`L = D^{-\frac{1}{2}} (D - A) D^{-\frac{1}{2}}`.

source: **Partial Eigenvalue Decomposition**. Eigenvalue decomposition is done on graph Laplacian
es_es: **Decomposición parcial de Autovalor**. La descomposición del autovalor se realiza en el grafo Laplaciano

source: The overall complexity of spectral embedding is :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[d N^2]`.
es_es: La complejidad general del embedding espectral es :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[d N^2]`.

source: Local Tangent Space Alignment
es_es: Alineación del Espacio Tangente Local

source: Though not technically a variant of LLE, Local tangent space alignment (LTSA) is algorithmically similar enough to LLE that it can be put in this category. Rather than focusing on preserving neighborhood distances as in LLE, LTSA seeks to characterize the local geometry at each neighborhood via its tangent space, and performs a global optimization to align these local tangent spaces to learn the embedding. LTSA can be performed with function :func:`locally_linear_embedding` or its object-oriented counterpart :class:`LocallyLinearEmbedding`, with the keyword ``method = 'ltsa'``.
es_es: Aunque técnicamente no sea una variante del ELL, el alineamiento del espacio tangente local (AETL, o LTSA en inglés) es lo suficientemente similar algoritmicamente al ELL que se puede poner en esta categoría. En lugar de enfocarse en preservar distancias de vecindad como en el ELL, el AETL busca caracterizar la geometría local en cada vecindad mediante su espacio tangente, y realiza una optimización global para alinear estos espacios locales tangentes y así aprender el embedding. El AETL puede realizarse con la función :func:`locally_linear_embedding` o su contraparte orientada a objetos :class:`LocallyLinearEmbedding`, con la palabra clave ``method = 'ltsa'``.

source: The LTSA algorithm comprises three stages:
es_es: El algoritmo AETL comprende tres etapas:

source: **Weight Matrix Construction**. Approximately :math:`O[D N k^3] + O[k^2 d]`. The first term reflects a similar cost to that of standard LLE.
es_es: **Construcción de la matriz de ponderado**. Aproximadamente :math:`O[D N k^3] + O[k^2 d]`. El primer termino refleja un costo similar al del ELL estándar.

source: The overall complexity of standard LTSA is :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[k^2 d] + O[d N^2]`.
es_es: La complejidad general del AETL estándar es :math:`O[D \log(k) N \log(N)] + O[D N k^3] + O[k^2 d] + O[d N^2]`.

source: Multi-dimensional Scaling (MDS)
es_es: Escalamiento Multidimensional (EMD)

source: `Multidimensional scaling <https://en.wikipedia.org/wiki/Multidimensional_scaling>`_ (:class:`MDS`) seeks a low-dimensional representation of the data in which the distances respect well the distances in the original high-dimensional space.
es_es: `Escalamiento multidimensional <https://es.wikipedia.org/wiki/Escalamiento_multidimensional>`_(:class:`MDS`) busca una representación de dimensión baja de los datos en los cuales las distancias respetan bien las distancias en el espacio altodimensional original.

source: In general, :class:`MDS` is a technique used for analyzing similarity or dissimilarity data. It attempts to model similarity or dissimilarity data as distances in a geometric spaces. The data can be ratings of similarity between objects, interaction frequencies of molecules, or trade indices between countries.
es_es: En general, :class:`MDS` es una técnica utilizada para analizar datos de similitud o disimilitud. Intenta modelar la similitud o disimilitud de los datos como distancias en espacios geométricos. Los datos pueden ser calificaciones de similitud entre objetos, frecuencias de interacción de moléculas, o índices de comercio entre países.
