Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/metrics.po
Languages: es_es

source: Pairwise metrics, Affinities and Kernels
es_es: Métricas por pares, afinidades y núcleos

source: The :mod:`sklearn.metrics.pairwise` submodule implements utilities to evaluate pairwise distances or affinity of sets of samples.
es_es: El submódulo :mod:`sklearn.metrics.pairwise` implementa utilidades para evaluar las distancias por pares o la afinidad de conjuntos de muestras.

source: This module contains both distance metrics and kernels. A brief summary is given on the two here.
es_es: Este módulo contiene métricas de distancia y núcleos. Aquí se presenta un breve resumen de ambos.

source: Distance metrics are functions ``d(a, b)`` such that ``d(a, b) < d(a, c)`` if objects ``a`` and ``b`` are considered "more similar" than objects ``a`` and ``c``. Two objects exactly alike would have a distance of zero. One of the most popular examples is Euclidean distance. To be a 'true' metric, it must obey the following four conditions::
es_es: Las métricas de distancia son funciones ``d(a, b)`` tales que ``d(a, b) < d(a, c)`` si los objetos ``a`` y ``b`` se consideran "más similares" que los objetos ``a`` y ``c``. Dos objetos exactamente iguales tendrían una distancia de cero. Uno de los ejemplos más populares es la distancia Euclidiana. Para ser una "verdadera" métrica, debe obedecer las siguientes cuatro condiciones::

source: Kernels are measures of similarity, i.e. ``s(a, b) > s(a, c)`` if objects ``a`` and ``b`` are considered "more similar" than objects ``a`` and ``c``. A kernel must also be positive semi-definite.
es_es: Los núcleos son medidas de similitud, es decir, ``s(a, b) > s(a, c)`` si los objetos ``a`` y ``b`` son considerados "más similares" que los objetos ``a`` y ``c``. Un núcleo también debe ser semi-definido positivo.

source: There are a number of ways to convert between a distance metric and a similarity measure, such as a kernel. Let ``D`` be the distance, and ``S`` be the kernel:
es_es: Hay varias formas de convertir entre una métrica de distancia y una medida de similitud, como un núcleo. Sea ``D`` la distancia y ``S`` el núcleo:

source: ``S = np.exp(-D * gamma)``, where one heuristic for choosing ``gamma`` is ``1 / num_features``
es_es: ``S = np.exp(-D * gamma)``, donde una heurística para elegir ``gamma`` es ``1 / num_features``

source: The distances between the row vectors of ``X`` and the row vectors of ``Y`` can be evaluated using :func:`pairwise_distances`. If ``Y`` is omitted the pairwise distances of the row vectors of ``X`` are calculated. Similarly, :func:`pairwise.pairwise_kernels` can be used to calculate the kernel between `X` and `Y` using different kernel functions. See the API reference for more details.
es_es: Las distancias entre los vectores fila de ``X`` y los vectores fila de ``Y`` pueden evaluarse utilizando :func:`pairwise_distances`. Si se omite ``Y`` se calculan las distancias por pares de los vectores fila de ``X``. Del mismo modo, :func:`pairwise.pairwise_kernels` puede utilizarse para calcular el núcleo entre `X` y `Y` utilizando diferentes funciones de núcleo. Consulte la referencia de la API para obtener más detalles.

source: Cosine similarity
es_es: Similitud del coseno

source: :func:`cosine_similarity` computes the L2-normalized dot product of vectors. That is, if :math:`x` and :math:`y` are row vectors, their cosine similarity :math:`k` is defined as:
es_es: :func:`cosine_similarity` calcula el producto punto normalizado L2 de los vectores. Es decir, si :math:`x` y :math:`y` son vectores de fila, su similitud coseno :math:`k` se define como:

source: This is called cosine similarity, because Euclidean (L2) normalization projects the vectors onto the unit sphere, and their dot product is then the cosine of the angle between the points denoted by the vectors.
es_es: Esto se llama similitud del coseno, porque la normalización euclidiana (L2) proyecta los vectores sobre la esfera unitaria, y su producto de puntos es entonces el coseno del ángulo entre los puntos denotados por los vectores.

source: This kernel is a popular choice for computing the similarity of documents represented as tf-idf vectors. :func:`cosine_similarity` accepts ``scipy.sparse`` matrices. (Note that the tf-idf functionality in ``sklearn.feature_extraction.text`` can produce normalized vectors, in which case :func:`cosine_similarity` is equivalent to :func:`linear_kernel`, only slower.)
es_es: Este núcleo es una opción popular para calcular la similitud de documentos representados como vectores tf-idf. :func:`cosine_similarity` acepta matrices ``scipy.sparse``. (Ten en cuenta que la funcionalidad tf-idf en ``sklearn.feature_extraction.text`` puede producir vectores normalizados, en cuyo caso :func:`cosine_similarity` es equivalente a :func:`linear_kernel`, sólo que más lento.)

source: Linear kernel
es_es: Núcleo lineal

source: The function :func:`linear_kernel` computes the linear kernel, that is, a special case of :func:`polynomial_kernel` with ``degree=1`` and ``coef0=0`` (homogeneous). If ``x`` and ``y`` are column vectors, their linear kernel is:
es_es: La función :func:`linear_kernel` calcula el núcleo lineal, es decir, un caso especial de :func:`polynomial_kernel` con ``degree=1`` y ``coef0=0`` (homogéneo). Si ``x`` y ``y`` son vectores columna, su núcleo lineal es:

source: Polynomial kernel
es_es: Núcleo polinomial

source: The function :func:`polynomial_kernel` computes the degree-d polynomial kernel between two vectors. The polynomial kernel represents the similarity between two vectors. Conceptually, the polynomial kernels considers not only the similarity between vectors under the same dimension, but also across dimensions. When used in machine learning algorithms, this allows to account for feature interaction.
es_es: La función :func:`polynomial_kernel` calcula el núcleo polinómico de grado-d entre dos vectores. El núcleo polinomial representa la similitud entre dos vectores. Conceptualmente, el núcleo polinomial considera no sólo la similitud entre vectores bajo la misma dimensión, sino también entre dimensiones. Cuando se utiliza en algoritmos de aprendizaje automático, esto permite tener en cuenta la interacción de las características.

source: The polynomial kernel is defined as:
es_es: El núcleo polinomial se define como:

source: where:
es_es: donde:

source: ``x``, ``y`` are the input vectors
es_es: ``x``, ``y`` son los vectores de entrada

source: ``d`` is the kernel degree
es_es: ``d`` es el grado del núcleo

source: If :math:`c_0 = 0` the kernel is said to be homogeneous.
es_es: Si :math:`c_0 = 0` se dice que el núcleo es homogéneo.

source: Sigmoid kernel
es_es: Núcleo sigmoidal

source: The function :func:`sigmoid_kernel` computes the sigmoid kernel between two vectors. The sigmoid kernel is also known as hyperbolic tangent, or Multilayer Perceptron (because, in the neural network field, it is often used as neuron activation function). It is defined as:
es_es: La función :func:`sigmoid_kernel` calcula el núcleo sigmoidal entre dos vectores. El núcleo sigmoidal también se conoce como tangente hiperbólica, o Perceptrón Multicapa (porque, en el campo de las redes neuronales, se utiliza a menudo como función de activación de las neuronas). Se define como:

source: :math:`\gamma` is known as slope
es_es: :math:`\gamma` es conocido como pendiente

source: :math:`c_0` is known as intercept
es_es: :math:`c_0` es conocido como intersección

source: RBF kernel
es_es: Núcleo RBF

source: The function :func:`rbf_kernel` computes the radial basis function (RBF) kernel between two vectors. This kernel is defined as:
es_es: La función :func:`rbf_kernel` calcula el núcleo de la función de base radial (RBF) entre dos vectores. Este núcleo se define como:

source: where ``x`` and ``y`` are the input vectors. If :math:`\gamma = \sigma^{-2}` the kernel is known as the Gaussian kernel of variance :math:`\sigma^2`.
es_es: donde ``x`` y ``y`` son los vectores de entrada. Si :math:`\gamma = \sigma^{-2}` el núcleo es conocido como el núcleo Gaussiano de varianza :math:`\sigma^2`.

source: Laplacian kernel
es_es: Núcleo Laplaciano

source: The function :func:`laplacian_kernel` is a variant on the radial basis function kernel defined as:
es_es: La función :func:`laplacian_kernel` es una variante en el núcleo de la función radial definida como:

source: where ``x`` and ``y`` are the input vectors and :math:`\|x-y\|_1` is the Manhattan distance between the input vectors.
es_es: donde ``x`` y ``y`` son los vectores de entrada y :math:`\|x-y\|_1` es la distancia de Manhattan entre los vectores de entrada.

source: It has proven useful in ML applied to noiseless data. See e.g. `Machine learning for quantum mechanics in a nutshell <https://onlinelibrary.wiley.com/doi/10.1002/qua.24954/abstract/>`_.
es_es: Se ha demostrado su utilidad en el aprendizaje automático aplicado a datos sin ruido. Ver, por ejemplo, `Machine learning for quantum mechanics in a nutshell <https://onlinelibrary.wiley.com/doi/10.1002/qua.24954/abstract/>`_.

source: Chi-squared kernel
es_es: Núcleo chi-cuadrado

source: The chi-squared kernel is a very popular choice for training non-linear SVMs in computer vision applications. It can be computed using :func:`chi2_kernel` and then passed to an :class:`~sklearn.svm.SVC` with ``kernel="precomputed"``::
es_es: El núcleo chi-cuadrado es una opción muy popular para entrenar SVMs no lineales en aplicaciones de visión por computadora. Se puede calcular utilizando :func:`chi2_kernel` y luego pasar a una :class:`~sklearn.svm.SVC` con ``kernel="precomputed"``::

source: It can also be directly used as the ``kernel`` argument::
es_es: También puede ser utilizado directamente como el argumento ``núcleo``::

source: The chi squared kernel is given by
es_es: El núcleo chi cuadrado es dado por

source: The data is assumed to be non-negative, and is often normalized to have an L1-norm of one. The normalization is rationalized with the connection to the chi squared distance, which is a distance between discrete probability distributions.
es_es: Se supone que los datos son no negativos, y a menudo se normalizan para que tengan una norma L1 de uno. La normalización se racionaliza con la conexión a la distancia chi cuadrada, que es una distancia entre distribuciones de probabilidad discretas.

source: The chi squared kernel is most commonly used on histograms (bags) of visual words.
es_es: El núcleo chi cuadrado es el más utilizado en los histogramas (bolsas) de palabras visuales.
