Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/mixture.po
Languages: es_es

source: Gaussian mixture models
es_es: Modelos de mezclas gaussianas

source: ``sklearn.mixture`` is a package which enables one to learn Gaussian Mixture Models (diagonal, spherical, tied and full covariance matrices supported), sample them, and estimate them from data. Facilities to help determine the appropriate number of components are also provided.
es_es: ``sklearn.mixture`` es un paquete que permite aprender Modelos de Mezcla Gaussiana (matrices diagonales, esféricas, enlazadas y de completa covarianza soportadas), su muestreo, y estimarlos desde los datos. También se proporcionan facultades para ayudar a determinar el número apropiado de componentes.

source: **Two-component Gaussian mixture model:** *data points, and equi-probability surfaces of the model.*
es_es: **Modelo de mezcla Gaussiana de dos componentes:** *puntos de datos, y superficies de probabilidad equiparables al modelo.*

source: A Gaussian mixture model is a probabilistic model that assumes all the data points are generated from a mixture of a finite number of Gaussian distributions with unknown parameters. One can think of mixture models as generalizing k-means clustering to incorporate information about the covariance structure of the data as well as the centers of the latent Gaussians.
es_es: Un modelo de mezcla Gaussiana es un modelo probabilista que asume que todos los puntos de datos son generados de una mezcla de un número finito de distribuciones Gaussianas con parámetros desconocidos. Uno puede pensar en los modelos de mezcla como la generalización de agrupamiento k-medias para incorporar información acerca de tanto la estructura de covarianza de los datos como los centros de los Gaussianes latentes.

source: Scikit-learn implements different classes to estimate Gaussian mixture models, that correspond to different estimation strategies, detailed below.
es_es: Scikit-learn implementa diferentes clases para estimar modelos de mezcla Gaussiana, que corresponden a diferentes estrategias de estimación, detalladas a continuación.

source: Gaussian Mixture
es_es: Mezcla Gaussiana

source: The :class:`GaussianMixture` object implements the :ref:`expectation-maximization <expectation_maximization>` (EM) algorithm for fitting mixture-of-Gaussian models. It can also draw confidence ellipsoids for multivariate models, and compute the Bayesian Information Criterion to assess the number of clusters in the data. A :meth:`GaussianMixture.fit` method is provided that learns a Gaussian Mixture Model from train data. Given test data, it can assign to each sample the Gaussian it mostly probably belong to using the :meth:`GaussianMixture.predict` method.
es_es: El objeto :class:`GaussianMixture` implementa el algoritmo :ref:`expectation-maximization <expectation_maximization>` (EM) para el encaje de modelos mezcla-de-Gaussianos. Puede también dibujar elipsoides de confidencia para modelos multivariante, y calcular el Criterio de Información Bayesiano para estimar el número de clústers en los datos. Se proporciona un método :meth:`GaussianMixture.fit` que aprende un modelo de mezcla Gaussiana de los datos de entrenamiento. Dados ciertos datos de prueba, se puede asignar a cada muestra el Gaussiano al que probablemente pertenezca usando el método :meth:`GaussianMixture.predict`.

source: The :class:`GaussianMixture` comes with different options to constrain the covariance of the difference classes estimated: spherical, diagonal, tied or full covariance.
es_es: La :class:`GaussianMixture` viene con diferentes opciones para restringir la covarianza de las clases de diferencia estimadas: esférico, diagonal, empatado o covarianza completa.

source: See :ref:`sphx_glr_auto_examples_mixture_plot_gmm_covariances.py` for an example of using the Gaussian mixture as clustering on the iris dataset.
es_es: Vea :ref:`sphx_glr_auto_examples_mixture_plot_gmm_covariances.py` para un ejemplo del uso de la mezcla Gaussiana como agrupamiento en el conjunto de datos iris.

source: See :ref:`sphx_glr_auto_examples_mixture_plot_gmm_pdf.py` for an example on plotting the density estimation.
es_es: Vea :ref:`sphx_glr_auto_examples_mixture_plot_gmm_pdf.py` para un ejemplo sobre graficar la estimación de densidad.

source: Pros and cons of class :class:`GaussianMixture`
es_es: Pros y contras de la clase :class:`GaussianMixture`

source: Speed
es_es: Velocidad

source: It is the fastest algorithm for learning mixture models
es_es: Es el algoritmo más rápido para aprender modelos de mezcla

source: Agnostic
es_es: Agnóstico

source: As this algorithm maximizes only the likelihood, it will not bias the means towards zero, or bias the cluster sizes to have specific structures that might or might not apply.
es_es: Ya que este algoritmo solo maximiza la probabilidad, no sesgará los medios hacia cero, ni sesgará los tamaños de clúster para tener estructuras especificas que podrían o no aplicar.

source: Cons
es_es: Contras

source: Singularities
es_es: Singularidades

source: When one has insufficiently many points per mixture, estimating the covariance matrices becomes difficult, and the algorithm is known to diverge and find solutions with infinite likelihood unless one regularizes the covariances artificially.
es_es: Cuando uno tiene insuficientes puntos por mezcla, estimar las matrices de covarianza se vuelve difícil, y se sabe que el algoritmo diverge y encuentra soluciones con probabilidades infinitas a menos que uno regularice las covarianzas artificialmente.

source: Number of components
es_es: Número de componentes

source: This algorithm will always use all the components it has access to, needing held-out data or information theoretical criteria to decide how many components to use in the absence of external cues.
es_es: Este algoritmo siempre utilizará todos los componentes a los que tiene acceso, necesitando criterios teóricos de apartado de datos o información para decidir cuantos componentes usar en la ausencia de señas externas.

source: Selecting the number of components in a classical Gaussian Mixture Model
es_es: Seleccionando el número de componentes en un modelo clásico de mezcla de Gaussianos

source: The BIC criterion can be used to select the number of components in a Gaussian Mixture in an efficient way. In theory, it recovers the true number of components only in the asymptotic regime (i.e. if much data is available and assuming that the data was actually generated i.i.d. from a mixture of Gaussian distribution). Note that using a :ref:`Variational Bayesian Gaussian mixture <bgmm>` avoids the specification of the number of components for a Gaussian mixture model.
es_es: El criterio de BIC puede ser utilizado para seleccionar el número de componentes en una mezcla Gaussiana de una manera eficiente. En teoría, recupera el verdadero número de componentes solo en el régimen asíntota (es decir, si muchos datos son disponibles y suponiendo que los datos fueron generados i.i.d. desde una mezcla de distribución Gaussiana). Note que utilizar una :ref:`Variational Bayesian Gaussian mixture <bgmm>` evita la especificación del número de componentes para un modelo de mezcla Gaussiana.

source: See :ref:`sphx_glr_auto_examples_mixture_plot_gmm_selection.py` for an example of model selection performed with classical Gaussian mixture.
es_es: Vea :ref:`sphx_glr_auto_examples_mixture_plot_gmm_selection.py` para un ejemplo de selección de modelo realizado con la mezcla Gaussiana clásica.

source: Estimation algorithm Expectation-maximization
es_es: Algoritmo de estimación Esperanza-maximización

source: The main difficulty in learning Gaussian mixture models from unlabeled data is that it is one usually doesn't know which points came from which latent component (if one has access to this information it gets very easy to fit a separate Gaussian distribution to each set of points). `Expectation-maximization <https://en.wikipedia.org/wiki/Expectation%E2%80%93maximization_algorithm>`_ is a well-founded statistical algorithm to get around this problem by an iterative process. First one assumes random components (randomly centered on data points, learned from k-means, or even just normally distributed around the origin) and computes for each point a probability of being generated by each component of the model. Then, one tweaks the parameters to maximize the likelihood of the data given those assignments. Repeating this process is guaranteed to always converge to a local optimum.
es_es: La dificultad principal en aprende modelos de mezcla Gaussiana desde datos sin etiquetar se trata de que es uno quien usualmente no sabe cuales puntos vinieron de que componente latente (si uno tiene acceso a esta información se vuelve muy facil encajar una distribución Gaussiana separada a cada conjunto de puntos). `Esperanza-maximización <https://es.wikipedia.org/wiki/Algoritmo_esperanza-maximizaci%C3%B3n>`_ es un algoritmo estadístico bien fundamentado para evitar este problema mediante un proceso iterativo. Primero uno asume que componentes aleatorios (centrados aleatoriamente en puntos de datos, aprendidos de k-medias, o inclusive solo distribuidos normalmente alrededor del origen) y calcula por cada punto una probabilidad de ser generado por cada componente del modelo. Y entonces, uno ajusta los parámetros para maximizar la probabilidad de los datos dadas esas asignaciones. La repetición este proceso está garantizada a siempre converger a un óptimo local.

source: Variational Bayesian Gaussian Mixture
es_es: Mezcla Gaussiana Bayesiana Variante

source: The :class:`BayesianGaussianMixture` object implements a variant of the Gaussian mixture model with variational inference algorithms. The API is similar as the one defined by :class:`GaussianMixture`.
es_es: El objeto :class:`BayesianGaussianMixture` implementa una variante del modelo de mezcla Gaussiana con algoritmos de inferencia variacionales. La API es similar a la definida por :class:`GaussianMixture`.

source: Estimation algorithm: variational inference
es_es: Algoritmo de estimación: inferencia variacional

source: Variational inference is an extension of expectation-maximization that maximizes a lower bound on model evidence (including priors) instead of data likelihood. The principle behind variational methods is the same as expectation-maximization (that is both are iterative algorithms that alternate between finding the probabilities for each point to be generated by each mixture and fitting the mixture to these assigned points), but variational methods add regularization by integrating information from prior distributions. This avoids the singularities often found in expectation-maximization solutions but introduces some subtle biases to the model. Inference is often notably slower, but not usually as much so as to render usage unpractical.
es_es: La inferencia variacional es una extensión de la esperanza-maximización que maximiza un limite inferior en la evidencia del modelo (incluyendo los priores) en lugar de la probabilidad de datos. El principio detrás de los métodos variacionales es el mismo que en la esperanza-maximización (es decir, ambos son algoitmos iterativos que alternan entre encontrar las probabilidades de cada punto a ser generadas por cada mezcla y encajar la mezcla a estos puntos asignados), pero los métodos variacionales añaden regularización mediante la integración de información desde distribuciones priores. Esto evita las singularidades comúnmente encontradas en soluciones de esperanza-maximización pero introduce algunos sesgos sutiles al modelo. La inferencia suele ser notablemente mas lenta, pero no tanto como para que su uso sea impractico.

source: Due to its Bayesian nature, the variational algorithm needs more hyper- parameters than expectation-maximization, the most important of these being the concentration parameter ``weight_concentration_prior``. Specifying a low value for the concentration prior will make the model put most of the weight on few components set the remaining components weights very close to zero. High values of the concentration prior will allow a larger number of components to be active in the mixture.
es_es: Debido a su naturaleza bayesiana, el algoritmo necesita mas hiperparámetros que la esperanza-maximización, el mas importante de estos siendo el parámetro de concentración ``weight_concentration_prior``. Especificar un valor bajo para la concentración previa hará que el modelo ponga la mayor parte del ponderado en pocos componentes y que establezca el ponderado del resto de los componentes muy cerca de 0. Si se usan valores altos para la concentración previa, se permitirá que un número más grande de componentes sea activo en la mezcla.

source: The parameters implementation of the :class:`BayesianGaussianMixture` class proposes two types of prior for the weights distribution: a finite mixture model with Dirichlet distribution and an infinite mixture model with the Dirichlet Process. In practice Dirichlet Process inference algorithm is approximated and uses a truncated distribution with a fixed maximum number of components (called the Stick-breaking representation). The number of components actually used almost always depends on the data.
es_es: La implementación de parámetros de la clase :class:`BayesianGaussianMixture` propone dos tipos de previos para la distribución de ponderados: un modelo de mezcla finita con distribución Dirichlet y un modelo de mezcla infinita con el proceso Dirichlet. En la práctica, el algoritmo de inferencia del Proceso Dirichlet es aproximado y utiliza una distribución truncada con un número máximo de componentes fijo (llamada la representación rompe-palos). El número de componentes realmente utilizados casi siempre depende de los datos.

source: The next figure compares the results obtained for the different type of the weight concentration prior (parameter ``weight_concentration_prior_type``) for different values of ``weight_concentration_prior``. Here, we can see the value of the ``weight_concentration_prior`` parameter has a strong impact on the effective number of active components obtained. We can also notice that large values for the concentration weight prior lead to more uniform weights when the type of prior is 'dirichlet_distribution' while this is not necessarily the case for the 'dirichlet_process' type (used by default).
es_es: La siguiente figura compara los resultados obtenidos para distintos tipos del previo de ponderado de concentración (el parámetro ``weight_concentration_prior_type``) para distintos valores de ``weight_concentration_prior``. Aquí podemos observar que el valor de parámetro ``weight_concentration_prior`` tiene un fuerte impacto en el número efectivo de componentes activos obtenido. Podemos también notar que valores grandes para el ponderado de concentración llevan a ponderados mas uniformes cuando el tipo de previo es 'dirichlet_distribution' mientras que esto no es necesariamente el caso para el tipo 'dirichlet_process' (usado por defecto).

source: The examples below compare Gaussian mixture models with a fixed number of components, to the variational Gaussian mixture models with a Dirichlet process prior. Here, a classical Gaussian mixture is fitted with 5 components on a dataset composed of 2 clusters. We can see that the variational Gaussian mixture with a Dirichlet process prior is able to limit itself to only 2 components whereas the Gaussian mixture fits the data with a fixed number of components that has to be set a priori by the user. In this case the user has selected ``n_components=5`` which does not match the true generative distribution of this toy dataset. Note that with very little observations, the variational Gaussian mixture models with a Dirichlet process prior can take a conservative stand, and fit only one component.
es_es: Los ejemplos a continuación comparan los modelos de mezcla Gaussiana con un número fijo de componentes, a los modelos de mezcla Gaussiana variacional con un proceso Dirichlet previo. Aquí, una mezcla Gaussiana clasica es encajada con 5 componentes en un conjunto de datos compuesto de 2 clústers. Podemos ver que la mezcla variacional Gaussiana con un proceso Dirichlet previo es capaz de limitarse a si misma a solo 2 componentes, mientras que la mezcla Gaussiana ajusta los datos con un número fijo de componentes que tiene que ser establecido a priori por el usuario: En este caso el usuario ha seleccionado ``n_componentes=5`` lo cual no corresponde a la distribución generativa real de este conjunto de datos de juguete. Note que con muy pocas observaciones, los modelos de mezcla Gaussiana variacional con un proceso Dirichlet previo puede tomar una postura conservadora, y encajar solo un componente.

source: On the following figure we are fitting a dataset not well-depicted by a Gaussian mixture. Adjusting the ``weight_concentration_prior``, parameter of the :class:`BayesianGaussianMixture` controls the number of components used to fit this data. We also present on the last two plots a random sampling generated from the two resulting mixtures.
es_es: En la siguiente figura estamos encajando un conjuntos de datos que no está bien representado por una mezcla gaussiana. Ajustando el parámetro ``weight_concentration_prior`` del :class:`BayesianGaussianMixture` controlamos el número de componentes usados para ajustar estos datos. También presentamos en las ultimas dos gráficas un muestreo aleatorio generado de las dos mezclas resultantes.

source: See :ref:`sphx_glr_auto_examples_mixture_plot_gmm.py` for an example on plotting the confidence ellipsoids for both :class:`GaussianMixture` and :class:`BayesianGaussianMixture`.
es_es: Vea :ref:`sphx_glr_auto_examples_mixture_plot_gm.py` para un ejemplo de gráfica de elipsoides de confianza para :class:`GaussianMixture` y :class:`BayesianGaussianMixture`.

source: :ref:`sphx_glr_auto_examples_mixture_plot_gmm_sin.py` shows using :class:`GaussianMixture` and :class:`BayesianGaussianMixture` to fit a sine wave.
es_es: :ref:`sphx_glr_auto_examples_mixture_plot_gm_sin.py` muestra el uso de :class:`GaussianMixture` y :class:`BayesianGaussianMixture` para ajustar una onda seno.

source: See :ref:`sphx_glr_auto_examples_mixture_plot_concentration_prior.py` for an example plotting the confidence ellipsoids for the :class:`BayesianGaussianMixture` with different ``weight_concentration_prior_type`` for different values of the parameter ``weight_concentration_prior``.
es_es: Vea :ref:`sphx_glr_auto_examples_mixture_plot_concentration_prior.py` para un ejemplo de grafica de los elipsoides de confianza para la :class:`BayesianGaussianMixture` con diferentes ``weight_concentration_prior_type`` para diferentes valores del parámetro ``weight_concentration_prior``.

source: Pros and cons of variational inference with :class:`BayesianGaussianMixture`
es_es: Pros y contras de la inferencia variacional con :class:`BayesianGaussianMixture`

source: Automatic selection
es_es: Selección automática

source: when ``weight_concentration_prior`` is small enough and ``n_components`` is larger than what is found necessary by the model, the Variational Bayesian mixture model has a natural tendency to set some mixture weights values close to zero. This makes it possible to let the model choose a suitable number of effective components automatically. Only an upper bound of this number needs to be provided. Note however that the "ideal" number of active components is very application specific and is typically ill-defined in a data exploration setting.
es_es: cuando ``weight_concentration_prior`` es lo suficientemente pequeño y ``n_components`` es mas grande que lo que el modelo considera necesario, el modelo de mezcla Bayesiana variacional tiene una tendencia natural a establecer algunos valores de ponderados de mezcla cerca de cero. Esto hace posible dejar que el modelo escoja un número adecuado de componentes efectivos automáticamente. Solo se necesita proporcionar un limite superior de este número. Sin embargo, tome en cuenta que el número "ideal" de componentes activos depende mucho de la aplicación y suele estar mal definido en una configuración de exploración de datos.

source: Less sensitivity to the number of parameters
es_es: Menor sensibilidad al número de parámetros

source: unlike finite models, which will almost always use all components as much as they can, and hence will produce wildly different solutions for different numbers of components, the variational inference with a Dirichlet process prior (``weight_concentration_prior_type='dirichlet_process'``) won't change much with changes to the parameters, leading to more stability and less tuning.
es_es: a diferencia de los modelos finitos, que casi siempre usarán tantos componentes como puedan, y, por lo tanto, producirán soluciones incontroladamente diferentes para diferentes números de componentes, la inferencia variacional con un proceso Dirichlet previo (``weight_concentration_prior_type='dirichlet_process'``) no cambiará mucho con los cambios en los parámetros, lo que llevará a mayor estabilidad y menos ajustamiento.

source: Regularization
es_es: Regularización

source: due to the incorporation of prior information, variational solutions have less pathological special cases than expectation-maximization solutions.
es_es: debido a la incorporación de información previa, las soluciones variacionales presentan menos casos especiales patológicos que las soluciones de esperanza-maximización.

source: the extra parametrization necessary for variational inference make inference slower, although not by much.
es_es: la parametrización adicional necesaria para la inferencia variacional hace que la inferencia sea más lenta, aunque no mucho.

source: Hyperparameters
es_es: Hiperparámetros

source: this algorithm needs an extra hyperparameter that might need experimental tuning via cross-validation.
es_es: este algoritmo necesita un hiperparámetro adicional que quizás necesite ajustes experimentales mediante una validación cruzada.

source: Bias
es_es: Sesgo

source: there are many implicit biases in the inference algorithms (and also in the Dirichlet process if used), and whenever there is a mismatch between these biases and the data it might be possible to fit better models using a finite mixture.
es_es: hay muchos sesgos impícitos en los algoritmos de inferencia (y también en el proceso de Dirichlet si se utiliza), y cada vez que hay un desajuste entre estos sesgos y los datos quizás sea posible encajar mejores modelos utilizando una mezcla finita.

source: The Dirichlet Process
es_es: El proceso de Dirichlet

source: Here we describe variational inference algorithms on Dirichlet process mixture. The Dirichlet process is a prior probability distribution on *clusterings with an infinite, unbounded, number of partitions*. Variational techniques let us incorporate this prior structure on Gaussian mixture models at almost no penalty in inference time, comparing with a finite Gaussian mixture model.
es_es: Aquí describimos los algoritmos de inferencia variacional en una mezcla de procesos de Dirichlet. El proceso de Dirichlet es una distribución de probabilidad previa en *agrupaciones con un número infinito, sin limite alguno, de particiones*. Las técnicas variacionales nos deja incorporar esta estructura previa en modelos de mezcla Gaussiana sin casi ningun costo en tiempo de inferencia, comparado a un modelo de mezcla Gaussiana finita.
