Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: Note that the :func:`precision_recall_curve` function is restricted to the binary case. The :func:`average_precision_score` function works only in binary classification and multilabel indicator format. The :func:`plot_precision_recall_curve` function plots the precision recall as follows.
es_es: Ten en cuenta que la función :func:`precision_recall_curve` está restringida al caso binario. La función :func:`average_precision_score` sólo funciona en la clasificación binaria y en el formato de indicador multietiqueta. La función :func:`plot_precision_recall_curve` traza la precisión de recuperación de la siguiente manera.

source: See :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` for an example of :func:`f1_score` usage to classify text documents.
es_es: Ver :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` para un ejemplo de uso de :func:`f1_score` para clasificar documentos de texto.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` for an example of :func:`precision_score` and :func:`recall_score` usage to estimate parameters using grid search with nested cross-validation.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` para un ejemplo de uso de :func:`precision_score` y :func:`recall_score` para estimar parámetros utilizando la búsqueda en la cuadrícula con validación cruzada anidada.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_precision_recall.py` for an example of :func:`precision_recall_curve` usage to evaluate classifier output quality.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_precision_recall.py` para un ejemplo de uso de :func:`precision_recall_curve` para evaluar la calidad de la salida del clasificador.

source: Binary classification
es_es: Clasificación binaria

source: In a binary classification task, the terms ''positive'' and ''negative'' refer to the classifier's prediction, and the terms ''true'' and ''false'' refer to whether that prediction corresponds to the external judgment (sometimes known as the ''observation''). Given these definitions, we can formulate the following table:
es_es: En una tarea de clasificación binaria, los términos ''positivo'' y ''negativo'' se refieren a la predicción del clasificador, y los términos ''verdadero'' y ''falso'' se refieren a si esa predicción corresponde al juicio externo (a veces conocido como ''observación''). Dadas estas definiciones, podemos formular la siguiente tabla:

source: Actual class (observation)
es_es: Clase real (observación)

source: Predicted class (expectation)
es_es: Clase prevista (expectativa)

source: tp (true positive) Correct result
es_es: tp (verdadero positivo) Resultado correcto

source: fp (false positive) Unexpected result
es_es: fp (falso positivo) Resultado inesperado

source: fn (false negative) Missing result
es_es: fn (falso negativo) Resultado ausente

source: tn (true negative) Correct absence of result
es_es: tn (verdadero negativo) Ausencia correcta de resultado

source: In this context, we can define the notions of precision, recall and F-measure:
es_es: En este contexto, podemos definir las nociones de precisión, recuperación y medidas F:

source: Here are some small examples in binary classification::
es_es: Aquí hay algunos ejemplos pequeños en clasificación binaria::

source: Multiclass and multilabel classification
es_es: Clasificación multiclase y multietiqueta

source: In multiclass and multilabel classification task, the notions of precision, recall, and F-measures can be applied to each label independently. There are a few ways to combine results across labels, specified by the ``average`` argument to the :func:`average_precision_score` (multilabel only), :func:`f1_score`, :func:`fbeta_score`, :func:`precision_recall_fscore_support`, :func:`precision_score` and :func:`recall_score` functions, as described :ref:`above <average>`. Note that if all labels are included, "micro"-averaging in a multiclass setting will produce precision, recall and :math:`F` that are all identical to accuracy. Also note that "weighted" averaging may produce an F-score that is not between precision and recall.
es_es: En las tareas de clasificación multiclase y multietiqueta, las nociones de precisión, recuperación y medidas F pueden aplicarse a cada etiqueta de forma independiente. Hay algunas formas de combinar los resultados entre las etiquetas, especificadas por el argumento ``average`` de :func:`puntuación_precisa_promedio` (sólo multietiqueta), :func: `f1_score`, :func:`fbeta_score`, :func:`precision_recall_fscore_support`, :func:`precision_score` y :func:`recall_score`, como se describe en :ref:`above <average>`. Ten en cuenta que si se incluyen todas las etiquetas, el promedio "micro" en un entorno multiclase producirá precisión, recuperación y :math:`F` que son idénticos a la precisión. También ten en cuenta que el promedio "ponderado" puede producir una puntuación F que no está entre la precisión y la recuperación.

source: To make this more explicit, consider the following notation:
es_es: Para hacer esto más explícito, considere la siguiente notación:

source: :math:`y` the set of *predicted* :math:`(sample, label)` pairs
es_es: :math:`y` el conjunto de pares *previstos* :math:`(sample, label)`

source: :math:`\hat{y}` the set of *true* :math:`(sample, label)` pairs
es_es: :math:`hat{y}` el conjunto de pares *true* :math:`(sample, label)`

source: :math:`L` the set of labels
es_es: :math:`L` el conjunto de etiquetas

source: :math:`S` the set of samples
es_es: :math:`S` el conjunto de muestras

source: :math:`y_s` the subset of :math:`y` with sample :math:`s`, i.e. :math:`y_s := \left\{(s', l) \in y | s' = s\right\}`
es_es: :math:`y_s` el subconjunto de :math:`y` con la muestra :math:`s`, es decir, :math:`y_s := \left\{(s', l) \in y | s' = s\right\}`

source: :math:`y_l` the subset of :math:`y` with label :math:`l`
es_es: :math:`y_l` el subconjunto de :math:`y` con la etiqueta :math:`l`

source: similarly, :math:`\hat{y}_s` and :math:`\hat{y}_l` are subsets of :math:`\hat{y}`
es_es: similarmente, :math:`\hat{y}_s` y :math:`\hat{y}_l` son subconjuntos de :math:`\hat{y}`

source: :math:`P(A, B) := \frac{\left| A \cap B \right|}{\left|A\right|}` for some sets :math:`A` and :math:`B`
es_es: :math:`P(A, B) := \frac{\left| Un \cap B \right|}{\left|A\right|}` para algunos conjuntos :math:`A` y :math:`B`

source: :math:`R(A, B) := \frac{\left| A \cap B \right|}{\left|B\right|}` (Conventions vary on handling :math:`B = \emptyset`; this implementation uses :math:`R(A, B):=0`, and similar for :math:`P`.)
es_es: :math:`R(A, B) := \frac{\left| A \cap B \right|}{\left|B\right|}` (Las convenciones varían en el manejo :math:`B = \emptyset`; esta implementación usa :math:`R(A, B):=0`, y similar para :math:`P`.)

source: Then the metrics are defined as:
es_es: Luego las métricas se definen como:

source: ``average``
es_es: ``promedio``

source: Precision
es_es: Precisión

source: Recall
es_es: Recuperación

source: ``"samples"``
es_es: ``"muestras"``

source: For multiclass classification with a "negative class", it is possible to exclude some labels:
es_es: Para la clasificación multiclase con una "clase negativa", es posible excluir algunas etiquetas:

source: Similarly, labels not present in the data sample may be accounted for in macro-averaging.
es_es: De manera similar, las etiquetas que no están presentes en la muestra de datos pueden contabilizarse en la macropromedio.

source: Jaccard similarity coefficient score
es_es: Puntuación del coeficiente de similitud de Jaccard

source: The :func:`jaccard_score` function computes the average of `Jaccard similarity coefficients <https://en.wikipedia.org/wiki/Jaccard_index>`_, also called the Jaccard index, between pairs of label sets.
es_es: La función :func:`jaccard_score` calcula el promedio de los coeficientes de similitud de `Jaccard<https://en.wikipedia.org/wiki/Jaccard_index>`_, también llamado índice de Jaccard, entre pares de conjuntos de etiquetas.

source: The Jaccard similarity coefficient of the :math:`i`-th samples, with a ground truth label set :math:`y_i` and predicted label set :math:`\hat{y}_i`, is defined as
es_es: El coeficiente de similitud de Jaccard de las muestras :math:`i`-ésimas, con un conjunto de etiquetas basada en evidencia :math:`y_i` y un conjunto de etiquetas predichas :math:`hat{y}_i`, se define como

source: :func:`jaccard_score` works like :func:`precision_recall_fscore_support` as a naively set-wise measure applying natively to binary targets, and extended to apply to multilabel and multiclass through the use of `average` (see :ref:`above <average>`).
es_es: :func:`jaccard_score` funciona como :func:`precision_recall_fscore_support` como una medida ingenua de conjunto que se aplica de forma nativa a objetivos binarios, y se extiende para aplicarse a multietiquetas y multiclases mediante el uso de `promedio` (ver :ref:`sobre <promedio>`).

source: In the binary case::
es_es: En caso binario::

source: Multiclass problems are binarized and treated like the corresponding multilabel problem::
es_es: Los problemas de múltiples clases son binarizados y tratados como el correspondiente problema multietiqueta::

source: Hinge loss
es_es: Pérdida de la bisagra

source: The :func:`hinge_loss` function computes the average distance between the model and the data using `hinge loss <https://en.wikipedia.org/wiki/Hinge_loss>`_, a one-sided metric that considers only prediction errors. (Hinge loss is used in maximal margin classifiers such as support vector machines.)
es_es: La función :func:`hinge_loss` calcula la distancia media entre el modelo y los datos utilizando la `pérdida de bisagra <https://en.wikipedia.org/wiki/Hinge_loss>`_, una métrica unilateral que sólo considera los errores de predicción. (La pérdida de bisagra se utiliza en los clasificadores de margen máximo, como las máquinas de vectores de soporte.)

source: If the labels are encoded with +1 and -1, :math:`y`: is the true value, and :math:`w` is the predicted decisions as output by ``decision_function``, then the hinge loss is defined as:
es_es: Si las etiquetas están codificadas con +1 y -1, :math:`y`: es el valor verdadero, y :math:`w` son las decisiones previstas como salida por ``decision_function``, entonces la pérdida de la bisagra se define como:

source: If there are more than two labels, :func:`hinge_loss` uses a multiclass variant due to Crammer & Singer. `Here <http://jmlr.csail.mit.edu/papers/volume2/crammer01a/crammer01a.pdf>`_ is the paper describing it.
es_es: Si hay más de dos etiquetas, :func:`hinge_loss` utiliza una variante multiclase debido a Crammer & Singer. `Aquí <http://jmlr.csail.mit.edu/papers/volume2/crammer01a/crammer01a.pdf>`_ es el artículo que lo describe.

source: If :math:`y_w` is the predicted decision for true label and :math:`y_t` is the maximum of the predicted decisions for all other labels, where predicted decisions are output by decision function, then multiclass hinge loss is defined by:
es_es: Si :math:`y_w` es la decisión prevista para la etiqueta verdadera y :math:`y_t` es el máximo de las decisiones previstas para todas las demás etiquetas, donde las decisiones predichas son salida por función de decisión, entonces la pérdida de bisagras multiclase es definida por:

source: Here a small example demonstrating the use of the :func:`hinge_loss` function with a svm classifier in a binary class problem::
es_es: Aquí un pequeño ejemplo que demuestra el uso de la función :func:`hinge_loss` con un clasificador svm en un problema de clase binaria::

source: Here is an example demonstrating the use of the :func:`hinge_loss` function with a svm classifier in a multiclass problem::
es_es: Aquí hay un ejemplo demostrando el uso de la función :func:`hinge_loss` con un clasificador svm en un problema de multiclase::

source: Log loss
es_es: Pérdida logística

source: Log loss, also called logistic regression loss or cross-entropy loss, is defined on probability estimates. It is commonly used in (multinomial) logistic regression and neural networks, as well as in some variants of expectation-maximization, and can be used to evaluate the probability outputs (``predict_proba``) of a classifier instead of its discrete predictions.
es_es: La pérdida logística, también llamada pérdida de regresión logística o pérdida de entropía cruzada, se define sobre las estimaciones de probabilidad. Se utiliza habitualmente en la regresión logística (multinomial) y en las redes neuronales, así como en algunas variantes de la maximización de expectativas, y puede utilizarse para evaluar las salidas de probabilidad (``predict_proba``) de un clasificador en lugar de sus predicciones discretas.

source: For binary classification with a true label :math:`y \in \{0,1\}` and a probability estimate :math:`p = \operatorname{Pr}(y = 1)`, the log loss per sample is the negative log-likelihood of the classifier given the true label:
es_es: Para la clasificación binaria con una etiqueta verdadera :math:`y \in {0,1\}` y una estimación de probabilidad :math:`p = \operatorname{Pr}(y = 1)`, la pérdida logística por muestra es la log-verosimilitud negativa del clasificador dada la etiqueta verdadera:

source: This extends to the multiclass case as follows. Let the true labels for a set of samples be encoded as a 1-of-K binary indicator matrix :math:`Y`, i.e., :math:`y_{i,k} = 1` if sample :math:`i` has label :math:`k` taken from a set of :math:`K` labels. Let :math:`P` be a matrix of probability estimates, with :math:`p_{i,k} = \operatorname{Pr}(y_{i,k} = 1)`. Then the log loss of the whole set is
es_es: Esto se extiende al caso multiclase, de la siguiente manera. Dejemos que las etiquetas verdaderas para un conjunto de muestras sean codificadas como una matriz de indicador binario de 1 a K :math:`Y`, i. ., :math:`y_{i,k} = 1` si la muestra :math:`i` tiene la etiqueta :math:`k` tomada de un conjunto de etiquetas :math:`K`. Dejemos que :math:`P` sea una matriz de estimaciones de probabilidad, con :math:`p_{i,k} = \operatorname{Pr}(y_{i,k} = 1)`. Entonces la pérdida logística de todo el conjunto es

source: To see how this generalizes the binary log loss given above, note that in the binary case, :math:`p_{i,0} = 1 - p_{i,1}` and :math:`y_{i,0} = 1 - y_{i,1}`, so expanding the inner sum over :math:`y_{i,k} \in \{0,1\}` gives the binary log loss.
es_es: Para ver cómo esto generaliza la pérdida logarítmica binaria dada anteriormente, observe que en el caso binario, :math:`p_{i,0} = 1 - p_{i,1}` y :math:`y_{i,0} = 1 - y_{i,1}`, por lo que al expandir la suma interna sobre :math:`y_{i,k} \en {0,1\}` da la pérdida logarítmica binaria.

source: The :func:`log_loss` function computes log loss given a list of ground-truth labels and a probability matrix, as returned by an estimator's ``predict_proba`` method.
es_es: La función :func:`log_loss` calcula la pérdida logística dada una lista de etiquetas basadas en evidencia y una matriz de probabilidad, como devuelve el método ``predict_proba`` de un estimador.

source: The first ``[.9, .1]`` in ``y_pred`` denotes 90% probability that the first sample has label 0. The log loss is non-negative.
es_es: El primer ``[.9, .1]`` en ``y_pred`` denota una probabilidad del 90% de que la primera muestra tenga la etiqueta 0. La pérdida logística no es negativa.

source: Matthews correlation coefficient
es_es: Coeficiente de correlación Matthews

source: The :func:`matthews_corrcoef` function computes the `Matthew's correlation coefficient (MCC) <https://en.wikipedia.org/wiki/Matthews_correlation_coefficient>`_ for binary classes. Quoting Wikipedia:
es_es: La función :func:`matthews_corrcoef` calcula el coeficiente de correlación de `Matthew (MCC) <https://en.wikipedia.org/wiki/Matthews_correlation_coefficient>`_ para clases binarias. Citando Wikipedia:

source: "The Matthews correlation coefficient is used in machine learning as a measure of the quality of binary (two-class) classifications. It takes into account true and false positives and negatives and is generally regarded as a balanced measure which can be used even if the classes are of very different sizes. The MCC is in essence a correlation coefficient value between -1 and +1. A coefficient of +1 represents a perfect prediction, 0 an average random prediction and -1 an inverse prediction. The statistic is also known as the phi coefficient."
es_es: "El coeficiente de correlación Matthews se utiliza en el aprendizaje automático como medida de la calidad de las clasificaciones binarias (dos clases). Tiene en cuenta los verdaderos y falsos positivos y negativos y, en general, se considera una medida balanceada que puede utilizarse incluso si las clases son de tamaños muy diferentes. El MCC es en esencia un valor de coeficiente de correlación entre -1 y +1. Un coeficiente de +1 representa una predicción perfecta, 0 una predicción aleatoria promedio y -1 una predicción inversa. La estadística también se conoce como el coeficiente de phi."

source: In the binary (two-class) case, :math:`tp`, :math:`tn`, :math:`fp` and :math:`fn` are respectively the number of true positives, true negatives, false positives and false negatives, the MCC is defined as
es_es: En el caso binario (dos clases), :math:`tp`, :math:`tn`, :math:`fp` y :math:`fn` son respectivamente el número de verdaderos positivos, negativos verdaderos, falsos positivos y negativos falsos, el MCC se define como

source: In the multiclass case, the Matthews correlation coefficient can be `defined <http://rk.kvl.dk/introduction/index.html>`_ in terms of a :func:`confusion_matrix` :math:`C` for :math:`K` classes. To simplify the definition consider the following intermediate variables:
es_es: En el caso de multiclase, el coeficiente de correlación Matthews puede ser `definido <http://rk.kvl.dk/introduction/index.html>`_ en términos de un :func:`confusion_matrix` :math:`C` para las clases :math:`K`. Para simplificar la definición, considere las siguientes variables intermedias:

source: :math:`t_k=\sum_{i}^{K} C_{ik}` the number of times class :math:`k` truly occurred,
es_es: :math:`t_k=\su_{i}^{K} C_{ik}` el número de veces que la clase :math:`k` realmente ha ocurrido,

source: :math:`p_k=\sum_{i}^{K} C_{ki}` the number of times class :math:`k` was predicted,
es_es: :math:`p_k=\su_{i}^{K} C_{ki}` se predijo el número de veces que la clase :math:`k`,

source: :math:`c=\sum_{k}^{K} C_{kk}` the total number of samples correctly predicted,
es_es: :math:`c=\su_{k}^{K} C_{kk}` el número total de muestras predicho correctamente,

source: :math:`s=\sum_{i}^{K} \sum_{j}^{K} C_{ij}` the total number of samples.
es_es: :math:`s=\su_{i}^{K} \su_{j}^{K} C_{ij}` el número total de muestras.

source: Then the multiclass MCC is defined as:
es_es: Entonces el MCC multiclase se define como:

source: When there are more than two labels, the value of the MCC will no longer range between -1 and +1. Instead the minimum value will be somewhere between -1 and 0 depending on the number and distribution of ground true labels. The maximum value is always +1.
es_es: Cuando hay más de dos etiquetas, el valor del MCC ya no estará entre -1 y +1. En su lugar, el valor mínimo será entre -1 y 0 dependiendo del número y la distribución de las etiquetas basadas en evidencia. El valor máximo es siempre +1.

source: Here is a small example illustrating the usage of the :func:`matthews_corrcoef` function:
es_es: Aquí hay un pequeño ejemplo que ilustra el uso de la función :func:`matthews_corrcoef`:

source: Multi-label confusion matrix
es_es: Matriz de confusión multietiqueta

source: The :func:`multilabel_confusion_matrix` function computes class-wise (default) or sample-wise (samplewise=True) multilabel confusion matrix to evaluate the accuracy of a classification. multilabel_confusion_matrix also treats multiclass data as if it were multilabel, as this is a transformation commonly applied to evaluate multiclass problems with binary classification metrics (such as precision, recall, etc.).
es_es: La función :func:`multilabel_confusion_matrix` calcula la matriz de confusión multietiqueta de una clase (por defecto) o de una muestra (samplewise=True) para evaluar la precisión de una clasificación. multilabel_confusion_matrix también trata los datos de varias clases como si fueran de varias etiquetas, ya que se trata de una transformación que se suele aplicar para evaluar problemas de varias clases con métricas de clasificación binarias (como la precisión, la recuperación, etc.).

source: When calculating class-wise multilabel confusion matrix :math:`C`, the count of true negatives for class :math:`i` is :math:`C_{i,0,0}`, false negatives is :math:`C_{i,1,0}`, true positives is :math:`C_{i,1,1}` and false positives is :math:`C_{i,0,1}`.
es_es: Al calcular la matriz de confusión multietiquetas en la clase :math:`C`, el reconteo de verdaderos negativos para la clase :math:`i` es :math:`C_{i,0,0}`, falsos negativos es :math:`C_{i,1,0}`, verdaderos positivos es :math:`C_{i,1,1}` y falsos positivos es :math:`C_{i,0,1}`.

source: Here is an example demonstrating the use of the :func:`multilabel_confusion_matrix` function with :term:`multilabel indicator matrix` input::
es_es: Aquí hay un ejemplo que demuestra el uso de la función :func:`multilabel_confusion_matrix` con la entrada :term:`multilabel indicator matrix`::

source: Or a confusion matrix can be constructed for each sample's labels:
es_es: O se puede construir una matriz de confusión para las etiquetas de cada muestra:

source: Here is an example demonstrating the use of the :func:`multilabel_confusion_matrix` function with :term:`multiclass` input::
es_es: Aquí hay un ejemplo demostrando el uso de la función :func:`multilabel_confusion_matrix` con la entrada :term:`multiclass`::

source: Here are some examples demonstrating the use of the :func:`multilabel_confusion_matrix` function to calculate recall (or sensitivity), specificity, fall out and miss rate for each class in a problem with multilabel indicator matrix input.
es_es: A continuación se muestran algunos ejemplos que demuestran el uso de la función :func:`multilabel_confusion_matrix` para calcular la recuperación (o la sensibilidad), la especificidad, el fallo y la tasa de error para cada clase en un problema con una matriz indicadora multietiqueta de entrada.

source: Calculating `recall <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`__ (also called the true positive rate or the sensitivity) for each class::
es_es: Calculando `recuperación <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`__ (también llamado la verdadera tasa positiva o la sensibilidad) para cada clase::

source: Calculating `specificity <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`__ (also called the true negative rate) for each class::
es_es: Calculando `especificidad <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`__ (también llamado el verdadero tipo negativo) para cada clase::

source: Calculating `fall out <https://en.wikipedia.org/wiki/False_positive_rate>`__ (also called the false positive rate) for each class::
es_es: Calculando `caída <https://en.wikipedia.org/wiki/False_positive_rate>`__ (también llamado el falso tipo positivo) para cada clase::

source: Calculating `miss rate <https://en.wikipedia.org/wiki/False_positives_and_false_negatives>`__ (also called the false negative rate) for each class::
es_es: Calculando `tasa de omisión <https://en.wikipedia.org/wiki/False_positives_and_false_negatives>`__ (también llamado el falso tipo negativo) para cada clase::

source: Receiver operating characteristic (ROC)
es_es: Receptor operativo característico (ROC)
