Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: While multiclass data is provided to the metric, like binary targets, as an array of class labels, multilabel data is specified as an indicator matrix, in which cell ``[i, j]`` has value 1 if sample ``i`` has label ``j`` and value 0 otherwise.
es_es: Mientras que los datos de multiclase se proporcionan a la métrica, como objetivos binarios, como una matriz de etiquetas de clase, los datos multietiquetas se especifican como una matriz de indicadores, en la que la celda ``[i, j]`` tiene valor 1 si la muestra ``i`` tiene la etiqueta ``j`` y valor 0 de lo contrario.

source: Accuracy score
es_es: Puntuación de precisión

source: The :func:`accuracy_score` function computes the `accuracy <https://en.wikipedia.org/wiki/Accuracy_and_precision>`_, either the fraction (default) or the count (normalize=False) of correct predictions.
es_es: La función :func:`accuracy_score` calcula la `precisión <https://en.wikipedia.org/wiki/Accuracy_and_precision>`_, ya sea la fracción (por defecto) o el contador (normalize=False) de predicciones correctas.

source: In multilabel classification, the function returns the subset accuracy. If the entire set of predicted labels for a sample strictly match with the true set of labels, then the subset accuracy is 1.0; otherwise it is 0.0.
es_es: En la clasificación multietiqueta, la función devuelve la precisión del subconjunto. Si todo el conjunto de etiquetas predecidas para una muestra coincide estrictamente con el conjunto verdadero de etiquetas, entonces la precisión del subconjunto es 1.0; de lo contrario es 0.0.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample and :math:`y_i` is the corresponding true value, then the fraction of correct predictions over :math:`n_\text{samples}` is defined as
es_es: Si :math:`\hat{y}_i` es el valor previsto de la muestra :math:`i`-ésima y :math:`y_i` es el valor verdadero correspondiente, entonces la fracción de predicciones correctas sobre :math:`n_\text{samples}` se define como

source: where :math:`1(x)` is the `indicator function <https://en.wikipedia.org/wiki/Indicator_function>`_.
es_es: donde :math:`1(x)` es la `función indicadora <https://en.wikipedia.org/wiki/Indicator_function>`_.

source: In the multilabel case with binary label indicators::
es_es: En el caso multietiqueta con indicadores de etiqueta binaria::

source: See :ref:`sphx_glr_auto_examples_feature_selection_plot_permutation_test_for_classification.py` for an example of accuracy score usage using permutations of the dataset.
es_es: Ver :ref:`sphx_glr_auto_examples_feature_selection_plot_permutation_test_for_classification.py` para un ejemplo de uso de puntuación de precisión usando permutaciones del conjunto de datos.

source: Top-k accuracy score
es_es: Puntuación de precisión de Top-k

source: The :func:`top_k_accuracy_score` function is a generalization of :func:`accuracy_score`. The difference is that a prediction is considered correct as long as the true label is associated with one of the ``k`` highest predicted scores. :func:`accuracy_score` is the special case of `k = 1`.
es_es: La función :func:`top_k_accuracy_score` es una generalización de :func:`accuracy_score`. La diferencia es que una predicción se considera correcta siempre y cuando la etiqueta verdadera esté asociada con uno de los puntajes predecidos más altos ``k``. :func:`accuracy_score` es el caso especial de `k = 1`.

source: The function covers the binary and multiclass classification cases but not the multilabel case.
es_es: La función abarca los casos de clasificación binaria y multiclase, pero no el caso multietiqueta.

source: If :math:`\hat{f}_{i,j}` is the predicted class for the :math:`i`-th sample corresponding to the :math:`j`-th largest predicted score and :math:`y_i` is the corresponding true value, then the fraction of correct predictions over :math:`n_\text{samples}` is defined as
es_es: Si :math:`\hat{f}_{i,j}` es la clase predecida para la :math:`i`-ésima muestra correspondiente a la :math:`j`-th mayor puntuación predicha y :math:`y_i` es el valor verdadero correspondiente, entonces la fracción de predicciones correctas sobre :math:`n_\text{samples}` se define como

source: where :math:`k` is the number of guesses allowed and :math:`1(x)` is the `indicator function <https://en.wikipedia.org/wiki/Indicator_function>`_.
es_es: donde :math:`k` es el número de suposiciones permitidas y :math:`1(x)` es la `función indicador <https://en.wikipedia.org/wiki/Indicator_function>`_.

source: Balanced accuracy score
es_es: Puntuación de precisión balanceada

source: The :func:`balanced_accuracy_score` function computes the `balanced accuracy <https://en.wikipedia.org/wiki/Accuracy_and_precision>`_, which avoids inflated performance estimates on imbalanced datasets. It is the macro-average of recall scores per class or, equivalently, raw accuracy where each sample is weighted according to the inverse prevalence of its true class. Thus for balanced datasets, the score is equal to accuracy.
es_es: La función :func:`balanced_accuracy_score` calcula la `precisión balanceada <https://en.wikipedia.org/wiki/Accuracy_and_precision>`_, que evita las estimaciones de rendimiento infladas en conjuntos de datos desbalanceados. Se trata del macropromedio de las puntuaciones de recuperación por clase o, de forma equivalente, de la precisión bruta, en la que cada muestra se pondera según la prevalencia inversa de su clase verdadera. Así, para los conjuntos de datos equilibrados, la puntuación es igual a la precisión.

source: In the binary case, balanced accuracy is equal to the arithmetic mean of `sensitivity <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`_ (true positive rate) and `specificity <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`_ (true negative rate), or the area under the ROC curve with binary predictions rather than scores:
es_es: En el caso binario la precisión balanceada es igual a la media aritmética de `sensibilidad <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`_ (verdadero tipo positivo) y `especificidad <https://en.wikipedia.org/wiki/Sensitivity_and_specificity>`_ (tasa verdadera negativa), o el área debajo de la curva ROC con predicciones binarias en lugar de puntuaciones:

source: If the classifier performs equally well on either class, this term reduces to the conventional accuracy (i.e., the number of correct predictions divided by the total number of predictions).
es_es: Si el clasificador funciona igual de bien en ambas clases, este término se reduce a la precisión convencional (es decir, el número de predicciones correctas dividido por el número total de predicciones).

source: In contrast, if the conventional accuracy is above chance only because the classifier takes advantage of an imbalanced test set, then the balanced accuracy, as appropriate, will drop to :math:`\frac{1}{n\_classes}`.
es_es: En contraste, si la precisión convencional está por encima de la posibilidad sólo porque el clasificador se aprovecha de un conjunto de pruebas desequilibrado entonces la precisión balanceada, según corresponda, caerá a :math:`\frac{1}{n\_classes}`.

source: The score ranges from 0 to 1, or when ``adjusted=True`` is used, it rescaled to the range :math:`\frac{1}{1 - n\_classes}` to 1, inclusive, with performance at random scoring 0.
es_es: La puntuación oscila entre 0 y 1, o cuando se utiliza ``adjusted=True``. se reescaló al rango :math:`\frac{1}{1 - n\_classes}` a 1, inclusive, con rendimiento a puntuación aleatoria 0.

source: If :math:`y_i` is the true value of the :math:`i`-th sample, and :math:`w_i` is the corresponding sample weight, then we adjust the sample weight to:
es_es: Si :math:`y_i` es el valor verdadero de la muestra `i`-ésima de :math:, y :math:`w_i` es la ponderación de muestra correspondiente, luego ajustamos la ponderación de la muestra a:

source: where :math:`1(x)` is the `indicator function <https://en.wikipedia.org/wiki/Indicator_function>`_. Given predicted :math:`\hat{y}_i` for sample :math:`i`, balanced accuracy is defined as:
es_es: donde :math:`1(x)` es la `función indicadora <https://en.wikipedia.org/wiki/Indicator_function>`_. Dado que se predice :math:`\hat{y}_i` para la muestra :math:`i`, la precisión equilibrada se define como:

source: With ``adjusted=True``, balanced accuracy reports the relative increase from :math:`\texttt{balanced-accuracy}(y, \mathbf{0}, w) = \frac{1}{n\_classes}`. In the binary case, this is also known as `*Youden's J statistic* <https://en.wikipedia.org/wiki/Youden%27s_J_statistic>`_, or *informedness*.
es_es: Con ``adjusted=True``, la precisión balanceada reporta el aumento relativo de :math:`\texttt{balanced-accuracy}(y, \mathbf{0}, w) = \frac{1}{n\_classes}`. En el caso binario, esto también se conoce como `*estadísticas de J de Youden* <https://en.wikipedia.org/wiki/Youden%27s_J_statistic>`_, o *informado*.

source: The multiclass definition here seems the most reasonable extension of the metric used in binary classification, though there is no certain consensus in the literature:
es_es: La definición de múltiples clases parece la extensión más razonable de la métrica utilizada en la clasificación binaria, aunque no existe un consenso seguro en la literatura:

source: Our definition: [Mosley2013]_, [Kelleher2015]_ and [Guyon2015]_, where [Guyon2015]_ adopt the adjusted version to ensure that random predictions have a score of :math:`0` and perfect predictions have a score of :math:`1`..
es_es: Nuestra definición: [Mosley2013]_, [Kelleher2015]_ y [Guyon2015]_, donde [Guyon2015]_ adopta la versión ajustada para asegurar que las predicciones aleatorias tengan una puntuación de :math:`0` y las predicciones perfectas tienen una puntuación de :math:`1`..

source: Class balanced accuracy as described in [Mosley2013]_: the minimum between the precision and the recall for each class is computed. Those values are then averaged over the total number of classes to get the balanced accuracy.
es_es: Precisión balanceada de la clase como se describe en [Mosley2013]_: se calcula el mínimo entre la precisión y el recordatorio para cada clase. Esos valores son entonces promediados sobre el número total de clases para obtener la precisión balanceada.

source: Balanced Accuracy as described in [Urbanowicz2015]_: the average of sensitivity and specificity is computed for each class and then averaged over total number of classes.
es_es: Precisión balanceada como se describe en [Urbanowicz2015]_: el promedio de sensibilidad y especificidad se calcula para cada clase y luego se promedia sobre el número total de clases.

source: Cohen's kappa
es_es: Kappa de Cohen

source: The function :func:`cohen_kappa_score` computes `Cohen's kappa <https://en.wikipedia.org/wiki/Cohen%27s_kappa>`_ statistic. This measure is intended to compare labelings by different human annotators, not a classifier versus a ground truth.
es_es: La función :func:`cohen_kappa_score` calcula la estadística `Cohen's kappa <https://en.wikipedia.org/wiki/Cohen%27s_kappa>`_. Esta medida está pensada para comparar etiquetados por diferentes anotadores humanos, no un clasificador frente a uno basado en evidencia.

source: The kappa score (see docstring) is a number between -1 and 1. Scores above .8 are generally considered good agreement; zero or lower means no agreement (practically random labels).
es_es: La puntuación de kappa (ver cadena de documentación) es un número entre -1 y 1. Las puntuaciones sobre .8 se consideran generalmente como un buen acuerdo; cero o menor significa ningún acuerdo (etiquetas prácticamente aleatorias).

source: Kappa scores can be computed for binary or multiclass problems, but not for multilabel problems (except by manually computing a per-label score) and not for more than two annotators.
es_es: Las puntuaciones de Kappa pueden ser calculadas para problemas binarios o multiclase, pero no para problemas multietiqueta (excepto calculando manualmente un puntaje por etiqueta) y no para más de dos anotadores.

source: Confusion matrix
es_es: Matriz de confusión

source: The :func:`confusion_matrix` function evaluates classification accuracy by computing the `confusion matrix <https://en.wikipedia.org/wiki/Confusion_matrix>`_ with each row corresponding to the true class (Wikipedia and other references may use different convention for axes).
es_es: La función :func:`confusion_matrix` evalúa la precisión de la clasificación calculando la `matriz de confusión <https://en.wikipedia.org/wiki/Confusion_matrix>`_ con cada fila correspondiente a la clase verdadera (Wikipedia y otras referencias pueden utilizar una convención diferente para los ejes).

source: By definition, entry :math:`i, j` in a confusion matrix is the number of observations actually in group :math:`i`, but predicted to be in group :math:`j`. Here is an example::
es_es: Por definición, la entrada :math:`i, j` en una matriz de confusión es el número de observaciones en el grupo :math:`i`, pero se espera que esté en el grupo :math:`j`. Aquí hay un ejemplo::

source: :func:`plot_confusion_matrix` can be used to visually represent a confusion matrix as shown in the :ref:`sphx_glr_auto_examples_model_selection_plot_confusion_matrix.py` example, which creates the following figure:
es_es: :func:`plot_confusion_matrix` puede ser usado para representar visualmente una matriz de confusión como se muestra en el ejemplo :ref:`sphx_glr_auto_examples_model_selection_plot_confusion_matrix.py` que crea la siguiente figura:

source: The parameter ``normalize`` allows to report ratios instead of counts. The confusion matrix can be normalized in 3 different ways: ``'pred'``, ``'true'``, and ``'all'`` which will divide the counts by the sum of each columns, rows, or the entire matrix, respectively.
es_es: El parámetro ``normalize`` permite informar de tasas en lugar de recuentos. La matriz de confusión puede ser normalizada de 3 maneras diferentes: ``'pred'``, ``'true'``, y ``'all'`` que dividirá los recuentos por la suma de cada columna, fila o la matriz completa, respectivamente.

source: For binary problems, we can get counts of true negatives, false positives, false negatives and true positives as follows::
es_es: Para problemas binarios, podemos obtener cuentas de verdaderos negativos, falsos positivos, falsos negativos y verdaderos positivos como sigue::

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_confusion_matrix.py` for an example of using a confusion matrix to evaluate classifier output quality.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_confusion_matrix.py` para un ejemplo de uso de una matriz de confusión para evaluar la calidad de salida del clasificador.

source: See :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py` for an example of using a confusion matrix to classify hand-written digits.
es_es: Ver :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py` para un ejemplo de uso de una matriz de confusión para clasificar dígitos escritos a mano.

source: See :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` for an example of using a confusion matrix to classify text documents.
es_es: Ver :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` para un ejemplo de uso de una matriz de confusión para clasificar documentos de texto.

source: Classification report
es_es: Reporte de clasificación

source: The :func:`classification_report` function builds a text report showing the main classification metrics. Here is a small example with custom ``target_names`` and inferred labels::
es_es: La función :func:`classification_report` construye un reporte de texto que muestra las principales métricas de clasificación. Aquí hay un pequeño ejemplo con ``target_names`` personalizados y etiquetas inferidas::

source: See :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py` for an example of classification report usage for hand-written digits.
es_es: Ver :ref:`sphx_glr_auto_examples_classification_plot_digits_classification.py` para un ejemplo de uso del informe de clasificación para dígitos escritos a mano.

source: See :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` for an example of classification report usage for text documents.
es_es: Ver :ref:`sphx_glr_auto_examples_text_plot_document_classification_20newsgroups.py` para un ejemplo de uso del informe de clasificación para documentos de texto.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` for an example of classification report usage for grid search with nested cross-validation.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_grid_search_digits.py` para ver un ejemplo de uso del informe de clasificación para la búsqueda en cuadrícula con validación cruzada anidada.

source: Hamming loss
es_es: Pérdida de Hamming

source: The :func:`hamming_loss` computes the average Hamming loss or `Hamming distance <https://en.wikipedia.org/wiki/Hamming_distance>`_ between two sets of samples.
es_es: El :func:`hamming_loss` calcula la pérdida media de Hamming o `distancia Hamming <https://en.wikipedia.org/wiki/Hamming_distance>`_ entre dos conjuntos de muestras.

source: If :math:`\hat{y}_j` is the predicted value for the :math:`j`-th label of a given sample, :math:`y_j` is the corresponding true value, and :math:`n_\text{labels}` is the number of classes or labels, then the Hamming loss :math:`L_{Hamming}` between two samples is defined as:
es_es: Si :math:`hat{y}_j` es el valor predicho para la :math:`j`-ésima etiqueta de una muestra dada, :math:`y_j` es el valor verdadero correspondiente, y :math:`n_\text{labels}` es el número de clases o etiquetas, entonces la pérdida de Hamming :math:`L_{Hamming}` entre dos muestras se define como:

source: where :math:`1(x)` is the `indicator function <https://en.wikipedia.org/wiki/Indicator_function>`_. ::
es_es: donde :math:`1(x)` es la `función indicadora <https://en.wikipedia.org/wiki/Indicator_function>`_. ::

source: In multiclass classification, the Hamming loss corresponds to the Hamming distance between ``y_true`` and ``y_pred`` which is similar to the :ref:`zero_one_loss` function. However, while zero-one loss penalizes prediction sets that do not strictly match true sets, the Hamming loss penalizes individual labels. Thus the Hamming loss, upper bounded by the zero-one loss, is always between zero and one, inclusive; and predicting a proper subset or superset of the true labels will give a Hamming loss between zero and one, exclusive.
es_es: En la clasificación multiclase, la pérdida Hamming corresponde a la distancia Hamming entre ``y_true`` y ``y_pred``, que es similar a la función :ref:`zero_one_loss`. Sin embargo, mientras que la pérdida cero a uno penaliza los conjuntos de predicción que no coinciden estrictamente con los conjuntos verdaderos, la pérdida Hamming penaliza las etiquetas individuales. Por lo tanto, la pérdida de Hamming, limitada por la pérdida de cero a uno, está siempre entre cero y uno, inclusive; y la predicción de un subconjunto o superconjunto adecuado de las etiquetas verdaderas dará una pérdida de Hamming entre cero y uno, exclusivamente.

source: Precision, recall and F-measures
es_es: Precisión, recuperación y medidas F

source: Intuitively, `precision <https://en.wikipedia.org/wiki/Precision_and_recall#Precision>`_ is the ability of the classifier not to label as positive a sample that is negative, and `recall <https://en.wikipedia.org/wiki/Precision_and_recall#Recall>`_ is the ability of the classifier to find all the positive samples.
es_es: Intuitivamente, la `precisión <https://en.wikipedia.org/wiki/Precision_and_recall#Precision>`_ es la capacidad del clasificador de no etiquetar como positiva una muestra que es negativa, y la `recuperación <https://en.wikipedia.org/wiki/Precision_and_recall#Recall>`_ es la capacidad del clasificador de encontrar todas las muestras positivas.

source: The `F-measure <https://en.wikipedia.org/wiki/F1_score>`_ (:math:`F_\beta` and :math:`F_1` measures) can be interpreted as a weighted harmonic mean of the precision and recall. A :math:`F_\beta` measure reaches its best value at 1 and its worst score at 0. With :math:`\beta = 1`, :math:`F_\beta` and :math:`F_1` are equivalent, and the recall and the precision are equally important.
es_es: La `medida F <https://en.wikipedia.org/wiki/F1_score>`_ (medidas :math:`F_\beta` y :math:`F_1`) puede interpretarse como una media armónica ponderada de la precisión y la recuperación. Una medida :math:`F_\beta` alcanza su mejor valor en 1 y su peor puntuación en 0. Con :math:`\beta = 1`, :math:`F_\beta` y :math:`F_1` son equivalentes, y el recuerdo y la precisión son igualmente importantes.

source: The :func:`precision_recall_curve` computes a precision-recall curve from the ground truth label and a score given by the classifier by varying a decision threshold.
es_es: La función :func:`precision_recall_curve` calcula una curva de recuperación de precisión a partir de la etiqueta basada en evidencia y una puntuación dada por el clasificador variando un umbral de decisión.

source: The :func:`average_precision_score` function computes the `average precision <https://en.wikipedia.org/w/index.php?title=Information_retrieval&oldid=793358396#Average_precision>`_ (AP) from prediction scores. The value is between 0 and 1 and higher is better. AP is defined as
es_es: La función :func:`average_precision_score` calcula la `precisión promedio <https://en.wikipedia.org/w/index.php?title=Information_retrieval&oldid=793358396#Average_precision>`_ (AP) a partir de las puntuaciones de las predicciones. El valor está entre 0 y 1 y cuanto más alto mejor. La AP se define como

source: where :math:`P_n` and :math:`R_n` are the precision and recall at the nth threshold. With random predictions, the AP is the fraction of positive samples.
es_es: donde :math:`P_n` y :math:`R_n` son la precisión y recuperación en el n-ésimo umbral. Con predicciones aleatorias, el AP es la fracción de muestras positivas.

source: References [Manning2008]_ and [Everingham2010]_ present alternative variants of AP that interpolate the precision-recall curve. Currently, :func:`average_precision_score` does not implement any interpolated variant. References [Davis2006]_ and [Flach2015]_ describe why a linear interpolation of points on the precision-recall curve provides an overly-optimistic measure of classifier performance. This linear interpolation is used when computing area under the curve with the trapezoidal rule in :func:`auc`.
es_es: Las referencias [Manning2008]_ y [Everingham2010]_ presentan variantes alternativas de AP que interpolan la curva de recuperación de precisión. Actualmente, :func:`average_precision_score` no implementa ninguna variante interpolada. Las referencias [Davis2006]_ y [Flach2015]_ describen por qué una interpolación lineal de puntos en la curva de recuperación de precisión proporciona una medida excesivamente optimista del rendimiento del clasificador. Esta interpolación lineal se utiliza al calcular el área bajo la curva con la regla trapezoidal en :func:`auc`.

source: Several functions allow you to analyze the precision, recall and F-measures score:
es_es: Varias funciones te permiten analizar la puntuación de precisión, recuperación y mediciones F:
