Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample and :math:`y_i` is the corresponding true value, then the mean absolute percentage error (MAPE) estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`hat{y}_i` es el valor predicho de la :math:`i`-ésima muestra y :math:`y_i` es el valor verdadero correspondiente, entonces el error medio porcentual absoluto (MAPE) estimado sobre :math:`n_{text{samples}}` se define como

source: where :math:`\epsilon` is an arbitrary small yet strictly positive number to avoid undefined results when y is zero.
es_es: donde :math:`\epsilon` es un número arbitrario pequeño pero estrictamente positivo para evitar resultados indefinidos cuando y es cero.

source: The :func:`mean_absolute_percentage_error` function supports multioutput.
es_es: La función :func:`mean_absolute_percentage_error` soporta salidas múltiples.

source: Here is a small example of usage of the :func:`mean_absolute_percentage_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`mean_absolute_percentage_error` ::

source: In above example, if we had used `mean_absolute_error`, it would have ignored the small magnitude values and only reflected the error in prediction of highest magnitude value. But that problem is resolved in case of MAPE because it calculates relative percentage error with respect to actual output.
es_es: En el ejemplo anterior, si hubiéramos utilizado `mean_absolute_error`, se habrían ignorado los valores de magnitud pequeños y sólo reflejarían el error en la predicción del valor de magnitud más alto. Pero ese problema se resuelve en el caso de MAPE porque calcula el porcentaje de error relativo con respecto a la salida real.

source: Median absolute error
es_es: Mediana del error absoluto

source: The :func:`median_absolute_error` is particularly interesting because it is robust to outliers. The loss is calculated by taking the median of all absolute differences between the target and the prediction.
es_es: La :func:`median_absolute_error` es particularmente interesante porque es robusta a los valores atípicos. La pérdida se calcula tomando la mediana de todas las diferencias absolutas entre el objetivo y la predicción.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample and :math:`y_i` is the corresponding true value, then the median absolute error (MedAE) estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`hat{y}_i` es el valor predicho de la :math:`i`-ésima muestra y :math:`y_i` es el valor verdadero correspondiente, entonces la mediana del error absoluto (MedAE) estimada sobre :math:`n_{text{samples}}` se define como

source: The :func:`median_absolute_error` does not support multioutput.
es_es: El :func:`median_absolute_error` no soporta múltiples salidas.

source: Here is a small example of usage of the :func:`median_absolute_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`median_absolute_error`::

source: R² score, the coefficient of determination
es_es: La puntuación R², el coeficiente de determinación

source: The :func:`r2_score` function computes the `coefficient of determination <https://en.wikipedia.org/wiki/Coefficient_of_determination>`_, usually denoted as R².
es_es: La función :func:`r2_score` calcula el `coeficiente de determinación <https://en.wikipedia.org/wiki/Coefficient_of_determination>`_, normalmente denotado como R².

source: It represents the proportion of variance (of y) that has been explained by the independent variables in the model. It provides an indication of goodness of fit and therefore a measure of how well unseen samples are likely to be predicted by the model, through the proportion of explained variance.
es_es: Representa la proporción de la varianza (de y) que ha sido explicada por las variables independientes del modelo. Proporciona una indicación de la bondad del ajuste y, por tanto, una medida de la probabilidad de que las muestras no vistas sean predichas por el modelo, a través de la proporción de varianza explicada.

source: As such variance is dataset dependent, R² may not be meaningfully comparable across different datasets. Best possible score is 1.0 and it can be negative (because the model can be arbitrarily worse). A constant model that always predicts the expected value of y, disregarding the input features, would get a R² score of 0.0.
es_es: Como esa varianza depende del conjunto de datos, R² puede no ser significativamente comparable entre diferentes conjuntos de datos. La mejor puntuación posible es 1,0 y puede ser negativa (porque el modelo puede ser arbitrariamente peor). Un modelo constante que siempre predice el valor esperado de y, sin tener en cuenta las características de entrada, obtendría una puntuación R² de 0,0.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample and :math:`y_i` is the corresponding true value for total :math:`n` samples, the estimated R² is defined as:
es_es: Si :math:`hat{y}_i` es el valor predicho de la :math:`i`-ésima muestra y :math:`y_i` es el valor verdadero correspondiente para el total de :math:`n` muestras, el R² estimado se define como:

source: where :math:`\bar{y} = \frac{1}{n} \sum_{i=1}^{n} y_i` and :math:`\sum_{i=1}^{n} (y_i - \hat{y}_i)^2 = \sum_{i=1}^{n} \epsilon_i^2`.
es_es: donde :math:`\bar{y} = \\frac{1}{n} \\sum_{i=1}^{n} y_i` y :math:`\\sum_{i=1}^{n} (y_i - \\hat{y}_i)^2 = \\sum_{i=1}^{n} \\epsilon_i^2`.

source: Note that :func:`r2_score` calculates unadjusted R² without correcting for bias in sample variance of y.
es_es: Ten en cuenta que :func:`r2_score` calcula R² no ajustado sin corregir el sesgo en la varianza de muestra de y.

source: Here is a small example of usage of the :func:`r2_score` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`r2_score`::

source: See :ref:`sphx_glr_auto_examples_linear_model_plot_lasso_and_elasticnet.py` for an example of R² score usage to evaluate Lasso and Elastic Net on sparse signals.
es_es: Ver :ref:`sphx_glr_auto_examples_linear_model_plot_lasso_and_elasticnet.py` para un ejemplo de uso de la puntuación R² para evaluar Lasso y red elástica en señales dispersas.

source: Mean Poisson, Gamma, and Tweedie deviances
es_es: Desviaciones medias de Poisson, Gamma y Tweedie

source: The :func:`mean_tweedie_deviance` function computes the `mean Tweedie deviance error <https://en.wikipedia.org/wiki/Tweedie_distribution#The_Tweedie_deviance>`_ with a ``power`` parameter (:math:`p`). This is a metric that elicits predicted expectation values of regression targets.
es_es: La función :func:`mean_tweedie_deviance` calcula el `error medio de desviación de Tweedie <https://en.wikipedia.org/wiki/Tweedie_distribution#The_Tweedie_deviance>`_ con un parámetro ``power`` (:math:`p`). Se trata de una métrica que obtiene los valores de expectativa predichos de los objetivos de regresión.

source: Following special cases exist,
es_es: Existen los siguientes casos especiales,

source: when ``power=0`` it is equivalent to :func:`mean_squared_error`.
es_es: cuando ``power=0`` es equivalente a :func:`mean_squared_error`.

source: when ``power=1`` it is equivalent to :func:`mean_poisson_deviance`.
es_es: cuando ``power=1`` es equivalente a :func:`mean_poisson_deviance`.

source: when ``power=2`` it is equivalent to :func:`mean_gamma_deviance`.
es_es: cuando ``power=2`` es equivalente a :func:`mean_gamma_deviance`.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample, and :math:`y_i` is the corresponding true value, then the mean Tweedie deviance error (D) for power :math:`p`, estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`hat{y}_i` es el valor predicho de la :math:`i`-ésima muestra, y :math:`y_i` es el valor verdadero correspondiente, entonces el error de desviación medio de Tweedie (D) para la potencia :math:`p`, estimado sobre :math:`n_{text{samples}} se define como

source: Tweedie deviance is a homogeneous function of degree ``2-power``. Thus, Gamma distribution with ``power=2`` means that simultaneously scaling ``y_true`` and ``y_pred`` has no effect on the deviance. For Poisson distribution ``power=1`` the deviance scales linearly, and for Normal distribution (``power=0``), quadratically. In general, the higher ``power`` the less weight is given to extreme deviations between true and predicted targets.
es_es: La desviación de Tweedie es una función homogénea de grado ``2-power``. Así, la distribución Gamma con ``power=2`` significa que el escalado simultáneo de ``y_true`` y ``y_pred`` no tiene ningún efecto sobre la desviación. Para la distribución Poisson ``power=1`` la desviación escala linealmente, y para la distribución Normal (``power=0``), cuadráticamente. En general, cuanto más alto sea ``power`` menor ponderación se da a las desviaciones extremas entre los objetivos verdaderos y los predichos.

source: For instance, let's compare the two predictions 1.0 and 100 that are both 50% of their corresponding true value.
es_es: Por ejemplo, comparemos las dos predicciones 1.0 y 100 que son el 50% de su valor real correspondiente.

source: The mean squared error (``power=0``) is very sensitive to the prediction difference of the second point,::
es_es: El error medio cuadrático (``power=0``) es muy sensible a la diferencia de predicción del segundo punto,::

source: If we increase ``power`` to 1,::
es_es: Si incrementamos ``power`` a 1,::

source: the difference in errors decreases. Finally, by setting, ``power=2``::
es_es: la diferencia en errores disminuye. Finalmente, al configurar, ``power=2``::

source: we would get identical errors. The deviance when ``power=2`` is thus only sensitive to relative errors.
es_es: obtendríamos errores idénticos. La desviación cuando ``power=2`` sólo es sensible a errores relativos.

source: Clustering metrics
es_es: Métricas de agrupamiento

source: The :mod:`sklearn.metrics` module implements several loss, score, and utility functions. For more information see the :ref:`clustering_evaluation` section for instance clustering, and :ref:`biclustering_evaluation` for biclustering.
es_es: El módulo :mod:`sklearn.metrics` implementa varias funciones de pérdida, puntuación y utilidad. Para más información, consulta la sección :ref:`clustering_evaluation` para el clustering de instancia, y :ref:`biclustering_evaluation` para el biclustering.

source: Dummy estimators
es_es: Estimadores de prueba

source: When doing supervised learning, a simple sanity check consists of comparing one's estimator against simple rules of thumb. :class:`DummyClassifier` implements several such simple strategies for classification:
es_es: Cuando se realiza un aprendizaje supervisado, una simple comprobación de cordura consiste en comparar el estimador propio con reglas simples. :class:`DummyClassifier` implementa varias de estas estrategias simples para la clasificación:

source: ``stratified`` generates random predictions by respecting the training set class distribution.
es_es: ``stratified`` genera predicciones aleatorias respetando la distribución de la clase del conjunto de entrenamiento.

source: ``most_frequent`` always predicts the most frequent label in the training set.
es_es: ``most_frequent`` siempre predice la etiqueta más frecuente en el conjunto de entrenamiento.

source: ``prior`` always predicts the class that maximizes the class prior (like ``most_frequent``) and ``predict_proba`` returns the class prior.
es_es: ``prior`` siempre predice la clase que maximiza la clase anterior (como ``most_frequent``) y ``predict_proba`` devuelve la clase anterior.

source: ``uniform`` generates predictions uniformly at random.
es_es: ``uniform`` genera predicciones uniformemente al azar.

source: ``constant`` always predicts a constant label that is provided by the user.
es_es: ``constant`` siempre predice un valor constante proporcionado por el usuario.

source: A major motivation of this method is F1-scoring, when the positive class is in the minority.
es_es: Una motivación importante de este método es la puntuación F1, cuando la clase positiva está en la minoría.

source: Note that with all these strategies, the ``predict`` method completely ignores the input data!
es_es: Ten en cuenta que con todas estas estrategias, ¡el método ``predict`` ignora completamente los datos de entrada!

source: To illustrate :class:`DummyClassifier`, first let's create an imbalanced dataset::
es_es: Para ilustrar :class:`DummyClassifier`, primero vamos a crear un conjunto de datos no balanceado::

source: Next, let's compare the accuracy of ``SVC`` and ``most_frequent``::
es_es: A continuación, comparemos la precisión de ``SVC`` y ``most_frequent``::

source: We see that ``SVC`` doesn't do much better than a dummy classifier. Now, let's change the kernel::
es_es: Vemos que ``SVC`` no lo hace mucho mejor que un clasificador ficticio. Ahora, vamos a cambiar el núcleo::

source: We see that the accuracy was boosted to almost 100%. A cross validation strategy is recommended for a better estimate of the accuracy, if it is not too CPU costly. For more information see the :ref:`cross_validation` section. Moreover if you want to optimize over the parameter space, it is highly recommended to use an appropriate methodology; see the :ref:`grid_search` section for details.
es_es: Vemos que la precisión aumentó hasta casi el 100%. Se recomienda una estrategia de validación cruzada para una mejor estimación de la precisión, si no es demasiado costosa para la CPU. Para más información, consulte la sección :ref:`cross_validation`. Además, si quieres optimizar el espacio de los parámetros, es muy recomendable utilizar una metodología adecuada; consulta la sección :ref:`grid_search` para más detalles.

source: More generally, when the accuracy of a classifier is too close to random, it probably means that something went wrong: features are not helpful, a hyperparameter is not correctly tuned, the classifier is suffering from class imbalance, etc...
es_es: En términos más generales, cuando la precisión de un clasificador está demasiado cerca de ser aleatorio, probablemente significa que algo salió mal: las características no son útiles, un hiperparámetro no está correctamente sintonizado, el clasificador sufre de desbalance de clase, etc...

source: :class:`DummyRegressor` also implements four simple rules of thumb for regression:
es_es: :class:`DummyRegressor` también implementa cuatro simples reglas generales para la regresión:

source: ``mean`` always predicts the mean of the training targets.
es_es: ``mean`` siempre predice la media de los objetivos de entrenamiento.

source: ``median`` always predicts the median of the training targets.
es_es: ``median`` siempre predice la mediana de los objetivos de entrenamiento.

source: ``quantile`` always predicts a user provided quantile of the training targets.
es_es: ``quantile`` siempre predice un cuantil proporcionado por el usuario de los objetivos de entrenamiento.

source: ``constant`` always predicts a constant value that is provided by the user.
es_es: ``constant`` siempre predice un valor constante proporcionado por el usuario.

source: In all these strategies, the ``predict`` method completely ignores the input data.
es_es: En todas estas estrategias, el método de ``predict`` ignora completamente los datos de entrada.
