Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: In multilabel learning, each sample can have any number of ground truth labels associated with it. The goal is to give high scores and better rank to the ground truth labels.
es_es: En el aprendizaje multietiqueta, cada muestra puede tener asociado cualquier número de etiquetas basadas en evidencia. El objetivo es dar puntuaciones altas y una mejor clasificación a las etiquetas de la verdad básica.

source: Coverage error
es_es: Error de cobertura

source: The :func:`coverage_error` function computes the average number of labels that have to be included in the final prediction such that all true labels are predicted. This is useful if you want to know how many top-scored-labels you have to predict in average without missing any true one. The best value of this metrics is thus the average number of true labels.
es_es: La función :func:`cobertura_error` calcula el número medio de etiquetas que hay que incluir en la predicción final para que se predigan todas las etiquetas verdaderas. Esto es útil si quiere saber cuántas etiquetas de máxima puntuación tiene que predecir de media sin que falte ninguna verdadera. El mejor valor de esta métrica es, por tanto, el número medio de etiquetas verdaderas.

source: Our implementation's score is 1 greater than the one given in Tsoumakas et al., 2010. This extends it to handle the degenerate case in which an instance has 0 true labels.
es_es: La puntuación de nuestra implementación es 1 mayor que la dada en Tsoumakas et al., 2010. Esto lo amplía para manejar el caso degenerado en el que una instancia tiene 0 etiquetas verdaderas.

source: Formally, given a binary indicator matrix of the ground truth labels :math:`y \in \left\{0, 1\right\}^{n_\text{samples} \times n_\text{labels}}` and the score associated with each label :math:`\hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}}`, the coverage is defined as
es_es: Formalmente, dada una matriz de indicador binario basada en evidencia etiqueta :math:`y \in \left\{0, 1\right\}^{n_\text{samples} \times n_\text{labels}}` y la puntuación asociada con cada etiqueta :math:`\hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}}`, la cobertura se define como

source: with :math:`\text{rank}_{ij} = \left|\left\{k: \hat{f}_{ik} \geq \hat{f}_{ij} \right\}\right|`. Given the rank definition, ties in ``y_scores`` are broken by giving the maximal rank that would have been assigned to all tied values.
es_es: con :math:`\text{rank}_{ij} = \left|\left\{k: \hat{f}_{ik} \geq \hat{f}_{ij} \right\}\right|`. Dada la definición de rango, los lazos en ``y_scores`` se rompen dando el rango máximo que habría sido asignado a todos los valores vinculados.

source: Label ranking average precision
es_es: Precisión promedio de clasificación de etiquetas

source: The :func:`label_ranking_average_precision_score` function implements label ranking average precision (LRAP). This metric is linked to the :func:`average_precision_score` function, but is based on the notion of label ranking instead of precision and recall.
es_es: La función :func:`label_ranking_average_precision_score` implementa la precisión media del posicionamiento de etiquetas (LRAP). Esta métrica está vinculada a la función :func:`average_precision_score`, pero se basa en la noción de clasificación de etiquetas en lugar de en la precisión y la recuperación.

source: Label ranking average precision (LRAP) averages over the samples the answer to the following question: for each ground truth label, what fraction of higher-ranked labels were true labels? This performance measure will be higher if you are able to give better rank to the labels associated with each sample. The obtained score is always strictly greater than 0, and the best value is 1. If there is exactly one relevant label per sample, label ranking average precision is equivalent to the `mean reciprocal rank <https://en.wikipedia.org/wiki/Mean_reciprocal_rank>`_.
es_es: La precisión promedio de la clasificación de las etiquetas (LRAP) promedia sobre las muestras la respuesta a la siguiente pregunta: para cada etiqueta basada en evidencia, ¿qué fracción de las etiquetas mejor clasificadas eran etiquetas verdaderas? Esta medida de rendimiento será mayor si se consigue dar un mejor rango a las etiquetas asociadas a cada muestra. La puntuación obtenida es siempre estrictamente mayor que 0, y el mejor valor es 1. Si hay exactamente una etiqueta relevante por muestra, la precisión media del ranking de etiquetas es equivalente al `ranking recíproco medio <https://en.wikipedia.org/wiki/Mean_reciprocal_rank>`_.

source: Formally, given a binary indicator matrix of the ground truth labels :math:`y \in \left\{0, 1\right\}^{n_\text{samples} \times n_\text{labels}}` and the score associated with each label :math:`\hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}}`, the average precision is defined as
es_es: Formalmente, dada una matriz indicadora binaria de las etiquetas basadas en evidencia :math:`y \in \left{0, 1\right\}^{n_texto{samples} \y la puntuación asociada a cada etiqueta :math:`hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}`, la precisión media se define como

source: where :math:`\mathcal{L}_{ij} = \left\{k: y_{ik} = 1, \hat{f}_{ik} \geq \hat{f}_{ij} \right\}`, :math:`\text{rank}_{ij} = \left|\left\{k: \hat{f}_{ik} \geq \hat{f}_{ij} \right\}\right|`, :math:`|\cdot|` computes the cardinality of the set (i.e., the number of elements in the set), and :math:`||\cdot||_0` is the :math:`\ell_0` "norm" (which computes the number of nonzero elements in a vector).
es_es: donde :math:`\mathcal{L}_{ij} = \left\k: y_{ik} = 1, \hat{f}_{ik} \geq \hat{f}_{ij} \right}`, :math:`\text{rank}_{ij} = \left|\left\{k: \hat{f}_{ik} |geq \hat{f}_{ij} \right\}\right|`, :math:`|\cdot|` calcula la cardinalidad del conjunto (es decir, el número de elementos en el conjunto), y :math:`||\cdot||_0` es la "norma" :math:`\ell_0` (que calcula el número de elementos no nulos en un vector).

source: Ranking loss
es_es: Pérdida de clasificación

source: The :func:`label_ranking_loss` function computes the ranking loss which averages over the samples the number of label pairs that are incorrectly ordered, i.e. true labels have a lower score than false labels, weighted by the inverse of the number of ordered pairs of false and true labels. The lowest achievable ranking loss is zero.
es_es: La función :func:`label_ranking_loss` calcula la pérdida de clasificación que promedia sobre las muestras el número de pares de etiquetas que están ordenados incorrectamente, es decir, las etiquetas verdaderas tienen una puntuación menor que las falsas, ponderada por la inversa del número de pares ordenados de etiquetas falsas y verdaderas. La pérdida de clasificación más baja que se puede alcanzar es cero.

source: Formally, given a binary indicator matrix of the ground truth labels :math:`y \in \left\{0, 1\right\}^{n_\text{samples} \times n_\text{labels}}` and the score associated with each label :math:`\hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}}`, the ranking loss is defined as
es_es: Formalmente, dada una matriz indicadora binaria de las etiquetas basada en evidencia :math:`y \in \left{0, 1\right\}^{n_texto{samples} \y la puntuación asociada a cada etiqueta :math:`hat{f} \in \mathbb{R}^{n_\text{samples} \times n_\text{labels}`, la pérdida de clasificación se define como

source: where :math:`|\cdot|` computes the cardinality of the set (i.e., the number of elements in the set) and :math:`||\cdot||_0` is the :math:`\ell_0` "norm" (which computes the number of nonzero elements in a vector).
es_es: donde :math:`|\cdot|` calcula la cardinalidad del conjunto (es decir, el número de elementos en el conjunto) y :math:`||\cdot||_0` es el :math:`\ell_0` "normal" (que calcula el número de elementos no cero en un vector).

source: Normalized Discounted Cumulative Gain
es_es: Ganancia acumulada descontada normalizada

source: Discounted Cumulative Gain (DCG) and Normalized Discounted Cumulative Gain (NDCG) are ranking metrics implemented in :func:`~sklearn.metrics.dcg_score` and :func:`~sklearn.metrics.ndcg_score` ; they compare a predicted order to ground-truth scores, such as the relevance of answers to a query.
es_es: La Ganancia Acumulativa Descontada (DCG) y la Ganancia Acumulativa Descontada Normalizada (NDCG) son métricas de clasificación implementadas en :func:`~sklearn.metrics.dcg_score` y :func:`~sklearn.metrics.ndcg_score` ; comparan un orden predicho con las puntuaciones basadas en evidencia, como la relevancia de las respuestas a una consulta.

source: From the Wikipedia page for Discounted Cumulative Gain:
es_es: Desde la página de Wikipedia para Ganancia acumulada descontada:

source: "Discounted cumulative gain (DCG) is a measure of ranking quality. In information retrieval, it is often used to measure effectiveness of web search engine algorithms or related applications. Using a graded relevance scale of documents in a search-engine result set, DCG measures the usefulness, or gain, of a document based on its position in the result list. The gain is accumulated from the top of the result list to the bottom, with the gain of each result discounted at lower ranks"
es_es: "La ganancia acumulada descontada (DCG) es una medida de la calidad del ranking. En la recuperación de la información, se utiliza a menudo para medir la eficacia de los algoritmos de los motores de búsqueda de la web o aplicaciones relacionadas. Utilizando una escala de relevancia graduada de documentos en un conjunto de resultados de un motor de búsqueda, la DCG mide la utilidad, o ganancia, de un documento en función de su posición en la lista de resultados. La ganancia se acumula desde la parte superior de la lista de resultados hasta la inferior, descontando la ganancia de cada resultado en los rangos inferiores"

source: DCG orders the true targets (e.g. relevance of query answers) in the predicted order, then multiplies them by a logarithmic decay and sums the result. The sum can be truncated after the first :math:`K` results, in which case we call it DCG@K. NDCG, or NDCG@K is DCG divided by the DCG obtained by a perfect prediction, so that it is always between 0 and 1. Usually, NDCG is preferred to DCG.
es_es: DCG ordena los objetivos reales (por ejemplo, la relevancia de las respuestas a la consulta) en el orden previsto, luego los multiplica por un decaimiento logarítmico y suma el resultado. La suma puede truncarse después de los primeros resultados :math:`K`, en cuyo caso la llamamos DCG@K. NDCG, o NDCG@K es la DCG dividida por la DCG obtenida por una predicción perfecta, de modo que siempre está entre 0 y 1. Normalmente, se prefiere NDCG a DCG.

source: Compared with the ranking loss, NDCG can take into account relevance scores, rather than a ground-truth ranking. So if the ground-truth consists only of an ordering, the ranking loss should be preferred; if the ground-truth consists of actual usefulness scores (e.g. 0 for irrelevant, 1 for relevant, 2 for very relevant), NDCG can be used.
es_es: En comparación con la pérdida por clasificación, la NDCG puede tener en cuenta las puntuaciones de relevancia, en lugar de una clasificación basada en evidencia. Por lo tanto, si la verdad básica consiste sólo en una ordenación, se debe preferir la pérdida de clasificación; si la verdad básica consiste en puntuaciones de utilidad reales (por ejemplo, 0 para irrelevante, 1 para relevante, 2 para muy relevante), se puede utilizar NDCG.

source: For one sample, given the vector of continuous ground-truth values for each target :math:`y \in \mathbb{R}^{M}`, where :math:`M` is the number of outputs, and the prediction :math:`\hat{y}`, which induces the ranking function :math:`f`, the DCG score is
es_es: Para una muestra, dado el vector de valores continuos basado en evidencia para cada objetivo :math:`y \in \mathbb{R}^{M}`, donde :math:`M` es el número de salidas, y la predicción :math:`hat{y}`, que induce la función de clasificación :math:`f`, la puntuación DCG es

source: and the NDCG score is the DCG score divided by the DCG score obtained for :math:`y`.
es_es: y la puntuación NDCG es la puntuación DCG dividida por la puntuación DCG obtenida para :math:`y`.

source: `Wikipedia entry for Discounted Cumulative Gain <https://en.wikipedia.org/wiki/Discounted_cumulative_gain>`_
es_es: `Entrada de Wikipedia para Ganancia Acumulada Descontada <https://en.wikipedia.org/wiki/Discounted_cumulative_gain>`_

source: Regression metrics
es_es: Métricas de Regresión

source: The :mod:`sklearn.metrics` module implements several loss, score, and utility functions to measure regression performance. Some of those have been enhanced to handle the multioutput case: :func:`mean_squared_error`, :func:`mean_absolute_error`, :func:`explained_variance_score` and :func:`r2_score`.
es_es: El módulo :mod:`sklearn.metrics` implementa varias funciones de pérdida, puntuación y utilidad para medir el rendimiento de la regresión. Algunas de ellas han sido mejoradas para manejar el caso de salida múltiple: :func:`mean_squared_error`, :func:`mean_absolute_error`, :func:`explained_variance_score` y :func:`r2_score`.

source: These functions have an ``multioutput`` keyword argument which specifies the way the scores or losses for each individual target should be averaged. The default is ``'uniform_average'``, which specifies a uniformly weighted mean over outputs. If an ``ndarray`` of shape ``(n_outputs,)`` is passed, then its entries are interpreted as weights and an according weighted average is returned. If ``multioutput`` is ``'raw_values'`` is specified, then all unaltered individual scores or losses will be returned in an array of shape ``(n_outputs,)``.
es_es: Estas funciones tienen un argumento de palabra clave ``multioutput`` que especifica la forma en que se deben promediar las puntuaciones o pérdidas de cada objetivo individual. El valor por defecto es ``'uniform_average'``, que especifica una media uniformemente ponderada sobre las salidas. Si se pasa un ``ndarray`` de forma ``(n_outputs,)``, sus entradas se interpretan como pesos y se devuelve una media ponderada acorde. Si se especifica que ``multioutput`` es ``raw_values``, entonces todas las puntuaciones o pérdidas individuales no alteradas se devolverán en un arreglo de forma ``(n_outputs,)``.

source: The :func:`r2_score` and :func:`explained_variance_score` accept an additional value ``'variance_weighted'`` for the ``multioutput`` parameter. This option leads to a weighting of each individual score by the variance of the corresponding target variable. This setting quantifies the globally captured unscaled variance. If the target variables are of different scale, then this score puts more importance on well explaining the higher variance variables. ``multioutput='variance_weighted'`` is the default value for :func:`r2_score` for backward compatibility. This will be changed to ``uniform_average`` in the future.
es_es: Las funciones :func:`r2_score` y :func:`explained_variance_score` aceptan un valor adicional ``'variance_weighted`` para el parámetro ``multioutput``. Esta opción conduce a una ponderación de cada puntuación individual por la varianza de la variable objetivo correspondiente. Este ajuste cuantifica la varianza capturada globalmente sin escalar. Si las variables objetivo son de diferente escala, esta puntuación da más importancia a la explicación de las variables de mayor varianza. ``multioutput='variance_weighted'`` es el valor por defecto de :func:`r2_score` por compatibilidad con versiones anteriores. Esto se cambiará a ``promedio_uniforme`` en el futuro.

source: Explained variance score
es_es: Puntuación de varianza explicada

source: The :func:`explained_variance_score` computes the `explained variance regression score <https://en.wikipedia.org/wiki/Explained_variation>`_.
es_es: La función :func:`explained_variance_score` calcula la puntuación de regresión de la varianza explicada <https://en.wikipedia.org/wiki/Explained_variation>`_.

source: If :math:`\hat{y}` is the estimated target output, :math:`y` the corresponding (correct) target output, and :math:`Var` is `Variance <https://en.wikipedia.org/wiki/Variance>`_, the square of the standard deviation, then the explained variance is estimated as follow:
es_es: Si :math:`\hat{y}` es la salida objetivo estimada, :math:`y` la salida correspondiente (correcta) la salida objetivo, y :math:`Var` es `Varianza <https://en.wikipedia.org/wiki/Variance>`_, el cuadrado de la desviación estándar, entonces la varianza explicada se calcula de la siguiente manera:

source: The best possible score is 1.0, lower values are worse.
es_es: La mejor puntuación posible es 1.0, los valores más bajos son peores.

source: Here is a small example of usage of the :func:`explained_variance_score` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`explained_variance_score` ::

source: Max error
es_es: Error máximo

source: The :func:`max_error` function computes the maximum `residual error <https://en.wikipedia.org/wiki/Errors_and_residuals>`_ , a metric that captures the worst case error between the predicted value and the true value. In a perfectly fitted single output regression model, ``max_error`` would be ``0`` on the training set and though this would be highly unlikely in the real world, this metric shows the extent of error that the model had when it was fitted.
es_es: La función :func:`max_error` calcula el máximo `error residual <https://en.wikipedia.org/wiki/Errors_and_residuals>`_ , una métrica que captura el peor caso de error entre el valor predicho y el valor real. En un modelo de regresión de salida única perfectamente ajustado, ``max_error`` sería ``0`` en el conjunto de entrenamiento y, aunque esto sería muy poco probable en el mundo real, esta métrica muestra el grado de error que tuvo el modelo cuando fue ajustado.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample, and :math:`y_i` is the corresponding true value, then the max error is defined as
es_es: Si :math:`\hat{y}_i` es el valor predicho de la muestra `i`-ésima :math:, y :math:`y_i` es el valor verdadero correspondiente, entonces el error máximo se define como

source: Here is a small example of usage of the :func:`max_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`explained_variance_score` ::

source: The :func:`max_error` does not support multioutput.
es_es: El :func:`max_error` no soporta salidas múltiples.

source: Mean absolute error
es_es: Error medio absoluto

source: The :func:`mean_absolute_error` function computes `mean absolute error <https://en.wikipedia.org/wiki/Mean_absolute_error>`_, a risk metric corresponding to the expected value of the absolute error loss or :math:`l1`-norm loss.
es_es: La función :func:`mean_absolute_error` calcula el `error medio absoluto <https://en.wikipedia.org/wiki/Mean_absolute_error>`_, una métrica de riesgo que corresponde al valor esperado de la pérdida del error absoluto o de la pérdida de la norma :math:`l1`.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample, and :math:`y_i` is the corresponding true value, then the mean absolute error (MAE) estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`\hat{y}_i` es el valor previsto de la muestra `i`-ésima :math:, y :math:`y_i` es el valor verdadero correspondiente, entonces el error absoluto promedio (MAE) estimado sobre :math:`n_{\text{samples}}` se define como

source: Here is a small example of usage of the :func:`mean_absolute_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`mean_absolute_error`::

source: Mean squared error
es_es: Error medio cuadrático

source: The :func:`mean_squared_error` function computes `mean square error <https://en.wikipedia.org/wiki/Mean_squared_error>`_, a risk metric corresponding to the expected value of the squared (quadratic) error or loss.
es_es: La función :func:`mean_squared_error` calcula el `error medio cuadrático <https://en.wikipedia.org/wiki/Mean_squared_error>`_, una métrica de riesgo que corresponde al valor esperado del error o pérdida al cuadrado (cuadrático).

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample, and :math:`y_i` is the corresponding true value, then the mean squared error (MSE) estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`\hat{y}_i` es el valor previsto de la muestra `i`-ésima :math:, y :math:`y_i` es el valor verdadero correspondiente, entonces el error medio cuadrado (MSE) estimado sobre :math:`n_{\text{samples}}` se define como

source: Here is a small example of usage of the :func:`mean_squared_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`mean_squared_error` ::

source: See :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_regression.py` for an example of mean squared error usage to evaluate gradient boosting regression.
es_es: Ver :ref:`sphx_glr_auto_examples_ensemble_plot_gradient_boosting_regression.py` para un ejemplo de uso del error cuadrático medio para evaluar la regresión de gradiente.

source: Mean squared logarithmic error
es_es: Error logarítmico medio cuadrático

source: The :func:`mean_squared_log_error` function computes a risk metric corresponding to the expected value of the squared logarithmic (quadratic) error or loss.
es_es: La función :func:`mean_squared_log_error` calcula una métrica de riesgo correspondiente al valor esperado del error o pérdida logarítmica (cuadrática) al cuadrado.

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample, and :math:`y_i` is the corresponding true value, then the mean squared logarithmic error (MSLE) estimated over :math:`n_{\text{samples}}` is defined as
es_es: Si :math:`hat{y}_i` es el valor predicho de la :math:`i`-ésima muestra, y :math:`y_i` es el valor verdadero correspondiente, entonces el error logarítmico medio cuadrático (MSLE) estimado sobre :math:`n_{text{samples}} se define como

source: Where :math:`\log_e (x)` means the natural logarithm of :math:`x`. This metric is best to use when targets having exponential growth, such as population counts, average sales of a commodity over a span of years etc. Note that this metric penalizes an under-predicted estimate greater than an over-predicted estimate.
es_es: Donde :math:`\log_e (x)` significa el logaritmo natural de :math:`x`. Esta métrica es la mejor para utilizar cuando los objetivos tienen un crecimiento exponencial, como los recuentos de población, las ventas medias de un producto durante un período de años, etc. Ten en cuenta que esta métrica penaliza más una estimación por debajo de lo previsto que una estimación por encima de lo previsto.

source: Here is a small example of usage of the :func:`mean_squared_log_error` function::
es_es: Aquí hay un pequeño ejemplo de uso de la función :func:`mean_squared_log_error` ::

source: Mean absolute percentage error
es_es: Error porcentual medio absoluto

source: The :func:`mean_absolute_percentage_error` (MAPE), also known as mean absolute percentage deviation (MAPD), is an evaluation metric for regression problems. The idea of this metric is to be sensitive to relative errors. It is for example not changed by a global scaling of the target variable.
es_es: El :func:``mean_absolute_percentage_error` (MAPE), también conocido como desviación porcentual media absoluta (MAPD), es una métrica de evaluación para problemas de regresión. La idea de esta métrica es ser sensible a los errores relativos. Por ejemplo, no cambia por un escalado global de la variable objetivo.
