Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: Metrics and scoring: quantifying the quality of predictions
es_es: Métricas y puntuación: cuantificar la calidad de las predicciones

source: There are 3 different APIs for evaluating the quality of a model's predictions:
es_es: Hay 3 APIs diferentes para evaluar la calidad de las predicciones de un modelo:

source: **Estimator score method**: Estimators have a ``score`` method providing a default evaluation criterion for the problem they are designed to solve. This is not discussed on this page, but in each estimator's documentation.
es_es: **Método de puntuación de los estimadores**: Los estimadores tienen un método de ``score`` que proporciona un criterio de evaluación por defecto para el problema que están diseñados para resolver. Esto no se discute en esta página, sino en la documentación de cada estimador.

source: **Scoring parameter**: Model-evaluation tools using :ref:`cross-validation <cross_validation>` (such as :func:`model_selection.cross_val_score` and :class:`model_selection.GridSearchCV`) rely on an internal *scoring* strategy. This is discussed in the section :ref:`scoring_parameter`.
es_es: **Parámetro de puntuación**: Las herramientas de evaluación de modelos que utilizan :ref:`validación cruzada <cross_validation>` (como :func:`model_selection.cross_val_score` y :class:`model_selection.GridSearchCV`) dependen de una estrategia interna de *puntuación*. Esto se discute en la sección :ref:`scoring_parameter`.

source: **Metric functions**: The :mod:`sklearn.metrics` module implements functions assessing prediction error for specific purposes. These metrics are detailed in sections on :ref:`classification_metrics`, :ref:`multilabel_ranking_metrics`, :ref:`regression_metrics` and :ref:`clustering_metrics`.
es_es: **Funciones métricas**: El módulo :mod:`sklearn.metrics` implementa funciones que evalúan el error de predicción con fines específicos. Estas métricas se detallan en las secciones de :ref:`classification_metrics`, :ref:`multilabel_ranking_metrics`, :ref:`regression_metrics` y :ref:`clustering_metrics`.

source: Finally, :ref:`dummy_estimators` are useful to get a baseline value of those metrics for random predictions.
es_es: Finalmente, :ref:`dummy_estimators` son útiles para obtener un valor de referencia de esas métricas para predicciones aleatorias.

source: For "pairwise" metrics, between *samples* and not estimators or predictions, see the :ref:`metrics` section.
es_es: Para las métricas "por pares", entre *muestras* y no estimadores o predicciones, ver la sección :ref:`metrics`.

source: The ``scoring`` parameter: defining model evaluation rules
es_es: El parámetro ``scoring``: definir las reglas de evaluación del modelo

source: Model selection and evaluation using tools, such as :class:`model_selection.GridSearchCV` and :func:`model_selection.cross_val_score`, take a ``scoring`` parameter that controls what metric they apply to the estimators evaluated.
es_es: La selección y evaluación de modelos mediante herramientas, como :class:`model_selection.GridSearchCV` y :func:`model_selection.cross_val_score`, toman un parámetro ``scoring`` que controla qué métrica aplican a los estimadores evaluados.

source: Common cases: predefined values
es_es: Casos comunes: valores predefinidos

source: For the most common use cases, you can designate a scorer object with the ``scoring`` parameter; the table below shows all possible values. All scorer objects follow the convention that **higher return values are better than lower return values**. Thus metrics which measure the distance between the model and the data, like :func:`metrics.mean_squared_error`, are available as neg_mean_squared_error which return the negated value of the metric.
es_es: Para los casos de uso más comunes, puede designar un objeto puntuador con el parámetro ``puntuación``; la tabla siguiente muestra todos los valores posibles. Todos los objetos calificadores siguen la convención de que **los valores de retorno más altos son mejores que los valores de retorno más bajos**. Así, las métricas que miden la distancia entre el modelo y los datos, como :func:`metrics.mean_squared_error`, están disponibles como neg_mean_squared_error que devuelve el valor negado de la métrica.

source: Scoring
es_es: Puntuación

source: Function
es_es: Función

source: Comment
es_es: Comentario

source: **Classification**
es_es: **Clasificación**

source: for binary targets
es_es: para objetivos binarios

source: micro-averaged
es_es: micro-promedio

source: macro-averaged
es_es: micro-promedio

source: weighted average
es_es: promedio ponderado

source: by multilabel sample
es_es: por muestra multietiqueta

source: requires ``predict_proba`` support
es_es: requiere soporte ``predict_proba``

source: 'precision' etc.
es_es: 'precisión', etc.

source: suffixes apply as with 'f1'
es_es: los sufijos se aplican como con 'f1'

source: 'recall' etc.
es_es: 'recuperación' etc.

source: **Clustering**
es_es: **Análisis de conglomerados**

source: **Regression**
es_es: **Regresión**

source: Usage examples:
es_es: Ejemplos de uso:

source: The values listed by the ``ValueError`` exception correspond to the functions measuring prediction accuracy described in the following sections. The scorer objects for those functions are stored in the dictionary ``sklearn.metrics.SCORERS``.
es_es: Los valores listados por la excepción ``ValueError`` corresponden a las funciones que miden la precisión de la predicción descritas en las siguientes secciones. Los objetos de puntuación para esas funciones se almacenan en el diccionario ``sklearn.metrics.SCORERS``.

source: Defining your scoring strategy from metric functions
es_es: Definir tu estrategia de puntuación a partir de funciones métricas

source: The module :mod:`sklearn.metrics` also exposes a set of simple functions measuring a prediction error given ground truth and prediction:
es_es: El módulo :mod:`sklearn.metrics` también expone un conjunto de funciones simples que miden un error de predicción dado basado en evidencia y predicción:

source: functions ending with ``_score`` return a value to maximize, the higher the better.
es_es: las funciones que terminan con ``_score`` devuelven un valor a maximizar, cuanto más alto mejor.

source: functions ending with ``_error`` or ``_loss`` return a value to minimize, the lower the better. When converting into a scorer object using :func:`make_scorer`, set the ``greater_is_better`` parameter to ``False`` (``True`` by default; see the parameter description below).
es_es: las funciones que terminan con ``_error`` o ``_loss`` devuelven un valor a minimizar, cuanto más bajo mejor. Cuando se convierta en un objeto anotador usando :func:`make_scorer`, establece el parámetro ``mayor_es_mejor`` a ``False`` (``True`` por defecto; ver la descripción del parámetro más abajo).

source: Metrics available for various machine learning tasks are detailed in sections below.
es_es: Las métricas disponibles para diversas tareas de aprendizaje automático se detallan en las secciones siguientes.

source: Many metrics are not given names to be used as ``scoring`` values, sometimes because they require additional parameters, such as :func:`fbeta_score`. In such cases, you need to generate an appropriate scoring object. The simplest way to generate a callable object for scoring is by using :func:`make_scorer`. That function converts metrics into callables that can be used for model evaluation.
es_es: Muchas métricas no reciben nombres para ser utilizadas como valores de ``puntuación``, a veces porque requieren parámetros adicionales, como :func:`fbeta_score`. En estos casos, es necesario generar un objeto de puntuación apropiado. La forma más sencilla de generar un objeto de llamada para la puntuación es utilizando :func:`make_scorer`. Esta función convierte las métricas en objetos llamables que pueden utilizarse para la evaluación del modelo.

source: One typical use case is to wrap an existing metric function from the library with non-default values for its parameters, such as the ``beta`` parameter for the :func:`fbeta_score` function::
es_es: Un caso de uso típico es envolver una función métrica existente de la biblioteca con valores no predeterminados para sus parámetros, como el parámetro ``beta`` para la función :func:`fbeta_score`::

source: The second use case is to build a completely custom scorer object from a simple python function using :func:`make_scorer`, which can take several parameters:
es_es: El segundo caso de uso es construir un objeto anotador completamente personalizado a partir de una simple función de python utilizando :func:`make_scorer`, que puede tomar varios parámetros:

source: the python function you want to use (``my_custom_loss_func`` in the example below)
es_es: la función de python que desea utilizar (``mi_pérdida_personalizada_func`` en el ejemplo siguiente)

source: whether the python function returns a score (``greater_is_better=True``, the default) or a loss (``greater_is_better=False``). If a loss, the output of the python function is negated by the scorer object, conforming to the cross validation convention that scorers return higher values for better models.
es_es: si la función python devuelve una puntuación (``greater_is_better=Verdadero``, por defecto) o una pérdida (``greater_is_better=Falso``). Si se trata de una pérdida, la salida de la función python es negada por el objeto de puntuación, conforme a la convención de validación cruzada de que las puntuaciones devuelven valores más altos para los mejores modelos.

source: for classification metrics only: whether the python function you provided requires continuous decision certainties (``needs_threshold=True``). The default value is False.
es_es: sólo para las métricas de clasificación: si la función python proporcionada requiere certezas de decisión continuas (``needs_threshold=True``). El valor por defecto es False.

source: any additional parameters, such as ``beta`` or ``labels`` in :func:`f1_score`.
es_es: cualquier parámetro adicional, como ``beta`` o ``labels`` en :func:`f1_score`.

source: Here is an example of building custom scorers, and of using the ``greater_is_better`` parameter::
es_es: Aquí hay un ejemplo de construcción de marcadores personalizados, y del uso del parámetro ``greater_is_better``::

source: Implementing your own scoring object
es_es: Implementando tu propio objeto de puntuación

source: You can generate even more flexible model scorers by constructing your own scoring object from scratch, without using the :func:`make_scorer` factory. For a callable to be a scorer, it needs to meet the protocol specified by the following two rules:
es_es: Puedes generar modelos de puntuación aún más flexibles construyendo tu propio objeto de puntuación desde cero, sin utilizar la fábrica :func:`make_scorer`. Para que una llamada sea un puntuador, debe cumplir el protocolo especificado por las dos reglas siguientes:

source: It can be called with parameters ``(estimator, X, y)``, where ``estimator`` is the model that should be evaluated, ``X`` is validation data, and ``y`` is the ground truth target for ``X`` (in the supervised case) or ``None`` (in the unsupervised case).
es_es: Se puede llamar con los parámetros ``(estimador, X, y)``, donde ``estimator`` es el modelo que debe ser evaluado, ``X`` son los datos de validación, y ``y`` es el objetivo basado en evidencia para ``X`` (en el caso supervisado) o ``None`` (en el caso no supervisado).

source: It returns a floating point number that quantifies the ``estimator`` prediction quality on ``X``, with reference to ``y``. Again, by convention higher numbers are better, so if your scorer returns loss, that value should be negated.
es_es: Devuelve un número de punto flotante que cuantifica la calidad de la predicción del ``estimator`` en ``X``, con referencia a ``y``. De nuevo, por convención los números más altos son mejores, así que si su estimador devuelve una pérdida, ese valor debe ser negado.

source: **Using custom scorers in functions where n_jobs > 1**
es_es: **Usando puntuaciones personalizadas en funciones donde n_jobs > 1**

source: While defining the custom scoring function alongside the calling function should work out of the box with the default joblib backend (loky), importing it from another module will be a more robust approach and work independently of the joblib backend.
es_es: Aunque la definición de la función de puntuación personalizada junto con la función de llamada debería funcionar de forma inmediata con el backend de joblib por defecto (loky), importarla desde otro módulo será un enfoque más robusto y funcionará independientemente del backend de joblib.

source: For example, to use ``n_jobs`` greater than 1 in the example below, ``custom_scoring_function`` function is saved in a user-created module (``custom_scorer_module.py``) and imported::
es_es: Por ejemplo, para usar ``n_jobs`` mayor que 1 en el ejemplo de abajo, la función ``custom_scoring_function`` se guarda en un módulo creado por el usuario (``custom_scorer_module.py``) e importado::

source: Using multiple metric evaluation
es_es: Utilizando evaluación métrica múltiple

source: Scikit-learn also permits evaluation of multiple metrics in ``GridSearchCV``, ``RandomizedSearchCV`` and ``cross_validate``.
es_es: Scikit-learn también permite la evaluación de múltiples métricas en ``GridSearchCV``, ``RandomizedSearchCV` y ``cross_validate``.

source: There are three ways to specify multiple scoring metrics for the ``scoring`` parameter:
es_es: Hay tres maneras de especificar múltiples métricas de puntuación para el parámetro ``scoring``:

source: As an iterable of string metrics::
es_es: Como un iterable de métricas de cadena::

source: As a ``dict`` mapping the scorer name to the scoring function::
es_es: Como un ``dict`` que mapea el nombre del calificador a la función de calificación::

source: Note that the dict values can either be scorer functions or one of the predefined metric strings.
es_es: Ten en cuenta que los valores del dict pueden ser funciones de puntuación o una de las cadenas métricas predefinidas.

source: As a callable that returns a dictionary of scores::
es_es: Como una llamada que devuelve un diccionario de puntuaciones::

source: Classification metrics
es_es: Métricas de clasificación

source: The :mod:`sklearn.metrics` module implements several loss, score, and utility functions to measure classification performance. Some metrics might require probability estimates of the positive class, confidence values, or binary decisions values. Most implementations allow each sample to provide a weighted contribution to the overall score, through the ``sample_weight`` parameter.
es_es: El módulo :mod:`sklearn.metrics` implementa varias funciones de pérdida, puntuación y utilidad para medir el rendimiento de la clasificación. Algunas métricas pueden requerir estimaciones de probabilidad de la clase positiva, valores de confianza o valores de decisiones binarias. La mayoría de las implementaciones permiten que cada muestra proporcione una contribución ponderada a la puntuación global, a través del parámetro ``sample_weight``.

source: Some of these are restricted to the binary classification case:
es_es: Algunos de estos están restringidos al caso de clasificación binaria:

source: Compute precision-recall pairs for different probability thresholds.
es_es: Calcula los pares de precisión-recuerdo para diferentes umbrales de probabilidad.

source: Compute Receiver operating characteristic (ROC).
es_es: Calcular la característica operativa del receptor (ROC).

source: Compute error rates for different probability thresholds.
es_es: Calcule las tasas de error para diferentes umbrales de probabilidad.

source: Others also work in the multiclass case:
es_es: Otros también trabajan en el caso multiclase:

source: Compute the balanced accuracy.
es_es: Calcula la precisión balanceada.

source: Cohen's kappa: a statistic that measures inter-annotator agreement.
es_es: Kappa de Cohen: estadística que mide el acuerdo entre anotadores.

source: Compute confusion matrix to evaluate the accuracy of a classification.
es_es: Calcula la matriz de confusión para evaluar la precisión de una clasificación.

source: Average hinge loss (non-regularized).
es_es: Pérdida media de la bisagra (no regularizada).

source: Compute the Matthews correlation coefficient (MCC).
es_es: Calcular el coeficiente de correlación Matthews (CMC).

source: Compute Area Under the Receiver Operating Characteristic Curve (ROC AUC) from prediction scores.
es_es: Calcula el Área Bajo la Curva Característica Operativa del Receptor (ROC AUC) de las puntuaciones de predicción.

source: Top-k Accuracy classification score.
es_es: Puntuación de la clasificación de precisión Top-k.

source: Some also work in the multilabel case:
es_es: Algunos también trabajan en el caso multietiquetas:

source: Accuracy classification score.
es_es: Puntuación de la clasificación de precisión.

source: Build a text report showing the main classification metrics.
es_es: Construye un informe de texto que muestre las principales métricas de clasificación.

source: Compute the F1 score, also known as balanced F-score or F-measure.
es_es: Calcula la puntuación F1, también conocida como puntuación F equilibrada o medición F.

source: Compute the F-beta score.
es_es: Calcula la puntuación F-beta.

source: Compute the average Hamming loss.
es_es: Calcula la pérdida media de Hamming.

source: Jaccard similarity coefficient score.
es_es: Puntuación del coeficiente de similitud de Jaccard.

source: Log loss, aka logistic loss or cross-entropy loss.
es_es: Pérdida logarítmica, también conocida como pérdida logística o pérdida de entropía cruzada.

source: Compute a confusion matrix for each class or sample.
es_es: Calcula una matriz de confusión para cada clase o muestra.

source: Compute precision, recall, F-measure and support for each class.
es_es: Calcula precisión, recuerda, la medición F y soporte para cada clase.

source: Compute the precision.
es_es: Calcula la precisión.

source: Compute the recall.
es_es: Calcula la recuperación.

source: Zero-one classification loss.
es_es: Pérdida de clasificación cero a uno.

source: And some work with binary and multilabel (but not multiclass) problems:
es_es: Y algunos trabajan con problemas binarios y multietiquetas (pero no multiclase):

source: Compute average precision (AP) from prediction scores.
es_es: Calcula la precisión media (AP) de los puntajes de predicción.

source: In the following sub-sections, we will describe each of those functions, preceded by some notes on common API and metric definition.
es_es: En las siguientes subsecciones, describiremos cada una de esas funciones, precedidas de algunas notas sobre la API común y la definición métrica.

source: From binary to multiclass and multilabel
es_es: De binario a multiclase y multietiqueta

source: Some metrics are essentially defined for binary classification tasks (e.g. :func:`f1_score`, :func:`roc_auc_score`). In these cases, by default only the positive label is evaluated, assuming by default that the positive class is labelled ``1`` (though this may be configurable through the ``pos_label`` parameter).
es_es: Algunas métricas están esencialmente definidas para tareas de clasificación binaria (por ejemplo, :func:`f1_score`, :func:`roc_auc_score`). En estos casos, por defecto sólo se evalúa la etiqueta positiva, asumiendo por defecto que la clase positiva está etiquetada como ``1`` (aunque esto puede ser configurable a través del parámetro ``pos_label``).

source: In extending a binary metric to multiclass or multilabel problems, the data is treated as a collection of binary problems, one for each class. There are then a number of ways to average binary metric calculations across the set of classes, each of which may be useful in some scenario. Where available, you should select among these using the ``average`` parameter.
es_es: Al extender una métrica binaria a problemas multiclase o multietiqueta, los datos se tratan como una colección de problemas binarios, uno por cada clase. Hay entonces un número de maneras de promediar los cálculos de la métrica binaria a través del conjunto de clases, cada una de las cuales puede ser útil en algún escenario. Cuando esté disponible, deberá seleccionar entre ellas utilizando el parámetro ``average``.

source: ``"macro"`` simply calculates the mean of the binary metrics, giving equal weight to each class. In problems where infrequent classes are nonetheless important, macro-averaging may be a means of highlighting their performance. On the other hand, the assumption that all classes are equally important is often untrue, such that macro-averaging will over-emphasize the typically low performance on an infrequent class.
es_es: ``"macro"`` simplemente calcula la media de las métricas binarias, dando la misma ponderación a cada clase. En los problemas en los que las clases poco frecuentes son, sin embargo, importantes, el macro-promedio puede ser un medio para destacar su rendimiento. Por otro lado, la suposición de que todas las clases son igual de importantes es a menudo falsa, de modo que el macro-promedio enfatizará en exceso el rendimiento típicamente bajo de una clase poco frecuente.

source: ``"weighted"`` accounts for class imbalance by computing the average of binary metrics in which each class's score is weighted by its presence in the true data sample.
es_es: ``"weighted"`` tiene en cuenta el desequilibrio de clases calculando la media de las métricas binarias en las que la puntuación de cada clase está ponderada por su presencia en la muestra de datos reales.

source: ``"micro"`` gives each sample-class pair an equal contribution to the overall metric (except as a result of sample-weight). Rather than summing the metric per class, this sums the dividends and divisors that make up the per-class metrics to calculate an overall quotient. Micro-averaging may be preferred in multilabel settings, including multiclass classification where a majority class is to be ignored.
es_es: ``"micro"`` da a cada par de clase muestra una contribución igual a la métrica global (excepto como resultado de la ponderación de la muestra). En lugar de sumar la métrica por clase, se suman los dividendos y divisores que componen las métricas por clase para calcular un cociente global. El micropromedio puede ser preferible en entornos de etiquetas múltiples, incluida la clasificación multiclase en la que se debe ignorar una clase mayoritaria.

source: ``"samples"`` applies only to multilabel problems. It does not calculate a per-class measure, instead calculating the metric over the true and predicted classes for each sample in the evaluation data, and returning their (``sample_weight``-weighted) average.
es_es: ``"samples"`` aplican sólo a los problemas multietiqueta. No calcula una medida por clase, sino que calcula la métrica sobre las clases verdaderas y predichas para cada muestra en los datos de evaluación, y devuelve su promedio (``sample_weight`` ponderada).

source: Selecting ``average=None`` will return an array with the score for each class.
es_es: Al seleccionar ``average=None`` se devolverá una matriz con la puntuación para cada clase.
