Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/model_evaluation.po
Languages: es_es

source: The function :func:`roc_curve` computes the `receiver operating characteristic curve, or ROC curve <https://en.wikipedia.org/wiki/Receiver_operating_characteristic>`_. Quoting Wikipedia :
es_es: La función :func:`roc_curve` calcula la curva de operación `receptor operativo característico, o la curva ROC <https://en.wikipedia.org/wiki/Receiver_operating_characteristic>`_. Citando Wikipedia :

source: "A receiver operating characteristic (ROC), or simply ROC curve, is a graphical plot which illustrates the performance of a binary classifier system as its discrimination threshold is varied. It is created by plotting the fraction of true positives out of the positives (TPR = true positive rate) vs. the fraction of false positives out of the negatives (FPR = false positive rate), at various threshold settings. TPR is also known as sensitivity, and FPR is one minus the specificity or true negative rate."
es_es: "Una curva de características operativas del receptor (ROC), o simplemente curva ROC, es un gráfico que ilustra el rendimiento de un sistema clasificador binario al variar su umbral de discriminación. Se crea trazando la fracción de verdaderos positivos de los positivos (TPR = tasa de verdaderos positivos) frente a la fracción de falsos positivos de los negativos (FPR = tasa de falsos positivos), en varios ajustes de umbral. La TPR también se conoce como sensibilidad, y la FPR es uno menos la especificidad o tasa de verdaderos negativos."

source: This function requires the true binary value and the target scores, which can either be probability estimates of the positive class, confidence values, or binary decisions. Here is a small example of how to use the :func:`roc_curve` function::
es_es: Esta función requiere el verdadero valor binario y las puntuaciones de destino, que pueden ser estimaciones de probabilidad de la clase positiva, valores de confianza o decisiones binarias. Aquí hay un pequeño ejemplo de cómo usar la función :func:`roc_curve`::

source: This figure shows an example of such an ROC curve:
es_es: Esta imagen muestra un ejemplo de dicha curva ROC:

source: The :func:`roc_auc_score` function computes the area under the receiver operating characteristic (ROC) curve, which is also denoted by AUC or AUROC. By computing the area under the roc curve, the curve information is summarized in one number. For more information see the `Wikipedia article on AUC <https://en.wikipedia.org/wiki/Receiver_operating_characteristic#Area_under_the_curve>`_.
es_es: La función :func:`roc_auc_score` calcula el área bajo la curva de características operativas del receptor (ROC), que también se denomina AUC o AUROC. Al calcular el área bajo la curva roc, la información de la curva se resume en un número. Para más información, consulta el artículo de la Wikipedia sobre AUC <https://en.wikipedia.org/wiki/Receiver_operating_characteristic#Area_under_the_curve>`_.

source: Compared to metrics such as the subset accuracy, the Hamming loss, or the F1 score, ROC doesn't require optimizing a threshold for each label.
es_es: Comparado con las métricas como la precisión del subconjunto, la pérdida de Hamming, o la puntuación de F1, ROC no requiere optimizar un umbral para cada etiqueta.

source: Binary case
es_es: Caso binario

source: In the **binary case**, you can either provide the probability estimates, using the `classifier.predict_proba()` method, or the non-thresholded decision values given by the `classifier.decision_function()` method. In the case of providing the probability estimates, the probability of the class with the "greater label" should be provided. The "greater label" corresponds to `classifier.classes_[1]` and thus `classifier.predict_proba(X)[:, 1]`. Therefore, the `y_score` parameter is of size (n_samples,).
es_es: En el **caso binario**, puedes proporcionar las estimaciones de probabilidad, utilizando el método `classifier.predict_proba()`, o los valores de decisión no retenidos por el método `classifier.decision_function()`. En el caso de proporcionar las estimaciones de probabilidad, se debe proporcionar la probabilidad de la clase con la "etiqueta mayor". La "etiqueta mayor" corresponde a `classifier. lasses_[1]` y así `classifier.predict_proba(X)[:, 1]`. Por lo tanto, el parámetro `y_score` es de tamaño (n_samples,).

source: We can use the probability estimates corresponding to `clf.classes_[1]`.
es_es: Podemos usar las estimaciones de probabilidad correspondientes a `clf.classes_[1]`.

source: Otherwise, we can use the non-thresholded decision values
es_es: De lo contrario, podemos utilizar los valores de decisión no restringidos

source: Multi-class case
es_es: Caso de clases múltiples

source: The :func:`roc_auc_score` function can also be used in **multi-class classification**. Two averaging strategies are currently supported: the one-vs-one algorithm computes the average of the pairwise ROC AUC scores, and the one-vs-rest algorithm computes the average of the ROC AUC scores for each class against all other classes. In both cases, the predicted labels are provided in an array with values from 0 to ``n_classes``, and the scores correspond to the probability estimates that a sample belongs to a particular class. The OvO and OvR algorithms support weighting uniformly (``average='macro'``) and by prevalence (``average='weighted'``).
es_es: La función :func:`roc_auc_score` también puede utilizarse en la **clasificación multiclase**. Actualmente se admiten dos estrategias de promediación: el algoritmo one-vs-one calcula la media de las puntuaciones ROC AUC por pares, y el algoritmo one-vs-rest calcula la media de las puntuaciones ROC AUC de cada clase frente a todas las demás. En ambos casos, las etiquetas predichas se proporcionan en una matriz con valores de 0 a ``n_classes``, y las puntuaciones corresponden a las estimaciones de probabilidad de que una muestra pertenezca a una clase concreta. Los algoritmos OvO y OvR admiten la ponderación uniforme (``average='macro'``) y por prevalencia (``average='weighted'``).

source: **One-vs-one Algorithm**: Computes the average AUC of all possible pairwise combinations of classes. [HT2001]_ defines a multiclass AUC metric weighted uniformly:
es_es: **Algoritmo One-vs-one**: Calcula el AUC promedio de todas las combinaciones posibles de clases. [HT2001]_ define una métrica de AUC multiclase ponderada uniformemente:

source: where :math:`c` is the number of classes and :math:`\text{AUC}(j | k)` is the AUC with class :math:`j` as the positive class and class :math:`k` as the negative class. In general, :math:`\text{AUC}(j | k) \neq \text{AUC}(k | j))` in the multiclass case. This algorithm is used by setting the keyword argument ``multiclass`` to ``'ovo'`` and ``average`` to ``'macro'``.
es_es: donde :math:`c` es el número de clases y :math:`\text{AUC}(j | k)` es el AUC con la clase :math:`j` como la clase positiva y la clase :math:`k` como la clase negativa. En general, :math:`\text{AUC}(j | k) \neq \text{AUC}(k | j)` en el caso multiclase. Este algoritmo se utiliza estableciendo el argumento de palabra clave ``multiclass`` a ``'ovo'`` y ``average`` a ``'macro'``.

source: The [HT2001]_ multiclass AUC metric can be extended to be weighted by the prevalence:
es_es: La métrica AUC de [HT2001]_ multiclase puede ser extendida para ser ponderada por la prevalencia:

source: where :math:`c` is the number of classes. This algorithm is used by setting the keyword argument ``multiclass`` to ``'ovo'`` and ``average`` to ``'weighted'``. The ``'weighted'`` option returns a prevalence-weighted average as described in [FC2009]_.
es_es: donde :math:`c` es el número de clases. Este algoritmo se utiliza estableciendo el argumento de la palabra clave ``multiclass`` a ``'ovo'` y ``average`` a ``'weighted'``. La opción ``'weighted'`` devuelve un promedio ponderado de prevalencia como se describe en [FC2009]_.

source: **One-vs-rest Algorithm**: Computes the AUC of each class against the rest [PD2000]_. The algorithm is functionally the same as the multilabel case. To enable this algorithm set the keyword argument ``multiclass`` to ``'ovr'``. Like OvO, OvR supports two types of averaging: ``'macro'`` [F2006]_ and ``'weighted'`` [F2001]_.
es_es: **Algoritmo One-vs-rest**: Calcula el AUC de cada clase contra el resto [PD2000]_. El algoritmo es funcionalmente el mismo que el caso multietiqueta. Para activar este algoritmo establece el argumento de palabra clave ``multiclass`` a ``'ovr'``. Al igual que OvO, OvR soporta dos tipos de promedio: ``'macro'`` [F2006]_ y ``'weighted'`` [F2001]_.

source: In applications where a high false positive rate is not tolerable the parameter ``max_fpr`` of :func:`roc_auc_score` can be used to summarize the ROC curve up to the given limit.
es_es: En aplicaciones donde una alta tasa de falsos positivos no es tolerable, el parámetro ``max_fpr`` de :func:`roc_auc_score` puede utilizarse para resumir la curva ROC hasta el límite dado.

source: Multi-label case
es_es: Caso multietiquetas

source: In **multi-label classification**, the :func:`roc_auc_score` function is extended by averaging over the labels as :ref:`above <average>`. In this case, you should provide a `y_score` of shape `(n_samples, n_classes)`. Thus, when using the probability estimates, one needs to select the probability of the class with the greater label for each output.
es_es: En la **clasificación multietiqueta**, la función :func:`roc_auc_score` se extiende al promediar sobre las etiquetas como :ref:`arriba <average>`. En este caso, debe proporcionar un `y_score` de la forma `(n_samples, n_classes)`. Por lo tanto, al usar las estimaciones de probabilidad, se necesita seleccionar la probabilidad de la clase con la etiqueta mayor para cada salida.

source: And the decision values do not require such processing.
es_es: Y los valores de decisión no requieren tal procesamiento.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_roc.py` for an example of using ROC to evaluate the quality of the output of a classifier.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_roc.py` para un ejemplo de uso de ROC para evaluar la calidad de la salida de un clasificador.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_roc_crossval.py` for an example of using ROC to evaluate classifier output quality, using cross-validation.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_roc_crossval.py` para un ejemplo de uso de ROC para evaluar la calidad de la salida del clasificador, utilizando la validación cruzada.

source: See :ref:`sphx_glr_auto_examples_applications_plot_species_distribution_modeling.py` for an example of using ROC to model species distribution.
es_es: Ver :ref:`sphx_glr_auto_examples_applications_plot_species_distribution_modeling.py` para un ejemplo de uso de ROC para modelar la distribución de especies.

source: Detection error tradeoff (DET)
es_es: Compensación de errores de detección (DET)

source: The function :func:`det_curve` computes the detection error tradeoff curve (DET) curve [WikipediaDET2017]_. Quoting Wikipedia:
es_es: La función :func:`det_curve` calcula la curva de error de detección (DET) de la curva [WikipediaDET2017]_. Citando Wikipedia:

source: "A detection error tradeoff (DET) graph is a graphical plot of error rates for binary classification systems, plotting false reject rate vs. false accept rate. The x- and y-axes are scaled non-linearly by their standard normal deviates (or just by logarithmic transformation), yielding tradeoff curves that are more linear than ROC curves, and use most of the image area to highlight the differences of importance in the critical operating region."
es_es: "Un gráfico de compensación de errores de detección (DET) es un gráfico de las tasas de error de los sistemas de clasificación binarios, que representa la tasa de falsos rechazos frente a la tasa de falsos aceptados. Los ejes x e y se escalan de forma no lineal por sus desviaciones normales estándar (o simplemente por transformación logarítmica), dando lugar a curvas de compensación que son más lineales que las curvas ROC, y utilizan la mayor parte del área de la imagen para destacar las diferencias de importancia en la región operativa crítica."

source: DET curves are a variation of receiver operating characteristic (ROC) curves where False Negative Rate is plotted on the y-axis instead of True Positive Rate. DET curves are commonly plotted in normal deviate scale by transformation with :math:`\phi^{-1}` (with :math:`\phi` being the cumulative distribution function). The resulting performance curves explicitly visualize the tradeoff of error types for given classification algorithms. See [Martin1997]_ for examples and further motivation.
es_es: Las curvas DET son una variación de las curvas de características operativas del receptor (ROC) en las que la tasa de falsos negativos se representa en el eje Y en lugar de la tasa de verdaderos positivos. Las curvas DET se suelen trazar en escala de desviación normal por transformación con :math:`\phi^{-1}` (siendo :math:`\phi` la función de distribución acumulativa). Las curvas de rendimiento resultantes visualizan explícitamente la compensación de los tipos de error para determinados algoritmos de clasificación. Ver [Martin1997]_ para ver ejemplos y una mayor motivación.

source: This figure compares the ROC and DET curves of two example classifiers on the same classification task:
es_es: Esta imagen compara las curvas ROC y DET de dos clasificadores de ejemplo en la misma tarea de clasificación:

source: **Properties:**
es_es: **Propiedades:**

source: DET curves form a linear curve in normal deviate scale if the detection scores are normally (or close-to normally) distributed. It was shown by [Navratil2007]_ that the reverse it not necessarily true and even more general distributions are able produce linear DET curves.
es_es: Las curvas DET forman una curva lineal en escala de desviación normal si las puntuaciones de detección están distribuidas normalmente (o casi normalmente). [Navratil2007]_ demostró que lo contrario no es necesariamente cierto y que incluso distribuciones más generales pueden producir curvas DET lineales.

source: The normal deviate scale transformation spreads out the points such that a comparatively larger space of plot is occupied. Therefore curves with similar classification performance might be easier to distinguish on a DET plot.
es_es: La transformación de la escala normal desviada distribuye los puntos de forma que se ocupa un espacio comparativamente mayor del gráfico. Por lo tanto, las curvas con un rendimiento de clasificación similar podrían ser más fáciles de distinguir en un gráfico DET.

source: With False Negative Rate being "inverse" to True Positive Rate the point of perfection for DET curves is the origin (in contrast to the top left corner for ROC curves).
es_es: Dado que la tasa de falsos negativos es "inversa" a la tasa de verdaderos positivos, el punto de perfección de las curvas DET es el origen (en contraste con la esquina superior izquierda de las curvas ROC).

source: **Applications and limitations:**
es_es: **Aplicaciones y limitaciones:**

source: DET curves are intuitive to read and hence allow quick visual assessment of a classifier's performance. Additionally DET curves can be consulted for threshold analysis and operating point selection. This is particularly helpful if a comparison of error types is required.
es_es: Las curvas DET son de lectura intuitiva y, por tanto, permiten una rápida evaluación visual del rendimiento de un clasificador. Además, las curvas DET pueden consultarse para el análisis de umbrales y la selección del punto de funcionamiento. Esto es especialmente útil si se requiere una comparación de los tipos de error.

source: One the other hand DET curves do not provide their metric as a single number. Therefore for either automated evaluation or comparison to other classification tasks metrics like the derived area under ROC curve might be better suited.
es_es: Por otro lado, las curvas DET no proporcionan su métrica como un único número. Por lo tanto, para la evaluación automatizada o la comparación con otras tareas de clasificación, podrían ser más adecuadas métricas como el área derivada bajo la curva ROC.

source: See :ref:`sphx_glr_auto_examples_model_selection_plot_det.py` for an example comparison between receiver operating characteristic (ROC) curves and Detection error tradeoff (DET) curves.
es_es: Ver :ref:`sphx_glr_auto_examples_model_selection_plot_det.py` para ver un ejemplo de comparación entre las curvas de características operativas del receptor (ROC) y las curvas de compensación de errores de detección (DET).

source: Wikipedia contributors. Detection error tradeoff. Wikipedia, The Free Encyclopedia. September 4, 2017, 23:33 UTC. Available at: https://en.wikipedia.org/w/index.php?title=Detection_error_tradeoff&oldid=798982054. Accessed February 19, 2018.
es_es: Colaboradores de Wikipedia. Detection error tradeoff. Wikipedia, The Free Encyclopedia. 4 de septiembre de 2017, 23:33 UTC. Disponible en: https://en.wikipedia.org/w/index.php?title=Detection_error_tradeoff&oldid=798982054. Accedido el 19 de febrero de 2018.

source: Zero one loss
es_es: Pérdida cero uno

source: The :func:`zero_one_loss` function computes the sum or the average of the 0-1 classification loss (:math:`L_{0-1}`) over :math:`n_{\text{samples}}`. By default, the function normalizes over the sample. To get the sum of the :math:`L_{0-1}`, set ``normalize`` to ``False``.
es_es: La función :func:`zero_one_loss` calcula la suma o la media de la pérdida de clasificación 0-1 (:math:`L_{0-1}`) sobre :math:`n_{text{samples}}. Por defecto, la función se normaliza sobre la muestra. Para obtener la suma de :math:`L_{0-1}`, establezca ``normalize`` como ``False``.

source: In multilabel classification, the :func:`zero_one_loss` scores a subset as one if its labels strictly match the predictions, and as a zero if there are any errors. By default, the function returns the percentage of imperfectly predicted subsets. To get the count of such subsets instead, set ``normalize`` to ``False``
es_es: En la clasificación multietiqueta, la :func:`cero_one_loss` puntúa un subconjunto como uno si sus etiquetas coinciden estrictamente con las predicciones, y como un cero si hay algún error. Por defecto, la función devuelve el porcentaje de subconjuntos con predicciones imperfectas. Para obtener el recuento de dichos subconjuntos, establezca ``normalize`` a ``False``

source: If :math:`\hat{y}_i` is the predicted value of the :math:`i`-th sample and :math:`y_i` is the corresponding true value, then the 0-1 loss :math:`L_{0-1}` is defined as:
es_es: Si :math:`\hat{y}_i` es el valor previsto de la muestra :math:`i`-ésima y :math:`y_i` es el valor verdadero correspondiente, entonces la pérdida 0-1 :math:`L_{0-1}` está definida como:

source: In the multilabel case with binary label indicators, where the first label set [0,1] has an error::
es_es: En el caso multietiqueta con indicadores de etiquetas binarias, donde la primera etiqueta [0,1] tiene un error::

source: See :ref:`sphx_glr_auto_examples_feature_selection_plot_rfe_with_cross_validation.py` for an example of zero one loss usage to perform recursive feature elimination with cross-validation.
es_es: Ver :ref:`sphx_glr_auto_examples_feature_selection_plot_rfe_with_cross_validation.py` para un ejemplo de uso de pérdida cero uno para realizar la eliminación recursiva de características con validación cruzada.

source: Brier score loss
es_es: Pérdida de puntuación en Brier

source: The :func:`brier_score_loss` function computes the `Brier score <https://en.wikipedia.org/wiki/Brier_score>`_ for binary classes [Brier1950]_. Quoting Wikipedia:
es_es: La función :func:`brier_score_loss` calcula la `puntuación Brier <https://en.wikipedia.org/wiki/Brier_score>`_ para las clases binarias [Brier1950]_. Citando Wikipedia:

source: "The Brier score is a proper score function that measures the accuracy of probabilistic predictions. It is applicable to tasks in which predictions must assign probabilities to a set of mutually exclusive discrete outcomes."
es_es: "La puntuación de Brier es una función de puntuación propia que mide la precisión de las predicciones probabilísticas. Es aplicable a tareas en las que las predicciones deben asignar probabilidades a un conjunto de resultados discretos mutuamente excluyentes."

source: This function returns the mean squared error of the actual outcome :math:`y \in \{0,1\}` and the predicted probability estimate :math:`p = \operatorname{Pr}(y = 1)` (:term:`predict_proba`) as outputted by:
es_es: Esta función devuelve el error cuadrado promedio del resultado real :math:`y \in \{0, \}` y la estimación prevista de probabilidad :math:`p = \operatorname{Pr}(y = 1)` (:term:`predict_proba`) como salida por:

source: The Brier score loss is also between 0 to 1 and the lower the value (the mean square difference is smaller), the more accurate the prediction is.
es_es: La pérdida de puntuación de Brier también está entre 0 y 1 y cuanto más bajo sea el valor (la diferencia cuadrática media es menor), más precisa es la predicción.

source: Here is a small example of usage of this function::
es_es: Aquí hay un pequeño ejemplo de uso de esta función::

source: The Brier score can be used to assess how well a classifier is calibrated. However, a lower Brier score loss does not always mean a better calibration. This is because, by analogy with the bias-variance decomposition of the mean squared error, the Brier score loss can be decomposed as the sum of calibration loss and refinement loss [Bella2012]_. Calibration loss is defined as the mean squared deviation from empirical probabilities derived from the slope of ROC segments. Refinement loss can be defined as the expected optimal loss as measured by the area under the optimal cost curve. Refinement loss can change independently from calibration loss, thus a lower Brier score loss does not necessarily mean a better calibrated model. "Only when refinement loss remains the same does a lower Brier score loss always mean better calibration" [Bella2012]_, [Flach2008]_.
es_es: La puntuación de Brier puede utilizarse para evaluar lo bien que está calibrado un clasificador. Sin embargo, una pérdida de puntuación de Brier más baja no siempre significa una mejor calibración. Esto se debe a que, por analogía con la descomposición sesgo-varianza del error cuadrático medio, la pérdida de puntuación de Brier puede descomponerse como la suma de la pérdida de calibración y la pérdida de refinamiento [Bella2012]_. La pérdida de calibración se define como la desviación media al cuadrado de las probabilidades empíricas derivadas de la pendiente de los segmentos ROC. La pérdida de refinamiento puede definirse como la pérdida óptima esperada, medida por el área bajo la curva de coste óptimo. La pérdida de refinamiento puede cambiar independientemente de la pérdida de calibración, por lo que una pérdida de puntuación de Brier más baja no significa necesariamente un modelo mejor calibrado. "Sólo cuando la pérdida de refinamiento permanece igual, una pérdida de puntuación de Brier más baja significa siempre una mejor calibración" [Bella2012]_, [Flach2008]_.

source: See :ref:`sphx_glr_auto_examples_calibration_plot_calibration.py` for an example of Brier score loss usage to perform probability calibration of classifiers.
es_es: Ver :ref:`sphx_glr_auto_examples_calibration_plot_calibration.py` para un ejemplo de uso de la pérdida de puntuación Brier para realizar la calibración probabilística de los clasificadores.

source: Multilabel ranking metrics
es_es: Métricas de clasificación multietiqueta
