Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/multiclass.po
Languages: es_es

source: Clearly the order of the chain is important. The first model in the chain has no information about the other labels while the last model in the chain has features indicating the presence of all of the other labels. In general one does not know the optimal ordering of the models in the chain so typically many randomly ordered chains are fit and their predictions are averaged together.
es_es: Es evidente que el orden de la cadena es importante. El primer modelo de la cadena no tiene información sobre las otras etiquetas, mientras que el último modelo de la cadena tiene características que indican la presencia de todas las demás etiquetas. En general, uno no sabe el orden óptimo de los modelos de la cadena, por lo que típicamente muchas cadenas ordenadas aleatoriamente son ajustadas y sus predicciones son promedio juntos.

source: **Multiclass-multioutput classification** (also known as **multitask classification**) is a classification task which labels each sample with a set of **non-binary** properties. Both the number of properties and the number of classes per property is greater than 2. A single estimator thus handles several joint classification tasks. This is both a generalization of the multi\ *label* classification task, which only considers binary attributes, as well as a generalization of the multi\ *class* classification task, where only one property is considered.
es_es: La **clasificación multiclase de salida múltiple** (también conocida como **clasificación multitarea**) es una tarea de clasificación que etiqueta cada muestra con un conjunto de propiedades **no binarias**. Tanto el número de propiedades como el número de clases por propiedad es superior a 2. Así, un único estimador se encarga de varias tareas de clasificación conjuntas. Se trata tanto de una generalización de la tarea de clasificación de múltiples *etiquetas*, que sólo considera atributos binarios, como de una generalización de la tarea de clasificación de múltiples *clases*, en la que sólo se considera una propiedad.

source: For example, classification of the properties "type of fruit" and "colour" for a set of images of fruit. The property "type of fruit" has the possible classes: "apple", "pear" and "orange". The property "colour" has the possible classes: "green", "red", "yellow" and "orange". Each sample is an image of a fruit, a label is output for both properties and each label is one of the possible classes of the corresponding property.
es_es: Por ejemplo, la clasificación de las propiedades "tipo de fruta" y "color" para un conjunto de imágenes de frutas. La propiedad "tipo de fruta" tiene las clases posibles "manzana", "pera" y "naranja". La propiedad "color" tiene las clases posibles: "verde", "rojo", "amarillo" y "naranja". Cada muestra es una imagen de una fruta, se emite una etiqueta para ambas propiedades y cada etiqueta es una de las posibles clases de la propiedad correspondiente.

source: Note that all classifiers handling multiclass-multioutput (also known as multitask classification) tasks, support the multilabel classification task as a special case. Multitask classification is similar to the multioutput classification task with different model formulations. For more information, see the relevant estimator documentation.
es_es: Observa que todos los clasificadores que manejan tareas multiclase de salidos múltiples (también conocidas como clasificación multitarea), admiten la tarea de clasificación multietiqueta como un caso especial. La clasificación multitarea es similar a la tarea de clasificación de salidas múltiples con diferentes formulaciones del modelo. Para más información, consulta la documentación del estimador correspondiente.

source: At present, no metric in :mod:`sklearn.metrics` supports the multiclass-multioutput classification task.
es_es: Actualmente, ninguna métrica en :mod:`sklearn.metrics` soporta la tarea de clasificación multiclase de salida múltiple.

source: A valid representation of :term:`multioutput` `y` is a dense matrix of shape ``(n_samples, n_classes)`` of class labels. A column wise concatenation of 1d :term:`multiclass` variables. An example of ``y`` for 3 samples:
es_es: Una representación válida de :term:`multioutput` `y` es una matriz densa de forma ``(n_samples, n_classes)`` de etiquetas de clase. Es una concatenación por columnas de 1d variables de :term:`multiclass`. Un ejemplo de ``y`` para 3 muestras:

source: **Multioutput regression** predicts multiple numerical properties for each sample. Each property is a numerical variable and the number of properties to be predicted for each sample is greater than or equal to 2. Some estimators that support multioutput regression are faster than just running ``n_output`` estimators.
es_es: La ** Rgresión de salida múltiple** predice múltiples propiedades numéricas para cada muestra. Cada propiedad es una variable numérica y el número de propiedades a predecir para cada muestra es mayor o igual a 2. Algunos estimadores que soportan la regresión de salida múltiple son más rápidos que la simple ejecución de estimadores ``n_output``.

source: For example, prediction of both wind speed and wind direction, in degrees, using data obtained at a certain location. Each sample would be data obtained at one location and both wind speed and direction would be output for each sample.
es_es: Por ejemplo, predicción tanto de la velocidad del viento como de la dirección del viento, en grados, utilizando datos obtenidos en una determinada ubicación. Cada muestra sería información obtenida en una ubicación y tanto la velocidad del viento como la dirección serían salida para cada muestra.

source: A valid representation of :term:`multioutput` `y` is a dense matrix of shape ``(n_samples, n_classes)`` of floats. A column wise concatenation of :term:`continuous` variables. An example of ``y`` for 3 samples:
es_es: Una representación válida de :term:`multioutput` `y` es una matriz densa de la forma ``(n_samples, n_classes)`` de floats. Una concatenación sabia de columna de variables :term:`continuas`. Un ejemplo de ``y`` para 3 muestras:

source: MultiOutputRegressor
es_es: Regresor de salida múltiples

source: Multioutput regression support can be added to any regressor with :class:`~sklearn.multioutput.MultiOutputRegressor`. This strategy consists of fitting one regressor per target. Since each target is represented by exactly one regressor it is possible to gain knowledge about the target by inspecting its corresponding regressor. As :class:`~sklearn.multioutput.MultiOutputRegressor` fits one regressor per target it can not take advantage of correlations between targets.
es_es: El soporte de regresión de salidas múltplies puede añadirse a cualquier regresor con :class:`~sklearn.multioutput.MultiOutputRegressor`. Esta estrategia consiste en ajustar un regresor por objetivo. Dado que cada objetivo está representado exactamente por un regresor, es posible conocer el objetivo inspeccionando su regresor correspondiente. Como :class:`~sklearn.multioutput.MultiOutputRegressor` se ajusta a un regresor por objetivo que no puede aprovechar las correlaciones entre objetivos.

source: Below is an example of multioutput regression:
es_es: A continuación hay un ejemplo de regresión de salidas múltiples:

source: RegressorChain
es_es: Cadena de Regresor

source: Regressor chains (see :class:`~sklearn.multioutput.RegressorChain`) is analogous to :class:`~sklearn.multioutput.ClassifierChain` as a way of combining a number of regressions into a single multi-target model that is capable of exploiting correlations among targets.
es_es: Las cadenas de regresores (ver:class:`~sklearn.multioutput.RegressorChain`) son análogas a :class:`~sklearn.multioutput.ClassifierChain` como forma de combinar una serie de regresiones en un único modelo multiobjetivo que es capaz de explotar las correlaciones entre los objetivos.
