Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/multiclass.po
Languages: es_es

source: Multiclass and multioutput algorithms
es_es: Algoritmos multiclase y multisalida

source: This section of the user guide covers functionality related to multi-learning problems, including :term:`multiclass`, :term:`multilabel`, and :term:`multioutput` classification and regression.
es_es: Esta sección de la guía del usuario cubre la funcionalidad relacionada con los problemas de aprendizaje múltiple, incluyendo :term:`multiclase`, :term:`multilabel`, y :term:`multioutput` clasificación y regresión.

source: The modules in this section implement :term:`meta-estimators`, which require a base estimator to be provided in their constructor. Meta-estimators extend the functionality of the base estimator to support multi-learning problems, which is accomplished by transforming the multi-learning problem into a set of simpler problems, then fitting one estimator per problem.
es_es: Los módulos de esta sección implementan :term:`meta-estimadores`, que requieren que se proporcione un estimador base en su constructor. Los meta-estimadores extienden la funcionalidad del estimador base para soportar problemas de aprendizaje múltiple, lo que se consigue transformando el problema de aprendizaje múltiple en un conjunto de problemas más simples, y luego ajustando un estimador por problema.

source: This section covers two modules: :mod:`sklearn.multiclass` and :mod:`sklearn.multioutput`. The chart below demonstrates the problem types that each module is responsible for, and the corresponding meta-estimators that each module provides.
es_es: Esta sección cubre dos módulos: :mod:`sklearn.multiclass` y :mod:`sklearn.multioutput`. El siguiente gráfico muestra los tipos de problemas de los que se encarga cada módulo y los correspondientes meta-estimadores que proporciona cada módulo.

source: The table below provides a quick reference on the differences between problem types. More detailed explanations can be found in subsequent sections of this guide.
es_es: La siguiente tabla proporciona una referencia rápida sobre las diferencias entre los tipos de problemas. Se pueden encontrar explicaciones más detalladas en las secciones posteriores de esta guía.

source: Number of targets
es_es: Número de objetivos

source: Target cardinality
es_es: Cardinalidad del objetivo

source: Multiclass classification
es_es: Clasificación multiclase

source: 'multiclass'
es_es: 'multiclase'

source: Multilabel classification
es_es: Clasificación multietiqueta

source: 2 (0 or 1)
es_es: 2 (0 o 1)

source: Multiclass-multioutput classification
es_es: Clasificación multiclase y multisalida

source: 'multiclass-multioutput'
es_es: 'multiclase de salida múltiple'

source: Multioutput regression
es_es: Regresión de salida múltiple

source: Continuous
es_es: Continuo

source: 'continuous-multioutput'
es_es: 'Salida múltiple continua'

source: Below is a summary of scikit-learn estimators that have multi-learning support built-in, grouped by strategy. You don't need the meta-estimators provided by this section if you're using one of these estimators. However, meta-estimators can provide additional strategies beyond what is built-in:
es_es: A continuación se muestra un resumen de los estimadores de scikit-learn que tienen soporte de aprendizaje múltiple incorporado, agrupados por estrategia. No necesitas los meta-estimadores proporcionados por esta sección si estas utilizando uno de estos estimadores. Sin embargo, los meta-estimadores pueden proporcionar estrategias adicionales más allá de lo que está incorporado:

source: **Inherently multiclass:**
es_es: **Intrínsecamente multiclase:**

source: :class:`svm.LinearSVC` (setting multi_class="crammer_singer")
es_es: :class:`svm.LinearSVC` (ajustando multi_class="crammer_singer")

source: :class:`linear_model.LogisticRegression` (setting multi_class="multinomial")
es_es: :class:`linear_model.LogisticRegression` (ajustando multi_class="multinomial")

source: :class:`linear_model.LogisticRegressionCV` (setting multi_class="multinomial")
es_es: :class:`linear_model.LogisticRegressionCV` (ajustando multi_class="multinomial")

source: **Multiclass as One-Vs-One:**
es_es: **Multiclase como One-Vs-One:**

source: :class:`gaussian_process.GaussianProcessClassifier` (setting multi_class = "one_vs_one")
es_es: :class:`gaussian_process.GaussianProcessClassifier` (ajustando multi_class = "one_vs_one")

source: **Multiclass as One-Vs-The-Rest:**
es_es: **Multiclase como One-Vs-The-Rest:**

source: :class:`gaussian_process.GaussianProcessClassifier` (setting multi_class = "one_vs_rest")
es_es: :class:`gaussian_process.GaussianProcessClassifier` (ajustando multi_class = "one_vs_rest")

source: :class:`svm.LinearSVC` (setting multi_class="ovr")
es_es: :class:`svm.LinearSVC` (ajustando multi_class="ovr")

source: :class:`linear_model.LogisticRegression` (setting multi_class="ovr")
es_es: :class:`linear_model.LogisticRegression` (ajustando multi_class="ovr")

source: :class:`linear_model.LogisticRegressionCV` (setting multi_class="ovr")
es_es: :class:`linear_model.LogisticRegressionCV` (ajustando multi_class="ovr")

source: **Support multilabel:**
es_es: **Soporte de multietiqueta:**

source: **Support multiclass-multioutput:**
es_es: **Soporte de multi-clase de salida múltiple:**

source: All classifiers in scikit-learn do multiclass classification out-of-the-box. You don't need to use the :mod:`sklearn.multiclass` module unless you want to experiment with different multiclass strategies.
es_es: Todos los clasificadores en scikit-learn hacen la clasificación multiclase inmediata. No es necesario utilizar el módulo :mod:`sklearn.multiclass` a menos que quieras experimentar con diferentes estrategias multiclase.

source: **Multiclass classification** is a classification task with more than two classes. Each sample can only be labeled as one class.
es_es: **La clasificación multiclase** es una tarea de clasificación con más de dos clases. Cada muestra sólo puede ser etiquetada como una clase.

source: For example, classification using features extracted from a set of images of fruit, where each image may either be of an orange, an apple, or a pear. Each image is one sample and is labeled as one of the 3 possible classes. Multiclass classification makes the assumption that each sample is assigned to one and only one label - one sample cannot, for example, be both a pear and an apple.
es_es: Por ejemplo, la clasificación mediante características extraídas de un conjunto de imágenes de fruta, donde cada imagen puede ser de una naranja, una manzana o una pera. Cada imagen es una muestra y se etiqueta como una de las 3 clases posibles. La clasificación multiclase parte de la base de que cada muestra se asigna a una sola etiqueta: una muestra no puede ser, por ejemplo, una pera y una manzana.

source: While all scikit-learn classifiers are capable of multiclass classification, the meta-estimators offered by :mod:`sklearn.multiclass` permit changing the way they handle more than two classes because this may have an effect on classifier performance (either in terms of generalization error or required computational resources).
es_es: Aunque todos los clasificadores de scikit-learn son capaces de realizar una clasificación multiclase, los meta-estimadores ofrecidos por :mod:`sklearn.multiclass` permiten cambiar la forma en que manejan más de dos clases porque esto puede tener un efecto en el rendimiento del clasificador (ya sea en términos de error de generalización o de recursos computacionales requeridos).

source: Target format
es_es: Formato del objetivo

source: Valid :term:`multiclass` representations for :func:`~sklearn.utils.multiclass.type_of_target` (`y`) are:
es_es: Representaciones válidas de :term:`multiclase` para :func:`~sklearn.utils.multiclass.type_of_target` (`y`) son:

source: 1d or column vector containing more than two discrete values. An example of a vector ``y`` for 4 samples:
es_es: Vector de 1d o columna que contiene más de dos valores discretos. Un ejemplo de vector ``y`` para 4 muestras:

source: Dense or sparse :term:`binary` matrix of shape ``(n_samples, n_classes)`` with a single sample per row, where each column represents one class. An example of both a dense and sparse :term:`binary` matrix ``y`` for 4 samples, where the columns, in order, are apple, orange, and pear:
es_es: Matriz :term:`binaria` densa o dispersa de forma ``(n_muestras, n_clases)`` con una sola muestra por fila, donde cada columna representa una clase. Un ejemplo de matriz :term:`binaria` densa y dispersa para 4 muestras, donde las columnas, en orden, son manzana, naranja y pera:

source: For more information about :class:`~sklearn.preprocessing.LabelBinarizer`, refer to :ref:`preprocessing_targets`.
es_es: Para más información sobre :class:`~sklearn.preprocessing.LabelBinarizer`, consulta :ref:`preprocessing_targets`.

source: OneVsRestClassifier
es_es: Clasificador One Vs Rest

source: The **one-vs-rest** strategy, also known as **one-vs-all**, is implemented in :class:`~sklearn.multiclass.OneVsRestClassifier`. The strategy consists in fitting one classifier per class. For each classifier, the class is fitted against all the other classes. In addition to its computational efficiency (only `n_classes` classifiers are needed), one advantage of this approach is its interpretability. Since each class is represented by one and only one classifier, it is possible to gain knowledge about the class by inspecting its corresponding classifier. This is the most commonly used strategy and is a fair default choice.
es_es: La estrategia **one-vs-rest**, también conocida como **uno-vs-todo**, se implementa en :class:`~sklearn.multiclass.OneVsRestClassifier`. La estrategia consiste en ajustar un clasificador por clase. Para cada clasificador, la clase se ajusta contra todas las demás clases. Además de su eficiencia computacional (sólo se necesitan clasificadores `n_clases`), una ventaja de este enfoque es su interpretabilidad. Dado que cada clase está representada por uno y sólo un clasificador, es posible obtener conocimientos sobre la clase inspeccionando su clasificador correspondiente. Esta es la estrategia más comúnmente utilizada y es una elección justa por defecto.

source: Below is an example of multiclass learning using OvR::
es_es: A continuación hay un ejemplo de aprendizaje multiclase usando OvR::

source: :class:`~sklearn.multiclass.OneVsRestClassifier` also supports multilabel classification. To use this feature, feed the classifier an indicator matrix, in which cell [i, j] indicates the presence of label j in sample i.
es_es: :class:`~sklearn.multiclass.OneVsRestClassifier` también soporta clasificación multietiqueta. Para utilizar esta función, alimentar el clasificador una matriz indicadora, en la que la célula [i, j] indica la presencia de la etiqueta j en la muestra i.

source: OneVsOneClassifier
es_es: Clasificador OneVsOne

source: :class:`~sklearn.multiclass.OneVsOneClassifier` constructs one classifier per pair of classes. At prediction time, the class which received the most votes is selected. In the event of a tie (among two classes with an equal number of votes), it selects the class with the highest aggregate classification confidence by summing over the pair-wise classification confidence levels computed by the underlying binary classifiers.
es_es: :class:`~sklearn.multiclass.OneVsOneClassifier` construye un clasificador por cada par de clases. En el momento de la predicción, se selecciona la clase que ha recibido más votos. En caso de empate (entre dos clases con el mismo número de votos), selecciona la clase con la mayor confianza de clasificación agregada mediante la suma de los niveles de confianza de clasificación por pares calculados por los clasificadores binarios subyacentes.

source: Since it requires to fit ``n_classes * (n_classes - 1) / 2`` classifiers, this method is usually slower than one-vs-the-rest, due to its O(n_classes^2) complexity. However, this method may be advantageous for algorithms such as kernel algorithms which don't scale well with ``n_samples``. This is because each individual learning problem only involves a small subset of the data whereas, with one-vs-the-rest, the complete dataset is used ``n_classes`` times. The decision function is the result of a monotonic transformation of the one-versus-one classification.
es_es: Dado que requiere ajustar los clasificadores ``n_clases * (n_clases - 1) / 2``, este método suele ser más lento que el de one-vs-the-rest, debido a su complejidad O(n_clases^2). Sin embargo, este método puede ser ventajoso para algoritmos como los algoritmos núcleo que no escalan bien con ``n_muestras``. Esto se debe a que cada problema de aprendizaje individual sólo implica un pequeño subconjunto de los datos, mientras que, con one-vs-the-rest, el conjunto de datos completo se utiliza ``n_clases`` veces. La función de decisión es el resultado de una transformación monótona de la clasificación uno contra uno.

source: Below is an example of multiclass learning using OvO::
es_es: A continuación hay un ejemplo de aprendizaje multiclase usando OvO::

source: OutputCodeClassifier
es_es: Clasificador de Código de salida

source: Error-Correcting Output Code-based strategies are fairly different from one-vs-the-rest and one-vs-one. With these strategies, each class is represented in a Euclidean space, where each dimension can only be 0 or 1. Another way to put it is that each class is represented by a binary code (an array of 0 and 1). The matrix which keeps track of the location/code of each class is called the code book. The code size is the dimensionality of the aforementioned space. Intuitively, each class should be represented by a code as unique as possible and a good code book should be designed to optimize classification accuracy. In this implementation, we simply use a randomly-generated code book as advocated in [3]_ although more elaborate methods may be added in the future.
es_es: Las estrategias basadas en códigos de salida con corrección de errores son bastante diferentes a las de one-vs-the-rest y one-vs-one. Con estas estrategias, cada clase se representa en un espacio euclidiano, donde cada dimensión sólo puede ser 0 o 1. Otra forma de decirlo es que cada clase está representada por un código binario (un arreglo de 0 y 1). La matriz que lleva la cuenta de la ubicación/código de cada clase se llama libro de códigos. El tamaño del código es la dimensionalidad del espacio mencionado. Intuitivamente, cada clase debería estar representada por un código lo más único posible y un buen libro de códigos debería estar diseñado para optimizar la precisión de la clasificación. En esta implementación, simplemente utilizamos un libro de códigos generado aleatoriamente como se recomienda en [3]_ aunque se pueden añadir métodos más elaborados en el futuro.

source: At fitting time, one binary classifier per bit in the code book is fitted. At prediction time, the classifiers are used to project new points in the class space and the class closest to the points is chosen.
es_es: En el momento del ajuste, se ajusta un clasificador binario por cada bit del libro de códigos. En el momento de la predicción, los clasificadores se utilizan para proyectar nuevos puntos en el espacio de clases y se elige la clase más cercana a los puntos.

source: In :class:`~sklearn.multiclass.OutputCodeClassifier`, the ``code_size`` attribute allows the user to control the number of classifiers which will be used. It is a percentage of the total number of classes.
es_es: En :class:`~sklearn.multiclass.OutputCodeClassifier`, el atributo ``code_size`` permite al usuario controlar el número de clasificadores que se utilizarán. Es un porcentaje del número total de clases.

source: A number between 0 and 1 will require fewer classifiers than one-vs-the-rest. In theory, ``log2(n_classes) / n_classes`` is sufficient to represent each class unambiguously. However, in practice, it may not lead to good accuracy since ``log2(n_classes)`` is much smaller than n_classes.
es_es: Un número entre 0 y 1 requerirá menos clasificadores que one-vs-the-rest. En teoría, ``log2(n_clases) / n_clases`` es suficiente para representar cada clase de forma inequívoca. Sin embargo, en la práctica, puede que no se consiga una buena precisión, ya que ``log2(n_clases)`` es mucho menor que n_clases.

source: A number greater than 1 will require more classifiers than one-vs-the-rest. In this case, some classifiers will in theory correct for the mistakes made by other classifiers, hence the name "error-correcting". In practice, however, this may not happen as classifier mistakes will typically be correlated. The error-correcting output codes have a similar effect to bagging.
es_es: Un número superior a 1 requerirá más clasificadores que one-vs-the-rest. En este caso, algunos clasificadores corregirán en teoría los errores cometidos por otros clasificadores, de ahí el nombre de "corrección de errores". En la práctica, sin embargo, esto puede no ocurrir, ya que los errores de los clasificadores suelen estar correlacionados. Los códigos de salida con corrección de errores tienen un efecto similar al del empaquetado.

source: Below is an example of multiclass learning using Output-Codes::
es_es: A continuación hay un ejemplo de aprendizaje multiclase utilizando Codigos de Salida::

source: **Multilabel classification** (closely related to **multioutput** **classification**) is a classification task labeling each sample with ``m`` labels from ``n_classes`` possible classes, where ``m`` can be 0 to ``n_classes`` inclusive. This can be thought of as predicting properties of a sample that are not mutually exclusive. Formally, a binary output is assigned to each class, for every sample. Positive classes are indicated with 1 and negative classes with 0 or -1. It is thus comparable to running ``n_classes`` binary classification tasks, for example with :class:`~sklearn.multioutput.MultiOutputClassifier`. This approach treats each label independently whereas multilabel classifiers *may* treat the multiple classes simultaneously, accounting for correlated behavior among them.
es_es: **La clasificación multietiqueta** (estrechamente relacionada con la clasificación de salidas múltiples**) es una tarea de clasificación que etiqueta cada muestra con "m" etiquetas de "n_classes" clases posibles, donde "m" puede ser de 0 a "n_classes" inclusive. Esto puede considerarse como la predicción de propiedades de una muestra que no son mutuamente excluyentes. Formalmente, se asigna una salida binaria a cada clase, para cada muestra. Las clases positivas se indican con 1 y las negativas con 0 o -1. Por lo tanto, es comparable a la ejecución de tareas de clasificación binaria ``n_classes``, por ejemplo con :class:`~sklearn.multioutput.MultiOutputClassifier`. Este enfoque trata cada etiqueta de forma independiente, mientras que los clasificadores multietiqueta *pueden* tratar las múltiples clases simultáneamente, teniendo en cuenta el comportamiento correlacionado entre ellas.

source: For example, prediction of the topics relevant to a text document or video. The document or video may be about one of 'religion', 'politics', 'finance' or 'education', several of the topic classes or all of the topic classes.
es_es: Por ejemplo, la predicción de los temas relevantes para un documento de texto o un vídeo. El documento o el vídeo puede tratar de una de las clases de temas "religión", "política", "finanzas" o "educación", de varias de las clases de temas o de todas las clases de temas.

source: A valid representation of :term:`multilabel` `y` is an either dense or sparse :term:`binary` matrix of shape ``(n_samples, n_classes)``. Each column represents a class. The ``1``'s in each row denote the positive classes a sample has been labeled with. An example of a dense matrix ``y`` for 3 samples:
es_es: Una representación válida de :term:`multilabel` `y` es una matriz :term:`binaria` densa o dispersa de la forma ``(n_samples, n_classes)``. Cada columna representa una clase. Los ``1`` de cada fila denotan las clases positivas con las que se ha etiquetado una muestra. Un ejemplo de matriz densa ``y`` para 3 muestras:

source: Dense binary matrices can also be created using :class:`~sklearn.preprocessing.MultiLabelBinarizer`. For more information, refer to :ref:`preprocessing_targets`.
es_es: También se pueden crear matrices binarias densas usando :class:`~sklearn.preprocessing.MultiLabelBinarizer`. Para obtener más información, consulta :ref:`preprocessing_targets`.

source: An example of the same ``y`` in sparse matrix form:
es_es: Un ejemplo del mismo ``y`` en forma de matriz dispersa:

source: MultiOutputClassifier
es_es: Clasificador de salidas múltiples

source: Multilabel classification support can be added to any classifier with :class:`~sklearn.multioutput.MultiOutputClassifier`. This strategy consists of fitting one classifier per target. This allows multiple target variable classifications. The purpose of this class is to extend estimators to be able to estimate a series of target functions (f1,f2,f3...,fn) that are trained on a single X predictor matrix to predict a series of responses (y1,y2,y3...,yn).
es_es: Se puede añadir soporte de clasificación multietiqueta a cualquier clasificador con :class:`~sklearn.multioutput.MultiOutputClassifier`. Esta estrategia consiste en ajustar un clasificador por objetivo. Esto permite múltiples clasificaciones de variables objetivo. El propósito de esta clase es extender los estimadores para poder estimar una serie de funciones objetivo (f1,f2,f3...,fn) que se entrenan en una única matriz de predicción X para predecir una serie de respuestas (y1,y2,y3...,yn).

source: Below is an example of multilabel classification:
es_es: A continuación se muestra un ejemplo de clasificación multietiqueta:

source: ClassifierChain
es_es: Cadena clasificadora

source: Classifier chains (see :class:`~sklearn.multioutput.ClassifierChain`) are a way of combining a number of binary classifiers into a single multi-label model that is capable of exploiting correlations among targets.
es_es: Las cadenas de clasificadores (ver:class:`~sklearn.multioutput.ClassifierChain`) son una forma de combinar varios clasificadores binarios en un único modelo multietiqueta que es capaz de explotar las correlaciones entre objetivos.

source: For a multi-label classification problem with N classes, N binary classifiers are assigned an integer between 0 and N-1. These integers define the order of models in the chain. Each classifier is then fit on the available training data plus the true labels of the classes whose models were assigned a lower number.
es_es: Para un problema de clasificación multietiqueta con N clases, a N clasificadores binarios se les asigna un número entero entre 0 y N-1. Estos enteros definen el orden de los modelos en la cadena. A continuación, cada clasificador se ajusta a los datos de entrenamiento disponibles más las etiquetas verdaderas de las clases a cuyos modelos se les asignó un número inferior.

source: When predicting, the true labels will not be available. Instead the predictions of each model are passed on to the subsequent models in the chain to be used as features.
es_es: Cuando se predice, las etiquetas verdaderas no estarán disponibles. En su lugar, las predicciones de cada modelo se transmiten a los modelos posteriores de la cadena que se usarán como características.
