Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/naive_bayes.po
Languages: es_es

source: Naive Bayes
es_es: Bayesiano ingenuo

source: Naive Bayes methods are a set of supervised learning algorithms based on applying Bayes' theorem with the "naive" assumption of conditional independence between every pair of features given the value of the class variable. Bayes' theorem states the following relationship, given class variable :math:`y` and dependent feature vector :math:`x_1` through :math:`x_n`, :
es_es: Los métodos de Bayesiano ingenio son un conjunto de algoritmos de aprendizaje supervisados basados en la aplicación del teorema de Bayes con la suposición "ingenua" de independencia condicional entre cada par de características dado el valor de la variable de clase. El teorema de Bayes indica la siguiente relación, variable de clase dada :math:`y` y vector de característica dependiente :math:`x_1` a través de :math:`x_n`, :

source: Using the naive conditional independence assumption that
es_es: Utilizando el ingenuo supuesto de independencia condicional de ese

source: for all :math:`i`, this relationship is simplified to
es_es: para todos los :math:`i`, esta relación se simplifica a

source: Since :math:`P(x_1, \dots, x_n)` is constant given the input, we can use the following classification rule:
es_es: Como :math:`P(x_1, \dots, x_n)` es constante dada la entrada, podemos usar la siguiente regla de clasificación:

source: and we can use Maximum A Posteriori (MAP) estimation to estimate :math:`P(y)` and :math:`P(x_i \mid y)`; the former is then the relative frequency of class :math:`y` in the training set.
es_es: y podemos usar la estimación máxima A Posteriori (MAP) para estimar :math:`P(y)` y :math:`P(x_i \mid y)`; el primero es entonces la frecuencia relativa de la clase :math:`y` en el conjunto de entrenamiento.

source: The different naive Bayes classifiers differ mainly by the assumptions they make regarding the distribution of :math:`P(x_i \mid y)`.
es_es: Los diferentes clasificadores Bayesianos ingenuos difieren principalmente por los supuestos que hacen con respecto a la distribución de :math:`P(x_i \mid y)`.

source: In spite of their apparently over-simplified assumptions, naive Bayes classifiers have worked quite well in many real-world situations, famously document classification and spam filtering. They require a small amount of training data to estimate the necessary parameters. (For theoretical reasons why naive Bayes works well, and on which types of data it does, see the references below.)
es_es: A pesar de sus supuestos aparentemente demasiado simplificados, los clasificadores Bayesianos ingenuos han funcionado bastante bien en muchas situaciones del mundo real, como la clasificación de documentos y el filtrado de spam. Requieren una pequeña cantidad de datos de entrenamiento para estimar los parámetros necesarios. (Para conocer las razones teóricas por las que el Bayesiano ingenuo funciona bien, y sobre qué tipos de datos lo hace, ver las referencias más abajo.)

source: Naive Bayes learners and classifiers can be extremely fast compared to more sophisticated methods. The decoupling of the class conditional feature distributions means that each distribution can be independently estimated as a one dimensional distribution. This in turn helps to alleviate problems stemming from the curse of dimensionality.
es_es: Los aprendices y clasificadores de Bayesiano ingenuo pueden ser extremadamente rápidos en comparación con métodos más sofisticados. La disociación de las distribuciones de características condicionales de la clase significa que cada distribución puede estimarse independientemente como una distribución unidimensional. Esto, a su vez, ayuda a aliviar los problemas derivados de la maldición de la dimensionalidad.

source: On the flip side, although naive Bayes is known as a decent classifier, it is known to be a bad estimator, so the probability outputs from ``predict_proba`` are not to be taken too seriously.
es_es: Por otro lado, aunque el Bayesiano ingenuo es conocido como un clasificador decente, se sabe que es un mal estimador, por lo que las salidas de probabilidad de ``predict_proba`` no deben tomarse demasiado en serio.

source: Gaussian Naive Bayes
es_es: Bayesiano ingenuo Gaussiano

source: :class:`GaussianNB` implements the Gaussian Naive Bayes algorithm for classification. The likelihood of the features is assumed to be Gaussian:
es_es: :class:`GaussianNB` implementa el algoritmo Bayesiano ingenuo Gaussiano para la clasificación. Se supone que la probabilidad de las características es gaussiana:

source: The parameters :math:`\sigma_y` and :math:`\mu_y` are estimated using maximum likelihood.
es_es: Los parámetros :math:`sigma_y` y :math:`mu_y` se estiman por máxima verosimilitud.

source: Multinomial Naive Bayes
es_es: Bayesiano ingenuo multinomial

source: :class:`MultinomialNB` implements the naive Bayes algorithm for multinomially distributed data, and is one of the two classic naive Bayes variants used in text classification (where the data are typically represented as word vector counts, although tf-idf vectors are also known to work well in practice). The distribution is parametrized by vectors :math:`\theta_y = (\theta_{y1},\ldots,\theta_{yn})` for each class :math:`y`, where :math:`n` is the number of features (in text classification, the size of the vocabulary) and :math:`\theta_{yi}` is the probability :math:`P(x_i \mid y)` of feature :math:`i` appearing in a sample belonging to class :math:`y`.
es_es: :class:`MultinomialNB` implementa el algoritmo Bayesiano ingenuo para datos distribuidos multinomialmente, y es una de las dos variantes clásicas de Bayesiano ingenuo utilizadas en la clasificación de textos (donde los datos se representan típicamente como recuentos de vectores de palabras, aunque también se sabe que los vectores tf-idf funcionan bien en la práctica). La distribución está parametrizada por vectores :math:`theta_y = (\theta_{y1},\ldots,\theta_{yn})` para cada clase :math:`y`, donde :math: `n` es el número de características (en la clasificación de textos, el tamaño del vocabulario) y :math:`theta_{yi}` es la probabilidad :math:`P(x_i \mid y)` de que la característica :math:`i` aparezca en una muestra perteneciente a la clase :math:`y`.

source: The parameters :math:`\theta_y` is estimated by a smoothed version of maximum likelihood, i.e. relative frequency counting:
es_es: Los parámetros :math:`\theta_y` se estiman por una versión suavizada de la verosimilitud máxima, es decir, conteo de frecuencia relativa:

source: where :math:`N_{yi} = \sum_{x \in T} x_i` is the number of times feature :math:`i` appears in a sample of class :math:`y` in the training set :math:`T`, and :math:`N_{y} = \sum_{i=1}^{n} N_{yi}` is the total count of all features for class :math:`y`.
es_es: donde :math:`N_{yi} = \sum_{x \in T} x_i` es el número de veces que la característica :math:`i` aparece en una muestra de la clase :math:`y` en el set de entrenamiento :math:`T`, y :math:`N_{y} = \sum_{i=1}^{n} N_{yi}` es el recuento total de todas las características para la clase :math:`y`.

source: The smoothing priors :math:`\alpha \ge 0` accounts for features not present in the learning samples and prevents zero probabilities in further computations. Setting :math:`\alpha = 1` is called Laplace smoothing, while :math:`\alpha < 1` is called Lidstone smoothing.
es_es: El suavizado anterior :math:`\alpha \ge 0` cuenta con características no presentes en las muestras de aprendizaje y previene cero probabilidades en futuros cálculos. Establecer :math:`\alpha = 1` se llama Suavizado Laplace, mientras que :math:`\alpha < 1` se llama Suavizado Lidstone.

source: Complement Naive Bayes
es_es: Complemento de Bayesiano ingenuo

source: :class:`ComplementNB` implements the complement naive Bayes (CNB) algorithm. CNB is an adaptation of the standard multinomial naive Bayes (MNB) algorithm that is particularly suited for imbalanced data sets. Specifically, CNB uses statistics from the *complement* of each class to compute the model's weights. The inventors of CNB show empirically that the parameter estimates for CNB are more stable than those for MNB. Further, CNB regularly outperforms MNB (often by a considerable margin) on text classification tasks. The procedure for calculating the weights is as follows:
es_es: :class:`ComplementNB` implementa el algoritmo Bayesiano ingenuo complementario (CNB). CNB es una adaptación del algoritmo estándar de Bayesiano ingenuo multinomial (MNB) que es especialmente adecuado para conjuntos de datos desequilibrados. En concreto, el CNB utiliza las estadísticas del *complemento* de cada clase para calcular las ponderaciones del modelo. Los inventores de CNB demuestran empíricamente que las estimaciones de los parámetros de CNB son más estables que las de MNB. Además, CNB supera regularmente a MNB (a menudo por un margen considerable) en tareas de clasificación de textos. El procedimiento para calcular las ponderaciones es el siguiente:

source: where the summations are over all documents :math:`j` not in class :math:`c`, :math:`d_{ij}` is either the count or tf-idf value of term :math:`i` in document :math:`j`, :math:`\alpha_i` is a smoothing hyperparameter like that found in MNB, and :math:`\alpha = \sum_{i} \alpha_i`. The second normalization addresses the tendency for longer documents to dominate parameter estimates in MNB. The classification rule is:
es_es: donde las sumatorias son sobre todos los documentos :math:`j` que no están en la clase :math:`c`, :math:`d_{ij}` es el recuento o el valor tf-idf del término :math:`i` en el documento :math:`j`, :math:`alpha_i` es un hiperparámetro de suavización como el que se encuentra en MNB, y :math:`alpha = \sum_{i} \alpha_i``. \alpha_i`. La segunda normalización aborda la tendencia de los documentos más largos a dominar las estimaciones de los parámetros en MNB. La regla de clasificación es:

source: i.e., a document is assigned to the class that is the *poorest* complement match.
es_es: es decir, se asigna un documento a la clase que es la *más pobre* coincidencia de complementos.

source: Bernoulli Naive Bayes
es_es: Bayesiano ingenuo de Bernoulli

source: :class:`BernoulliNB` implements the naive Bayes training and classification algorithms for data that is distributed according to multivariate Bernoulli distributions; i.e., there may be multiple features but each one is assumed to be a binary-valued (Bernoulli, boolean) variable. Therefore, this class requires samples to be represented as binary-valued feature vectors; if handed any other kind of data, a ``BernoulliNB`` instance may binarize its input (depending on the ``binarize`` parameter).
es_es: La clase ``BernoulliNB`` implementa los algoritmos de entrenamiento y clasificación de Bayesiano ingenuo para los datos que se distribuyen de acuerdo con las distribuciones Bernoulli multivariadas; es decir, puede haber múltiples características pero se asume que cada una es una variable de valor binario (Bernoulli, booleano). Por lo tanto, esta clase requiere que las muestras se representen como vectores de características de valor binario; si se entrega cualquier otro tipo de datos, una instancia de ``BernoulliNB`` puede binarizar su entrada (dependiendo del parámetro ``binarize``).

source: The decision rule for Bernoulli naive Bayes is based on
es_es: La regla de decisión para los Bayesianos ingenuos de Bernoulli se basa en

source: which differs from multinomial NB's rule in that it explicitly penalizes the non-occurrence of a feature :math:`i` that is an indicator for class :math:`y`, where the multinomial variant would simply ignore a non-occurring feature.
es_es: que difiere de la regla de Bayesiano ingenuo multinomial en que penaliza explícitamente la no ocurrencia de una característica :math:`i` que es un indicador de la clase :math:`y`, mientras que la variante multinomial simplemente ignoraría una característica no ocurrente.

source: In the case of text classification, word occurrence vectors (rather than word count vectors) may be used to train and use this classifier. ``BernoulliNB`` might perform better on some datasets, especially those with shorter documents. It is advisable to evaluate both models, if time permits.
es_es: En el caso de la clasificación de textos, se pueden utilizar vectores de ocurrencia de palabras (en lugar de vectores de recuento de palabras) para entrenar y utilizar este clasificador. ``BernoulliNB`` podría tener un mejor rendimiento en algunos conjuntos de datos, especialmente en aquellos con documentos más cortos. Es aconsejable evaluar ambos modelos, si el tiempo lo permite.

source: Categorical Naive Bayes
es_es: Bayesiano ingenuo categórico

source: :class:`CategoricalNB` implements the categorical naive Bayes algorithm for categorically distributed data. It assumes that each feature, which is described by the index :math:`i`, has its own categorical distribution.
es_es: :class:`CategoricalNB` implementa el algoritmo de Bayesiano ingenuo categórico para datos distribuidos categóricamente. Supone que cada característica, descrita por el índice :math:`i`, tiene su propia distribución categórica.

source: For each feature :math:`i` in the training set :math:`X`, :class:`CategoricalNB` estimates a categorical distribution for each feature i of X conditioned on the class y. The index set of the samples is defined as :math:`J = \{ 1, \dots, m \}`, with :math:`m` as the number of samples.
es_es: Para cada característica :math:`i` del conjunto de entrenamiento :math:`X`, :class:`CategoricalNB` estima una distribución categórica para cada característica i de X condicionada a la clase y. El conjunto de índices de las muestras se define como :math:`J = \{ 1, \dots, m \}`, siendo :math:`m` el número de muestras.

source: The probability of category :math:`t` in feature :math:`i` given class :math:`c` is estimated as:
es_es: Se estima la probabilidad de la categoría :math:`t` en la característica :math:`i` dada clase :math:`c`:

source: where :math:`N_{tic} = |\{j \in J \mid x_{ij} = t, y_j = c\}|` is the number of times category :math:`t` appears in the samples :math:`x_{i}`, which belong to class :math:`c`, :math:`N_{c} = |\{ j \in J\mid y_j = c\}|` is the number of samples with class c, :math:`\alpha` is a smoothing parameter and :math:`n_i` is the number of available categories of feature :math:`i`.
es_es: donde :math:`N_{tic} = |\{j \in J \mid x_{ij} = t, y_j = c\}|` es el número de veces que aparece la categoría :math:`t` en las muestras :math:`x_{i}`, que pertenecen a la clase :math:`c`, :math:`N_{c} = |\{ j \in J\mid y_j = c\}|` es el número de muestras con la clase c, :math:`\alpha` es un parámetro suavizado y :math:`n_i` es el número de categorías disponibles de la función :math:`i`.

source: :class:`CategoricalNB` assumes that the sample matrix :math:`X` is encoded (for instance with the help of :class:`OrdinalEncoder`) such that all categories for each feature :math:`i` are represented with numbers :math:`0, ..., n_i - 1` where :math:`n_i` is the number of available categories of feature :math:`i`.
es_es: :class:`CategoricalNB` asume que la matriz de muestra :math:`X` está codificada (por ejemplo con la ayuda de :class:`OrdinalEncoder`) de forma que todas las categorías de cada característica :math:`i` están representadas con números :math:`0, ..., n_i - 1` donde :math:`n_i` es el número de categorías disponibles de la característica :math:`i`.

source: Out-of-core naive Bayes model fitting
es_es: Ajuste del modelo de Bayesiano ingenuo fuera del núcleo

source: Naive Bayes models can be used to tackle large scale classification problems for which the full training set might not fit in memory. To handle this case, :class:`MultinomialNB`, :class:`BernoulliNB`, and :class:`GaussianNB` expose a ``partial_fit`` method that can be used incrementally as done with other classifiers as demonstrated in :ref:`sphx_glr_auto_examples_applications_plot_out_of_core_classification.py`. All naive Bayes classifiers support sample weighting.
es_es: Los modelos Bayesianoa ingenuos pueden utilizarse para abordar problemas de clasificación a gran escala para los que el conjunto de entrenamiento completo podría no caber en la memoria. Para manejar este caso, :class:`MultinomialNB`, :class:`BernoulliNB`, y :class:`GaussianNB` exponen un método ``partial_fit`` que puede ser utilizado de forma incremental como se hace con otros clasificadores como se demuestra en :ref:`sphx_glr_auto_examples_applications_plot_out_of_core_classification.py`. Todos los clasificadores Bayesianos ingenuos admiten la ponderación de las muestras.

source: Contrary to the ``fit`` method, the first call to ``partial_fit`` needs to be passed the list of all the expected class labels.
es_es: Contrario al método ``fit``, la primera llamada a ``partial_fit`` necesita ser pasada la lista de todas las etiquetas de clase esperadas.

source: For an overview of available strategies in scikit-learn, see also the :ref:`out-of-core learning <scaling_strategies>` documentation.
es_es: Para una visión general de las estrategias disponibles en scikit-learn, vea también la documentación :ref:`aprendiendo fuera del núcleo <scaling_strategies>`.

source: The ``partial_fit`` method call of naive Bayes models introduces some computational overhead. It is recommended to use data chunk sizes that are as large as possible, that is as the available RAM allows.
es_es: La llamada al método ``partial_fit`` de los modelos Bayesianos ingenuos introduce cierta sobrecarga computacional. Se recomienda utilizar tamaños de trozos de datos lo más grandes posible, es decir, lo que permita la memoria RAM disponible.
