Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/neighbors.po
Languages: es_es

source: Second, precomputing the graph can give finer control on the nearest neighbors estimation, for instance enabling multiprocessing though the parameter `n_jobs`, which might not be available in all estimators.
es_es: En segundo lugar, precalcular el gráfico puede dar un control más fino sobre la estimación de los vecinos más cercanos, por ejemplo, permitiendo el multiprocesamiento a través del parámetro `n_jobs`, que podría no estar disponible en todos los estimadores.

source: Finally, the precomputation can be performed by custom estimators to use different implementations, such as approximate nearest neighbors methods, or implementation with special data types. The precomputed neighbors :term:`sparse graph` needs to be formatted as in :func:`~sklearn.neighbors.radius_neighbors_graph` output:
es_es: Finalmente, el precálculo puede ser realizado por estimadores personalizados para utilizar diferentes implementaciones, como los métodos de vecinos más cercanos aproximados, o la implementación con tipos de datos especiales. Los vecinos precalculados :term:`sparse graph` deben tener el mismo formato que la salida :func:`~sklearn.neighbors.radius_neighbors_graph`:

source: a CSR matrix (although COO, CSC or LIL will be accepted).
es_es: una matriz CSR (aunque se aceptarán COO, CSC o LIL).

source: only explicitly store nearest neighborhoods of each sample with respect to the training data. This should include those at 0 distance from a query point, including the matrix diagonal when computing the nearest neighborhoods between the training data and itself.
es_es: sólo almacena explícitamente los vecindarios más cercanos de cada muestra con respecto a los datos de entrenamiento. Esto debería incluir los que se encuentran a una distancia de 0 de un punto de consulta, incluyendo la diagonal de la matriz cuando se calculan los vecindarios más cercanos entre los datos de entrenamiento y ellos mismos.

source: each row's `data` should store the distance in increasing order (optional. Unsorted data will be stable-sorted, adding a computational overhead).
es_es: los `datos` de cada fila deben almacenar la distancia en orden creciente (opcional. Los datos no ordenados serán ordenados de forma estable, lo que añade una sobrecarga computacional).

source: all values in data should be non-negative.
es_es: todos los valores en los datos no deben ser negativos.

source: there should be no duplicate `indices` in any row (see https://github.com/scipy/scipy/issues/5807).
es_es: no debe haber `índices` duplicados en ninguna fila (consulta https://github.com/scipy/scipy/issues/5807).

source: if the algorithm being passed the precomputed matrix uses k nearest neighbors (as opposed to radius neighborhood), at least k neighbors must be stored in each row (or k+1, as explained in the following note).
es_es: si el algoritmo al que se le pasa la matriz precalculada utiliza k vecinos más cercanos (en lugar de vecindad de radio), se deben almacenar al menos k vecinos en cada fila (o k+1, como se explica en la siguiente nota).

source: When a specific number of neighbors is queried (using :class:`KNeighborsTransformer`), the definition of `n_neighbors` is ambiguous since it can either include each training point as its own neighbor, or exclude them. Neither choice is perfect, since including them leads to a different number of non-self neighbors during training and testing, while excluding them leads to a difference between `fit(X).transform(X)` and `fit_transform(X)`, which is against scikit-learn API. In :class:`KNeighborsTransformer` we use the definition which includes each training point as its own neighbor in the count of `n_neighbors`. However, for compatibility reasons with other estimators which use the other definition, one extra neighbor will be computed when `mode == 'distance'`. To maximise compatibility with all estimators, a safe choice is to always include one extra neighbor in a custom nearest neighbors estimator, since unnecessary neighbors will be filtered by following estimators.
es_es: Cuando se consulta un número específico de vecinos (utilizando :class:`KNeighborsTransformer`), la definición de `n_neighbors` es ambigua ya que puede incluir cada punto de entrenamiento como su propio vecino, o excluirlos. Ninguna de las dos opciones es perfecta, ya que incluirlos conduce a un número diferente de vecinos no propios durante el entrenamiento y la prueba, mientras que excluirlos conduce a una diferencia entre `fit(X).transform(X)` y `fit_transform(X)`, lo que va en contra de la API de scikit-learn. En :class:`KNeighborsTransformer` utilizamos la definición que incluye cada punto de entrenamiento como su propio vecino en la cuenta de `n_neighbors`. Sin embargo, por razones de compatibilidad con otros estimadores que utilizan la otra definición, se calculará un vecino extra cuando `mode == 'distance'`. Para maximizar la compatibilidad con todos los estimadores, una opción segura es incluir siempre un vecino extra en un estimador personalizado de vecinos más cercanos, ya que los vecinos innecesarios serán filtrados por los siguientes estimadores.

source: :ref:`sphx_glr_auto_examples_neighbors_approximate_nearest_neighbors.py`: an example of pipelining :class:`KNeighborsTransformer` and :class:`~sklearn.manifold.TSNE`. Also proposes two custom nearest neighbors estimators based on external packages.
es_es: :ref:`sphx_glr_auto_examples_neighbors_approximate_nearest_neighbors.py`: un ejemplo de pipelining :class:`KNeighborsTransformer` y :class:`~sklearn.manifold.TSNE`. También propone dos estimadores personalizados de vecinos más cercanos basados en paquetes externos.

source: :ref:`sphx_glr_auto_examples_neighbors_plot_caching_nearest_neighbors.py`: an example of pipelining :class:`KNeighborsTransformer` and :class:`KNeighborsClassifier` to enable caching of the neighbors graph during a hyper-parameter grid-search.
es_es: :ref:`sphx_glr_auto_examples_neighbors_plot_caching_nearest_neighbors.py`: un ejemplo de pipelining :class:`KNeighborsTransformer` y :class:`KNeighborsClassifier` para permitir el almacenamiento en caché del grafo de vecinos durante una búsqueda de cuadrícula de hiperparámetros.

source: Neighborhood Components Analysis
es_es: Análisis de componentes de Neighborhood

source: Neighborhood Components Analysis (NCA, :class:`NeighborhoodComponentsAnalysis`) is a distance metric learning algorithm which aims to improve the accuracy of nearest neighbors classification compared to the standard Euclidean distance. The algorithm directly maximizes a stochastic variant of the leave-one-out k-nearest neighbors (KNN) score on the training set. It can also learn a low-dimensional linear projection of data that can be used for data visualization and fast classification.
es_es: Análisis de componentes de Neighborhood (NCA, :class:`NeighborhoodComponentsAnalysis`) es un algoritmo de aprendizaje de la métrica de la distancia cuyo objetivo es mejorar la exactitud de la clasificación de los vecinos más cercanos en comparación con la distancia euclidiana estándar. El algoritmo maximiza directamente una variante estocástica de la puntuación de los vecinos más cercanos (KNN) en el conjunto de entrenamiento. También puede aprender una proyección lineal de baja dimensión de los datos que puede utilizarse para la visualización de datos y la clasificación rápida.

source: In the above illustrating figure, we consider some points from a randomly generated dataset. We focus on the stochastic KNN classification of point no. 3. The thickness of a link between sample 3 and another point is proportional to their distance, and can be seen as the relative weight (or probability) that a stochastic nearest neighbor prediction rule would assign to this point. In the original space, sample 3 has many stochastic neighbors from various classes, so the right class is not very likely. However, in the projected space learned by NCA, the only stochastic neighbors with non-negligible weight are from the same class as sample 3, guaranteeing that the latter will be well classified. See the :ref:`mathematical formulation <nca_mathematical_formulation>` for more details.
es_es: En la figura ilustrada arriba, consideramos algunos puntos de un conjunto de datos generados aleatoriamente. Nos centramos en la clasificación KNN estocástica del punto nº 3. El grosor de un enlace entre la muestra 3 y otro punto es proporcional a su distancia, y puede verse como el peso relativo (o probabilidad) que una regla de predicción estocástica del vecino más cercano asignaría a este punto. En el espacio original, la muestra 3 tiene muchos vecinos estocásticos de varias clases, por lo que la clase correcta no es muy probable. Sin embargo, en el espacio proyectado aprendido por NCA, los únicos vecinos estocásticos con peso no despreciable son de la misma clase que la muestra 3, lo que garantiza que esta última estará bien clasificada. Consulta la :ref:`formulación matemática <nca_mathematical_formulation>` para obtener más detalles.

source: Classification
es_es: Clasificación

source: Combined with a nearest neighbors classifier (:class:`KNeighborsClassifier`), NCA is attractive for classification because it can naturally handle multi-class problems without any increase in the model size, and does not introduce additional parameters that require fine-tuning by the user.
es_es: Combinado con un clasificador de vecinos más cercanos (:class:`KNeighborsClassifier`), el NCA es atractivo para la clasificación porque puede manejar naturalmente problemas de multiclases sin ningún aumento en el tamaño del modelo, y no introduce parámetros adicionales que requieran un ajuste fino por parte del usuario.

source: NCA classification has been shown to work well in practice for data sets of varying size and difficulty. In contrast to related methods such as Linear Discriminant Analysis, NCA does not make any assumptions about the class distributions. The nearest neighbor classification can naturally produce highly irregular decision boundaries.
es_es: Se ha demostrado que la clasificación NCA funciona bien en la práctica para conjuntos de datos de tamaño y dificultad variables. A diferencia de otros métodos relacionados, como el análisis discriminante lineal, el NCA no hace ninguna suposición sobre las distribuciones de las clases. La clasificación del vecino más cercano puede producir naturalmente límites de decisión muy irregulares.

source: To use this model for classification, one needs to combine a :class:`NeighborhoodComponentsAnalysis` instance that learns the optimal transformation with a :class:`KNeighborsClassifier` instance that performs the classification in the projected space. Here is an example using the two classes:
es_es: Para utilizar este modelo para la clasificación, es necesario combinar una instancia :class:`NeighborhoodComponentsAnalysis` que aprende la transformación óptima con una instancia :class:`KNeighborsClassifier` que realiza la clasificación en el espacio proyectado. Este es un ejemplo que utiliza las dos clases:

source: The plot shows decision boundaries for Nearest Neighbor Classification and Neighborhood Components Analysis classification on the iris dataset, when training and scoring on only two features, for visualisation purposes.
es_es: El gráfico muestra los límites de decisión para la clasificación de vecino más cercano y la clasificación de análisis de componentes de vecindad en el conjunto de datos del iris, cuando se entrena y puntúa sólo con dos características, a efectos de visualización.

source: Dimensionality reduction
es_es: Reducción de Dimensionalidad

source: NCA can be used to perform supervised dimensionality reduction. The input data are projected onto a linear subspace consisting of the directions which minimize the NCA objective. The desired dimensionality can be set using the parameter ``n_components``. For instance, the following figure shows a comparison of dimensionality reduction with Principal Component Analysis (:class:`~sklearn.decomposition.PCA`), Linear Discriminant Analysis (:class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`) and Neighborhood Component Analysis (:class:`NeighborhoodComponentsAnalysis`) on the Digits dataset, a dataset with size :math:`n_{samples} = 1797` and :math:`n_{features} = 64`. The data set is split into a training and a test set of equal size, then standardized. For evaluation the 3-nearest neighbor classification accuracy is computed on the 2-dimensional projected points found by each method. Each data sample belongs to one of 10 classes.
es_es: El NCA puede utilizarse para realizar una reducción de la dimensionalidad supervisada. Los datos de entrada se proyectan en un subespacio lineal formado por las direcciones que minimizan el objetivo del NCA. La dimensionalidad deseada puede establecerse mediante el parámetro ``n_components``. Por ejemplo, la siguiente figura muestra una comparación de la reducción de la dimensionalidad con el Análisis de Componentes Principales (:class:`~sklearn.decomposition.PCA`), el Análisis Discriminante Lineal (:class:`~sklearn.discriminant_analysis. LinearDiscriminantAnalysis`) y Neighborhood Component Analysis (:class:`NeighborhoodComponentsAnalysis`) en el conjunto de datos Digits, un conjunto de datos con tamaño :math:`n_{samples} = 1797` y :math:`n_{features} = 64`. El conjunto de datos se divide en un conjunto de entrenamiento y otro de prueba de igual tamaño, y luego se estandariza. Para la evaluación, se calcula la exactitud de la clasificación de 3 vecinos más cercanos en los puntos proyectados bidimensionales encontrados por cada método. Cada muestra de datos pertenece a una de las 10 clases.

source: Mathematical formulation
es_es: Formulación matemática

source: The goal of NCA is to learn an optimal linear transformation matrix of size ``(n_components, n_features)``, which maximises the sum over all samples :math:`i` of the probability :math:`p_i` that :math:`i` is correctly classified, i.e.:
es_es: El objetivo del NCA es aprender una matriz de transformación lineal óptima de tamaño ``(n_components, n_features)``, que maximice la suma sobre todas las muestras :math:`i` de la probabilidad :math:`p_i` de que :math:`i` se clasifique correctamente, es decir:

source: with :math:`N` = ``n_samples`` and :math:`p_i` the probability of sample :math:`i` being correctly classified according to a stochastic nearest neighbors rule in the learned embedded space:
es_es: con :math:`N` = ``n_samples`` y :math:`p_i` la probabilidad de que la muestra :math:`i` se clasifique correctamente según una regla estocástica de vecinos más cercanos en el espacio incrustado aprendido:

source: where :math:`C_i` is the set of points in the same class as sample :math:`i`, and :math:`p_{i j}` is the softmax over Euclidean distances in the embedded space:
es_es: donde :math:`C_i` es el conjunto de puntos en la misma clase que la muestra :math:`i`, y :math:`p_{i j}` es el máximo softmax sobre distancias euclidianas en el espacio incrustado:

source: p_{i j} = \frac{\exp(-||L x_i - L x_j||^2)}{\sum\limits_{k \ne i} {\exp{-(||L x_i - L x_k||^2)}}} , \quad p_{i i} = 0
es_es: p_{i j} = \\frac{\exp(-||L x_i - L x_j||^2)}{\suma\limits_{k \ne i} {\exp{-(|||L x_i - L x_k||^2)}}} , \\quad p_{i i} = 0

source: Mahalanobis distance
es_es: Distancia de Mahalanobis

source: NCA can be seen as learning a (squared) Mahalanobis distance metric:
es_es: El NCA puede verse como el aprendizaje de una métrica de distancia de Mahalanobis (al cuadrado):

source: where :math:`M = L^T L` is a symmetric positive semi-definite matrix of size ``(n_features, n_features)``.
es_es: donde :math:`M = L^T L` es una matriz semidefinida positiva simétrica de tamaño ``(n_features, n_features)``.

source: Implementation
es_es: Implementación

source: This implementation follows what is explained in the original paper [1]_. For the optimisation method, it currently uses scipy's L-BFGS-B with a full gradient computation at each iteration, to avoid to tune the learning rate and provide stable learning.
es_es: Esta implementación sigue lo explicado en el artículo original [1]_. Para el método de optimización, actualmente utiliza el L-BFGS-B de scipy con un cálculo de gradiente completo en cada iteración, para evitar afinar la tasa de aprendizaje y proporcionar un aprendizaje estable.

source: See the examples below and the docstring of :meth:`NeighborhoodComponentsAnalysis.fit` for further information.
es_es: Puedes ver los ejemplos a continuación y la cadena de caracteres de :meth:`NeighborhoodComponentsAnalysis.fit` para más información.

source: Complexity
es_es: Complejidad

source: Training
es_es: Formación

source: NCA stores a matrix of pairwise distances, taking ``n_samples ** 2`` memory. Time complexity depends on the number of iterations done by the optimisation algorithm. However, one can set the maximum number of iterations with the argument ``max_iter``. For each iteration, time complexity is ``O(n_components x n_samples x min(n_samples, n_features))``.
es_es: El NCA almacena una matriz de distancias entre pares, ocupando ``n_samples ** 2`` de memoria. La complejidad del tiempo depende del número de iteraciones realizadas por el algoritmo de optimización. Sin embargo, se puede establecer el número máximo de iteraciones con el argumento ``max_iter``. Para cada iteración, la complejidad temporal es ``O(n_components x n_samples x min(n_samples, n_features))``.

source: Transform
es_es: Transformación

source: Here the ``transform`` operation returns :math:`LX^T`, therefore its time complexity equals ``n_components * n_features * n_samples_test``. There is no added space complexity in the operation.
es_es: Aquí la operación ``transform`` devuelve :math:`LX^T`, por lo tanto su complejidad de tiempo es igual a ``n_components * n_features * n_samples_test``. No hay complejidad de espacio añadida en la operación.

source: References:
es_es: Referencias:

source: `"Neighbourhood Components Analysis" <http://www.cs.nyu.edu/~roweis/papers/ncanips.pdf>`_, J. Goldberger, S. Roweis, G. Hinton, R. Salakhutdinov, Advances in Neural Information Processing Systems, Vol. 17, May 2005, pp. 513-520.
es_es: `"Neighbourhood Components Analysis" <http://www.cs.nyu.edu/~roweis/papers/ncanips.pdf>`_, J. Goldberger, S. Roweis, G. Hinton, R. Salakhutdinov, Advances in Neural Information Processing Systems, Vol. 17, mayo 2005, pp. 513-520.

source: `Wikipedia entry on Neighborhood Components Analysis <https://en.wikipedia.org/wiki/Neighbourhood_components_analysis>`_
es_es: `Entrada de Wikipedia en Neighborhood Components Analysis <https://en.wikipedia.org/wiki/Neighbourhood_components_analysis>`_
