Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/neighbors.po
Languages: es_es

source: An early approach to taking advantage of this aggregate information was the *KD tree* data structure (short for *K-dimensional tree*), which generalizes two-dimensional *Quad-trees* and 3-dimensional *Oct-trees* to an arbitrary number of dimensions. The KD tree is a binary tree structure which recursively partitions the parameter space along the data axes, dividing it into nested orthotropic regions into which data points are filed. The construction of a KD tree is very fast: because partitioning is performed only along the data axes, no :math:`D`-dimensional distances need to be computed. Once constructed, the nearest neighbor of a query point can be determined with only :math:`O[\log(N)]` distance computations. Though the KD tree approach is very fast for low-dimensional (:math:`D < 20`) neighbors searches, it becomes inefficient as :math:`D` grows very large: this is one manifestation of the so-called "curse of dimensionality". In scikit-learn, KD tree neighbors searches are specified using the keyword ``algorithm = 'kd_tree'``, and are computed using the class :class:`KDTree`.
es_es: Uno de los primeros enfoques para aprovechar esta información agregada fue la estructura de datos de *KD tree* o *árbol KD* (abreviatura de *árbol K-dimensional*), que generaliza los *árboles Quad* (*Quad-trees*) bidimensionales y los *árboles Oct* (*Oct-trees*) tridimensionales a un número arbitrario de dimensiones. El árbol KD es una estructura de árbol binario que particiona recursivamente el espacio de los parámetros a lo largo de los ejes de los datos, dividiéndolo en regiones ortotrópicas anidadas en las que se archivan los puntos de datos. La construcción de un árbol KD es muy rápida: como la partición se realiza sólo a lo largo de los ejes de datos, no es necesario calcular distancias :math:`D`-dimensionales. Una vez construido, el vecino más cercano de un punto de consulta puede determinarse con sólo cálculos de distancia :math:`O[\log(N)]`. Aunque el enfoque del árbol KD es muy rápido para búsquedas de vecinos de baja dimensión (:math:`D < 20`), se vuelve ineficiente a medida que :math:`D` aumenta: esta es una manifestación de la llamada "maldición de la dimensionalidad". En scikit-learn, las búsquedas de vecinos en el árbol KD se especifican utilizando la palabra clave ``algoritmo = 'kd_tree'``, y se calculan utilizando la clase :class:`KDTree`.

source: Ball Tree
es_es: Árbol de bolas

source: To address the inefficiencies of KD Trees in higher dimensions, the *ball tree* data structure was developed. Where KD trees partition data along Cartesian axes, ball trees partition data in a series of nesting hyper-spheres. This makes tree construction more costly than that of the KD tree, but results in a data structure which can be very efficient on highly structured data, even in very high dimensions.
es_es: Para hacer frente a las ineficiencias de los árboles KD en dimensiones superiores, se desarrolló la estructura de datos *árbol de bolas*. Mientras que los árboles KD dividen los datos a lo largo de ejes cartesianos, los árboles de bolas dividen los datos en una serie de hiperesferas anidadas. Esto hace que la construcción del árbol sea más costosa que la del árbol KD, pero da como resultado una estructura de datos que puede ser muy eficiente en datos altamente estructurados, incluso en dimensiones muy altas.

source: A ball tree recursively divides the data into nodes defined by a centroid :math:`C` and radius :math:`r`, such that each point in the node lies within the hyper-sphere defined by :math:`r` and :math:`C`. The number of candidate points for a neighbor search is reduced through use of the *triangle inequality*:
es_es: Un árbol de bolas divide recursivamente los datos en nodos definidos por un centroide :math:`C` y un radio :math:`r`, de forma que cada punto del nodo se encuentra dentro de la hiperesfera definida por :math:`r` y :math:`C`. El número de puntos candidatos para la búsqueda de vecinos se reduce mediante el uso de la *desigualdad triangular*:

source: With this setup, a single distance calculation between a test point and the centroid is sufficient to determine a lower and upper bound on the distance to all points within the node. Because of the spherical geometry of the ball tree nodes, it can out-perform a *KD-tree* in high dimensions, though the actual performance is highly dependent on the structure of the training data. In scikit-learn, ball-tree-based neighbors searches are specified using the keyword ``algorithm = 'ball_tree'``, and are computed using the class :class:`BallTree`. Alternatively, the user can work with the :class:`BallTree` class directly.
es_es: Con esta configuración, un único cálculo de la distancia entre un punto de prueba y el centroide es suficiente para determinar un límite inferior y superior de la distancia a todos los puntos dentro del nodo. Debido a la geometría esférica de los nodos del árbol de bolas, puede superar a un *árbol KD* en dimensiones altas, aunque el rendimiento real depende en gran medida de la estructura de los datos de entrenamiento. En scikit-learn, las búsquedas de vecinos basadas en el árbol de bolas se especifican utilizando la palabra clave ``algoritmo = 'ball_tree'``, y se calculan utilizando la clase :class:`BallTree`. Alternativamente, el usuario puede trabajar con la clase :class:`BallTree` directamente.

source: Choice of Nearest Neighbors Algorithm
es_es: Selección del algoritmo de los vecinos más cercanos

source: The optimal algorithm for a given dataset is a complicated choice, and depends on a number of factors:
es_es: El algoritmo óptimo para un conjunto de datos determinado es una elección complicada y depende de varios factores:

source: number of samples :math:`N` (i.e. ``n_samples``) and dimensionality :math:`D` (i.e. ``n_features``).
es_es: número de muestras :math:`N` (es decir, ``n_muestras``) y dimensionalidad :math:`D` (es decir, ``n_características``).

source: *Brute force* query time grows as :math:`O[D N]`
es_es: El tiempo de consulta de *fuerza bruta* crece como :math:`O[D N]`

source: *Ball tree* query time grows as approximately :math:`O[D \log(N)]`
es_es: *El tiempo de consulta del árbol de bolas crece aproximadamente como :math:`O[D \log(N)]`

source: *KD tree* query time changes with :math:`D` in a way that is difficult to precisely characterise. For small :math:`D` (less than 20 or so) the cost is approximately :math:`O[D\log(N)]`, and the KD tree query can be very efficient. For larger :math:`D`, the cost increases to nearly :math:`O[DN]`, and the overhead due to the tree structure can lead to queries which are slower than brute force.
es_es: *El tiempo de consulta del árbol KD cambia con :math:`D` de una manera que es difícil de caracterizar con precisión. Para :math:`D` pequeños (menos de 20 aproximadamente) el costo es aproximadamente :math:`O[D\log(N)]`, y la consulta del árbol KD puede ser muy eficiente. Para :math:`D` más grandes, el costo aumenta hasta casi :math:`O[DN]`, y la sobrecarga debida a la estructura de árbol puede llevar a consultas más lentas que la fuerza bruta.

source: For small data sets (:math:`N` less than 30 or so), :math:`\log(N)` is comparable to :math:`N`, and brute force algorithms can be more efficient than a tree-based approach. Both :class:`KDTree` and :class:`BallTree` address this through providing a *leaf size* parameter: this controls the number of samples at which a query switches to brute-force. This allows both algorithms to approach the efficiency of a brute-force computation for small :math:`N`.
es_es: Para conjuntos de datos pequeños (:math:`N` menos de 30 aproximadamente), :math:`log(N)` es comparable a :math:`N`, y los algoritmos de fuerza bruta pueden ser más eficientes que un enfoque basado en árboles. Tanto :class:`KDTree` como :class:`BallTree` abordan esta cuestión proporcionando un parámetro de *tamaño de hoja*: éste controla el número de muestras a partir del cual una consulta pasa a ser de fuerza bruta. Esto permite que ambos algoritmos se aproximen a la eficiencia de un cálculo de fuerza bruta para un :math:`N` pequeño.

source: data structure: *intrinsic dimensionality* of the data and/or *sparsity* of the data. Intrinsic dimensionality refers to the dimension :math:`d \le D` of a manifold on which the data lies, which can be linearly or non-linearly embedded in the parameter space. Sparsity refers to the degree to which the data fills the parameter space (this is to be distinguished from the concept as used in "sparse" matrices. The data matrix may have no zero entries, but the **structure** can still be "sparse" in this sense).
es_es: estructura de los datos: La *dimensionalidad intrínseca* de los datos y/o la *especificidad* de los datos. La dimensionalidad intrínseca se refiere a la dimensión :math:`d \le D` de un colector en el que se encuentran los datos, que puede estar incrustado de forma lineal o no lineal en el espacio de parámetros. La dispersión se refiere al grado en que los datos llenan el espacio de parámetros (esto debe distinguirse del concepto utilizado en las matrices "dispersas". La matriz de datos puede no tener entradas nulas, pero la **estructura** puede seguir siendo "dispersa" en este sentido).

source: *Brute force* query time is unchanged by data structure.
es_es: El tiempo de consulta de *fuerza bruta* no se ve afectado por la estructura de datos.

source: *Ball tree* and *KD tree* query times can be greatly influenced by data structure. In general, sparser data with a smaller intrinsic dimensionality leads to faster query times. Because the KD tree internal representation is aligned with the parameter axes, it will not generally show as much improvement as ball tree for arbitrarily structured data.
es_es: Los tiempos de consulta del *árbol de bolas* y del *árbol KD* pueden verse muy influidos por la estructura de los datos. En general, los datos más dispersos con una menor dimensionalidad intrínseca conducen a tiempos de consulta más rápidos. Dado que la representación interna del árbol KD está alineada con los ejes de los parámetros, en general no mostrará tantas mejoras como el árbol de bolas para datos estructurados de forma arbitraria.

source: Datasets used in machine learning tend to be very structured, and are very well-suited for tree-based queries.
es_es: Los conjuntos de datos utilizados en el aprendizaje automático suelen estar muy estructurados y son muy adecuados para las consultas basadas en árboles.

source: number of neighbors :math:`k` requested for a query point.
es_es: número de vecinos :math:`k` solicitados para un punto de consulta.

source: *Brute force* query time is largely unaffected by the value of :math:`k`
es_es: *El tiempo de consulta por fuerza bruta no se ve afectado por el valor de :math:`k`

source: *Ball tree* and *KD tree* query time will become slower as :math:`k` increases. This is due to two effects: first, a larger :math:`k` leads to the necessity to search a larger portion of the parameter space. Second, using :math:`k > 1` requires internal queueing of results as the tree is traversed.
es_es: El tiempo de consulta del *árbol de bolas* y del *árbol KD* será más lento a medida que :math:`k` aumente. Esto se debe a dos efectos: en primer lugar, un :math:`k` mayor conduce a la necesidad de buscar una porción mayor del espacio de parámetros. En segundo lugar, el uso de :math:`k > 1` requiere la puesta en cola interna de los resultados a medida que se recorre el árbol.

source: As :math:`k` becomes large compared to :math:`N`, the ability to prune branches in a tree-based query is reduced. In this situation, Brute force queries can be more efficient.
es_es: A medida que :math:`k` se hace grande en comparación con :math:`N`, la capacidad de podar ramas en una consulta basada en un árbol se reduce. En esta situación, las consultas de fuerza bruta pueden ser más eficientes.

source: number of query points. Both the ball tree and the KD Tree require a construction phase. The cost of this construction becomes negligible when amortized over many queries. If only a small number of queries will be performed, however, the construction can make up a significant fraction of the total cost. If very few query points will be required, brute force is better than a tree-based method.
es_es: número de puntos de consulta. Tanto el árbol de bolas como el árbol KD requieren una fase de construcción. El coste de esta construcción resulta insignificante cuando se amortiza en muchas consultas. Sin embargo, si sólo se va a realizar un pequeño número de consultas, la construcción puede suponer una fracción significativa del coste total. Si se necesitan muy pocos puntos de consulta, la fuerza bruta es mejor que un método basado en árboles.

source: Currently, ``algorithm = 'auto'`` selects ``'brute'`` if any of the following conditions are verified:
es_es: Actualmente, ``algorithm = 'auto'`` selecciona ``'brute'`` si se verifica alguna de las siguientes condiciones:

source: input data is sparse
es_es: los datos de entrada son dispersos

source: ``effective_metric_`` isn't in the ``VALID_METRICS`` list for either ``'kd_tree'`` or ``'ball_tree'``
es_es: ``effective_metric_`` no está en la lista ``VALID_METRICS`` para ``'kd_tree'`` o ``'ball_tree'``

source: Otherwise, it selects the first out of ``'kd_tree'`` and ``'ball_tree'`` that has ``effective_metric_`` in its ``VALID_METRICS`` list. This heuristic is based on the following assumptions:
es_es: En caso contrario, selecciona el primero de ``'kd_tree'`` y ``'ball_tree'`` que tenga ``effective_metric_`` en su lista ``VALID_METRICS``. Esta heurística se basa en las siguientes suposiciones:

source: the number of query points is at least the same order as the number of training points
es_es: el número de puntos de consulta es al menos del mismo orden que el número de puntos de entrenamiento

source: ``leaf_size`` is close to its default value of ``30``
es_es: ``leaf_size`` está cerca de su valor por defecto de ``30``

source: when :math:`D > 15`, the intrinsic dimensionality of the data is generally too high for tree-based methods
es_es: cuando :math:`D > 15`, la dimensionalidad intrínseca de los datos es generalmente demasiado alta para los métodos basados en árboles

source: Effect of ``leaf_size``
es_es: Efecto de ``leaf_size``

source: As noted above, for small sample sizes a brute force search can be more efficient than a tree-based query. This fact is accounted for in the ball tree and KD tree by internally switching to brute force searches within leaf nodes. The level of this switch can be specified with the parameter ``leaf_size``. This parameter choice has many effects:
es_es: Como se ha mencionado anteriormente, para tamaños de muestra pequeños, una búsqueda de fuerza bruta puede ser más eficiente que una consulta basada en un árbol. Este hecho se tiene en cuenta en el árbol de bolas y en el árbol KD cambiando internamente a búsquedas de fuerza bruta dentro de los nodos hoja. El nivel de este cambio puede especificarse con el parámetro ``leaf_size``. La elección de este parámetro tiene muchos efectos:

source: **construction time**
es_es: **tiempo de construcción**

source: A larger ``leaf_size`` leads to a faster tree construction time, because fewer nodes need to be created
es_es: Un ``leaf_size`` mayor acelera el tiempo de construcción del árbol, ya que hay que crear menos nodos

source: **query time**
es_es: **tiempo de consulta**

source: Both a large or small ``leaf_size`` can lead to suboptimal query cost. For ``leaf_size`` approaching 1, the overhead involved in traversing nodes can significantly slow query times. For ``leaf_size`` approaching the size of the training set, queries become essentially brute force. A good compromise between these is ``leaf_size = 30``, the default value of the parameter.
es_es: Tanto un ``leaf_size`` grande como pequeño puede llevar a un coste de consulta subóptimo. Si ``leaf_size`` se aproxima a 1, la sobrecarga que supone recorrer los nodos puede ralentizar considerablemente los tiempos de consulta. Si el tamaño de las hojas se aproxima al tamaño del conjunto de entrenamiento, las consultas se convierten en fuerza bruta. Un buen compromiso entre ambos es ``leaf_size = 30``, el valor por defecto del parámetro.

source: **memory**
es_es: **memoria**

source: As ``leaf_size`` increases, the memory required to store a tree structure decreases. This is especially important in the case of ball tree, which stores a :math:`D`-dimensional centroid for each node. The required storage space for :class:`BallTree` is approximately ``1 / leaf_size`` times the size of the training set.
es_es: A medida que ``leaf_size`` aumenta, la memoria requerida para almacenar una estructura de árbol disminuye. Esto es especialmente importante en el caso del árbol de bolas, que almacena un :math:`D`-dimensional centroid para cada nodo. El espacio de almacenamiento requerido para :class:`BallTree` es aproximadamente ``1 / leaf_size`` el tamaño del conjunto de entrenamiento.

source: ``leaf_size`` is not referenced for brute force queries.
es_es: ``leaf_size`` no está referenciado para consultas de fuerza bruta.

source: Nearest Centroid Classifier
es_es: Clasificador de centroides más cercano

source: The :class:`NearestCentroid` classifier is a simple algorithm that represents each class by the centroid of its members. In effect, this makes it similar to the label updating phase of the :class:`~sklearn.cluster.KMeans` algorithm. It also has no parameters to choose, making it a good baseline classifier. It does, however, suffer on non-convex classes, as well as when classes have drastically different variances, as equal variance in all dimensions is assumed. See Linear Discriminant Analysis (:class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`) and Quadratic Discriminant Analysis (:class:`~sklearn.discriminant_analysis.QuadraticDiscriminantAnalysis`) for more complex methods that do not make this assumption. Usage of the default :class:`NearestCentroid` is simple:
es_es: El clasificador :class:`NearestCentroid` es un algoritmo simple que representa cada clase por el centroide de sus miembros. En efecto, esto lo hace similar a la fase de actualización de etiquetas del algoritmo :class:`~sklearn.cluster.KMeans`. Tampoco hay que elegir parámetros, lo que lo convierte en un buen clasificador de referencia. Sin embargo, sufre en clases no convexas, así como cuando las clases tienen varianzas drásticamente diferentes, ya que se asume una varianza igual en todas las dimensiones. Consulta Linear Discriminant Analysis (:class:`~sklearn.discriminant_analysis.LinearDiscriminantAnalysis`) y Quadratic Discriminant Analysis (:class:`~sklearn.discriminant_analysis.QuadraticDiscriminantAnalysis`) para métodos más complejos que no hacen esta suposición. El uso de la clase :class:`NearestCentroid` por defecto es sencillo:

source: Nearest Shrunken Centroid
es_es: Centroide de Shrunken más cercano

source: The :class:`NearestCentroid` classifier has a ``shrink_threshold`` parameter, which implements the nearest shrunken centroid classifier. In effect, the value of each feature for each centroid is divided by the within-class variance of that feature. The feature values are then reduced by ``shrink_threshold``. Most notably, if a particular feature value crosses zero, it is set to zero. In effect, this removes the feature from affecting the classification. This is useful, for example, for removing noisy features.
es_es: El clasificador :class:`NearestCentroid` tiene un parámetro ``shrink_threshold``, que implementa el clasificador shrunken centroid más cercano. En efecto, el valor de cada característica para cada centroide se divide por la varianza dentro de la clase de esa característica. A continuación, los valores de las características se reducen en ``shrink_threshold``. En particular, si el valor de una característica particular es cero, se pone a cero. En efecto, esto hace que la característica no afecte a la clasificación. Esto es útil, por ejemplo, para eliminar características ruidosas.

source: In the example below, using a small shrink threshold increases the accuracy of the model from 0.81 to 0.82.
es_es: En el ejemplo siguiente, el uso de un reducido umbral de contracción aumenta la precisión del modelo de 0,81 a 0,82.

source: :ref:`sphx_glr_auto_examples_neighbors_plot_nearest_centroid.py`: an example of classification using nearest centroid with different shrink thresholds.
es_es: :ref:`sphx_glr_auto_examples_neighbors_plot_nearest_centroid.py`: un ejemplo de clasificación utilizando el centroide más cercano con diferentes umbrales de reducción.

source: Nearest Neighbors Transformer
es_es: Transformador de vecinos más cercanos

source: Many scikit-learn estimators rely on nearest neighbors: Several classifiers and regressors such as :class:`KNeighborsClassifier` and :class:`KNeighborsRegressor`, but also some clustering methods such as :class:`~sklearn.cluster.DBSCAN` and :class:`~sklearn.cluster.SpectralClustering`, and some manifold embeddings such as :class:`~sklearn.manifold.TSNE` and :class:`~sklearn.manifold.Isomap`.
es_es: Muchos estimadores de scikit-learn se basan en los vecinos más cercanos: Varios clasificadores y regresores como :class:`KNeighborsClassifier` y :class:`KNeighborsRegressor`, pero también algunos métodos de agrupamiento como :class:`~sklearn.cluster.DBSCAN` y :class:`~sklearn.cluster.SpectralClustering`, y algunos incrustados como :class:`~sklearn.manifold.TSNE` y :class:`~sklearn.manifold.Isomap`.

source: All these estimators can compute internally the nearest neighbors, but most of them also accept precomputed nearest neighbors :term:`sparse graph`, as given by :func:`~sklearn.neighbors.kneighbors_graph` and :func:`~sklearn.neighbors.radius_neighbors_graph`. With mode `mode='connectivity'`, these functions return a binary adjacency sparse graph as required, for instance, in :class:`~sklearn.cluster.SpectralClustering`. Whereas with `mode='distance'`, they return a distance sparse graph as required, for instance, in :class:`~sklearn.cluster.DBSCAN`. To include these functions in a scikit-learn pipeline, one can also use the corresponding classes :class:`KNeighborsTransformer` and :class:`RadiusNeighborsTransformer`. The benefits of this sparse graph API are multiple.
es_es: Todos estos estimadores pueden calcular internamente los vecinos más cercanos, pero la mayoría de ellos también aceptan los vecinos más cercanos precalculados :term:`grafo disperso`, como se da en :func:`~sklearn.neighbors.kneighbors_graph` y :func:`~sklearn.neighbors.radius_neighbors_graph`. Con el modo `mode='connectivity'`, estas funciones devuelven un gráfico binario de adyacencia disperso como se requiere, por ejemplo, en :class:`~sklearn.cluster.SpectralClustering`. Mientras que con `mode='distance'`, devuelven un gráfico disperso de distancia como se requiere, por ejemplo, en :class:`~sklearn.cluster.DBSCAN`. Para incluir estas funciones en un pipeline de scikit-learn, también se pueden utilizar las clases correspondientes :class:`KNeighborsTransformer` y :class:`RadiusNeighborsTransformer`. Los beneficios de esta API de gráficos dispersos son múltiples.

source: First, the precomputed graph can be re-used multiple times, for instance while varying a parameter of the estimator. This can be done manually by the user, or using the caching properties of the scikit-learn pipeline:
es_es: En primer lugar, el gráfico precalculado puede reutilizarse varias veces, por ejemplo, al variar un parámetro del estimador. Esto se puede hacer manualmente por el usuario, o utilizando las propiedades de almacenamiento en caché de la pipeline de scikit-learn:
