Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/neighbors.po
Languages: es_es

source: Nearest Neighbors
es_es: Vecino más cercano

source: :mod:`sklearn.neighbors` provides functionality for unsupervised and supervised neighbors-based learning methods. Unsupervised nearest neighbors is the foundation of many other learning methods, notably manifold learning and spectral clustering. Supervised neighbors-based learning comes in two flavors: `classification`_ for data with discrete labels, and `regression`_ for data with continuous labels.
es_es: :mod:`sklearn.neighbors` proporciona funcionalidad para métodos de aprendizaje basados en vecinos no supervisados y supervisados. Los vecinos más cercanos no supervisados son la base de muchos otros métodos de aprendizaje, especialmente el aprendizaje múltiple y la agrupación espectral. El aprendizaje basado en vecinos supervisados tiene dos variantes: `classification`_ para datos con etiquetas discretas, y `regression`_ para datos con etiquetas continuas.

source: The principle behind nearest neighbor methods is to find a predefined number of training samples closest in distance to the new point, and predict the label from these. The number of samples can be a user-defined constant (k-nearest neighbor learning), or vary based on the local density of points (radius-based neighbor learning). The distance can, in general, be any metric measure: standard Euclidean distance is the most common choice. Neighbors-based methods are known as *non-generalizing* machine learning methods, since they simply "remember" all of its training data (possibly transformed into a fast indexing structure such as a :ref:`Ball Tree <ball_tree>` or :ref:`KD Tree <kd_tree>`).
es_es: El principio en el que se basan los métodos del vecino más cercano es encontrar un número predefinido de muestras de entrenamiento más cercanas en distancia al nuevo punto, y predecir la etiqueta a partir de ellas. El número de muestras puede ser una constante definida por el usuario (aprendizaje del vecino más cercano k), o variar en función de la densidad local de puntos (aprendizaje del vecino basado en el radio). La distancia puede ser, en general, cualquier medida métrica: la distancia euclidiana estándar es la opción más común. Los métodos basados en los vecinos se conocen como métodos de aprendizaje automático *no generalizadores*, ya que simplemente "recuerdan" todos sus datos de entrenamiento (posiblemente transformados en una estructura de indexación rápida como un :ref:`Ball Tree <ball_tree>` or :ref:`KD Tree <kd_tree>`).

source: Despite its simplicity, nearest neighbors has been successful in a large number of classification and regression problems, including handwritten digits and satellite image scenes. Being a non-parametric method, it is often successful in classification situations where the decision boundary is very irregular.
es_es: A pesar de su simplicidad, los vecinos más cercanos han tenido éxito en un gran número de problemas de clasificación y regresión, incluyendo dígitos escritos a mano y escenas de imágenes de satélite. Al ser un método no paramétrico, suele tener éxito en situaciones de clasificación en las que el límite de decisión es muy irregular.

source: The classes in :mod:`sklearn.neighbors` can handle either NumPy arrays or `scipy.sparse` matrices as input. For dense matrices, a large number of possible distance metrics are supported. For sparse matrices, arbitrary Minkowski metrics are supported for searches.
es_es: Las clases de :mod:`sklearn.neighbors` pueden manejar matrices NumPy o matrices `scipy.sparse` como entrada. En el caso de las matrices densas, se admite un gran número de métricas de distancia posibles. Para matrices dispersas, se admiten métricas de Minkowski arbitrarias para las búsquedas.

source: There are many learning routines which rely on nearest neighbors at their core. One example is :ref:`kernel density estimation <kernel_density>`, discussed in the :ref:`density estimation <density_estimation>` section.
es_es: Hay muchas rutinas de aprendizaje que se basan en los vecinos más cercanos. Un ejemplo es :ref:`kernel density estimation <kernel_density>`, discutido en la sección :ref:`density estimation <density_estimation>`.

source: Unsupervised Nearest Neighbors
es_es: Vecinos más cercanos no supervisados

source: :class:`NearestNeighbors` implements unsupervised nearest neighbors learning. It acts as a uniform interface to three different nearest neighbors algorithms: :class:`BallTree`, :class:`KDTree`, and a brute-force algorithm based on routines in :mod:`sklearn.metrics.pairwise`. The choice of neighbors search algorithm is controlled through the keyword ``'algorithm'``, which must be one of ``['auto', 'ball_tree', 'kd_tree', 'brute']``. When the default value ``'auto'`` is passed, the algorithm attempts to determine the best approach from the training data. For a discussion of the strengths and weaknesses of each option, see `Nearest Neighbor Algorithms`_.
es_es: :class:`NearestNeighbors` implementa el aprendizaje no supervisado de los vecinos más cercanos. Actúa como una interfaz uniforme para tres algoritmos diferentes de vecinos más cercanos: :class:`BallTree`, :class:`KDTree`, y un algoritmo de fuerza bruta basado en las rutinas de :mod:`sklearn.metrics.pairwise`. La elección del algoritmo de búsqueda de vecinos se controla a través de la palabra clave ``'algorithm'``, que debe ser uno de ``['auto', 'ball_tree', 'kd_tree', 'brute']``. Cuando se pasa el valor por defecto ``'auto'``, el algoritmo intenta determinar la mejor aproximación a partir de los datos de entrenamiento. Para una discusión de los puntos fuertes y débiles de cada opción, consulta `Nearest Neighbor Algorithms`_.

source: Regarding the Nearest Neighbors algorithms, if two neighbors :math:`k+1` and :math:`k` have identical distances but different labels, the result will depend on the ordering of the training data.
es_es: En cuanto a los algoritmos de vecinos más cercanos, si dos vecinos :math:`k+1` y :math:`k` tienen distancias idénticas pero etiquetas diferentes, el resultado dependerá del orden de los datos de entrenamiento.

source: Finding the Nearest Neighbors
es_es: Encontrar a los vecinos más cercanos

source: For the simple task of finding the nearest neighbors between two sets of data, the unsupervised algorithms within :mod:`sklearn.neighbors` can be used:
es_es: Para la sencilla tarea de encontrar los vecinos más cercanos entre dos conjuntos de datos, se pueden utilizar los algoritmos no supervisados de :mod:`sklearn.neighbors`:

source: Because the query set matches the training set, the nearest neighbor of each point is the point itself, at a distance of zero.
es_es: Como el conjunto de consulta se corresponde con el conjunto de entrenamiento, el vecino más cercano de cada punto es el propio punto, a una distancia de cero.

source: It is also possible to efficiently produce a sparse graph showing the connections between neighboring points:
es_es: También es posible producir eficazmente un gráfico disperso que muestre las conexiones entre los puntos vecinos:

source: The dataset is structured such that points nearby in index order are nearby in parameter space, leading to an approximately block-diagonal matrix of K-nearest neighbors. Such a sparse graph is useful in a variety of circumstances which make use of spatial relationships between points for unsupervised learning: in particular, see :class:`~sklearn.manifold.Isomap`, :class:`~sklearn.manifold.LocallyLinearEmbedding`, and :class:`~sklearn.cluster.SpectralClustering`.
es_es: El conjunto de datos está estructurado de manera que los puntos cercanos en el orden de los índices están cerca en el espacio de los parámetros, lo que conduce a una matriz aproximadamente diagonal de bloques de los vecinos más cercanos. Este gráfico disperso es útil en una variedad de circunstancias que hacen uso de las relaciones espaciales entre los puntos para el aprendizaje no supervisado: en particular, véase :class:`~sklearn.manifold.Isomap`, :class:`~sklearn.manifold.LocallyLinearEmbedding`, y :class:`~sklearn.cluster.SpectralClustering`.

source: KDTree and BallTree Classes
es_es: Clases de árbol KD y árbol de bolas

source: Alternatively, one can use the :class:`KDTree` or :class:`BallTree` classes directly to find nearest neighbors. This is the functionality wrapped by the :class:`NearestNeighbors` class used above. The Ball Tree and KD Tree have the same interface; we'll show an example of using the KD Tree here:
es_es: Como alternativa, se pueden utilizar las clases :class:`KDTree` o :class:`BallTree` directamente para encontrar los vecinos más cercanos. Esta es la funcionalidad que envuelve la clase :class:`NearestNeighbors` utilizada anteriormente. El árbol de bolas y el árbol KD tienen la misma interfaz; aquí mostraremos un ejemplo de uso del árbol KD:

source: Refer to the :class:`KDTree` and :class:`BallTree` class documentation for more information on the options available for nearest neighbors searches, including specification of query strategies, distance metrics, etc. For a list of available metrics, see the documentation of the :class:`DistanceMetric` class.
es_es: Consulta la documentación de las clases :class:`KDTree` y :class:`BallTree` para obtener más información sobre las opciones disponibles para las búsquedas de vecinos más cercanos, incluyendo la especificación de estrategias de consulta, métricas de distancia, etc. Para una lista de métricas disponibles, consulta la documentación de la clase :class:`DistanceMetric`.

source: Nearest Neighbors Classification
es_es: Clasificación de los vecinos más cercanos

source: Neighbors-based classification is a type of *instance-based learning* or *non-generalizing learning*: it does not attempt to construct a general internal model, but simply stores instances of the training data. Classification is computed from a simple majority vote of the nearest neighbors of each point: a query point is assigned the data class which has the most representatives within the nearest neighbors of the point.
es_es: La clasificación basada en vecinos es un tipo de *aprendizaje basado en instancias* o *aprendizaje no generalizador*: no intenta construir un modelo interno general, sino que simplemente almacena instancias de los datos de entrenamiento. La clasificación se calcula a partir de una simple mayoría de votos de los vecinos más cercanos de cada punto: a un punto de consulta se le asigna la clase de datos que tiene más representantes dentro de los vecinos más cercanos del punto.

source: scikit-learn implements two different nearest neighbors classifiers: :class:`KNeighborsClassifier` implements learning based on the :math:`k` nearest neighbors of each query point, where :math:`k` is an integer value specified by the user. :class:`RadiusNeighborsClassifier` implements learning based on the number of neighbors within a fixed radius :math:`r` of each training point, where :math:`r` is a floating-point value specified by the user.
es_es: scikit-learn implementa dos clasificadores diferentes de vecinos más cercanos: :class:`KNeighborsClassifier` implementa el aprendizaje basado en los :math:`k` vecinos más cercanos de cada punto de consulta, donde :math:`k` es un valor entero especificado por el usuario. :class:`RadiusNeighborsClassifier` implementa el aprendizaje basado en el número de vecinos dentro de un radio fijo :math:`r` de cada punto de entrenamiento, donde :math:`r` es un valor de punto flotante especificado por el usuario.

source: The :math:`k`-neighbors classification in :class:`KNeighborsClassifier` is the most commonly used technique. The optimal choice of the value :math:`k` is highly data-dependent: in general a larger :math:`k` suppresses the effects of noise, but makes the classification boundaries less distinct.
es_es: La clasificación :math:`k`-neighbors en :class:`KNeighborsClassifier` es la técnica más utilizada. La elección óptima del valor :math:`k` depende en gran medida de los datos: en general, un :math:`k` mayor suprime los efectos del ruido, pero hace que los límites de la clasificación sean menos nítidos.

source: In cases where the data is not uniformly sampled, radius-based neighbors classification in :class:`RadiusNeighborsClassifier` can be a better choice. The user specifies a fixed radius :math:`r`, such that points in sparser neighborhoods use fewer nearest neighbors for the classification. For high-dimensional parameter spaces, this method becomes less effective due to the so-called "curse of dimensionality".
es_es: En los casos en los que los datos no están muestreados uniformemente, la clasificación de vecinos basada en el radio en :class:`RadiusNeighborsClassifier` puede ser una mejor opción. El usuario especifica un radio fijo :math:`r`, de forma que los puntos de los vecindarios más dispersos utilizan menos vecinos más cercanos para la clasificación. Para los espacios de parámetros de alta dimensión, este método se vuelve menos eficaz debido a la llamada "maldición de la dimensión".

source: The basic nearest neighbors classification uses uniform weights: that is, the value assigned to a query point is computed from a simple majority vote of the nearest neighbors. Under some circumstances, it is better to weight the neighbors such that nearer neighbors contribute more to the fit. This can be accomplished through the ``weights`` keyword. The default value, ``weights = 'uniform'``, assigns uniform weights to each neighbor. ``weights = 'distance'`` assigns weights proportional to the inverse of the distance from the query point. Alternatively, a user-defined function of the distance can be supplied to compute the weights.
es_es: La clasificación básica de vecinos más cercanos utiliza ponderaciones uniformes: es decir, el valor asignado a un punto de consulta se calcula a partir de un voto mayoritario simple de los vecinos más cercanos. En algunas circunstancias, es mejor ponderar los vecinos de forma que los más cercanos contribuyan más al ajuste. Esto puede lograrse mediante la palabra clave ``weights``. El valor por defecto, ``weights = 'uniform'``, asigna pesos uniformes a cada vecino. El valor ``weights = 'distance`` asigna pesos proporcionales a la inversa de la distancia al punto de consulta. Alternativamente, se puede proporcionar una función definida por el usuario de la distancia para calcular los pesos.

source: :ref:`sphx_glr_auto_examples_neighbors_plot_classification.py`: an example of classification using nearest neighbors.
es_es: :ref:`sphx_glr_auto_examples_neighbors_plot_classification.py`: un ejemplo de clasificación usando vecinos más cercanos.

source: Nearest Neighbors Regression
es_es: Regresión de vecinos más cercanos

source: Neighbors-based regression can be used in cases where the data labels are continuous rather than discrete variables. The label assigned to a query point is computed based on the mean of the labels of its nearest neighbors.
es_es: La regresión basada en los vecinos puede utilizarse en los casos en que las etiquetas de los datos son variables continuas y no discretas. La etiqueta asignada a un punto de consulta se calcula a partir de la media de las etiquetas de sus vecinos más cercanos.

source: scikit-learn implements two different neighbors regressors: :class:`KNeighborsRegressor` implements learning based on the :math:`k` nearest neighbors of each query point, where :math:`k` is an integer value specified by the user. :class:`RadiusNeighborsRegressor` implements learning based on the neighbors within a fixed radius :math:`r` of the query point, where :math:`r` is a floating-point value specified by the user.
es_es: scikit-learn implementa dos regresores de vecinos diferentes: :class:`KNeighborsRegressor` implementa el aprendizaje basado en los :math:`k` vecinos más cercanos de cada punto de consulta, donde :math:`k` es un valor entero especificado por el usuario. :class:`RadiusNeighborsRegressor` implementa el aprendizaje basado en los vecinos dentro de un radio fijo :math:`r` del punto de consulta, donde :math:`r` es un valor de punto flotante especificado por el usuario.

source: The basic nearest neighbors regression uses uniform weights: that is, each point in the local neighborhood contributes uniformly to the classification of a query point. Under some circumstances, it can be advantageous to weight points such that nearby points contribute more to the regression than faraway points. This can be accomplished through the ``weights`` keyword. The default value, ``weights = 'uniform'``, assigns equal weights to all points. ``weights = 'distance'`` assigns weights proportional to the inverse of the distance from the query point. Alternatively, a user-defined function of the distance can be supplied, which will be used to compute the weights.
es_es: La regresión básica de vecinos más cercanos utiliza pesos uniformes: es decir, cada punto de la vecindad local contribuye uniformemente a la clasificación de un punto de consulta. En algunas circunstancias, puede ser ventajoso ponderar los puntos de manera que los puntos cercanos contribuyan más a la regresión que los puntos lejanos. Esto puede lograrse mediante la palabra clave "pesos". El valor por defecto, ``pesos = 'uniforme'``, asigna pesos iguales a todos los puntos. El valor ``pesos = `distancia`` asigna pesos proporcionales a la inversa de la distancia al punto de consulta. Alternativamente, se puede proporcionar una función definida por el usuario de la distancia, que se utilizará para calcular los pesos.

source: The use of multi-output nearest neighbors for regression is demonstrated in :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`. In this example, the inputs X are the pixels of the upper half of faces and the outputs Y are the pixels of the lower half of those faces.
es_es: El uso de vecinos más cercanos de salida múltiple para la regresión se demuestra en :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`. En este ejemplo, las entradas X son los píxeles de la mitad superior de las caras y las salidas Y son los píxeles de la mitad inferior de esas caras.

source: :ref:`sphx_glr_auto_examples_neighbors_plot_regression.py`: an example of regression using nearest neighbors.
es_es: :ref:`sphx_glr_auto_examples_neighbors_plot_classification.py`: un ejemplo de clasificación usando vecinos más cercanos.

source: :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`: an example of multi-output regression using nearest neighbors.
es_es: :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`: un ejemplo de regresión de multi-salida usando vecinos más cercanos.

source: Nearest Neighbor Algorithms
es_es: Algoritmos del vecino más cercano

source: Brute Force
es_es: Fuerza bruta

source: Fast computation of nearest neighbors is an active area of research in machine learning. The most naive neighbor search implementation involves the brute-force computation of distances between all pairs of points in the dataset: for :math:`N` samples in :math:`D` dimensions, this approach scales as :math:`O[D N^2]`. Efficient brute-force neighbors searches can be very competitive for small data samples. However, as the number of samples :math:`N` grows, the brute-force approach quickly becomes infeasible. In the classes within :mod:`sklearn.neighbors`, brute-force neighbors searches are specified using the keyword ``algorithm = 'brute'``, and are computed using the routines available in :mod:`sklearn.metrics.pairwise`.
es_es: El cálculo rápido de los vecinos más cercanos es un área activa de investigación en el aprendizaje automático. La implementación más simple de la búsqueda de vecinos implica el cálculo por fuerza bruta de las distancias entre todos los pares de puntos del conjunto de datos: para muestras :math:`N` en dimensiones :math:`D`, este enfoque se escala como :math:`O[D N^2]`. La búsqueda eficiente de vecinos por fuerza bruta puede ser muy competitiva para muestras de datos pequeñas. Sin embargo, a medida que el número de muestras :math:`N` crece, el enfoque de fuerza bruta se vuelve rápidamente inviable. En las clases dentro de :mod:`sklearn.neighbors`, las búsquedas de vecinos por fuerza bruta se especifican utilizando la palabra clave ``algoritmo = 'brute'``, y se calculan utilizando las rutinas disponibles en :mod:`sklearn.metrics.pairwise`.

source: K-D Tree
es_es: Árbol K-D

source: To address the computational inefficiencies of the brute-force approach, a variety of tree-based data structures have been invented. In general, these structures attempt to reduce the required number of distance calculations by efficiently encoding aggregate distance information for the sample. The basic idea is that if point :math:`A` is very distant from point :math:`B`, and point :math:`B` is very close to point :math:`C`, then we know that points :math:`A` and :math:`C` are very distant, *without having to explicitly calculate their distance*. In this way, the computational cost of a nearest neighbors search can be reduced to :math:`O[D N \log(N)]` or better. This is a significant improvement over brute-force for large :math:`N`.
es_es: Para hacer frente a las ineficiencias computacionales del enfoque de fuerza bruta, se han inventado diversas estructuras de datos basadas en árboles. En general, estas estructuras intentan reducir el número de cálculos de distancia necesarios codificando de forma eficiente la información de distancia agregada para la muestra. La idea básica es que si el punto :math:`A` está muy distante del punto :math:`B`, y el punto :math:`B` está muy cerca del punto :math:`C`, entonces sabemos que los puntos :math:`A` y :math:`C` están muy distantes, *sin tener que calcular explícitamente su distancia*. De este modo, el coste computacional de una búsqueda de vecinos más cercanos puede reducirse a :math:`O[D N \log(N)]` o mejor. Esto supone una mejora significativa respecto a la fuerza bruta para grandes :math:`N`.
