Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/neural_networks_supervised.po
Languages: es_es

source: If you want more control over stopping criteria or learning rate in SGD, or want to do additional monitoring, using ``warm_start=True`` and ``max_iter=1`` and iterating yourself can be helpful::
es_es: Si quieres tener más control sobre los criterios de parada o la tasa de aprendizaje en SGD, o quieres hacer una supervisión adicional, utiliza ``warm_start=True`` y ``max_iter=1`` e iterar tú mismo puede ser útil::
