Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/neural_networks_unsupervised.po
Languages: es_es

source: Neural network models (unsupervised)
es_es: Modelos de red neural (no supervisados)

source: Restricted Boltzmann machines
es_es: Máquinas Boltzmann restringidas

source: Restricted Boltzmann machines (RBM) are unsupervised nonlinear feature learners based on a probabilistic model. The features extracted by an RBM or a hierarchy of RBMs often give good results when fed into a linear classifier such as a linear SVM or a perceptron.
es_es: Las máquinas de Boltzmann restringidas (RBM) son aprendices de características no lineales no supervisadas basadas en un modelo probabilístico. Las características extraídas por una RBM o una jerarquía de RBM suelen dar buenos resultados cuando se introducen en un clasificador lineal como una SVM lineal o un perceptrón.

source: The model makes assumptions regarding the distribution of inputs. At the moment, scikit-learn only provides :class:`BernoulliRBM`, which assumes the inputs are either binary values or values between 0 and 1, each encoding the probability that the specific feature would be turned on.
es_es: El modelo hace suposiciones sobre la distribución de las entradas. Por el momento, scikit-learn sólo proporciona :class:`BernoulliRBM`, que asume que las entradas son valores binarios o valores entre 0 y 1, cada uno codificando la probabilidad de que la característica específica se active.

source: The RBM tries to maximize the likelihood of the data using a particular graphical model. The parameter learning algorithm used (:ref:`Stochastic Maximum Likelihood <sml>`) prevents the representations from straying far from the input data, which makes them capture interesting regularities, but makes the model less useful for small datasets, and usually not useful for density estimation.
es_es: El RBM trata de maximizar la probabilidad de los datos utilizando un modelo gráfico determinado. El algoritmo de aprendizaje de parámetros utilizado (:ref:`Máxima Verosimilitud Estocástica <sml>`) evita que las representaciones se alejen de los datos de entrada, lo que hace que capturen regularidades interesantes, pero hace que el modelo sea menos útil para conjuntos de datos pequeños, y normalmente no es útil para la estimación de la densidad.

source: The method gained popularity for initializing deep neural networks with the weights of independent RBMs. This method is known as unsupervised pre-training.
es_es: El método ganó popularidad para inicializar redes neuronales profundas con los pesos de RBMs independientes. Este método se conoce como preentrenamiento no supervisado.

source: Graphical model and parametrization
es_es: Modelo gráfico y parametrización

source: The graphical model of an RBM is a fully-connected bipartite graph.
es_es: El modelo gráfico de un RBM es un grafo bipartito completamente conectado.

source: The nodes are random variables whose states depend on the state of the other nodes they are connected to. The model is therefore parameterized by the weights of the connections, as well as one intercept (bias) term for each visible and hidden unit, omitted from the image for simplicity.
es_es: Los nodos son variables aleatorias cuyos estados dependen del estado de los otros nodos a los que están conectados. Por lo tanto, el modelo está parametrizado por las ponderaciones de las conexiones, así como un término de intercepción (sesgo) para cada unidad visible y oculta, omitido en la imagen por simplicidad.

source: The energy function measures the quality of a joint assignment:
es_es: La función energética mide la calidad de una asignación conjunta:

source: In the formula above, :math:`\mathbf{b}` and :math:`\mathbf{c}` are the intercept vectors for the visible and hidden layers, respectively. The joint probability of the model is defined in terms of the energy:
es_es: En la fórmula anterior, :math:`\mathbf{b}` y :math:`\mathbf{c}` son los vectores de intercepción para las capas visible y oculta, respectivamente. La probabilidad conjunta del modelo se define en términos de energía:

source: The word *restricted* refers to the bipartite structure of the model, which prohibits direct interaction between hidden units, or between visible units. This means that the following conditional independencies are assumed:
es_es: La palabra *restringida* se refiere a la estructura bipartita del modelo, que prohíbe la interacción directa entre unidades ocultas, o entre unidades visibles. Esto significa que se asumen las siguientes independencias condicionales:

source: The bipartite structure allows for the use of efficient block Gibbs sampling for inference.
es_es: La estructura bipartita permite el uso de un eficiente muestreo de Gibbs en bloque para la inferencia.

source: Bernoulli Restricted Boltzmann machines
es_es: Máquinas de Boltzmann restringidas de Bernoulli

source: In the :class:`BernoulliRBM`, all units are binary stochastic units. This means that the input data should either be binary, or real-valued between 0 and 1 signifying the probability that the visible unit would turn on or off. This is a good model for character recognition, where the interest is on which pixels are active and which aren't. For images of natural scenes it no longer fits because of background, depth and the tendency of neighbouring pixels to take the same values.
es_es: En la :clase:`BernoulliRBM`, todas las unidades son unidades estocásticas binarias. Esto significa que los datos de entrada deben ser binarios, o de valor real entre 0 y 1, lo que significa la probabilidad de que la unidad visible se encienda o se apague. Este es un buen modelo para el reconocimiento de caracteres, donde el interés está en qué píxeles están activos y cuáles no. Para las imágenes de escenas naturales ya no se ajusta debido al fondo, la profundidad y la tendencia de los píxeles vecinos a tomar los mismos valores.

source: The conditional probability distribution of each unit is given by the logistic sigmoid activation function of the input it receives:
es_es: La distribución de probabilidad condicional de cada unidad viene dada por la función de activación sigmoidal logística de la entrada que recibe:

source: where :math:`\sigma` is the logistic sigmoid function:
es_es: donde :math:`\sigma` es la función sigmoidal logística:

source: Stochastic Maximum Likelihood learning
es_es: Aprendizaje por máxima verosimilitud estocástica

source: The training algorithm implemented in :class:`BernoulliRBM` is known as Stochastic Maximum Likelihood (SML) or Persistent Contrastive Divergence (PCD). Optimizing maximum likelihood directly is infeasible because of the form of the data likelihood:
es_es: El algoritmo de entrenamiento implementado en :class:`BernoulliRBM` se conoce como Máxima Verosimilitud Estocástica (SML) o Divergencia Contrastiva Persistente (PCD). Optimizar la máxima verosimilitud directamente es inviable debido a la forma de la verosimilitud de los datos:

source: For simplicity the equation above is written for a single training example. The gradient with respect to the weights is formed of two terms corresponding to the ones above. They are usually known as the positive gradient and the negative gradient, because of their respective signs. In this implementation, the gradients are estimated over mini-batches of samples.
es_es: Para simplificar, la ecuación anterior está escrita para un solo ejemplo de entrenamiento. El gradiente con respecto a los pesos está formado por dos términos correspondientes a los anteriores. Suelen conocerse como gradiente positivo y gradiente negativo, por sus respectivos signos. En esta implementación, los gradientes se estiman sobre mini-lotes de muestras.

source: In maximizing the log-likelihood, the positive gradient makes the model prefer hidden states that are compatible with the observed training data. Because of the bipartite structure of RBMs, it can be computed efficiently. The negative gradient, however, is intractable. Its goal is to lower the energy of joint states that the model prefers, therefore making it stay true to the data. It can be approximated by Markov chain Monte Carlo using block Gibbs sampling by iteratively sampling each of :math:`v` and :math:`h` given the other, until the chain mixes. Samples generated in this way are sometimes referred as fantasy particles. This is inefficient and it is difficult to determine whether the Markov chain mixes.
es_es: Al maximizar la log-verosimilitud, el gradiente positivo hace que el modelo prefiera los estados ocultos que son compatibles con los datos de entrenamiento observados. Debido a la estructura bipartita de los RBM, puede calcularse de forma eficiente. El gradiente negativo, sin embargo, es inmanejable. Su objetivo es reducir la energía de los estados conjuntos que el modelo prefiere, haciendo que se mantenga fiel a los datos. Puede aproximarse mediante el Monte Carlo de cadenas de Markov utilizando el muestreo de Gibbs en bloque, muestreando iterativamente cada uno de los :math:`v` y :math:`h` dado el otro, hasta que la cadena se mezcle. Las muestras generadas de este modo se denominan a veces partículas de fantasía. Esto es ineficiente y es difícil determinar si la cadena de Markov se mezcla.

source: The Contrastive Divergence method suggests to stop the chain after a small number of iterations, :math:`k`, usually even 1. This method is fast and has low variance, but the samples are far from the model distribution.
es_es: El método de Divergencia Contrastiva sugiere detener la cadena después de un pequeño número de iteraciones, :math:`k`, por lo general hasta 1. Este método es rápido y tiene una baja varianza, pero las muestras están lejos de la distribución del modelo.

source: Persistent Contrastive Divergence addresses this. Instead of starting a new chain each time the gradient is needed, and performing only one Gibbs sampling step, in PCD we keep a number of chains (fantasy particles) that are updated :math:`k` Gibbs steps after each weight update. This allows the particles to explore the space more thoroughly.
es_es: La Divergencia Contrastiva Persistente aborda esta cuestión. En lugar de iniciar una nueva cadena cada vez que se necesita el gradiente, y realizar sólo un paso de muestreo de Gibbs, en la PCD mantenemos un número de cadenas (partículas de fantasía) que se actualizan :math:`k` pasos de Gibbs después de cada actualización de ponderaciones. Esto permite que las partículas exploren el espacio más a fondo.
