Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/outlier_detection.po
Languages: es_es

source: The number k of neighbors considered, (alias parameter n_neighbors) is typically chosen 1) greater than the minimum number of objects a cluster has to contain, so that other objects can be local outliers relative to this cluster, and 2) smaller than the maximum number of close by objects that can potentially be local outliers. In practice, such informations are generally not available, and taking n_neighbors=20 appears to work well in general. When the proportion of outliers is high (i.e. greater than 10 \%, as in the example below), n_neighbors should be greater (n_neighbors=35 in the example below).
es_es: El número k de vecinos considerado, (parámetro alias n_neighbors) suele elegirse 1) mayor que el número mínimo de objetos que debe contener un clúster, para que otros objetos puedan ser valores atípicos locales en relación con este conglomerado, y 2) menor que el número máximo de objetos cercanos que pueden ser potencialmente atípicos locales. En la práctica, esta información no suele estar disponible, y tomar n_neighbors=20 parece funcionar bien en general. Cuando la proporción de valores atípicos es alta (es decir, superior al 10 \%, como en el ejemplo siguiente), n_neighbors debe ser mayor (n_neighbors=35 en el ejemplo siguiente).

source: The strength of the LOF algorithm is that it takes both local and global properties of datasets into consideration: it can perform well even in datasets where abnormal samples have different underlying densities. The question is not, how isolated the sample is, but how isolated it is with respect to the surrounding neighborhood.
es_es: El punto fuerte del algoritmo LOF es que tiene en cuenta tanto las propiedades locales como las globales de los conjuntos de datos: puede funcionar bien incluso en conjuntos de datos en los que las muestras anómalas tienen diferentes densidades subyacentes. La cuestión no es cuán aislada está la muestra, sino cuán aislada está con respecto al vecindario circundante.

source: When applying LOF for outlier detection, there are no ``predict``, ``decision_function`` and ``score_samples`` methods but only a ``fit_predict`` method. The scores of abnormality of the training samples are accessible through the ``negative_outlier_factor_`` attribute. Note that ``predict``, ``decision_function`` and ``score_samples`` can be used on new unseen data when LOF is applied for novelty detection, i.e. when the ``novelty`` parameter is set to ``True``. See :ref:`novelty_with_lof`.
es_es: Cuando se aplica LOF para la detección de valores atípicos, no existen los métodos ``predict``, ``decision_function`` y ``score_samples``, sino sólo un método ``fit_predict``. Las puntuaciones de anormalidad de las muestras de entrenamiento son accesibles a través del atributo ``negative_outlier_factor_``. Tenga en cuenta que ``predict``, ``decision_function`` y ``score_samples`` pueden utilizarse en nuevos datos no vistos cuando se aplica LOF para la detección de novedades, es decir, cuando el parámetro ``novelty`` se establece en ``True``. Ver en :ref:`novelty_with_lof`.

source: This strategy is illustrated below.
es_es: Esta estrategia se ilustra a continuación.

source: See :ref:`sphx_glr_auto_examples_neighbors_plot_lof_outlier_detection.py` for an illustration of the use of :class:`neighbors.LocalOutlierFactor`.
es_es: Consulta :ref:`sphx_glr_auto_examples_neighbors_plot_lof_outlier_detection.py` para ver una ilustración del uso de :class:`neighbors.LocalOutlierFactor`.

source: See :ref:`sphx_glr_auto_examples_miscellaneous_plot_anomaly_comparison.py` for a comparison with other anomaly detection methods.
es_es: Consulta :ref:`sphx_glr_auto_examples_miscellaneous_plot_anomaly_comparison.py` para una comparación con otros métodos de detección de anomalías.

source: Novelty detection with Local Outlier Factor
es_es: Detección de novedades con Local Outlier Factor

source: To use :class:`neighbors.LocalOutlierFactor` for novelty detection, i.e. predict labels or compute the score of abnormality of new unseen data, you need to instantiate the estimator with the ``novelty`` parameter set to ``True`` before fitting the estimator::
es_es: Para utilizar :class:`neighbors.LocalOutlierFactor` para la detección de novedades, es decir, para predecir etiquetas o calcular la puntuación de anormalidad de nuevos datos no vistos, es necesario instanciar el estimador con el parámetro ``novelty`` establecido en ``True`` antes de ajustar el estimador::

source: Note that ``fit_predict`` is not available in this case.
es_es: Toma en cuenta que ``fit_predict`` no está disponible en este caso.

source: **Novelty detection with Local Outlier Factor`**
es_es: **Detección de novedades con Local Outlier Factor`**

source: Novelty detection with Local Outlier Factor is illustrated below.
es_es: A continuación, se ilustra la detección de novedades con Local Outlier Factor.
