Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/partial_dependence.po
Languages: es_es

source: Partial Dependence and Individual Conditional Expectation plots
es_es: Gráficos de Dependencia Parcial y de Expectativa Condicional Individual

source: Partial dependence plots (PDP) and individual conditional expectation (ICE) plots can be used to visualize and analyze interaction between the target response [1]_ and a set of input features of interest.
es_es: Los gráficos de dependencia parcial (Partial dependence plots, PDP) y los gráficos de expectativas condicionales individuales (individual conditional expectation, ICE) pueden utilizarse para visualizar y analizar la interacción entre la respuesta objetivo [1]_ y un conjunto de características de entrada de interés.

source: Both PDPs and ICEs assume that the input features of interest are independent from the complement features, and this assumption is often violated in practice. Thus, in the case of correlated features, we will create absurd data points to compute the PDP/ICE.
es_es: Tanto los PDP como las ICE suponen que las características de entrada de interés son independientes de las características del complemento, y esta suposición a menudo se viola en la práctica. Así, en los casos de características correlacionadas, crearemos puntos de datos absurdos para calcular PDP/ICE.

source: Partial dependence plots
es_es: Gráficos de dependencia parcial

source: Partial dependence plots (PDP) show the dependence between the target response and a set of input features of interest, marginalizing over the values of all other input features (the 'complement' features). Intuitively, we can interpret the partial dependence as the expected target response as a function of the input features of interest.
es_es: Los gráficos de dependencia parcial (PDP) muestran la dependencia entre la respuesta objetivo y un conjunto de características de entrada de interés, marginando los valores de todas las demás características de entrada (las características 'complementarias'). Intuitivamente, podemos interpretar la dependencia parcial como la respuesta objetivo esperada en función de las características de entrada de interés.

source: Due to the limits of human perception the size of the set of input feature of interest must be small (usually, one or two) thus the input features of interest are usually chosen among the most important features.
es_es: Debido a los límites de la percepción humana, el tamaño del conjunto de características de entrada de interés debe ser pequeño (normalmente, uno o dos), por lo que las características de entrada de interés suelen elegirse entre las más importantes.

source: The figure below shows two one-way and one two-way partial dependence plots for the California housing dataset, with a :class:`HistGradientBoostingRegressor <sklearn.ensemble.HistGradientBoostingRegressor>`:
es_es: La siguiente figura muestra dos gráficos de dependencia parcial unidireccionales y uno bidireccional para el conjunto de datos de viviendas de California, con un :class:`HistGradientBoostingRegressor <sklearn.ensemble.HistGradientBoostingRegressor>`:

source: One-way PDPs tell us about the interaction between the target response and an input feature of interest feature (e.g. linear, non-linear). The left plot in the above figure shows the effect of the average occupancy on the median house price; we can clearly see a linear relationship among them when the average occupancy is inferior to 3 persons. Similarly, we could analyze the effect of the house age on the median house price (middle plot). Thus, these interpretations are marginal, considering a feature at a time.
es_es: Los PDP unidireccionales nos informan de la interacción entre la respuesta objetivo y una característica de entrada de interés (por ejemplo, lineal, no lineal). El gráfico de la izquierda de la figura anterior muestra el efecto de la ocupación promedio sobre el precio medio de la vivienda; podemos ver claramente una relación lineal entre ellos cuando la ocupación promedio es inferior a 3 personas. Del mismo modo, podríamos analizar el efecto de la edad de la vivienda sobre el precio medio de la misma (gráfico central). Así pues, estas interpretaciones son marginales, considerando una característica a la vez.

source: PDPs with two input features of interest show the interactions among the two features. For example, the two-variable PDP in the above figure shows the dependence of median house price on joint values of house age and average occupants per household. We can clearly see an interaction between the two features: for an average occupancy greater than two, the house price is nearly independent of the house age, whereas for values less than 2 there is a strong dependence on age.
es_es: Los PDP con dos características de entrada de interés muestran las interacciones entre las dos características. Por ejemplo, los PDP con dos variables en la figura anterior muestra la dependencia del precio medio de la vivienda de los valores conjuntos de la edad de la vivienda y de los ocupantes promedio por hogar. Podemos ver claramente una interacción entre las dos características: para una ocupación promedio mayor que dos, el precio de la vivienda es casi independiente de la edad de la casa, mientras que para los valores menores que 2 hay una fuerte dependencia de la edad.

source: The :mod:`sklearn.inspection` module provides a convenience function :func:`plot_partial_dependence` to create one-way and two-way partial dependence plots. In the below example we show how to create a grid of partial dependence plots: two one-way PDPs for the features ``0`` and ``1`` and a two-way PDP between the two features::
es_es: El módulo :mod:`sklearn.inspection` proporciona una función de conveniencia :func:`plot_partial_dependence` para crear gráficos de dependencia parcial unidireccional y bidireccional. En el siguiente ejemplo se muestra cómo crear una cuadrícula de gráficos de dependencia parcial: dos PDP unidereccional para las características ``0`` y ``1`` y un PDP bidireccionales entre las dos características::

source: You can access the newly created figure and Axes objects using ``plt.gcf()`` and ``plt.gca()``.
es_es: Puedes acceder a los objetos figura y Ejes recién creados utilizando ``plt.gcf()`` y ``plt.gca()``.

source: For multi-class classification, you need to set the class label for which the PDPs should be created via the ``target`` argument::
es_es: Para la clasificación multiclase, es necesario establecer la etiqueta de clase para la que deben crearse los PDF mediante el argumento ``target``::

source: The same parameter ``target`` is used to specify the target in multi-output regression settings.
es_es: El mismo parámetro ``target`` se utiliza para especificar el objetivo en las configuraciones de la regresión de salida múltiple.

source: If you need the raw values of the partial dependence function rather than the plots, you can use the :func:`sklearn.inspection.partial_dependence` function::
es_es: Si necesitas los valores en bruto de la función de dependencia parcial en lugar de los gráficos, puedes utilizar la función :func:`sklearn.inspection.partial_dependence`::

source: The values at which the partial dependence should be evaluated are directly generated from ``X``. For 2-way partial dependence, a 2D-grid of values is generated. The ``values`` field returned by :func:`sklearn.inspection.partial_dependence` gives the actual values used in the grid for each input feature of interest. They also correspond to the axis of the plots.
es_es: Los valores en los que debe evaluarse la dependencia parcial se generan directamente a partir de ``X``. Para la dependencia parcial bidireccional, se genera una cuadrícula 2D de valores. El campo ``values`` devuelto por :func:`sklearn.inspection. artial_dependence` da los valores reales utilizados en la cuadrícula para cada característica de entrada de interés. También corresponden al eje de los gráficos.

source: Individual conditional expectation (ICE) plot
es_es: Gráfico de expectativas condicionales individuales (Individual conditional expectation, ICE)

source: Similar to a PDP, an individual conditional expectation (ICE) plot shows the dependence between the target function and an input feature of interest. However, unlike a PDP, which shows the average effect of the input feature, an ICE plot visualizes the dependence of the prediction on a feature for each sample separately with one line per sample. Due to the limits of human perception, only one input feature of interest is supported for ICE plots.
es_es: De forma similar a los PDP, un gráfico de expectativas condicionales individuales (ICE) muestra la dependencia entre la función objetivo y una característica de entrada de interés. Sin embargo, a diferencia de un PDP, que muestra el efecto promedio de la característica de entrada, un gráfico ICE visualiza la dependencia de la predicción de una característica para cada muestra por separado con una línea por muestra. Debido a los límites de la percepción humana, sólo se admite una característica de entrada de interés para los gráficos de ICE.

source: The figures below show four ICE plots for the California housing dataset, with a :class:`HistGradientBoostingRegressor <sklearn.ensemble.HistGradientBoostingRegressor>`. The second figure plots the corresponding PD line overlaid on ICE lines.
es_es: Las siguientes figuras muestran cuatro gráficos de ICE para el conjunto de datos de viviendas de California, con un :class:`HistGradientBoostingRegressor <sklearn.ensemble.HistGradientBoostingRegressor>`. La segunda figura muestra la línea PD correspondiente a las líneas de ICE.

source: While the PDPs are good at showing the average effect of the target features, they can obscure a heterogeneous relationship created by interactions. When interactions are present the ICE plot will provide many more insights. For example, we could observe a linear relationship between the median income and the house price in the PD line. However, the ICE lines show that there are some exceptions, where the house price remains constant in some ranges of the median income.
es_es: Mientras que los PDP son buenos para mostrar el efecto promedio de las características objetivo, pueden ocultar una relación heterogénea creada por las interacciones. Cuando las interacciones están presentes, el gráfico de ICE proporcionará muchas más perspectivas. Por ejemplo, podríamos observar una relación lineal entre la renta media y el precio de la vivienda en la línea PD. Sin embargo, las líneas ICE muestran que hay algunas excepciones, en las que el precio de la vivienda permanece constante en algunos rangos de la renta media.

source: The :mod:`sklearn.inspection` module's :func:`plot_partial_dependence` convenience function can be used to create ICE plots by setting ``kind='individual'``. In the example below, we show how to create a grid of ICE plots:
es_es: La función de conveniencia :func:`plot_partial_dependence` del módulo :mod:`sklearn.inspection` puede utilizarse para crear gráficos de ICE estableciendo ``kind='individual'``. En el siguiente ejemplo, te mostramos cómo crear una cuadrícula de gráficos de ICE:

source: In ICE plots it might not be easy to see the average effect of the input feature of interest. Hence, it is recommended to use ICE plots alongside PDPs. They can be plotted together with ``kind='both'``.
es_es: En los gráficos de ICE tal vez no sea fácil ver el efecto promedio de la característica de entrada de interés. Por lo tanto, se recomienda utilizar los gráficos ICE junto con los PDP. Pueden trazarse juntos con ``kind='both'``.

source: Mathematical Definition
es_es: Definición Matemática

source: Let :math:`X_S` be the set of input features of interest (i.e. the `features` parameter) and let :math:`X_C` be its complement.
es_es: Sea :math:`X_S` el conjunto de características de entradas de interés (es decir, el parámetro `features`) y sea :math:`X_C` su complemento.

source: The partial dependence of the response :math:`f` at a point :math:`x_S` is defined as:
es_es: La dependencia parcial de la respuesta :math:`f` en un punto :math:`x_S` se define como:

source: where :math:`f(x_S, x_C)` is the response function (:term:`predict`, :term:`predict_proba` or :term:`decision_function`) for a given sample whose values are defined by :math:`x_S` for the features in :math:`X_S`, and by :math:`x_C` for the features in :math:`X_C`. Note that :math:`x_S` and :math:`x_C` may be tuples.
es_es: donde :math:`f(x_S, x_C)` es la función de respuesta (:term:`predict`, :term:`predict_proba` o :term:`decision_function`) para una muestra dada cuyos valores están definidos por :math:`x_S` para las características en :math:`X_S`, y por :math:`x_C` para las características en :math:`X_C`. Ten en cuenta que :math:`x_S` y :math:`x_C` pueden ser tuplas.

source: Computing this integral for various values of :math:`x_S` produces a PDP plot as above. An ICE line is defined as a single :math:`f(x_{S}, x_{C}^{(i)})` evaluated at :math:`x_{S}`.
es_es: El cálculo de esta integral para varios valores de :math:`x_S` produce un gráfico PDP como el de arriba. Una línea ICE se define como un solo :math:`f(x_{S}, x_{C}^{(i)})` evaluado en :math:`x_{S}`.

source: Computation methods
es_es: Métodos de cálculo

source: There are two main methods to approximate the integral above, namely the 'brute' and 'recursion' methods. The `method` parameter controls which method to use.
es_es: Hay dos métodos principales para aproximar la integral anterior, a saber, los métodos 'brute' y 'recursión'. El parámetro `method` controla el método a utilizar.

source: The 'brute' method is a generic method that works with any estimator. Note that computing ICE plots is only supported with the 'brute' method. It approximates the above integral by computing an average over the data `X`:
es_es: El método 'brute' es un método genérico que funciona con cualquier estimador. Ten en cuenta que el cálculo de los gráficos ICE sólo es posible con el método 'brute'. Aproxima la integral anterior calculando un promedio sobre los datos `X`:

source: where :math:`x_C^{(i)}` is the value of the i-th sample for the features in :math:`X_C`. For each value of :math:`x_S`, this method requires a full pass over the dataset `X` which is computationally intensive.
es_es: donde :math:`x_C^{(i)}` es valor de la i-ésima muestra para las características en :math:`X_C`. Para cada valor de :math:`x_S`, este método requiere una pasada completa por el conjunto de datos `X` lo cual es intensivo computacionalmente.

source: Each of the :math:`f(x_{S}, x_{C}^{(i)})` corresponds to one ICE line evaluated at :math:`x_{S}`. Computing this for multiple values of :math:`x_{S}`, one obtains a full ICE line. As one can see, the average of the ICE lines correspond to the partial dependence line.
es_es: Cada uno de las :math:`f(x_{S}, x_{C}^{(i)})` corresponde a una línea ICE evaluada en :math:`x_{S}`. Calculando esto para múltiples valores de :math:`x_{S}`, se obtiene una línea ICE completa. Como se puede ver, el promedio de las líneas ICE corresponde a la línea de dependencia parcial.

source: The 'recursion' method is faster than the 'brute' method, but it is only supported for PDP plots by some tree-based estimators. It is computed as follows. For a given point :math:`x_S`, a weighted tree traversal is performed: if a split node involves an input feature of interest, the corresponding left or right branch is followed; otherwise both branches are followed, each branch being weighted by the fraction of training samples that entered that branch. Finally, the partial dependence is given by a weighted average of all the visited leaves values.
es_es: El método 'recursion' es más rápido que el método 'brute', pero sólo admite para los gráficos PDP mediante algunos estimadores basados en árboles. Se calcula como sigue. Para un punto dado :math:`x_S`, se realiza un recorrido a un árbol ponderado: si un nodo dividido involucra una característica de entrada de interés, se sigue la rama izquierda o derecha correspondiente; de lo contrario, se siguen ambas ramas, cada rama siendo ponderada por la fracción de muestras de entrenamiento que entraron en esa rama. Por último, la dependencia parcial viene dada por un promedio ponderado de todos los valores de las hojas visitadas.

source: With the 'brute' method, the parameter `X` is used both for generating the grid of values :math:`x_S` and the complement feature values :math:`x_C`. However with the 'recursion' method, `X` is only used for the grid values: implicitly, the :math:`x_C` values are those of the training data.
es_es: Con el método 'brute', el parámetro `X` se utiliza tanto para generar la cuadrícula de valores :math:`x_S` como los valores de características del complemento :math:`x_C`. Sin embargo, con el método 'recursion', `X` sólo se utiliza para los valores de la cuadrícula: implícitamente, los valores :math:`x_C` son los de los datos de entrenamiento.

source: By default, the 'recursion' method is used for plotting PDPs on tree-based estimators that support it, and 'brute' is used for the rest.
es_es: Por defecto, el método 'recursion' es utilizado para graficar los PDP en los estimadores basados en un árbol que lo admiten, y 'brute' se utiliza para el resto.

source: While both methods should be close in general, they might differ in some specific settings. The 'brute' method assumes the existence of the data points :math:`(x_S, x_C^{(i)})`. When the features are correlated, such artificial samples may have a very low probability mass. The 'brute' and 'recursion' methods will likely disagree regarding the value of the partial dependence, because they will treat these unlikely samples differently. Remember, however, that the primary assumption for interpreting PDPs is that the features should be independent.
es_es: Aunque ambos métodos deberían ser parecidos en general, podrían diferir en algunos ajustes específicos. El método 'brute' asume la existencia de los puntos de datos :math:`(x_S, x_C^{(i)})`. Cuando las características están correlacionadas, estas muestras artificiales pueden tener una masa de probabilidad muy baja. Los métodos 'brute' y 'recursion' probablemente no estén de acuerdo con el valor de la dependencia parcial, porque tratarán estas poco probables muestras de forma diferente. Recuerda, sin embargo, que la suposición principal para interpretar los PDP es que las características deben ser independientes.

source: Footnotes
es_es: Notas al pie de página

source: For classification, the target response may be the probability of a class (the positive class for binary classification), or the decision function.
es_es: Para la clasificación, la respuesta objetivo puede ser la probabilidad de una clase (la clase positiva para la clasificación binaria), o la función de decisión.

source: References
es_es: Referencias

source: T. Hastie, R. Tibshirani and J. Friedman, `The Elements of Statistical Learning <https://web.stanford.edu/~hastie/ElemStatLearn//>`_, Second Edition, Section 10.13.2, Springer, 2009.
es_es: T. Hastie, R. Tibshirani y J. Friedman, `The Elements of Statistical Learning <https://web.stanford.edu/~hastie/ElemStatLearn//>`_, segunda edición, sección 10.13.2, Springer, 2009.

source: C. Molnar, `Interpretable Machine Learning <https://christophm.github.io/interpretable-ml-book/>`_, Section 5.1, 2019.
es_es: C. Molnar, `Interpretable Machine Learning <https://christophm.github.io/interpretable-ml-book/>`_, Sección 5.1, 2019.

source: A. Goldstein, A. Kapelner, J. Bleich, and E. Pitkin, `Peeking Inside the Black Box: Visualizing Statistical Learning With Plots of Individual Conditional Expectation <https://arxiv.org/abs/1309.6392>`_, Journal of Computational and Graphical Statistics, 24(1): 44-65, Springer, 2015.
es_es: A. Goldstein, A. Kapelner, J. Bleich y E. Pitkin, `Peeking Inside the Black Box: Visualizing Statistical Learning With Plots of Individual Conditional Expectation <https://arxiv.org/abs/1309.6392>`_, Journal of Computational and Graphical Statistics, 24(1): 44-65, Springer, 2015.
