Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/preprocessing_targets.po
Languages: es_es

source: Transforming the prediction target (``y``)
es_es: Transformación del objetivo de predicción (``y``)

source: These are transformers that are not intended to be used on features, only on supervised learning targets. See also :ref:`transformed_target_regressor` if you want to transform the prediction target for learning, but evaluate the model in the original (untransformed) space.
es_es: Estos son transformadores que no están destinados a ser utilizados en características, sólo en objetivos de aprendizaje supervisado. Consulta también :ref:`transformed_target_regressor` si deseas transformar el objetivo de predicción para el aprendizaje, pero evalúa el modelo en el espacio original (sin transformar).

source: Label binarization
es_es: Binarización de etiquetas

source: :class:`LabelBinarizer` is a utility class to help create a :term:`label indicator matrix` from a list of :term:`multiclass` labels::
es_es: :class:`LabelBinarizer` es una clase de utilidad que ayuda a crear una :term:`matriz indicatriz de etiqueta` de una lista de etiquetas :term:`multiclase`::

source: Using this format can enable multiclass classification in estimators that support the label indicator matrix format.
es_es: El uso de este formato puede permitir la clasificación multiclase en estimadores que admiten el formato de matriz indicatriz de etiqueta.

source: LabelBinarizer is not needed if you are using an estimator that already supports :term:`multiclass` data.
es_es: LabelBinarizer no es necesario si estás usando un estimador que ya soporta datos :term:`multiclase`.

source: For more information about multiclass classification, refer to :ref:`multiclass_classification`.
es_es: Para más información sobre clasificación multiclase, consulta :ref:`multiclass_classification`.

source: In :term:`multilabel` learning, the joint set of binary classification tasks is expressed with a label binary indicator array: each sample is one row of a 2d array of shape (n_samples, n_classes) with binary values where the one, i.e. the non zero elements, corresponds to the subset of labels for that sample. An array such as ``np.array([[1, 0, 0], [0, 1, 1], [0, 0, 0]])`` represents label 0 in the first sample, labels 1 and 2 in the second sample, and no labels in the third sample.
es_es: En el aprendizaje :term:`multietiqueta`, el conjunto de unión de tareas de clasificación binaria se expresa con un arreglo de indicadores binarios de etiquetas: cada muestra es una fila de un arreglo 2d de forma (n_muestras, n_clases) con valores binarios donde el uno, es decir, los elementos no nulos, corresponden al subconjunto de etiquetas para esa muestra. Un arreglo como ``np.array([[1, 0, 0], [0, 1, 1], [0, 0, 0]])`` representa la etiqueta 0 en la primera muestra, las etiquetas 1 y 2 en la segunda muestra, y ninguna etiqueta en la tercera muestra.

source: Producing multilabel data as a list of sets of labels may be more intuitive. The :class:`MultiLabelBinarizer <sklearn.preprocessing.MultiLabelBinarizer>` transformer can be used to convert between a collection of collections of labels and the indicator format::
es_es: Producir datos multietiqueta como una lista de conjuntos de etiquetas puede ser más intuitivo. El transformador :class:`MultiLabelBinarizer <sklearn.preprocessing.MultiLabelBinarizer>` puede utilizarse para convertir entre una colección de conjuntos de etiquetas y el formato indicador::

source: For more information about multilabel classification, refer to :ref:`multilabel_classification`.
es_es: Para más información sobre clasificación multietiqueta, consulta :ref:`multilabel_classification`.

source: Label encoding
es_es: Codificación de etiquetas

source: :class:`LabelEncoder` is a utility class to help normalize labels such that they contain only values between 0 and n_classes-1. This is sometimes useful for writing efficient Cython routines. :class:`LabelEncoder` can be used as follows::
es_es: :class:`LabelEncoder` es una clase de utilidad para ayudar a normalizar las etiquetas de manera que sólo contengan valores entre 0 y n_clases-1. Esto a veces es útil para escribir rutinas eficientes de Cython. :class:`LabelEncoder` puede utilizarse como sigue::

source: It can also be used to transform non-numerical labels (as long as they are hashable and comparable) to numerical labels::
es_es: También puede utilizarse para transformar etiquetas no numéricas (siempre que sean hashables y comparables) a etiquetas numéricas::
