Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/preprocessing.po
Languages: es_es

source: Preprocessing data
es_es: Preprocesamiento de los datos

source: The ``sklearn.preprocessing`` package provides several common utility functions and transformer classes to change raw feature vectors into a representation that is more suitable for the downstream estimators.
es_es: El paquete ``sklearn.preprocessing`` proporciona varias funciones de utilidad comunes y clases transformadoras para cambiar los vectores de características en bruto a una representación que sea más adecuada para los estimadores posteriores.

source: In general, learning algorithms benefit from standardization of the data set. If some outliers are present in the set, robust scalers or transformers are more appropriate. The behaviors of the different scalers, transformers, and normalizers on a dataset containing marginal outliers is highlighted in :ref:`sphx_glr_auto_examples_preprocessing_plot_all_scaling.py`.
es_es: En general, los algoritmos de aprendizaje se benefician de la estandarización del conjunto de datos. Si hay algunos valores atípicos presentes en el conjunto, los escaladores robustos o transformadores son más apropiados. Los comportamientos de los diferentes escaladores, transformadores y normalizadores en un conjunto de datos que contiene valores atípicos marginales se resaltan en :ref:`sphx_glr_auto_examples_preprocessing_plot_all_scaling.py`.

source: Standardization, or mean removal and variance scaling
es_es: Estandarización, o eliminación media y escala de varianza

source: **Standardization** of datasets is a **common requirement for many machine learning estimators** implemented in scikit-learn; they might behave badly if the individual features do not more or less look like standard normally distributed data: Gaussian with **zero mean and unit variance**.
es_es: La **Estandarización** de conjuntos de datos es un **requisito común para muchos estimadores de aprendizaje automático** implementados en scikit-learn; podrían comportarse mal si las características individuales no se ven más o menos como datos distribuidos normalmente estándar: Gaussiana con **media cero y varianza unitaria**.

source: In practice we often ignore the shape of the distribution and just transform the data to center it by removing the mean value of each feature, then scale it by dividing non-constant features by their standard deviation.
es_es: En la práctica a menudo ignoramos la forma de la distribución y simplemente transformamos los datos para centrarlos eliminando el valor medio de cada característica, luego los escalamos dividiendo características no constantes por su desviación estándar.

source: For instance, many elements used in the objective function of a learning algorithm (such as the RBF kernel of Support Vector Machines or the l1 and l2 regularizers of linear models) assume that all features are centered around zero and have variance in the same order. If a feature has a variance that is orders of magnitude larger than others, it might dominate the objective function and make the estimator unable to learn from other features correctly as expected.
es_es: Por ejemplo, muchos elementos utilizados en la función objetivo de un algoritmo de aprendizaje (como el kernel RBF de Máquinas de Vectores de Soporte o los regularizadores l1 y l2 de modelos lineales) asumen que todas las características están centradas en cero y tienen varianza del mismo orden. Si una característica tiene varianza de un orden de magnitud mayor que otras, podría dominar la función objetivo y hacer que el estimador no pueda aprender de otras características correctamente como se esperaba.

source: The :mod:`~sklearn.preprocessing` module provides the :class:`StandardScaler` utility class, which is a quick and easy way to perform the following operation on an array-like dataset::
es_es: El módulo :mod:`~sklearn.preprocessing` proporciona la clase de utilidad :class:`StandardScaler`, que es una forma rápida y sencilla de realizar la siguiente operación en un conjunto de datos array-like::

source: Scaled data has zero mean and unit variance::
es_es: Los datos escalados tienen una media cero y varianza unitaria::

source: This class implements the ``Transformer`` API to compute the mean and standard deviation on a training set so as to be able to later re-apply the same transformation on the testing set. This class is hence suitable for use in the early steps of a :class:`~sklearn.pipeline.Pipeline`::
es_es: Esta clase implementa la API ``Transformer`` para calcular la media y la desviación estándar en un conjunto de entrenamiento para poder volver a aplicar posteriormente la misma transformación en el conjunto de prueba. Esta clase es, por lo tanto, adecuada para su uso en los primeros pasos de un :class:`~sklearn.pipeline.Pipeline`::

source: It is possible to disable either centering or scaling by either passing ``with_mean=False`` or ``with_std=False`` to the constructor of :class:`StandardScaler`.
es_es: Es posible desactivar el centrado o el escalado pasando ``with_mean=False`` o ``with_std=False`` al constructor de :class:`StandardScaler`.

source: Scaling features to a range
es_es: Escalamiento de las características a un rango

source: An alternative standardization is scaling features to lie between a given minimum and maximum value, often between zero and one, or so that the maximum absolute value of each feature is scaled to unit size. This can be achieved using :class:`MinMaxScaler` or :class:`MaxAbsScaler`, respectively.
es_es: Una estandarización alternativa es el escalamiento de características para que se sitúen entre un valor mínimo y máximo determinado, a menudo entre cero y uno, o para que el valor absoluto máximo de cada característica se escalado al tamaño unitario. Esto puede lograrse utilizando :class:`MinMaxScaler` o :class:`MaxAbsScaler`, respectivamente.

source: The motivation to use this scaling include robustness to very small standard deviations of features and preserving zero entries in sparse data.
es_es: La motivación para utilizar esta escala incluye robustez ante desviaciones estándar muy pequeñas de las características y preservando las entradas cero en los datos dispersos.

source: Here is an example to scale a toy data matrix to the ``[0, 1]`` range::
es_es: Aquí hay un ejemplo para escalar una matriz de datos de juguete al rango ``[0, 1]``::

source: The same instance of the transformer can then be applied to some new test data unseen during the fit call: the same scaling and shifting operations will be applied to be consistent with the transformation performed on the train data::
es_es: La misma instancia del transformador puede aplicarse a unos nuevos datos de prueba no vistos durante el llamado de ajuste: se aplicarán las mismas operaciones de escalamiento y desplazamiento para ser coherentes con la transformación realizada en los datos de entrenamiento::

source: It is possible to introspect the scaler attributes to find about the exact nature of the transformation learned on the training data::
es_es: Es posible inspeccionar los atributos del escalador para encontrar la naturaleza exacta de la transformación aprendida en los datos de entrenamiento::

source: If :class:`MinMaxScaler` is given an explicit ``feature_range=(min, max)`` the full formula is::
es_es: Si a :class:`MinMaxScaler` se le da un ``feature_range=(min, max)`` explícito la fórmula completa es::

source: :class:`MaxAbsScaler` works in a very similar fashion, but scales in a way that the training data lies within the range ``[-1, 1]`` by dividing through the largest maximum value in each feature. It is meant for data that is already centered at zero or sparse data.
es_es: :class:`MaxAbsScaler` funciona de una manera muy similar, pero escala de una manera que los datos de entrenamiento se encuentran dentro del rango ``[-1, 1]`` dividiendo entre el valor máximo más grande en cada característica. Está pensado para datos que ya están centrados en cero o datos dispersos.

source: Here is how to use the toy data from the previous example with this scaler::
es_es: Aquí está cómo utilizar los datos de juguete del ejemplo anterior con este escalador::

source: Scaling sparse data
es_es: Escalamiento de datos dispersos

source: Centering sparse data would destroy the sparseness structure in the data, and thus rarely is a sensible thing to do. However, it can make sense to scale sparse inputs, especially if features are on different scales.
es_es: Centrar datos dispersos destruiría la estructura de dispersión en los datos, por lo que rara vez es algo sensato para hacer. Sin embargo, puede tener sentido escalar las entradas dispersas, especialmente si las características están en diferentes escalas.

source: :class:`MaxAbsScaler` was specifically designed for scaling sparse data, and is the recommended way to go about this. However, :class:`StandardScaler` can accept ``scipy.sparse`` matrices as input, as long as ``with_mean=False`` is explicitly passed to the constructor. Otherwise a ``ValueError`` will be raised as silently centering would break the sparsity and would often crash the execution by allocating excessive amounts of memory unintentionally. :class:`RobustScaler` cannot be fitted to sparse inputs, but you can use the ``transform`` method on sparse inputs.
es_es: :class:`MaxAbsScaler` fue diseñado específicamente para el escalamiento de datos dispersos, y es la forma recomendada de hacerlo. Sin embargo, :class:`StandardScaler` puede aceptar matrices ``scipy.sparse`` como entrada, siempre que se pase explícitamente ``with_mean=False`` al constructor. De lo contrario, se producirá un ``ValueError`` ya que el centrado silencioso rompería la dispersión y a menudo bloquearía la ejecución al asignar involuntariamente cantidades excesivas de memoria. :class:`RobustScaler` no puede ajustarse a entradas dispersas, pero puede utilizar el método ``transform`` en entradas dispersas.

source: Note that the scalers accept both Compressed Sparse Rows and Compressed Sparse Columns format (see ``scipy.sparse.csr_matrix`` and ``scipy.sparse.csc_matrix``). Any other sparse input will be **converted to the Compressed Sparse Rows representation**. To avoid unnecessary memory copies, it is recommended to choose the CSR or CSC representation upstream.
es_es: Ten en cuenta que los escaladores aceptan tanto el formato de Filas Dispersas Comprimidas (CSR) como el formato de Columnas Dispersas Comprimidas (CSC) (ver ``scipy.sparse.csr_matrix`` y ``scipy.sparse.csc_matrix``). Cualquier otra entrada dispersa será **convertida a la representación Filas Dispersas Comprimidas**. Para evitar copias de memoria innecesarias, se recomienda elegir la representación CSR o CSC en la parte superior.

source: Finally, if the centered data is expected to be small enough, explicitly converting the input to an array using the ``toarray`` method of sparse matrices is another option.
es_es: Por último, si se espera que los datos centrados sean lo suficientemente pequeños, otra opción es convertir explícitamente la entrada en un arreglo utilizando el método ``toarray`` de matrices dispersas.

source: Scaling data with outliers
es_es: Escalamiento de datos con valores atípicos

source: If your data contains many outliers, scaling using the mean and variance of the data is likely to not work very well. In these cases, you can use :class:`RobustScaler` as a drop-in replacement instead. It uses more robust estimates for the center and range of your data.
es_es: Si tus datos contienen muchos valores atípicos, es probable que el escalamiento utilizando la media y la varianza de los datos no funcione muy bien. En estos casos, puedes utilizar :class:`RobustScaler` como reemplazo. Este utiliza estimaciones más robustas para el centrado y el rango de tus datos.

source: References:
es_es: Referencias:

source: Further discussion on the importance of centering and scaling data is available on this FAQ: `Should I normalize/standardize/rescale the data? <http://www.faqs.org/faqs/ai-faq/neural-nets/part2/section-16.html>`_
es_es: Más información sobre la importancia del centrado y escalamiento de los datos está disponible en este FAQ:`Should I normalize/standardize/rescale the data? <http://www.faqs.org/faqs/ai-faq/neural-nets/part2/section-16.html>`_

source: Scaling vs Whitening
es_es: Escalamiento vs Whitening

source: It is sometimes not enough to center and scale the features independently, since a downstream model can further make some assumption on the linear independence of the features.
es_es: A veces no es suficiente con centrar y escalar las características de forma independiente, ya que un modelo posterior puede hacer alguna suposición sobre la independencia lineal de las características.

source: To address this issue you can use :class:`~sklearn.decomposition.PCA` with ``whiten=True`` to further remove the linear correlation across features.
es_es: Para solucionar este problema se puede utilizar :class:`~sklearn.decomposition.PCA` con ``whiten=True`` para eliminar aún más la correlación lineal entre las características.

source: Centering kernel matrices
es_es: Centrado de matrices del kernel

source: If you have a kernel matrix of a kernel :math:`K` that computes a dot product in a feature space defined by function :math:`\phi`, a :class:`KernelCenterer` can transform the kernel matrix so that it contains inner products in the feature space defined by :math:`\phi` followed by removal of the mean in that space.
es_es: Si tienes una matriz de kernel de un kernel :math:`K` que calcula un producto punto en un espacio de características definido por la función :math:`\phi`, un :class:`KernelCenterer` puede transformar la matriz de kernel para que contenga productos internos en el espacio de características definido por :math:`\phi` seguido de la eliminación de la media en ese espacio.

source: Non-linear transformation
es_es: Transformación no lineal

source: Two types of transformations are available: quantile transforms and power transforms. Both quantile and power transforms are based on monotonic transformations of the features and thus preserve the rank of the values along each feature.
es_es: Hay dos tipos de transformaciones disponibles: las transformaciones de cuantiles y las transformaciones de potencia. Tanto las transformaciones de cuantiles como las de potencia se basan en transformaciones monótonas de las características y, por tanto, preservan el rango de los valores a lo largo de cada característica.

source: Quantile transforms put all features into the same desired distribution based on the formula :math:`G^{-1}(F(X))` where :math:`F` is the cumulative distribution function of the feature and :math:`G^{-1}` the `quantile function <https://en.wikipedia.org/wiki/Quantile_function>`_ of the desired output distribution :math:`G`. This formula is using the two following facts: (i) if :math:`X` is a random variable with a continuous cumulative distribution function :math:`F` then :math:`F(X)` is uniformly distributed on :math:`[0,1]`; (ii) if :math:`U` is a random variable with uniform distribution on :math:`[0,1]` then :math:`G^{-1}(U)` has distribution :math:`G`. By performing a rank transformation, a quantile transform smooths out unusual distributions and is less influenced by outliers than scaling methods. It does, however, distort correlations and distances within and across features.
es_es: Las transformaciones de cuantiles ponen todas las características en la misma distribución deseada basándose en la fórmula :math:`G^{-1}(F(X))` donde :math:`F` es la función de distribución acumulada de la característica y :math:`G^{-1}` la `función cuantil <https://en.wikipedia.org/wiki/Quantile_function>`_ de la distribución de salida deseada :math:`G`. Esta fórmula utiliza los dos siguientes hechos: (i) si :math:`X` es una variable aleatoria con una función de distribución acumulada continua :math:`F`, entonces :math:`F(X)` se distribuye uniformemente en :math:`[0, 1]`; (ii) si :math:`U` es una variable aleatoria con distribución uniforme en :math:`[0, 1]` entonces :math:`G^{-1}(U)` tiene distribución :math:`G`. Al realizar una transformación de rango, una transformación de cuantil suaviza las distribuciones inusuales y está menos influenciada por los valores atípicos que los métodos de escalamiento. Sin embargo, distorsiona las correlaciones y distancias dentro y entre características.

source: Power transforms are a family of parametric transformations that aim to map data from any distribution to as close to a Gaussian distribution.
es_es: Las transformaciones de potencia son una familia de transformaciones paramétricas cuyo objetivo es mapear datos de cualquier distribución a lo más parecido a una Distribución Gaussiana.

source: Mapping to a Uniform distribution
es_es: Mapeo a una Distribución Uniforme

source: :class:`QuantileTransformer` provides a non-parametric transformation to map the data to a uniform distribution with values between 0 and 1::
es_es: :class:`QuantileTransformer` proporciona una transformación no paramétrica para mapear los datos a una distribución uniforme con valores entre 0 y 1::

source: This feature corresponds to the sepal length in cm. Once the quantile transformation applied, those landmarks approach closely the percentiles previously defined::
es_es: Esta característica corresponde a la longitud del sépalo en cm. Una vez aplicada la transformación de cuantiles, esos hitos se acercan estrechamente a los percentiles definidos anteriormente::

source: This can be confirmed on a independent testing set with similar remarks::
es_es: Esto puede confirmarse en un conjunto de pruebas independientes con observaciones similares::

source: Mapping to a Gaussian distribution
es_es: Mapeo a una Distribución Gaussiana

source: In many modeling scenarios, normality of the features in a dataset is desirable. Power transforms are a family of parametric, monotonic transformations that aim to map data from any distribution to as close to a Gaussian distribution as possible in order to stabilize variance and minimize skewness.
es_es: En muchos escenarios de modelado, es deseable la normalidad de las características de un conjunto de datos. Las transformaciones de potencia son una familia de transformaciones paramétricas y monótonas cuyo objetivo es mapear los datos de cualquier distribución a una distribución lo más cercana posible a una distribución Gaussiana con el fin de estabilizar la varianza y minimizar la asimetría.

source: :class:`PowerTransformer` currently provides two such power transformations, the Yeo-Johnson transform and the Box-Cox transform.
es_es: :class:`PowerTransformer` actualmente proporciona dos transformaciones de potencia de este tipo, la transformación Yeo-Johnson y la transformación Box-Cox.

source: The Yeo-Johnson transform is given by:
es_es: La transformación Yeo-Johnson viene dada por:

source: while the Box-Cox transform is given by:
es_es: mientras que la transformación Box-Cox viene dada por:

source: Box-Cox can only be applied to strictly positive data. In both methods, the transformation is parameterized by :math:`\lambda`, which is determined through maximum likelihood estimation. Here is an example of using Box-Cox to map samples drawn from a lognormal distribution to a normal distribution::
es_es: Box-Cox sólo puede aplicarse a datos estrictamente positivos. En ambos métodos, la transformación está parametrizada por :math:`\lambda`, que se determina a través de la estimación de máxima verosimilitud. Aquí hay un ejemplo de uso de Box-Cox para mapear muestras extraídas de una distribución lognormal a una distribución normal::

source: While the above example sets the `standardize` option to `False`, :class:`PowerTransformer` will apply zero-mean, unit-variance normalization to the transformed output by default.
es_es: Mientras que el ejemplo anterior establece la opción `standardize` en `False`, :class:`PowerTransformer` aplicará por defecto una normalización de media cero y varianza unitaria a la salida transformada.

source: Below are examples of Box-Cox and Yeo-Johnson applied to various probability distributions. Note that when applied to certain distributions, the power transforms achieve very Gaussian-like results, but with others, they are ineffective. This highlights the importance of visualizing the data before and after transformation.
es_es: A continuación se muestran ejemplos de Box-Cox y Yeo-Johnson aplicados a varias distribuciones de probabilidad. Ten en cuenta que cuando se aplican a ciertas distribuciones, las transformaciones de potencia consiguen resultados muy parecidos a los Gaussianos, pero con otras, son ineficaces. Esto resalta la importancia de visualizar los datos antes y después de la transformación.

source: It is also possible to map data to a normal distribution using :class:`QuantileTransformer` by setting ``output_distribution='normal'``. Using the earlier example with the iris dataset::
es_es: También es posible mapear los datos a una distribución normal usando :class:`QuantileTransformer` estableciendo ``output_distribution='normal'``. Utilizando el ejemplo anterior con el conjunto de datos iris::

source: Thus the median of the input becomes the mean of the output, centered at 0. The normal output is clipped so that the input's minimum and maximum --- corresponding to the 1e-7 and 1 - 1e-7 quantiles respectively --- do not become infinite under the transformation.
es_es: Así, la mediana de la entrada se convierte en la media de la salida, centrada en 0. La salida normal es recortada para que el mínimo y el máximo de la entrada --- correspondientes a las cantidades 1e-7 y 1 - 1e-7 respectivamente --- no se conviertan en infinitos bajo la transformación.

source: Normalization
es_es: Normalización

source: **Normalization** is the process of **scaling individual samples to have unit norm**. This process can be useful if you plan to use a quadratic form such as the dot-product or any other kernel to quantify the similarity of any pair of samples.
es_es: La **normalización** es el proceso de **escalamiento de muestras individuales para tener la norma unitaria**. Este proceso puede ser útil si planeas utilizar una forma cuadrática como el producto punto o cualquier otro kernel para cuantificar la similitud de cualquier par de muestras.

source: This assumption is the base of the `Vector Space Model <https://en.wikipedia.org/wiki/Vector_Space_Model>`_ often used in text classification and clustering contexts.
es_es: Este supuesto es la base del `Modelo de espacio vectorial <https://en.wikipedia.org/wiki/Vector_Space_Model>`_ utilizado a menudo en los contextos de clasificación y agrupamiento de textos.

source: The function :func:`normalize` provides a quick and easy way to perform this operation on a single array-like dataset, either using the ``l1``, ``l2``, or ``max`` norms::
es_es: La función :func:`normalize` proporciona una forma rápida y sencilla de realizar esta operación en un único conjunto de datos array-like, ya sea utilizando las normas ``l1``, ``l2`` o ``max``::

source: The ``preprocessing`` module further provides a utility class :class:`Normalizer` that implements the same operation using the ``Transformer`` API (even though the ``fit`` method is useless in this case: the class is stateless as this operation treats samples independently).
es_es: El módulo ``preprocessing`` proporciona además una clase de utilidad :class:`Normalizer` que implementa la misma operación utilizando la API ``Transformer`` (aunque el método ``fit`` es inútil en este caso: la clase no tiene estado ya que esta operación trata las muestras de forma independiente).
