Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/preprocessing.po
Languages: es_es

source: This class is hence suitable for use in the early steps of a :class:`~sklearn.pipeline.Pipeline`::
es_es: Esta clase es, por tanto, adecuada para su uso en los primeros pasos de un :class:`~sklearn.pipeline.Pipeline`::

source: The normalizer instance can then be used on sample vectors as any transformer::
es_es: La instancia del normalizador puede utilizarse en vectores de muestra como cualquier transformador::

source: Note: L2 normalization is also known as spatial sign preprocessing.
es_es: Nota: La normalización L2 también se conoce como preprocesamiento de signos espaciales.

source: Sparse input
es_es: Entrada dispersa

source: :func:`normalize` and :class:`Normalizer` accept **both dense array-like and sparse matrices from scipy.sparse as input**.
es_es: :func:`normalize` and :class:`Normalizer` aceptan **tanto array-like densos como matrices dispersas de scipy.sparse como entrada**.

source: For sparse input the data is **converted to the Compressed Sparse Rows representation** (see ``scipy.sparse.csr_matrix``) before being fed to efficient Cython routines. To avoid unnecessary memory copies, it is recommended to choose the CSR representation upstream.
es_es: Para la entrada dispersa los datos son **convertidos a la representación Filas Dispersas Comprimidas ** (ver scipy.sparse.csr_matrix) antes de ser alimentado a las rutinas eficientes de Cython. Para evitar copias de memoria innecesarias, se recomienda elegir la representación CSR de entrada.

source: Encoding categorical features
es_es: Codificación de características categóricas

source: Often features are not given as continuous values but categorical. For example a person could have features ``["male", "female"]``, ``["from Europe", "from US", "from Asia"]``, ``["uses Firefox", "uses Chrome", "uses Safari", "uses Internet Explorer"]``. Such features can be efficiently coded as integers, for instance ``["male", "from US", "uses Internet Explorer"]`` could be expressed as ``[0, 1, 3]`` while ``["female", "from Asia", "uses Chrome"]`` would be ``[1, 2, 1]``.
es_es: A menudo las características no se dan como valores continuos sino como categóricos. Por ejemplo, una persona podría tener características ``["male", "female"]``,``["from Europe", "from US", "from Asia"]``, ``["uses Firefox", "uses Chrome", "uses Safari", "uses Internet Explorer"]``. Estas características pueden codificarse eficazmente como enteros, por ejemplo ``["male", "from US", "uses Internet Explorer"]`` podría expresarse como ``[0, 1, 3]`` mientras que ``["female", "from Asia", "uses Chrome"]`` sería ``[1, 2, 1]``.

source: To convert categorical features to such integer codes, we can use the :class:`OrdinalEncoder`. This estimator transforms each categorical feature to one new feature of integers (0 to n_categories - 1)::
es_es: Para convertir características categóricas en dichos códigos de enteros, podemos utilizar el :class:`OrdinalEncoder`. Este estimador transforma cada característica categórica en una nueva característica de enteros (0 a n_categorías - 1)::

source: Such integer representation can, however, not be used directly with all scikit-learn estimators, as these expect continuous input, and would interpret the categories as being ordered, which is often not desired (i.e. the set of browsers was ordered arbitrarily).
es_es: Sin embargo, esta representación de números enteros no puede utilizarse directamente con todos los estimadores de scikit-learn, ya que éstos esperan una entrada continua, e interpretarían las categorías como si estuvieran ordenadas, lo que a menudo no se desea (es decir, el conjunto de navegadores se ordenó arbitrariamente).

source: Another possibility to convert categorical features to features that can be used with scikit-learn estimators is to use a one-of-K, also known as one-hot or dummy encoding. This type of encoding can be obtained with the :class:`OneHotEncoder`, which transforms each categorical feature with ``n_categories`` possible values into ``n_categories`` binary features, with one of them 1, and all others 0.
es_es: Otra posibilidad para convertir características categóricas en características que puedan ser utilizadas con los estimadores de scikit-learn es utilizar un one-of-K, también conocido como codificación one-hot o dummy. Este tipo de codificación se puede obtener con el :class:`OneHotEncoder`, que transforma cada característica categórica con ``n_categories`` posibles en ``n_categories`` con características binarias, una de ellas 1, y todas las demás 0.

source: Continuing the example above::
es_es: Continuando el ejemplo anterior::

source: By default, the values each feature can take is inferred automatically from the dataset and can be found in the ``categories_`` attribute::
es_es: Por defecto, los valores que puede tomar cada característica se infieren automáticamente del conjunto de datos y se pueden encontrar en el atributo ``categories_``::

source: It is possible to specify this explicitly using the parameter ``categories``. There are two genders, four possible continents and four web browsers in our dataset::
es_es: Es posible especificar esto explícitamente utilizando el parámetro ``categories`. En nuestro conjunto de datos hay dos géneros, cuatro continentes posibles y cuatro navegadores web::

source: If there is a possibility that the training data might have missing categorical features, it can often be better to specify ``handle_unknown='ignore'`` instead of setting the ``categories`` manually as above. When ``handle_unknown='ignore'`` is specified and unknown categories are encountered during transform, no error will be raised but the resulting one-hot encoded columns for this feature will be all zeros (``handle_unknown='ignore'`` is only supported for one-hot encoding)::
es_es: Si existe la posibilidad de que los datos de entrenamiento puedan tener características categóricas perdidas, a menudo puede ser mejor especificar ``handle_unknown='ignore'`` en lugar de establecer las ``categories`` manualmente como arriba. Cuando se especifica ``handle_unknown='ignore'`` y se encuentran categorías desconocidas durante la transformación, no se producirá ningún error, pero las columnas codificadas en one-hot para esta característica serán todos ceros (``handle_unknown='ignore'` sólo se admite para la codificación one-hot)::

source: It is also possible to encode each column into ``n_categories - 1`` columns instead of ``n_categories`` columns by using the ``drop`` parameter. This parameter allows the user to specify a category for each feature to be dropped. This is useful to avoid co-linearity in the input matrix in some classifiers. Such functionality is useful, for example, when using non-regularized regression (:class:`LinearRegression <sklearn.linear_model.LinearRegression>`), since co-linearity would cause the covariance matrix to be non-invertible. When this parameter is not None, ``handle_unknown`` must be set to ``error``::
es_es: También es posible codificar cada columna en ``n_categories - 1`` columnas en lugar de ``n_categories`` columnas usando el parámetro ``drop``. Este parámetro permite al usuario especificar una categoría para cada característica que se va a descartar. Esto es útil para evitar la colinealidad en la matriz de entrada en algunos clasificadores. Esta funcionalidad es útil, por ejemplo, cuando se utiliza una regresión no regularizada (:class:`LinearRegression <sklearn.linear_model.LinearRegression>`), ya que la colinealidad haría que la matriz de covarianzas no fuera invertible. Cuando este parámetro no None, ``handle_unknown`` debe establecerse como ``error``::

source: One might want to drop one of the two columns only for features with 2 categories. In this case, you can set the parameter `drop='if_binary'`.
es_es: Es posible que quieras eliminar una de las dos columnas sólo para las características con 2 categorías. En este caso, puedes establecer el parámetro `drop='if_binary'`.

source: In the transformed `X`, the first column is the encoding of the feature with categories "male"/"female", while the remaining 6 columns is the encoding of the 2 features with respectively 3 categories each.
es_es: En la transformada `X`, la primera columna es la codificación de la característica con las categorías "male"/"female", mientras que las 6 columnas restantes son la codificación de las 2 características con respectivamente 3 categorías cada una.

source: :class:`OneHotEncoder` supports categorical features with missing values by considering the missing values as an additional category::
es_es: :class:`OneHotEncoder` soporta características categóricas con valores faltantes considerando los valores faltantes como una categoría adicional::

source: If a feature contains both `np.nan` and `None`, they will be considered separate categories::
es_es: Si una característica contiene tanto `np.nan` como `None` se considerarán categorías separadas::

source: See :ref:`dict_feature_extraction` for categorical features that are represented as a dict, not as scalars.
es_es: Vea :ref:`dict_feature_extraction` para características categóricas que se representan como un diccionario, no como escalares.

source: Discretization
es_es: Discretización

source: `Discretization <https://en.wikipedia.org/wiki/Discretization_of_continuous_features>`_ (otherwise known as quantization or binning) provides a way to partition continuous features into discrete values. Certain datasets with continuous features may benefit from discretization, because discretization can transform the dataset of continuous attributes to one with only nominal attributes.
es_es: `Discretización <https://en.wikipedia.org/wiki/Discretization_of_continuous_features>`_ (también conocida como cuantificación o binning) proporciona una forma de dividir características continuas en valores discretos. Ciertos conjuntos de datos con características continuas pueden beneficiarse de la discretización, ya que ésta puede transformar el conjunto de datos de atributos continuos en uno con sólo atributos nominales.

source: One-hot encoded discretized features can make a model more expressive, while maintaining interpretability. For instance, pre-processing with a discretizer can introduce nonlinearity to linear models.
es_es: Las características discretizadas codificadas de One-hot pueden hacer que un modelo sea más expresivo, manteniendo al mismo tiempo la capacidad de interpretación. Por ejemplo, el preprocesamiento con un discretizador puede introducir la no linealidad en los modelos lineales.

source: K-bins discretization
es_es: Discretización K-clases o intervalos de clase

source: :class:`KBinsDiscretizer` discretizes features into ``k`` bins::
es_es: :class:`KBinsDiscretizer` discretiza las características en ``k`` intervalos de clases::

source: By default the output is one-hot encoded into a sparse matrix (See :ref:`preprocessing_categorical_features`) and this can be configured with the ``encode`` parameter. For each feature, the bin edges are computed during ``fit`` and together with the number of bins, they will define the intervals. Therefore, for the current example, these intervals are defined as:
es_es: Por defecto, la salida está codificada one-hot en una matriz dispersa (Ver :ref:`preprocessing_categorical_features`) y esto puede configurarse con el parámetro ``encode``. Para cada característica, los límites del intervalo de clase se calculan durante el ``fit`` y junto con el número de intervalos de clase, definirán los intervalos. Por lo tanto, para el ejemplo actual, estos intervalos se definen como:

source: feature 1: :math:`{[-\infty, -1), [-1, 2), [2, \infty)}`
es_es: característica 1: :math:`{[-\infty, -1), [-1, 2), [2, \infty)}`

source: feature 2: :math:`{[-\infty, 5), [5, \infty)}`
es_es: característica 2: :math:`{[-\infty, 5), [5, \infty)}`

source: feature 3: :math:`{[-\infty, 14), [14, \infty)}`
es_es: característica 3: :math:`{[-\infty, 14), [14, \infty)}`

source: Based on these bin intervals, ``X`` is transformed as follows::
es_es: Basado en estos intervalos de clase, ``X`` se transforma de la siguiente manera::

source: The resulting dataset contains ordinal attributes which can be further used in a :class:`~sklearn.pipeline.Pipeline`.
es_es: El conjunto de datos resultante contiene atributos ordinales que pueden utilizarse posteriormente en un :class:`~sklearn.pipeline.Pipeline`.

source: Discretization is similar to constructing histograms for continuous data. However, histograms focus on counting features which fall into particular bins, whereas discretization focuses on assigning feature values to these bins.
es_es: La discretización es similar a la construcción de histogramas para datos continuos. Sin embargo, los histogramas se centran en el recuento de características que caen en determinados intervalos de clase, mientras que la discretización se centra en asignar valores de características a estos intervalos de clases.

source: :class:`KBinsDiscretizer` implements different binning strategies, which can be selected with the ``strategy`` parameter. The 'uniform' strategy uses constant-width bins. The 'quantile' strategy uses the quantiles values to have equally populated bins in each feature. The 'kmeans' strategy defines bins based on a k-means clustering procedure performed on each feature independently.
es_es: :class:`KBinsDiscretizer` implementa diferentes estrategias de binning, que se pueden seleccionar con el parámetro ``strategy``. La estrategia ``uniform'' utiliza intervalos de clase de ancho constante. La estrategia 'quantile' utiliza los valores cuantiles para tener intervalos de claase igualmente poblados en cada característica. La estrategia "kmeans" define los intervalos basándose en un procedimiento de agrupamiento por k-medias realizado en cada característica de forma independiente.

source: Be aware that one can specify custom bins by passing a callable defining the discretization strategy to :class:`~sklearn.preprocessing.FunctionTransformer`. For instance, we can use the Pandas function :func:`pandas.cut`::
es_es: Ten en cuenta que puedes especificar intervalos de clase personalizados pasando un invocable que defina la estrategia de discretización a :class:`~sklearn. reprocessing.FunctionTransformer`. Por ejemplo, podemos utilizar la función de Pandas :func:`pandas.cut`::

source: Feature binarization
es_es: Binarización de característica

source: **Feature binarization** is the process of **thresholding numerical features to get boolean values**. This can be useful for downstream probabilistic estimators that make assumption that the input data is distributed according to a multi-variate `Bernoulli distribution <https://en.wikipedia.org/wiki/Bernoulli_distribution>`_. For instance, this is the case for the :class:`~sklearn.neural_network.BernoulliRBM`.
es_es: La **binarización de características** es el proceso de **fijar umbrales de las características numéricas para obtener valores booleanos**. Esto puede ser útil para estimadores probabilísticos posteriores que suponen que los datos de entrada se distribuyen según una distribución `Bernoulli <https://en.wikipedia.org/wiki/Bernoulli_distribution>`_ multivariante. Por ejemplo, este es el caso de :class:`~sklearn.neural_network.BernoulliRBM`.

source: It is also common among the text processing community to use binary feature values (probably to simplify the probabilistic reasoning) even if normalized counts (a.k.a. term frequencies) or TF-IDF valued features often perform slightly better in practice.
es_es: También es común entre la comunidad de procesadores de texto utilizar valores binarios de las características (probablemente para simplificar el razonamiento probabilístico) aunque los recuentos normalizados (también conocidos como frecuencias de términos) o las características con valores TF-IDF suelen tener un rendimiento ligeramente superior en la práctica.

source: As for the :class:`Normalizer`, the utility class :class:`Binarizer` is meant to be used in the early stages of :class:`~sklearn.pipeline.Pipeline`. The ``fit`` method does nothing as each sample is treated independently of others::
es_es: En cuanto al :class:`Normalizer`, la clase de utilidad :class:`Binarizer` está pensada para ser utilizada en las primeras etapas de :class:`~sklearn.pipeline.Pipeline`. El método ``fit`` no hace nada ya que cada muestra es tratada independientemente de las demás::

source: It is possible to adjust the threshold of the binarizer::
es_es: Es posible ajustar el umbral del binarizador::

source: As for the :class:`Normalizer` class, the preprocessing module provides a companion function :func:`binarize` to be used when the transformer API is not necessary.
es_es: En cuanto a la clase :class:`Normalizer`, el módulo de preprocesamiento proporciona una función complementaria :func:`binarize` para ser utilizada cuando la API del transformador no es necesaria.

source: Note that the :class:`Binarizer` is similar to the :class:`KBinsDiscretizer` when ``k = 2``, and when the bin edge is at the value ``threshold``.
es_es: Ten en cuenta que el :class:`Binarizer` es similar al :class:`KBinsDiscretizer` cuando ``k = 2``, y cuando el límite del intervalo de clase está en el valor ``threshold``.

source: :func:`binarize` and :class:`Binarizer` accept **both dense array-like and sparse matrices from scipy.sparse as input**.
es_es: :func:`binarize` y :class:`Binarizer` aceptan **tanto array-like densos como matrices dispersas de scipy.sparse como entrada**.

source: For sparse input the data is **converted to the Compressed Sparse Rows representation** (see ``scipy.sparse.csr_matrix``). To avoid unnecessary memory copies, it is recommended to choose the CSR representation upstream.
es_es: Para la entrada dispersa los datos son **convertidos a la representación Filas Dispersas Comprimidas ** (ver ``scipy.sparse.csr_matrix``). Para evitar copias de memoria innecesarias, se recomienda elegir la representación CSR antes.

source: Imputation of missing values
es_es: Imputación de valores faltantes

source: Tools for imputing missing values are discussed at :ref:`impute`.
es_es: Las herramientas para la imputación de valores faltantes se discuten en :ref:`impute`.

source: Generating polynomial features
es_es: Generación de características polinómicas

source: Often it's useful to add complexity to the model by considering nonlinear features of the input data. A simple and common method to use is polynomial features, which can get features' high-order and interaction terms. It is implemented in :class:`PolynomialFeatures`::
es_es: A menudo es útil añadir complejidad al modelo considerando características no lineales de los datos de entrada. Un método simple y común para utilizar son las características polinómicas, que permiten obtener los términos de alto orden e interacción de las características. Se implementa en :class:`PolinnomialFeatures`::

source: The features of X have been transformed from :math:`(X_1, X_2)` to :math:`(1, X_1, X_2, X_1^2, X_1X_2, X_2^2)`.
es_es: Las características de X han sido transformadas de :math:`(X_1, X_2)` a :math:`(1, X_1, X_2, X_1^2, X_1X_2, X_2^2)`.

source: In some cases, only interaction terms among features are required, and it can be gotten with the setting ``interaction_only=True``::
es_es: En algunos casos, sólo se requieren términos de interacción entre las características, y se pueden conseguir con el ajuste ``interaction_only=True``::

source: The features of X have been transformed from :math:`(X_1, X_2, X_3)` to :math:`(1, X_1, X_2, X_3, X_1X_2, X_1X_3, X_2X_3, X_1X_2X_3)`.
es_es: Las características de X han sido transformadas de :math:`(X_1, X_2, X_3)` a :math:`(1, X_1, X_2, X_3, X_1X_2, X_1X_3, X_2X_3, X_1X_2X_3)`.

source: Note that polynomial features are used implicitly in `kernel methods <https://en.wikipedia.org/wiki/Kernel_method>`_ (e.g., :class:`~sklearn.svm.SVC`, :class:`~sklearn.decomposition.KernelPCA`) when using polynomial :ref:`svm_kernels`.
es_es: Ten en cuenta que las características polinómicas se utilizan implícitamente en los `métodos del kernel <https://en.wikipedia.org/wiki/Kernel_method>`_ (por ejemplo, :class:`~sklearn.svm.SVC`, :class:`~sklearn.decomposition.KernelPCA`) cuando se utilizan polinomios :ref:`svm_kernels`.

source: See :ref:`sphx_glr_auto_examples_linear_model_plot_polynomial_interpolation.py` for Ridge regression using created polynomial features.
es_es: Ver :ref:`sphx_glr_auto_examples_linear_model_plot_polynomial_interpolation.py` para la Regresión de Cresta usando características polinómicas creadas.

source: Custom transformers
es_es: Transformadores personalizados

source: Often, you will want to convert an existing Python function into a transformer to assist in data cleaning or processing. You can implement a transformer from an arbitrary function with :class:`FunctionTransformer`. For example, to build a transformer that applies a log transformation in a pipeline, do::
es_es: A menudo, querrás convertir una función existente de Python en un transformador para ayudar a limpiar o procesar datos. Puedes implementar un transformador desde una función arbitraria con :class:`FunctionTransformer`. Por ejemplo, para construir un transformador que aplique una transformación de registro en un pipeline, haz::

source: You can ensure that ``func`` and ``inverse_func`` are the inverse of each other by setting ``check_inverse=True`` and calling ``fit`` before ``transform``. Please note that a warning is raised and can be turned into an error with a ``filterwarnings``::
es_es: Puedes asegurarte de que ``func`` e ``inverse_func`` son la inversa de los demás configurando ``check_inverse=True`` y llamando ``fit`` antes de ``transform``. Por favor, ten en cuenta que se producirá una advertencia y se puede convertir en un error con un ``filterwarnings``::

source: For a full code example that demonstrates using a :class:`FunctionTransformer` to extract features from text data see :ref:`sphx_glr_auto_examples_compose_plot_column_transformer.py`
es_es: Para ver un ejemplo de código completo que demuestra el uso de :class:`FunctionTransformer` para extraer características de los datos de texto consulta :ref:`sphx_glr_auto_examples_compose_plot_column_transformer.py`
