Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/random_projection.po
Languages: es_es

source: Random Projection
es_es: Proyección aleatoria

source: The :mod:`sklearn.random_projection` module implements a simple and computationally efficient way to reduce the dimensionality of the data by trading a controlled amount of accuracy (as additional variance) for faster processing times and smaller model sizes. This module implements two types of unstructured random matrix: :ref:`Gaussian random matrix <gaussian_random_matrix>` and :ref:`sparse random matrix <sparse_random_matrix>`.
es_es: El módulo :mod:`sklearn.random_projection` implementa una forma simple y computacionalmente eficiente de reducir la dimensionalidad de los datos intercambiando una cantidad controlada de precisión (como varianza adicional) por tiempos de procesamiento más rápidos y tamaños de modelos más pequeños. Este módulo implementa dos tipos de matrices aleatorias no estructuradas: :ref:`matriz aleatoria Gaussiana <gaussian_random_matrix>` y :ref:`matriz aleatoria dispersa <sparse_random_matrix>`.

source: The dimensions and distribution of random projections matrices are controlled so as to preserve the pairwise distances between any two samples of the dataset. Thus random projection is a suitable approximation technique for distance based method.
es_es: Las dimensiones y distribución de las matrices de proyecciones aleatorias se controlan para preservar las distancias por pares entre dos muestras cualesquiera del conjunto de datos. Así, la proyección aleatoria es una técnica de aproximación adecuada para el método basado en la distancia.

source: The Johnson-Lindenstrauss lemma
es_es: El lema Johnson-Lindenstrauss

source: The main theoretical result behind the efficiency of random projection is the `Johnson-Lindenstrauss lemma (quoting Wikipedia) <https://en.wikipedia.org/wiki/Johnson%E2%80%93Lindenstrauss_lemma>`_:
es_es: El principal resultado teórico detrás de la eficiencia de la proyección aleatoria es el `Lema de Johnson-Lindenstrauss (citando a Wikipedia) <https://en.wikipedia.org/wiki/Johnson%E2%80%93Lindenstrauss_lemma>`_:

source: In mathematics, the Johnson-Lindenstrauss lemma is a result concerning low-distortion embeddings of points from high-dimensional into low-dimensional Euclidean space. The lemma states that a small set of points in a high-dimensional space can be embedded into a space of much lower dimension in such a way that distances between the points are nearly preserved. The map used for the embedding is at least Lipschitz, and can even be taken to be an orthogonal projection.
es_es: En matemáticas, el lema Johnson-Lindenstrauss es un resultado concerniente a las inserciones de baja distorsión de puntos de un espacio de alta dimensión en un espacio euclideano de baja dimensión. El lema afirma que un pequeño conjunto de puntos en un espacio de alta dimensión puede integrarse en un espacio de dimensión mucho más baja de tal manera que las distancias entre los puntos casi se conservan. El mapa utilizado para la inserción es al menos Lipschitz, e incluso puede tomarse como una proyección ortogonal.

source: Knowing only the number of samples, the :func:`johnson_lindenstrauss_min_dim` estimates conservatively the minimal size of the random subspace to guarantee a bounded distortion introduced by the random projection::
es_es: Conociendo sólo el número de muestras, la función :func:`johnson_lindenstrauss_min_dim` estima de forma conservadora el tamaño mínimo del subespacio aleatorio para garantizar una distorsión acotada introducida por la proyección aleatoria::

source: See :ref:`sphx_glr_auto_examples_miscellaneous_plot_johnson_lindenstrauss_bound.py` for a theoretical explication on the Johnson-Lindenstrauss lemma and an empirical validation using sparse random matrices.
es_es: Véase :ref:`sphx_glr_auto_examples_miscellaneous_plot_johnson_lindenstrauss_bound.py` para una explicación teórica sobre el lema Johnson-Lindenstrauss y una validación empírica usando matrices aleatorias dispersas.

source: Gaussian random projection
es_es: Proyección aleatoria Gaussiana

source: The :class:`GaussianRandomProjection` reduces the dimensionality by projecting the original input space on a randomly generated matrix where components are drawn from the following distribution :math:`N(0, \frac{1}{n_{components}})`.
es_es: La clase :class:`GaussianRandomProjection` reduce la dimensionalidad proyectando el espacio de entrada original en una matriz generada aleatoriamente donde los componentes se extraen de la siguiente distribución :math:`N(0, \frac{1}{n_{components}})`.

source: Here a small excerpt which illustrates how to use the Gaussian random projection transformer::
es_es: Aquí un pequeño extracto que ilustra cómo utilizar el transformador de proyección aleatoria Gaussiana::

source: Sparse random projection
es_es: Proyección aleatoria dispersa

source: The :class:`SparseRandomProjection` reduces the dimensionality by projecting the original input space using a sparse random matrix.
es_es: La clase :class:`SparseRandomProjection` reduce la dimensionalidad proyectando el espacio de entrada original usando una matriz aleatoria dispersa.

source: Sparse random matrices are an alternative to dense Gaussian random projection matrix that guarantees similar embedding quality while being much more memory efficient and allowing faster computation of the projected data.
es_es: Las matrices aleatorias dispersas son una alternativa a la densa matriz de proyección aleatoria gaussiana que garantiza una calidad de inserción similar, a la vez que es mucho más eficiente en términos de memoria y permite un cálculo más rápido de los datos proyectados.

source: If we define ``s = 1 / density``, the elements of the random matrix are drawn from
es_es: Si definimos ``s = 1 / density``, los elementos de la matriz aleatoria se extraen de

source: where :math:`n_{\text{components}}` is the size of the projected subspace. By default the density of non zero elements is set to the minimum density as recommended by Ping Li et al.: :math:`1 / \sqrt{n_{\text{features}}}`.
es_es: donde :math:`n_{\text{components}}` es el tamaño del subespacio proyectado. Por defecto, la densidad de los elementos no nulos se establece en la densidad mínima recomendada por Ping Li et al. :math:`1 / \sqrt{n_{\text{features}}}`.

source: Here a small excerpt which illustrates how to use the sparse random projection transformer::
es_es: Aquí un pequeño extracto que ilustra cómo utilizar el transformador de proyección aleatoria dispersa::
