Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/semi_supervised.po
Languages: es_es

source: Semi-supervised learning
es_es: Aprendizaje semi supervisado

source: `Semi-supervised learning <https://en.wikipedia.org/wiki/Semi-supervised_learning>`_ is a situation in which in your training data some of the samples are not labeled. The semi-supervised estimators in :mod:`sklearn.semi_supervised` are able to make use of this additional unlabeled data to better capture the shape of the underlying data distribution and generalize better to new samples. These algorithms can perform well when we have a very small amount of labeled points and a large amount of unlabeled points.
es_es: `El aprendizaje semi supervisado <https://en.wikipedia.org/wiki/Semi-supervised_learning>`_ es una situación en la que en los datos de entrenamiento algunas de las muestras no están etiquetadas. Los estimadores semi supervisados en :mod:`sklearn.semi_supervised` son capaces de hacer uso de estos datos adicionales no etiquetados para capturar mejor la forma de la distribución de datos subyacente y generalizar mejor a las nuevas muestras. Estos algoritmos pueden funcionar bien cuando tenemos una cantidad muy pequeña de puntos etiquetados y una gran cantidad de puntos no etiquetados.

source: Unlabeled entries in `y`
es_es: Entradas sin etiquetar en `y`

source: It is important to assign an identifier to unlabeled points along with the labeled data when training the model with the ``fit`` method. The identifier that this implementation uses is the integer value :math:`-1`. Note that for string labels, the dtype of `y` should be object so that it can contain both strings and integers.
es_es: Es importante asignar un identificador a los puntos no etiquetados junto con los datos etiquetados cuando se entrena el modelo con el método ``fit``. El identificador que utiliza esta implementación es el valor entero :math:`-1`. Ten en cuenta que para las etiquetas de cadena, el dtype de `y` debe ser object para que pueda contener tanto cadenas como enteros.

source: Semi-supervised algorithms need to make assumptions about the distribution of the dataset in order to achieve performance gains. See `here <https://en.wikipedia.org/wiki/Semi-supervised_learning#Assumptions_used>`_ for more details.
es_es: Los algoritmos semi supervisados necesitan hacer suposiciones sobre la distribución del conjunto de datos para lograr ganancias de rendimiento. Véase `aquí <https://en.wikipedia.org/wiki/Semi-supervised_learning#Assumptions_used>`_ para más detalles.

source: Self Training
es_es: Auto entrenamiento

source: This self-training implementation is based on Yarowsky's [1]_ algorithm. Using this algorithm, a given supervised classifier can function as a semi-supervised classifier, allowing it to learn from unlabeled data.
es_es: Esta implementación de auto entrenamiento se basa en el algoritmo de Yarowsky [1]_. Usando este algoritmo, un determinado clasificador supervisado puede funcionar como un clasificador semi supervisado, permitiéndole aprender de datos no etiquetados.

source: :class:`SelfTrainingClassifier` can be called with any classifier that implements `predict_proba`, passed as the parameter `base_classifier`. In each iteration, the `base_classifier` predicts labels for the unlabeled samples and adds a subset of these labels to the labeled dataset.
es_es: :class:`SelfTrainingClassifier` puede ser llamado con cualquier clasificador que implemente `predict_proba`, pasado como parámetro `base_classifier`. En cada iteración, el `base_classifier` predice etiquetas para las muestras no etiquetadas y añade un subconjunto de estas etiquetas al conjunto de datos etiquetados.

source: The choice of this subset is determined by the selection criterion. This selection can be done using a `threshold` on the prediction probabilities, or by choosing the `k_best` samples according to the prediction probabilities.
es_es: La elección de este subconjunto está determinada por el criterio de selección. Esta selección se puede hacer utilizando un `threshold` en las probabilidades de predicción, o eligiendo las `k_best` muestras de acuerdo con las probabilidades de predicción.

source: The labels used for the final fit as well as the iteration in which each sample was labeled are available as attributes. The optional `max_iter` parameter specifies how many times the loop is executed at most.
es_es: Las etiquetas utilizadas para el ajuste final, así como la iteración en la que cada muestra fue etiquetada están disponibles como atributos. El parámetro opcional `max_iter` especifica cuántas veces se ejecuta el bucle como máximo.

source: The `max_iter` parameter may be set to `None`, causing the algorithm to iterate until all samples have labels or no new samples are selected in that iteration.
es_es: El parámetro `max_iter` puede establecerse en `None`, haciendo iterar el algoritmo hasta que todas las muestras tengan etiquetas o no se seleccionen nuevas muestras en esa iteración.

source: When using the self-training classifier, the :ref:`calibration <calibration>` of the classifier is important.
es_es: Cuando se utiliza el clasificador de auto entrenamiento, la :ref:`calibración <calibration>` del clasificador es importante.

source: Label Propagation
es_es: Propagación de etiquetas

source: Label propagation denotes a few variations of semi-supervised graph inference algorithms.
es_es: La propagación de etiquetas denota algunas variaciones de los algoritmos de inferencia de grafos semi supervisados.

source: A few features available in this model:
es_es: Algunas características disponibles en este modelo:

source: Used for classification tasks
es_es: Utilizado para tareas de clasificación

source: Kernel methods to project data into alternate dimensional spaces
es_es: Métodos Kernel para proyectar datos en espacios dimensionales alternativos

source: `scikit-learn` provides two label propagation models: :class:`LabelPropagation` and :class:`LabelSpreading`. Both work by constructing a similarity graph over all items in the input dataset.
es_es: `scikit-learn` proporciona dos modelos de propagación de etiquetas: :class:`LabelPropagation` y :class:`LabelSpreading`. Ambos trabajan construyendo una gráfica de similitud sobre todos los elementos en el conjunto de datos de entrada.

source: **An illustration of label-propagation:** *the structure of unlabeled observations is consistent with the class structure, and thus the class label can be propagated to the unlabeled observations of the training set.*
es_es: **Una ilustración de la propagación de etiquetas:** *la estructura de observaciones sin etiquetar es coherente con la estructura de la clase, y por lo tanto la etiqueta de la clase puede propagarse a las observaciones sin etiquetar del conjunto de entrenamiento.*

source: :class:`LabelPropagation` and :class:`LabelSpreading` differ in modifications to the similarity matrix that graph and the clamping effect on the label distributions. Clamping allows the algorithm to change the weight of the true ground labeled data to some degree. The :class:`LabelPropagation` algorithm performs hard clamping of input labels, which means :math:`\alpha=0`. This clamping factor can be relaxed, to say :math:`\alpha=0.2`, which means that we will always retain 80 percent of our original label distribution, but the algorithm gets to change its confidence of the distribution within 20 percent.
es_es: :class:`LabelPropagation` y :class:`LabelSpreading` difieren en las modificaciones de la matriz de similitud que grafican y como restringen la distribución de las etiquetas". La restricción permite que el algoritmo cambie el peso de los datos etiquetados reales en cierto grado. El algoritmo :class:`LabelPropagation` realiza una restricción dura de las etiquetas de entrada, lo que significa :math:`\alpha=0`. Este factor de restricción puede ser relajado, por ejemplo :math:`\alpha=0.2`, lo que significa que siempre mantendremos el 80 por ciento de nuestra distribución de etiquetas original, pero el algoritmo puede cambiar su confianza en la distribución dentro del 20 por ciento.

source: :class:`LabelPropagation` uses the raw similarity matrix constructed from the data with no modifications. In contrast, :class:`LabelSpreading` minimizes a loss function that has regularization properties, as such it is often more robust to noise. The algorithm iterates on a modified version of the original graph and normalizes the edge weights by computing the normalized graph Laplacian matrix. This procedure is also used in :ref:`spectral_clustering`.
es_es: :class:`LabelPropagation` utiliza la matriz de similitud cruda construida a partir de los datos sin modificaciones. En cambio, :class:`LabelSpreading` minimiza una función de pérdida que tiene propiedades de regularización, por lo que a menudo es más robusto al ruido. El algoritmo itera sobre una versión modificada del gráfico original y normaliza los pesos de las aristas calculando la matriz Laplaciana normalizada del gráfico. Este procedimiento también se utiliza en :ref:`spectral_clustering`.

source: Label propagation models have two built-in kernel methods. Choice of kernel effects both scalability and performance of the algorithms. The following are available:
es_es: Los modelos de propagación de etiquetas tienen dos métodos de kernel integrados. La elección del kernel afecta tanto la escalabilidad como el rendimiento de los algoritmos. Están disponibles los siguientes:

source: rbf (:math:`\exp(-\gamma |x-y|^2), \gamma > 0`). :math:`\gamma` is specified by keyword gamma.
es_es: rbf (:math:`\exp(-\gamma |x-y|^2), \gamma > 0`). :math:`\gamma` se especifica con la palabra clave gamma.

source: knn (:math:`1[x' \in kNN(x)]`). :math:`k` is specified by keyword n_neighbors.
es_es: knn (:math:`1[x' \in kNN(x)]`). :math:`k` se especifica con la palabra clave n_neighbors.

source: The RBF kernel will produce a fully connected graph which is represented in memory by a dense matrix. This matrix may be very large and combined with the cost of performing a full matrix multiplication calculation for each iteration of the algorithm can lead to prohibitively long running times. On the other hand, the KNN kernel will produce a much more memory-friendly sparse matrix which can drastically reduce running times.
es_es: El kernel RBF producirá un gráfico completamente conectado que está representado en memoria por una matriz densa. Esta matriz puede ser muy grande y, combinada con el costo de realizar un cálculo completo de multiplicación de la matriz para cada iteración del algoritmo, puede llevar a tiempos de ejecución prohibitivamente largos. Por otro lado, el núcleo KNN producirá una matriz dispersa mucho más amigable con la memoria que puede reducir drásticamente los tiempos de ejecución.

source: References
es_es: Referencias
