Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/sgd.po
Languages: es_es

source: In both cases, the criterion is evaluated once by epoch, and the algorithm stops when the criterion does not improve ``n_iter_no_change`` times in a row. The improvement is evaluated with absolute tolerance ``tol``, and the algorithm stops in any case after a maximum number of iteration ``max_iter``.
es_es: En ambos casos, el criterio se evalúa una vez por época, y el algoritmo se detiene cuando el criterio no mejora ``n_iter_no_change`` veces seguidas. La mejora se evalúa con la tolerancia absoluta ``tol``, y el algoritmo se detiene en cualquier caso después de un número máximo de iteraciones ``max_iter``.

source: Tips on Practical Use
es_es: Consejos de Uso Práctico

source: Stochastic Gradient Descent is sensitive to feature scaling, so it is highly recommended to scale your data. For example, scale each attribute on the input vector X to [0,1] or [-1,+1], or standardize it to have mean 0 and variance 1. Note that the *same* scaling must be applied to the test vector to obtain meaningful results. This can be easily done using :class:`StandardScaler`::
es_es: El Descenso de Gradiente Estocástico es sensible al escalamiento de las características, por lo que es muy recomendable escalar tus datos. Por ejemplo, escala cada atributo del vector de entrada X a [0,1] o [-1,+1], o estandarízalo para que tenga media 0 y varianza 1. Ten en cuenta que el *mismo* escalamiento debe aplicarse al vector de prueba para obtener resultados significativos. Esto puede hacerse fácilmente utilizando :class:`StandardScaler`::

source: If your attributes have an intrinsic scale (e.g. word frequencies or indicator features) scaling is not needed.
es_es: Si tus atributos tienen una escala intrínseca (por ejemplo, las frecuencias de las palabras o las características de los indicadores) el escalamiento no es necesario.

source: Finding a reasonable regularization term :math:`\alpha` is best done using automatic hyper-parameter search, e.g. :class:`~sklearn.model_selection.GridSearchCV` or :class:`~sklearn.model_selection.RandomizedSearchCV`, usually in the range ``10.0**-np.arange(1,7)``.
es_es: La mejor manera de encontrar un término de regularización razonable :math:`\alpha` es utilizando la búsqueda automática de hiperparámetros, por ejemplo, :class:`~sklearn.model_selection.GridSearchCV` o :class:`~sklearn.model_selection.RandomizedSearchCV`, normalmente en el rango ``10.0**-np.arange(1,7)``.

source: Empirically, we found that SGD converges after observing approximately 10^6 training samples. Thus, a reasonable first guess for the number of iterations is ``max_iter = np.ceil(10**6 / n)``, where ``n`` is the size of the training set.
es_es: Empíricamente, encontramos que el SGD converge después de observar aproximadamente 10^6 muestras de entrenamiento. Por tanto, una primera estimación razonable del número de iteraciones es ``max_iter = np.ceil(10**6 / n)``, donde ``n`` es el tamaño del conjunto de entrenamiento.

source: If you apply SGD to features extracted using PCA we found that it is often wise to scale the feature values by some constant `c` such that the average L2 norm of the training data equals one.
es_es: Si se aplica el SGD a las características extraídas mediante el PCA, descubrimos que a menudo es prudente escalar los valores de las características mediante una constante "c" tal que la norma L2 promedio de los datos de entrenamiento sea igual a uno.

source: We found that Averaged SGD works best with a larger number of features and a higher eta0
es_es: Descubrimos que la SGD Promediada funciona mejor con un mayor número de características y una eta0 más alta

source: Mathematical formulation
es_es: Formulación matemática

source: We describe here the mathematical details of the SGD procedure. A good overview with convergence rates can be found in [#6]_.
es_es: Describimos aquí los detalles matemáticos del procedimiento SGD. Un buen resumen con las tasas de convergencia se puede encontrar en [#6]_.

source: Given a set of training examples :math:`(x_1, y_1), \ldots, (x_n, y_n)` where :math:`x_i \in \mathbf{R}^m` and :math:`y_i \in \mathcal{R}` (:math:`y_i \in {-1, 1}` for classification), our goal is to learn a linear scoring function :math:`f(x) = w^T x + b` with model parameters :math:`w \in \mathbf{R}^m` and intercept :math:`b \in \mathbf{R}`. In order to make predictions for binary classification, we simply look at the sign of :math:`f(x)`. To find the model parameters, we minimize the regularized training error given by
es_es: Dado un conjunto de ejemplos de entrenamiento :math:`(x_1, y_1), \ldots, (x_n, y_n)` donde :math:`x_i \in \mathbf{R}^m` y :math:`y_i \in \mathcal{R}` (:math: `y_i \in {-1, 1}` para la clasificación), nuestro objetivo es aprender una función de puntuación lineal :math:`f(x) = w^T x + b` con parámetros de modelo :math:`w \in \mathbf{R}^m` e intercepto :math:`b \in \mathbf{R}`. Para hacer predicciones para la clasificación binaria, simplemente revisamos el signo de :math:`f(x)`. Para encontrar los parámetros del modelo, minimizamos el error de entrenamiento regularizado dado por

source: where :math:`L` is a loss function that measures model (mis)fit and :math:`R` is a regularization term (aka penalty) that penalizes model complexity; :math:`\alpha > 0` is a non-negative hyperparameter that controls the regularization stength.
es_es: donde :math:`L` es una función de pérdida que mide el (des)ajuste del modelo y :math:`R` es un término de regularización (también conocido como penalización) que penaliza la complejidad del modelo; :math:`\alpha > 0` es un hiperparámetro no negativo que controla la fuerza de la regularización.

source: Different choices for :math:`L` entail different classifiers or regressors:
es_es: Diferentes elecciones de :math:`L` implican diferentes clasificadores o regresores:

source: Hinge (soft-margin): equivalent to Support Vector Classification. :math:`L(y_i, f(x_i)) = \max(0, 1 - y_i f(x_i))`.
es_es: Bisagra (margen blando): equivalente a la Clasificación por Vectores de Soporte. :math:`L(y_i, f(x_i)) = \max(0, 1 - y_i f(x_i))`.

source: Perceptron: :math:`L(y_i, f(x_i)) = \max(0, - y_i f(x_i))`.
es_es: Perceptrón: :math:`L(y_i, f(x_i)) = \max(0, - y_i f(x_i))`.

source: Modified Huber: :math:`L(y_i, f(x_i)) = \max(0, 1 - y_i f(x_i))^2` if :math:`y_i f(x_i) > 1`, and :math:`L(y_i, f(x_i)) = -4 y_i f(x_i)` otherwise.
es_es: Huber modificado: :math:`L(y_i, f(x_i)) = \max(0, 1 - y_i f(x_i))^2` si :math:`y_i f(x_i) > 1`, y :math:`L(y_i, f(x_i)) = -4 y_i f(x_i)` en caso contrario.

source: Log: equivalent to Logistic Regression. :math:`L(y_i, f(x_i)) = \log(1 + \exp (-y_i f(x_i)))`.
es_es: Log: equivalente a la Regresión Logística. :math:`L(y_i, f(x_i)) = \log(1 + \exp (-y_i f(x_i)))`.

source: Least-Squares: Linear regression (Ridge or Lasso depending on :math:`R`). :math:`L(y_i, f(x_i)) = \frac{1}{2}(y_i - f(x_i))^2`.
es_es: Mínimos cuadrados: Regresión lineal (Ridge o Lasso dependiendo de :math:`R`). :math:`L(y_i, f(x_i)) = \frac{1}{2}(y_i - f(x_i))^2`.

source: Huber: less sensitive to outliers than least-squares. It is equivalent to least squares when :math:`|y_i - f(x_i)| \leq \varepsilon`, and :math:`L(y_i, f(x_i)) = \varepsilon |y_i - f(x_i)| - \frac{1}{2} \varepsilon^2` otherwise.
es_es: Huber: menos sensible a los valores atípicos que los mínimos cuadrados. Es equivalente a los mínimos cuadrados cuando :math:`|y_i - f(x_i)|leq \varepsilon`, y :math:`L(y_i, f(x_i)) = \varepsilon |y_i - f(x_i)| - \frac{1}{2} \varepsilon^2` de lo contrario.

source: Epsilon-Insensitive: (soft-margin) equivalent to Support Vector Regression. :math:`L(y_i, f(x_i)) = \max(0, |y_i - f(x_i)| - \varepsilon)`.
es_es: Insensible a épsilon: (margen blando) equivalente a la Regresión de Vectores de Soporte. :math:`L(y_i, f(x_i)) = \max(0, |y_i - f(x_i)| - \varepsilon)`.

source: All of the above loss functions can be regarded as an upper bound on the misclassification error (Zero-one loss) as shown in the Figure below.
es_es: Todas las funciones de pérdida anteriores pueden considerarse como un límite superior del error de clasificación incorrecta (pérdida de cero a uno), como se muestra en la siguiente Figura.

source: Popular choices for the regularization term :math:`R` (the `penalty` parameter) include:
es_es: Las opciones populares para el término de regularización :math:`R` (el parámetro `penalty`) incluyen:

source: L2 norm: :math:`R(w) := \frac{1}{2} \sum_{j=1}^{m} w_j^2 = ||w||_2^2`,
es_es: Norma L2: :math:`R(w) := \frac{1}{2} \sum_{j=1}^{m} w_j^2 = ||w||_2^2`,

source: L1 norm: :math:`R(w) := \sum_{j=1}^{m} |w_j|`, which leads to sparse solutions.
es_es: Norma L1: :math:`R(w) := \sum_{j=1}^{m} |w_j|`, lo que conduce a soluciones dispersas.

source: Elastic Net: :math:`R(w) := \frac{\rho}{2} \sum_{j=1}^{n} w_j^2 + (1-\rho) \sum_{j=1}^{m} |w_j|`, a convex combination of L2 and L1, where :math:`\rho` is given by ``1 - l1_ratio``.
es_es: Red elástica: :math:`R(w) := \frac{\rho}{2} \sum_{j=1}^{n} w_j^2 + (1-\rho) \sum_{j=1}^{m} |w_j|`, una combinación convexa de L2 y L1, donde :math:`\rho` viene dado por ``1 - l1_ratio``.

source: The Figure below shows the contours of the different regularization terms in a 2-dimensional parameter space (:math:`m=2`) when :math:`R(w) = 1`.
es_es: La Figura siguiente muestra los contornos de los diferentes términos de regularización en un espacio de parámetros bidimensional (:math:`m=2`) cuando :math:`R(w) = 1`.

source: Stochastic gradient descent is an optimization method for unconstrained optimization problems. In contrast to (batch) gradient descent, SGD approximates the true gradient of :math:`E(w,b)` by considering a single training example at a time.
es_es: El descenso de gradiente estocástico es un método de optimización para problemas de optimización sin restricciones. A diferencia del descenso de gradiente (por lotes), el SGD se aproxima al verdadero gradiente de :math:`E(w,b)` considerando un solo ejemplo de entrenamiento a la vez.

source: The class :class:`SGDClassifier` implements a first-order SGD learning routine. The algorithm iterates over the training examples and for each example updates the model parameters according to the update rule given by
es_es: La clase :class:`SGDClassifier` implementa una rutina de aprendizaje SGD de primer orden. El algoritmo itera sobre los ejemplos de entrenamiento y para cada ejemplo actualiza los parámetros del modelo según la regla de actualización dada por

source: where :math:`\eta` is the learning rate which controls the step-size in the parameter space. The intercept :math:`b` is updated similarly but without regularization (and with additional decay for sparse matrices, as detailed in :ref:`implementation_details`).
es_es: donde :math:`\eta` es la tasa de aprendizaje que controla el tamaño del paso en el espacio de parámetros. El intercepto :math:`b` se actualiza de forma similar pero sin regularización (y con un decaimiento adicional para matrices dispersas, como se detalla en :ref:`implementation_details`).

source: The learning rate :math:`\eta` can be either constant or gradually decaying. For classification, the default learning rate schedule (``learning_rate='optimal'``) is given by
es_es: La tasa de aprendizaje :math:`\eta` puede ser constante o gradualmente decreciente. Para la clasificación, el programa de tasa de aprendizaje por defecto (``learning_rate='optimal'``) viene dado por

source: where :math:`t` is the time step (there are a total of `n_samples * n_iter` time steps), :math:`t_0` is determined based on a heuristic proposed by Léon Bottou such that the expected initial updates are comparable with the expected size of the weights (this assuming that the norm of the training samples is approx. 1). The exact definition can be found in ``_init_t`` in :class:`BaseSGD`.
es_es: donde :math:`t` es el paso de tiempo (hay un total de `n_samples * n_iter` pasos de tiempo), :math:`t_0` se determina en base a una heurística propuesta por Léon Bottou de forma que las actualizaciones iniciales esperadas son comparables con el tamaño esperado de las ponderaciones (esto suponiendo que la norma de las muestras de entrenamiento es aproximadamente 1). La definición exacta se puede encontrar en ``_init_t`` en :class:`BaseSGD`.

source: For regression the default learning rate schedule is inverse scaling (``learning_rate='invscaling'``), given by
es_es: Para la regresión, el programa de la tasa de aprendizaje por defecto es el escalamiento inverso (``learning_rate='invscaling'``), dado por

source: where :math:`eta_0` and :math:`power\_t` are hyperparameters chosen by the user via ``eta0`` and ``power_t``, resp.
es_es: donde :math:`eta_0` y :math:`power\_t` son hiperparámetros elegidos por el usuario mediante ``eta0`` y ``power_t``, respectivamente.

source: For a constant learning rate use ``learning_rate='constant'`` and use ``eta0`` to specify the learning rate.
es_es: Para una tasa de aprendizaje constante, utiliza ``learning_rate='constant'`` y utiliza ``eta0`` para especificar la tasa de aprendizaje.

source: For an adaptively decreasing learning rate, use ``learning_rate='adaptive'`` and use ``eta0`` to specify the starting learning rate. When the stopping criterion is reached, the learning rate is divided by 5, and the algorithm does not stop. The algorithm stops when the learning rate goes below 1e-6.
es_es: Para una tasa de aprendizaje adaptativamente decreciente, utiliza ``learning_rate='adaptive'`` y utiliza ``eta0`` para especificar la tasa de aprendizaje inicial. Cuando se alcanza el criterio de parada, la tasa de aprendizaje es dividida entre 5, y el algoritmo no se detiene. El algoritmo se detiene cuando la tasa de aprendizaje es inferior a 1e-6.

source: The model parameters can be accessed through the ``coef_`` and ``intercept_`` attributes: ``coef_`` holds the weights :math:`w` and ``intercept_`` holds :math:`b`.
es_es: Se puede acceder a los parámetros del modelo a través de los atributos ``coef_`` y ``intercept_``: ``coef_`` contiene las ponderaciones :math:`w` e ``intercept_`` contiene :math:`b`.

source: When using Averaged SGD (with the `average` parameter), `coef_` is set to the average weight across all updates: `coef_` :math:`= \frac{1}{T} \sum_{t=0}^{T-1} w^{(t)}`, where :math:`T` is the total number of updates, found in the `t_` attribute.
es_es: Cuando se utiliza el SGD Promediado (con el parámetro `average`), `coef_` se establece en la ponderación promedio de todas las actualizaciones: `coef_` :math:`= \frac{1}{T} \sum_{t=0}^{T-1} w^{(t)}`, donde :math:`T` es el número total de actualizaciones, encontradas en el atributo `t_`.

source: Implementation details
es_es: Detalles de implementación

source: The implementation of SGD is influenced by the `Stochastic Gradient SVM` of [#1]_. Similar to SvmSGD, the weight vector is represented as the product of a scalar and a vector which allows an efficient weight update in the case of L2 regularization. In the case of sparse input `X`, the intercept is updated with a smaller learning rate (multiplied by 0.01) to account for the fact that it is updated more frequently. Training examples are picked up sequentially and the learning rate is lowered after each observed example. We adopted the learning rate schedule from [#2]_. For multi-class classification, a "one versus all" approach is used. We use the truncated gradient algorithm proposed in [#3]_ for L1 regularization (and the Elastic Net). The code is written in Cython.
es_es: La implementación de SGD está influenciada por el `Stochastic Gradient SVM` de [#1]_. De forma similar a SvmSGD, el vector de ponderaciones se representa como el producto de un escalar y un vector que permite una actualización eficiente de las ponderaciones en el caso de la regularización L2. En el caso de una entrada dispersa `X`, el intercepto se actualiza con una tasa de aprendizaje menor (multiplicada por 0,01) para tener en cuenta el hecho de que se actualiza con mayor frecuencia. Los ejemplos de entrenamiento se recogen secuencialmente y la tasa de aprendizaje se reduce después de cada ejemplo observado. Adoptamos el programa de tasa de aprendizaje de [#2]_. Para la clasificación multiclase, se utiliza un enfoque de "uno contra todos". Utilizamos el algoritmo de gradiente truncado propuesto en [#3]_ para la regularización L1 (y la Red Elástica). El código está escrito en Cython.
