Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/sgd.po
Languages: es_es

source: Stochastic Gradient Descent
es_es: Descenso de Gradiente Estocástico

source: **Stochastic Gradient Descent (SGD)** is a simple yet very efficient approach to fitting linear classifiers and regressors under convex loss functions such as (linear) `Support Vector Machines <https://en.wikipedia.org/wiki/Support_vector_machine>`_ and `Logistic Regression <https://en.wikipedia.org/wiki/Logistic_regression>`_. Even though SGD has been around in the machine learning community for a long time, it has received a considerable amount of attention just recently in the context of large-scale learning.
es_es: **Descenso de Gradiente Estocástico (Stochastic Gradient Descent, SGD)** es un enfoque simple pero muy eficiente para ajustar clasificadores y regresores lineales bajo funciones de pérdida convexas, como las `Máquinas de Vectores de Soporte <https://en.wikipedia.org/wiki/Support_vector_machine>`_ y `Regresión Logística <https://en.wikipedia.org/wiki/Logistic_regression>`_ (lineales). Aunque el SGD lleva mucho tiempo en la comunidad del aprendizaje automático, ha recibido una atención considerable recientemente en el contexto del aprendizaje a gran escala.

source: SGD has been successfully applied to large-scale and sparse machine learning problems often encountered in text classification and natural language processing. Given that the data is sparse, the classifiers in this module easily scale to problems with more than 10^5 training examples and more than 10^5 features.
es_es: El SGD se ha aplicado con éxito a problemas de aprendizaje automático a gran escala y dispersos, encontrados a menudo en la clasificación de textos y el procesamiento del lenguaje natural. Dado que los datos son dispersos, los clasificadores de este módulo pueden escalar fácilmente a problemas con más de 10^5 ejemplos de entrenamiento y más de 10^5 características.

source: Strictly speaking, SGD is merely an optimization technique and does not correspond to a specific family of machine learning models. It is only a *way* to train a model. Often, an instance of :class:`SGDClassifier` or :class:`SGDRegressor` will have an equivalent estimator in the scikit-learn API, potentially using a different optimization technique. For example, using `SGDClassifier(loss='log')` results in logistic regression, i.e. a model equivalent to :class:`~sklearn.linear_model.LogisticRegression` which is fitted via SGD instead of being fitted by one of the other solvers in :class:`~sklearn.linear_model.LogisticRegression`. Similarly, `SGDRegressor(loss='squared_loss', penalty='l2')` and :class:`~sklearn.linear_model.Ridge` solve the same optimization problem, via different means.
es_es: En sentido estricto, el SGD no es más que una técnica de optimización y no corresponde a una familia específica de modelos de aprendizaje automático. Es sólo una *forma* de entrenar un modelo. A menudo, una instancia de :class:`SGDClassifier` o :class:`SGDRegressor` tendrá un estimador equivalente en la API de scikit-learn, utilizando potencialmente una técnica de optimización diferente. Por ejemplo, el uso de `SGDClassifier(loss='log')` da como resultado una regresión logística, es decir, un modelo equivalente a :class:`~sklearn.linear_model.LogisticRegression` que se ajusta a través de SGD en lugar de ser ajustado por uno de los otros solucionadores en :class:`~sklearn.linear_model.LogisticRegression`. Del mismo modo, `SGDRegressor(loss='squared_loss', penalty='l2')` y :class:`~sklearn.linear_model.Ridge` resuelven el mismo problema de optimización, a través de diferentes medios.

source: The advantages of Stochastic Gradient Descent are:
es_es: Las ventajas del Descenso de Gradiente Estocástico son:

source: Efficiency.
es_es: Eficiencia.

source: Ease of implementation (lots of opportunities for code tuning).
es_es: Facilidad de implementación (muchas oportunidades para el ajuste del código).

source: The disadvantages of Stochastic Gradient Descent include:
es_es: Las desventajas del Descenso de Gradiente Estocástico incluyen:

source: SGD requires a number of hyperparameters such as the regularization parameter and the number of iterations.
es_es: El SGD requiere una serie de hiperparámetros como el parámetro de regularización y el número de iteraciones.

source: SGD is sensitive to feature scaling.
es_es: El SGD es sensible al escalamiento de características.

source: Make sure you permute (shuffle) your training data before fitting the model or use ``shuffle=True`` to shuffle after each iteration (used by default). Also, ideally, features should be standardized using e.g. `make_pipeline(StandardScaler(), SGDClassifier())` (see :ref:`Pipelines <combining_estimators>`).
es_es: Asegúrate de permutar (barajar) tus datos de entrenamiento antes de ajustar el modelo o utiliza ``shuffle=True`` para barajar después de cada iteración (utilizado por defecto). También, idealmente, las características deberían ser estandarizadas usando, por ejemplo, `make_pipeline(StandardScaler(), SGDClassifier())` (ver :ref:`Pipelines <combining_estimators>`).

source: Classification
es_es: Clasificación

source: The class :class:`SGDClassifier` implements a plain stochastic gradient descent learning routine which supports different loss functions and penalties for classification. Below is the decision boundary of a :class:`SGDClassifier` trained with the hinge loss, equivalent to a linear SVM.
es_es: La clase :class:`SGDClassifier` implementa una rutina de aprendizaje simple de descenso de gradiente estocástico que soporta diferentes funciones de pérdida y penalizaciones para la clasificación. A continuación se muestra la frontera de decisión de un :class:`SGDClassifier` entrenado con la pérdida de bisagra, equivalente a una SVM lineal.

source: As other classifiers, SGD has to be fitted with two arrays: an array `X` of shape (n_samples, n_features) holding the training samples, and an array y of shape (n_samples,) holding the target values (class labels) for the training samples::
es_es: Como otros clasificadores, el SGD tiene que ajustarse con dos arreglos: un arreglo `X` de forma (n_samples, n_features) que contiene las muestras de entrenamiento, y un arreglo `y` de forma (n_samples,) que contiene los valores objetivo (etiquetas de clase) para las muestras de entrenamiento::

source: After being fitted, the model can then be used to predict new values::
es_es: Una vez ajustado, el modelo puede utilizarse para predecir nuevos valores::

source: SGD fits a linear model to the training data. The ``coef_`` attribute holds the model parameters::
es_es: SGD ajusta un modelo lineal a los datos de entrenamiento. El atributo ``coef_`` contiene los parámetros del modelo::

source: The ``intercept_`` attribute holds the intercept (aka offset or bias)::
es_es: El atributo ``intercept_`` contiene el intercepto (también conocido como desplazamiento o sesgo)::

source: Whether or not the model should use an intercept, i.e. a biased hyperplane, is controlled by the parameter ``fit_intercept``.
es_es: El parámetro ``fit_intercept`` controla si el modelo debe utilizar o no un intercepto, es decir, un hiperplano sesgado.

source: The signed distance to the hyperplane (computed as the dot product between the coefficients and the input sample, plus the intercept) is given by :meth:`SGDClassifier.decision_function`::
es_es: La distancia con signo al hiperplano (calculada como el producto punto entre los coeficientes y la muestra de entrada, más el intercepto) viene dada por :meth:`SGDClassifier.decision_function`::

source: The concrete loss function can be set via the ``loss`` parameter. :class:`SGDClassifier` supports the following loss functions:
es_es: La función de pérdida concreta puede establecerse mediante el parámetro ``loss``. :class:`SGDClassifier` admite las siguientes funciones de pérdida:

source: ``loss="hinge"``: (soft-margin) linear Support Vector Machine,
es_es: ``loss="hinge"``: (margen blando) Máquina de Vectores de Soporte lineal,

source: ``loss="modified_huber"``: smoothed hinge loss,
es_es: ``loss="modified_huber"``: pérdida de bisagra suavizada,

source: ``loss="log"``: logistic regression,
es_es: ``loss="log"``: regresión logística,

source: and all regression losses below. In this case the target is encoded as -1 or 1, and the problem is treated as a regression problem. The predicted class then correspond to the sign of the predicted target.
es_es: y todas las pérdidas de regresión más abajo. En este caso, el objetivo se codifica como -1 o 1, y el problema se trata como un problema de regresión. La clase predicha corresponde entonces al signo del objetivo predicho.

source: Please refer to the :ref:`mathematical section below <sgd_mathematical_formulation>` for formulas. The first two loss functions are lazy, they only update the model parameters if an example violates the margin constraint, which makes training very efficient and may result in sparser models (i.e. with more zero coefficents), even when L2 penalty is used.
es_es: Por favor, consulta :ref:`la sección matemática más abajo <sgd_mathematical_formulation>` para ver las fórmulas. Las dos primeras funciones de pérdida son perezosas, sólo actualizan los parámetros del modelo si un ejemplo viola la restricción de margen, lo que hace que el entrenamiento sea muy eficiente y puede dar lugar a modelos más dispersos (es decir, con más coeficientes cero), incluso cuando se utiliza la penalización L2.

source: Using ``loss="log"`` or ``loss="modified_huber"`` enables the ``predict_proba`` method, which gives a vector of probability estimates :math:`P(y|x)` per sample :math:`x`::
es_es: El uso de ``loss="log"` o ``loss="modified_huber"`` habilita el método ``predict_proba``, que da un vector de estimaciones de probabilidad :math:`P(y|x)` por muestra :math:`x`::

source: The concrete penalty can be set via the ``penalty`` parameter. SGD supports the following penalties:
es_es: La penalización concreta puede establecerse mediante el parámetro ``penalty``. SGD admite las siguientes penalizaciones:

source: ``penalty="l2"``: L2 norm penalty on ``coef_``.
es_es: ``penalty="l2"``: Penalización de la norma L2 en ``coef_``.

source: ``penalty="l1"``: L1 norm penalty on ``coef_``.
es_es: ``penalty="l1"``: Penalización de la norma L1 en ``coef_``.

source: ``penalty="elasticnet"``: Convex combination of L2 and L1; ``(1 - l1_ratio) * L2 + l1_ratio * L1``.
es_es: ``penalty="elasticnet"``: Combinación convexa de L2 y L1; ``(1 - l1_ratio) * L2 + l1_ratio * L1``.

source: The default setting is ``penalty="l2"``. The L1 penalty leads to sparse solutions, driving most coefficients to zero. The Elastic Net [#5]_ solves some deficiencies of the L1 penalty in the presence of highly correlated attributes. The parameter ``l1_ratio`` controls the convex combination of L1 and L2 penalty.
es_es: La configuración por defecto es ``penalty="l2"``. La penalización L1 conduce a soluciones dispersas, llevando la mayoría de los coeficientes a cero. La Red Elástica [#5]_ resuelve algunas deficiencias de la penalización L1 en presencia de atributos altamente correlacionados. El parámetro ``l1_ratio`` controla la combinación convexa de la penalización L1 y L2.

source: :class:`SGDClassifier` supports multi-class classification by combining multiple binary classifiers in a "one versus all" (OVA) scheme. For each of the :math:`K` classes, a binary classifier is learned that discriminates between that and all other :math:`K-1` classes. At testing time, we compute the confidence score (i.e. the signed distances to the hyperplane) for each classifier and choose the class with the highest confidence. The Figure below illustrates the OVA approach on the iris dataset. The dashed lines represent the three OVA classifiers; the background colors show the decision surface induced by the three classifiers.
es_es: :class:`SGDClassifier` soporta la clasificación multiclase combinando múltiples clasificadores binarios en un esquema "uno contra todos" (OVA). Para cada una de las clases :math:`K`, se aprende un clasificador binario que discrimina entre esa y todas las demás clases :math:`K-1`. En el momento de la prueba, calculamos la puntuación de confianza (es decir, las distancias con signo al hiperplano) de cada clasificador y se elige la clase con mayor confianza. La Figura siguiente ilustra el enfoque OVA en el conjunto de datos del iris. Las líneas discontinuas representan los tres clasificadores OVA; los colores del fondo muestran la superficie de decisión inducida por los tres clasificadores.

source: In the case of multi-class classification ``coef_`` is a two-dimensional array of shape (n_classes, n_features) and ``intercept_`` is a one-dimensional array of shape (n_classes,). The i-th row of ``coef_`` holds the weight vector of the OVA classifier for the i-th class; classes are indexed in ascending order (see attribute ``classes_``). Note that, in principle, since they allow to create a probability model, ``loss="log"`` and ``loss="modified_huber"`` are more suitable for one-vs-all classification.
es_es: En el caso de la clasificación multiclase, ``coef_`` es un arreglo bidimensional de forma (n_classes, n_features) e ``intercept_`` es un arreglo unidimensional de forma (n_classes,). La fila i-ésima de ``coef_`` contiene el vector de ponderaciones del clasificador OVA para la clase i-ésima; las clases se indexan en orden ascendente (ver el atributo ``classes_``). Ten en cuenta que, en principio, dado que permiten crear un modelo de probabilidad, ``loss="log"`` y ``loss="modified_huber"`` son más adecuados para la clasificación uno contra todos.

source: :class:`SGDClassifier` supports both weighted classes and weighted instances via the fit parameters ``class_weight`` and ``sample_weight``. See the examples below and the docstring of :meth:`SGDClassifier.fit` for further information.
es_es: :class:`SGDClassifier` soporta tanto clases ponderadas como instancias ponderadas a través de los parámetros de ajuste ``class_weight`` y ``sample_weight``. Para más información, consulta los ejemplos siguientes y la cadena de documentación de :meth:`SGDClassifier.fit`.

source: :class:`SGDClassifier` supports averaged SGD (ASGD) [#4]_. Averaging can be enabled by setting `average=True`. ASGD performs the same updates as the regular SGD (see :ref:`sgd_mathematical_formulation`), but instead of using the last value of the coefficients as the `coef_` attribute (i.e. the values of the last update), `coef_` is set instead to the **average** value of the coefficients across all updates. The same is done for the `intercept_` attribute. When using ASGD the learning rate can be larger and even constant, leading on some datasets to a speed up in training time.
es_es: :class:`SGDClassifier` soporta SGD promediado (averaged SGD, ASGD) [#4]_. El promediado puede activarse estableciendo `average=True`. ASGD realiza las mismas actualizaciones que el SGD regular (ver :ref:`sgd_mathematical_formulation`), pero en lugar de utilizar el último valor de los coeficientes como atributo `coef_` (es decir, los valores de la última actualización), `coef_` se establece en su lugar en el valor **promedio** de los coeficientes en todas las actualizaciones. Lo mismo se hace con el atributo `intercept_`. Cuando se utiliza el ASGD, la tasa de aprendizaje puede ser mayor e incluso constante, lo que lleva, en algunos conjuntos de datos, a una aceleración del tiempo de entrenamiento.

source: For classification with a logistic loss, another variant of SGD with an averaging strategy is available with Stochastic Average Gradient (SAG) algorithm, available as a solver in :class:`LogisticRegression`.
es_es: Para la clasificación con pérdida logística, otra variante de SGD con una estrategia de promediación está disponible con el algoritmo Gradiente Medio Estocástico (Stochastic Average Gradient , SAG), disponible como un solucionador en :class:`LogisticRegression`.

source: :ref:`sphx_glr_auto_examples_svm_plot_separating_hyperplane_unbalanced.py` (See the Note in the example)
es_es: :ref:`sphx_glr_auto_examples_svm_plot_separating_hyperplane_unbalanced.py` (Ver la Nota en el ejemplo)

source: Regression
es_es: Regresión

source: The class :class:`SGDRegressor` implements a plain stochastic gradient descent learning routine which supports different loss functions and penalties to fit linear regression models. :class:`SGDRegressor` is well suited for regression problems with a large number of training samples (> 10.000), for other problems we recommend :class:`Ridge`, :class:`Lasso`, or :class:`ElasticNet`.
es_es: La clase :class:`SGDRegressor` implementa una rutina de aprendizaje de descenso de gradiente estocástico simple que soporta diferentes funciones de pérdida y penalizaciones para ajustar modelos de regresión lineal. :class:`SGDRegressor` es muy adecuada para problemas de regresión con un gran número de muestras de entrenamiento (> 10.000), para otros problemas recomendamos :class:`Ridge`, :class:`Lasso`, o :class:`ElasticNet`.

source: The concrete loss function can be set via the ``loss`` parameter. :class:`SGDRegressor` supports the following loss functions:
es_es: La función de pérdida concreta puede establecerse mediante el parámetro ``loss``. :class:`SGDRegressor` admite las siguientes funciones de pérdida:

source: ``loss="squared_loss"``: Ordinary least squares,
es_es: ``loss="squared_loss"``: Mínimos cuadrados ordinarios,

source: ``loss="huber"``: Huber loss for robust regression,
es_es: ``loss="huber"``: Pérdida de Huber para una regresión robusta,

source: ``loss="epsilon_insensitive"``: linear Support Vector Regression.
es_es: ``loss="epsilon_insensitive"``: Regresión de Vectores de Soporte lineal.

source: Please refer to the :ref:`mathematical section below <sgd_mathematical_formulation>` for formulas. The Huber and epsilon-insensitive loss functions can be used for robust regression. The width of the insensitive region has to be specified via the parameter ``epsilon``. This parameter depends on the scale of the target variables.
es_es: Por favor, consulta las fórmulas en :ref:`la sección matemática más abajo <sgd_mathematical_formulation>`. Las funciones de pérdida Huber e insensibles a épsilon pueden utilizarse para una regresión robusta. La anchura de la región insensible debe especificarse mediante el parámetro ``epsilon``. Este parámetro depende de la escala de las variables objetivo.

source: The `penalty` parameter determines the regularization to be used (see description above in the classification section).
es_es: El parámetro `penalty` determina la regularización que se utilizará (ver la descripción anterior en la sección de clasificación).

source: :class:`SGDRegressor` also supports averaged SGD [#4]_ (here again, see description above in the classification section).
es_es: :class:`SGDRegressor` también admite el SGD promediado [#4]_ (de nuevo, ver la descripción anterior en la sección de clasificación).

source: For regression with a squared loss and a l2 penalty, another variant of SGD with an averaging strategy is available with Stochastic Average Gradient (SAG) algorithm, available as a solver in :class:`Ridge`.
es_es: Para la regresión con una pérdida cuadrada y una penalización l2, está disponible otra variante de SGD con una estrategia de promediación con el algoritmo Gradiente Medio Estocástico (Stochastic Average Gradient, SAG), disponible como un solucionador en :class:`Ridge`.

source: Stochastic Gradient Descent for sparse data
es_es: Descenso de Gradiente Estocástico para datos dispersos

source: The sparse implementation produces slightly different results from the dense implementation, due to a shrunk learning rate for the intercept. See :ref:`implementation_details`.
es_es: La implementación dispersa produce resultados ligeramente diferentes de la implementación densa, debido a una tasa de aprendizaje reducida para el intercepto. Ver :ref:`implementation_details`.

source: There is built-in support for sparse data given in any matrix in a format supported by `scipy.sparse <https://docs.scipy.org/doc/scipy/reference/sparse.html>`_. For maximum efficiency, however, use the CSR matrix format as defined in `scipy.sparse.csr_matrix <https://docs.scipy.org/doc/scipy/reference/generated/scipy.sparse.csr_matrix.html>`_.
es_es: Hay soporte integrado para datos dispersos dados en cualquier matriz en un formato soportado por `scipy.sparse <https://docs.scipy.org/doc/scipy/reference/sparse.html>`_. Sin embargo, para obtener la máxima eficiencia, utiliza el formato de matriz CSR definido en `scipy.sparse.csr_matrix <https://docs.scipy.org/doc/scipy/reference/generated/scipy.sparse.csr_matrix.html>`_.

source: Complexity
es_es: Complejidad

source: The major advantage of SGD is its efficiency, which is basically linear in the number of training examples. If X is a matrix of size (n, p) training has a cost of :math:`O(k n \bar p)`, where k is the number of iterations (epochs) and :math:`\bar p` is the average number of non-zero attributes per sample.
es_es: La mayor ventaja de SGD es su eficiencia, que es básicamente lineal en el número de ejemplos de entrenamiento. Si X es una matriz de tamaño (n, p) el entrenamiento tiene un costo de :math:`O(k n \bar p)`, donde k es el número de iteraciones (épocas) y :math:`bar p` es el número promedio de atributos distintos de cero por muestra.

source: Recent theoretical results, however, show that the runtime to get some desired optimization accuracy does not increase as the training set size increases.
es_es: Sin embargo, los resultados teóricos recientes muestran que el tiempo de ejecución para obtener cierta precisión de optimización deseada no aumenta a medida que aumenta el tamaño del conjunto de entrenamiento.

source: Stopping criterion
es_es: Criterio de parada

source: The classes :class:`SGDClassifier` and :class:`SGDRegressor` provide two criteria to stop the algorithm when a given level of convergence is reached:
es_es: Las clases :class:`SGDClassifier` y :class:`SGDRegressor` proporcionan dos criterios para detener el algoritmo cuando se alcanza un determinado nivel de convergencia:

source: With ``early_stopping=True``, the input data is split into a training set and a validation set. The model is then fitted on the training set, and the stopping criterion is based on the prediction score (using the `score` method) computed on the validation set. The size of the validation set can be changed with the parameter ``validation_fraction``.
es_es: Con ``early_stopping=True``, los datos de entrada se dividen en un conjunto de entrenamiento y un conjunto de validación. El modelo se ajusta al conjunto de entrenamiento y el criterio de parada se basa en la puntuación de la predicción (utilizando el método `score`) calculada en el conjunto de validación. El tamaño del conjunto de validación puede modificarse con el parámetro ``validation_fraction``.

source: With ``early_stopping=False``, the model is fitted on the entire input data and the stopping criterion is based on the objective function computed on the training data.
es_es: Con ``early_stopping=False``, el modelo se ajusta a todos los datos de entrada y el criterio de parada se basa en la función objetivo calculada en los datos de entrenamiento.
