Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/svm.po
Languages: es_es

source: Support Vector Machines
es_es: Máquinas de Vectores de Soporte

source: **Support vector machines (SVMs)** are a set of supervised learning methods used for :ref:`classification <svm_classification>`, :ref:`regression <svm_regression>` and :ref:`outliers detection <svm_outlier_detection>`.
es_es: Las **máquinas de vectores de soporte (support vector machines, SVMs)** son un conjunto de métodos de aprendizaje supervisado que se utilizan para la :ref:`clasificación <svm_classification>`, la :ref:`regresión <svm_regression>` y la :ref:`detección de valores atípicos <svm_outlier_detection>`.

source: The advantages of support vector machines are:
es_es: Las ventajas de las máquinas de vectores de soporte son:

source: Effective in high dimensional spaces.
es_es: Efectivas en espacios de alta dimensión.

source: Still effective in cases where number of dimensions is greater than the number of samples.
es_es: Aún efectivas en los casos en que el número de dimensiones es mayor que el número de muestras.

source: Uses a subset of training points in the decision function (called support vectors), so it is also memory efficient.
es_es: Utilizan un subconjunto de puntos de entrenamiento en la función de decisión (llamados vectores de soporte), por lo que también son eficientes en cuanto a memoria.

source: Versatile: different :ref:`svm_kernels` can be specified for the decision function. Common kernels are provided, but it is also possible to specify custom kernels.
es_es: Versátiles: se pueden especificar diferentes :ref:`svm_kernels` para la función de decisión. Se proporcionan kernels comunes, pero también es posible especificar kernels personalizados.

source: The disadvantages of support vector machines include:
es_es: Las desventajas de las máquinas de vectores de soporte incluyen:

source: If the number of features is much greater than the number of samples, avoid over-fitting in choosing :ref:`svm_kernels` and regularization term is crucial.
es_es: Si el número de características es mucho mayor que el número de muestras, hay que evitar el sobreajuste al elegir :ref:`svm_kernels` y el término de regularización es crucial.

source: SVMs do not directly provide probability estimates, these are calculated using an expensive five-fold cross-validation (see :ref:`Scores and probabilities <scores_probabilities>`, below).
es_es: Las SVMs no proporcionan directamente estimaciones de probabilidad, éstas se calculan utilizando una costosa validación cruzada de cinco-pliegues (ver :ref:`Puntuaciones y probabilidades <scores_probabilities>`, más abajo).

source: The support vector machines in scikit-learn support both dense (``numpy.ndarray`` and convertible to that by ``numpy.asarray``) and sparse (any ``scipy.sparse``) sample vectors as input. However, to use an SVM to make predictions for sparse data, it must have been fit on such data. For optimal performance, use C-ordered ``numpy.ndarray`` (dense) or ``scipy.sparse.csr_matrix`` (sparse) with ``dtype=float64``.
es_es: Las máquinas de vectores de soporte en scikit-learn admiten como entrada tanto vectores de muestra densos (``numpy.ndarray`` y convertibles a eso por ``numpy.asarray``) como dispersos (cualquier ``scipy.sparse``). Sin embargo, para utilizar una SVM para hacer predicciones para datos dispersos, debe haber sido ajustada en dichos datos. Para un rendimiento óptimo, utiliza ``numpy.ndarray`` ordenado en C (denso) o ``scipy.sparse.csr_matrix`` (disperso) con ``dtype=float64``.

source: Classification
es_es: Clasificación

source: :class:`SVC`, :class:`NuSVC` and :class:`LinearSVC` are classes capable of performing binary and multi-class classification on a dataset.
es_es: :class:`SVC`, :class:`NuSVC` y :class:`LinearSVC` son clases capaces de realizar una clasificación binaria y multiclase en un conjunto de datos.

source: :class:`SVC` and :class:`NuSVC` are similar methods, but accept slightly different sets of parameters and have different mathematical formulations (see section :ref:`svm_mathematical_formulation`). On the other hand, :class:`LinearSVC` is another (faster) implementation of Support Vector Classification for the case of a linear kernel. Note that :class:`LinearSVC` does not accept parameter ``kernel``, as this is assumed to be linear. It also lacks some of the attributes of :class:`SVC` and :class:`NuSVC`, like ``support_``.
es_es: :class:`SVC` y :class:`NuSVC` son métodos similares, pero aceptan conjuntos de parámetros ligeramente diferentes y tienen formulaciones matemáticas distintas (ver la sección :ref:`svm_mathematical_formulation`). Por otro lado, :class:`LinearSVC` es otra implementación (más rápida) de la Clasificación por Vectores de Soporte para el caso de un kernel lineal. Ten en cuenta que :class:`LinearSVC` no acepta el parámetro ``kernel``, ya que se supone que es lineal. También carece de algunos de los atributos de :class:`SVC` y :class:`NuSVC`, como ``support_``.

source: As other classifiers, :class:`SVC`, :class:`NuSVC` and :class:`LinearSVC` take as input two arrays: an array `X` of shape `(n_samples, n_features)` holding the training samples, and an array `y` of class labels (strings or integers), of shape `(n_samples)`::
es_es: Como otros clasificadores, :class:`SVC`, :class:`NuSVC` y :class:`LinearSVC` toman como entrada dos arreglos: un arreglo `X` de forma `(n_samples, n_features)` que contiene las muestras de entrenamiento, y un arreglo `y` de etiquetas de clase (cadenas o enteros), de forma `(n_samples)`::

source: After being fitted, the model can then be used to predict new values::
es_es: Una vez ajustado, el modelo puede ser utilizado para predecir nuevos valores::

source: SVMs decision function (detailed in the :ref:`svm_mathematical_formulation`) depends on some subset of the training data, called the support vectors. Some properties of these support vectors can be found in attributes ``support_vectors_``, ``support_`` and ``n_support_``::
es_es: La función de decisión de las SVMs (detallada en la :ref:`svm_mathematical_formulation`) depende de un subconjunto de los datos de entrenamiento, llamados vectores de soporte. Algunas propiedades de estos vectores de soporte se pueden encontrar en los atributos ``support_vectors_``, ``support_`` y ``n_support_``::

source: Multi-class classification
es_es: Clasificación multiclase

source: :class:`SVC` and :class:`NuSVC` implement the "one-versus-one" approach for multi-class classification. In total, ``n_classes * (n_classes - 1) / 2`` classifiers are constructed and each one trains data from two classes. To provide a consistent interface with other classifiers, the ``decision_function_shape`` option allows to monotonically transform the results of the "one-versus-one" classifiers to a "one-vs-rest" decision function of shape ``(n_samples, n_classes)``.
es_es: :class:`SVC` y :class:`NuSVC` implementan el enfoque "uno contra uno" para la clasificación multiclase. En total, se construyen ``n_classes * (n_classes - 1) / 2` clasificadores y cada uno entrena datos de dos clases. Para proporcionar una interfaz consistente con otros clasificadores, la opción ``decision_function_shape`` permite transformar monotónicamente los resultados de los clasificadores "uno contra uno" a una función de decisión "uno contra el resto" de forma ``(n_samples, n_classes)``.

source: On the other hand, :class:`LinearSVC` implements "one-vs-the-rest" multi-class strategy, thus training `n_classes` models.
es_es: Por otro lado, :class:`LinearSVC` implementa la estrategia multiclase "uno contra el resto", entrenando así modelos `n_classes`.

source: See :ref:`svm_mathematical_formulation` for a complete description of the decision function.
es_es: Ver :ref:`svm_mathematical_formulation` para una descripción completa de la función de decisión.

source: Note that the :class:`LinearSVC` also implements an alternative multi-class strategy, the so-called multi-class SVM formulated by Crammer and Singer [#8]_, by using the option ``multi_class='crammer_singer'``. In practice, one-vs-rest classification is usually preferred, since the results are mostly similar, but the runtime is significantly less.
es_es: Ten en cuenta que :class:`LinearSVC` también implementa una estrategia alternativa multiclase, la llamada SVM multiclase formulada por Crammer y Singer [#8]_, utilizando la opción ``multi_class='crammer_singer'``. En la práctica, se suele preferir la clasificación uno contra el resto, ya que los resultados son en su mayoría similares, pero el tiempo de ejecución es significativamente menor.

source: For "one-vs-rest" :class:`LinearSVC` the attributes ``coef_`` and ``intercept_`` have the shape ``(n_classes, n_features)`` and ``(n_classes,)`` respectively. Each row of the coefficients corresponds to one of the ``n_classes`` "one-vs-rest" classifiers and similar for the intercepts, in the order of the "one" class.
es_es: Para el :class:`LinearSVC` "uno contra el resto" los atributos ``coef_`` e ``intercept_`` tienen la forma ``(n_classes, n_features)`` y ``(n_classes,)`` respectivamente. Cada fila de los coeficientes corresponde a uno de los clasificadores ``n_classes`` "uno contra el resto" y lo mismo para los interceptos, en el orden de la clase "uno".

source: In the case of "one-vs-one" :class:`SVC` and :class:`NuSVC`, the layout of the attributes is a little more involved. In the case of a linear kernel, the attributes ``coef_`` and ``intercept_`` have the shape ``(n_classes * (n_classes - 1) / 2, n_features)`` and ``(n_classes * (n_classes - 1) / 2)`` respectively. This is similar to the layout for :class:`LinearSVC` described above, with each row now corresponding to a binary classifier. The order for classes 0 to n is "0 vs 1", "0 vs 2" , ... "0 vs n", "1 vs 2", "1 vs 3", "1 vs n", . . . "n-1 vs n".
es_es: En el caso de :class:`SVC` y :class:`NuSVC` "uno contra uno", la disposición de los atributos es un poco más complicada. En el caso de un kernel lineal, los atributos ``coef_`` e ``intercept_`` tienen la forma ``(n_classes * (n_classes - 1) / 2, n_features)`` y ``(n_classes * (n_classes - 1) / 2)`` respectivamente. Esto es similar al diseño de :class:`LinearSVC` descrito anteriormente, con cada fila correspondiente a un clasificador binario. El orden para las clases 0 a n es "0 vs 1", "0 vs 2", ... "0 vs n", "1 vs 2", "1 vs 3", "1 vs n", ... "n-1 vs n".

source: The shape of ``dual_coef_`` is ``(n_classes-1, n_SV)`` with a somewhat hard to grasp layout. The columns correspond to the support vectors involved in any of the ``n_classes * (n_classes - 1) / 2`` "one-vs-one" classifiers. Each of the support vectors is used in ``n_classes - 1`` classifiers. The ``n_classes - 1`` entries in each row correspond to the dual coefficients for these classifiers.
es_es: La forma de ``dual_coef_`` es ``(n_classes-1, n_SV)`` con un diseño algo difícil de entender. Las columnas corresponden a los vectores de soporte implicados en cualquiera de los ``n_classes * (n_classes - 1) / 2`` clasificadores "uno contra uno". Cada uno de los vectores de soporte se utiliza en ``n_classes - 1`` clasificadores. Las ``n_classes - 1`` entradas de cada fila corresponden a los coeficientes duales para estos clasificadores.

source: This might be clearer with an example: consider a three class problem with class 0 having three support vectors :math:`v^{0}_0, v^{1}_0, v^{2}_0` and class 1 and 2 having two support vectors :math:`v^{0}_1, v^{1}_1` and :math:`v^{0}_2, v^{1}_2` respectively. For each support vector :math:`v^{j}_i`, there are two dual coefficients. Let's call the coefficient of support vector :math:`v^{j}_i` in the classifier between classes :math:`i` and :math:`k` :math:`\alpha^{j}_{i,k}`. Then ``dual_coef_`` looks like this:
es_es: Esto puede ser más claro con un ejemplo: considera un problema de tres clases con la clase 0 que tiene tres vectores de soporte :math:`v^{0}_0, v^{1}_0, v^{2}_0` y las clases 1 y 2 que tienen dos vectores de soporte :math:`v^{0}_1, v^{1}_1` y :math:`v^{0}_2, v^{1}_2` respectivamente. Para cada vector de soporte :math:`v^{j}_i`, hay dos coeficientes duales. Llamemos al coeficiente del vector de soporte :math:`v^{j}_i` en el clasificador entre las clases :math:`i` y :math:`k` :math:`alpha^{j}_{i,k}`. Entonces ``dual_coef_`` tiene el siguiente aspecto:

source: Coefficients for SVs of class 0
es_es: Coeficientes para SVs de la clase 0

source: Coefficients for SVs of class 1
es_es: Coeficientes para SVs de la clase 1

source: Coefficients for SVs of class 2
es_es: Coeficientes para SVs de la clase 2

source: Scores and probabilities
es_es: Puntuaciones y probabilidades

source: The ``decision_function`` method of :class:`SVC` and :class:`NuSVC` gives per-class scores for each sample (or a single score per sample in the binary case). When the constructor option ``probability`` is set to ``True``, class membership probability estimates (from the methods ``predict_proba`` and ``predict_log_proba``) are enabled. In the binary case, the probabilities are calibrated using Platt scaling [#1]_: logistic regression on the SVM's scores, fit by an additional cross-validation on the training data. In the multiclass case, this is extended as per [#2]_.
es_es: El método ``decision_function`` de :class:`SVC` y :class:`NuSVC` proporciona puntuaciones por clase para cada muestra (o una única puntuación por muestra en el caso binario). Cuando la opción del constructor ``probability` se establece en ``True``, se habilitan las estimaciones de probabilidad de pertenencia a la clase (de los métodos ``predict_proba`` y ``predict_log_proba``). En el caso binario, las probabilidades se calibran utilizando el escalamiento de Platt [#1]_: regresión logística sobre las puntuaciones de la SVM, ajustada por una validación cruzada adicional sobre los datos de entrenamiento. En el caso multiclase, esto se amplía según [#2]_.

source: The same probability calibration procedure is available for all estimators via the :class:`~sklearn.calibration.CalibratedClassifierCV` (see :ref:`calibration`). In the case of :class:`SVC` and :class:`NuSVC`, this procedure is builtin in `libsvm`_ which is used under the hood, so it does not rely on scikit-learn's :class:`~sklearn.calibration.CalibratedClassifierCV`.
es_es: El mismo procedimiento de calibración de la probabilidad está disponible para todos los estimadores a través de :class:`~sklearn.calibration.CalibratedClassifierCV` (ver :ref:`calibration`). En el caso de :class:`SVC` y :class:`NuSVC`, este procedimiento está incorporado en `libsvm`_ que se utiliza a nivel interno, por lo que no depende de :class:`~sklearn.calibration.CalibratedClassifierCV` de scikit-learn.

source: The cross-validation involved in Platt scaling is an expensive operation for large datasets. In addition, the probability estimates may be inconsistent with the scores:
es_es: La validación cruzada que implica el escalamiento de Platt es una operación costosa para conjuntos de datos grandes. Además, las estimaciones de probabilidad pueden ser inconsistentes con las puntuaciones:

source: the "argmax" of the scores may not be the argmax of the probabilities
es_es: el "argmax" de las puntuaciones puede no ser el argmax de las probabilidades

source: in binary classification, a sample may be labeled by ``predict`` as belonging to the positive class even if the output of `predict_proba` is less than 0.5; and similarly, it could be labeled as negative even if the output of `predict_proba` is more than 0.5.
es_es: en la clasificación binaria, una muestra puede ser etiquetada por ``predict`` como perteneciente a la clase positiva incluso si la salida de ``predict_proba`` es menor que 0,5; y de forma similar, podría ser etiquetada como negativa incluso si la salida de ``predict_proba`` es mayor que 0,5.

source: Platt's method is also known to have theoretical issues. If confidence scores are required, but these do not have to be probabilities, then it is advisable to set ``probability=False`` and use ``decision_function`` instead of ``predict_proba``.
es_es: También se sabe que el método de Platt tiene problemas teóricos. Si se requieren puntuaciones de confianza, pero éstas no tienen que ser probabilidades, entonces es aconsejable establecer ``probability=False`` y utilizar ``decision_function`` en lugar de ``predict_proba``.

source: Please note that when ``decision_function_shape='ovr'`` and ``n_classes > 2``, unlike ``decision_function``, the ``predict`` method does not try to break ties by default. You can set ``break_ties=True`` for the output of ``predict`` to be the same as ``np.argmax(clf.decision_function(...), axis=1)``, otherwise the first class among the tied classes will always be returned; but have in mind that it comes with a computational cost. See :ref:`sphx_glr_auto_examples_svm_plot_svm_tie_breaking.py` for an example on tie breaking.
es_es: Ten en cuenta que cuando ``decision_function_shape='ovr'`` y ``n_classes > 2``, a diferencia de ``decision_function``, el método ``predict`` no intenta romper vínculos por defecto. Puedes establecer ``break_ties=True`` para que la salida de ``predict`` sea la misma que ``np.argmax(clf.decision_function(...), axis=1)``, de lo contrario siempre se devolverá la primera clase entre las clases vinculadas; pero ten en cuenta que tiene un costo computacional. Ver :ref:`sphx_glr_auto_examples_svm_plot_svm_tie_breaking.py` para un ejemplo de desvinculación.

source: Unbalanced problems
es_es: Problemas no balanceados

source: In problems where it is desired to give more importance to certain classes or certain individual samples, the parameters ``class_weight`` and ``sample_weight`` can be used.
es_es: En los problemas en los que se desea dar más importancia a ciertas clases o a ciertas muestras individuales, se pueden utilizar los parámetros ``class_weight`` y ``sample_weight``.

source: :class:`SVC` (but not :class:`NuSVC`) implements the parameter ``class_weight`` in the ``fit`` method. It's a dictionary of the form ``{class_label : value}``, where value is a floating point number > 0 that sets the parameter ``C`` of class ``class_label`` to ``C * value``. The figure below illustrates the decision boundary of an unbalanced problem, with and without weight correction.
es_es: :class:`SVC` (pero no :class:`NuSVC`) implementa el parámetro ``class_weight`` en el método ``fit``. Es un diccionario de la forma ``{class_label : value}``, donde value es un número de punto flotante > 0 que establece el parámetro ``C`` de la clase ``class_label`` a ``C * value``. La figura siguiente ilustra la frontera de decisión de un problema no balanceado, con y sin corrección de ponderación.

source: :class:`SVC`, :class:`NuSVC`, :class:`SVR`, :class:`NuSVR`, :class:`LinearSVC`, :class:`LinearSVR` and :class:`OneClassSVM` implement also weights for individual samples in the `fit` method through the ``sample_weight`` parameter. Similar to ``class_weight``, this sets the parameter ``C`` for the i-th example to ``C * sample_weight[i]``, which will encourage the classifier to get these samples right. The figure below illustrates the effect of sample weighting on the decision boundary. The size of the circles is proportional to the sample weights:
es_es: :class:`SVC`, :class:`NuSVC`, :class:`SVR`, :class:`NuSVR`, :class:`LinearSVC`, :class:`LinearSVR` y :class:`OneClassSVM` implementan también ponderaciones para las muestras individuales en el método `fit` a través del parámetro ``sample_weight``. Similar a ``class_weight``, establece el parámetro ``C`` para el ejemplo i-ésimo en ``C * sample_weight[i]``, lo que animará al clasificador a acertar con estas muestras. La figura siguiente ilustra el efecto de la ponderación de las muestras en la frontera de decisión. El tamaño de los círculos es proporcional a las ponderaciones de las muestras:

source: Regression
es_es: Regresión

source: The method of Support Vector Classification can be extended to solve regression problems. This method is called Support Vector Regression.
es_es: El método de Clasificación por Vectores de Soporte puede ampliarse para resolver problemas de regresión. Este método se denomina Regresión con Vectores de Soporte.

source: The model produced by support vector classification (as described above) depends only on a subset of the training data, because the cost function for building the model does not care about training points that lie beyond the margin. Analogously, the model produced by Support Vector Regression depends only on a subset of the training data, because the cost function ignores samples whose prediction is close to their target.
es_es: El modelo producido por la clasificación por vectores de soporte (como se ha descrito anteriormente) sólo depende de un subconjunto de los datos de entrenamiento, porque la función de costo para construir el modelo no se preocupa por los puntos de entrenamiento que se encuentran más allá del margen. De forma análoga, el modelo producido por la Regresión con Vectores de Soporte depende sólo de un subconjunto de los datos de entrenamiento, porque la función de costo ignora muestras cuya predicción está cerca de su objetivo.

source: There are three different implementations of Support Vector Regression: :class:`SVR`, :class:`NuSVR` and :class:`LinearSVR`. :class:`LinearSVR` provides a faster implementation than :class:`SVR` but only considers the linear kernel, while :class:`NuSVR` implements a slightly different formulation than :class:`SVR` and :class:`LinearSVR`. See :ref:`svm_implementation_details` for further details.
es_es: Hay tres implementaciones diferentes de la Regresión con Vectores de Soporte: :class:`SVR`, :class:`NuSVR` y :class:`LinearSVR`. :class:`LinearSVR` proporciona una implementación más rápida que :class:`SVR` pero sólo considera el kernel lineal, mientras que :class:`NuSVR` implementa una formulación ligeramente diferente a la de :class:`SVR` y :class:`LinearSVR`. Ver :ref:`svm_implementation_details` para más detalles.

source: As with classification classes, the fit method will take as argument vectors X, y, only that in this case y is expected to have floating point values instead of integer values::
es_es: Al igual que con las clases de clasificación, el método de ajuste tomará como argumento los vectores X, y, sólo que en este caso se espera que y tenga valores de punto flotante en lugar de valores enteros::

source: Density estimation, novelty detection
es_es: Estimación de la densidad, detección de novedades

source: The class :class:`OneClassSVM` implements a One-Class SVM which is used in outlier detection.
es_es: La clase :class:`OneClassSVM` implementa una SVM de una clase que se utiliza en la detección de valores atípicos.

source: See :ref:`outlier_detection` for the description and usage of OneClassSVM.
es_es: Ver :ref:`outlier_detection` para la descripción y uso de OneClassSVM.

source: Complexity
es_es: Complejidad
