Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/svm.po
Languages: es_es

source: Support Vector Machines are powerful tools, but their compute and storage requirements increase rapidly with the number of training vectors. The core of an SVM is a quadratic programming problem (QP), separating support vectors from the rest of the training data. The QP solver used by the `libsvm`_-based implementation scales between :math:`O(n_{features} \times n_{samples}^2)` and :math:`O(n_{features} \times n_{samples}^3)` depending on how efficiently the `libsvm`_ cache is used in practice (dataset dependent). If the data is very sparse :math:`n_{features}` should be replaced by the average number of non-zero features in a sample vector.
es_es: Las Máquinas de Vectores de Soporte son herramientas potentes, pero sus requisitos de cálculo y almacenamiento aumentan rápidamente con el número de vectores de entrenamiento. El core de una SVM es un problema de programación cuadrática (QP) que separa los vectores de soporte del resto de los datos de entrenamiento. El solucionador de QP utilizado por la implementación basada en `libsvm`_ escala entre :math:`O(n_{features} \times n_{samples}^2)` y :math:`O(n_{features} \times n_{samples}^3)` dependiendo de la eficiencia con la que se utilice la caché de `libsvm`_ en la práctica (depende del conjunto de datos). Si los datos son muy escasos, :math:`n_{features}` debe sustituirse por el número promedio de características distintas de cero en un vector de muestras.

source: For the linear case, the algorithm used in :class:`LinearSVC` by the `liblinear`_ implementation is much more efficient than its `libsvm`_-based :class:`SVC` counterpart and can scale almost linearly to millions of samples and/or features.
es_es: Para el caso lineal, el algoritmo utilizado en :class:`LinearSVC` por la implementación `liblinear`_ es mucho más eficiente que su contraparte :class:`SVC` basada en `libsvm`_ y puede escalar casi linealmente a millones de muestras y/o características.

source: Tips on Practical Use
es_es: Consejos de Uso Práctico

source: **Avoiding data copy**: For :class:`SVC`, :class:`SVR`, :class:`NuSVC` and :class:`NuSVR`, if the data passed to certain methods is not C-ordered contiguous and double precision, it will be copied before calling the underlying C implementation. You can check whether a given numpy array is C-contiguous by inspecting its ``flags`` attribute.
es_es: **Evitar la copia de datos**: Para :class:`SVC`, :class:`SVR`, :class:`NuSVC` y :class:`NuSVR`, si los datos pasados a ciertos métodos no son contiguos ordenados en C y de doble precisión, serán copiados antes de llamar a la implementación C subyacente. Puedes comprobar si un arreglo numpy dado es contiguo a C inspeccionando su atributo ``flags``.

source: For :class:`LinearSVC` (and :class:`LogisticRegression <sklearn.linear_model.LogisticRegression>`) any input passed as a numpy array will be copied and converted to the `liblinear`_ internal sparse data representation (double precision floats and int32 indices of non-zero components). If you want to fit a large-scale linear classifier without copying a dense numpy C-contiguous double precision array as input, we suggest to use the :class:`SGDClassifier <sklearn.linear_model.SGDClassifier>` class instead. The objective function can be configured to be almost the same as the :class:`LinearSVC` model.
es_es: Para :class:`LinearSVC` (y :class:`LogisticRegression <sklearn.linear_model.LogisticRegression>`) cualquier entrada pasada como un arreglo de numpy será copiada y convertida a la representación interna de datos dispersos de `liblinear`_ (números de punto flotante de doble precisión e índices int32 de componentes distintos de cero). Si quieres ajustar un clasificador lineal a gran escala sin copiar un arreglo numpy denso de doble precisión contiguo a C como entrada, te sugerimos que utilices la clase :class:`SGDClassifier <sklearn.linear_model.SGDClassifier>` en su lugar. La función objetivo puede ser configurada para ser casi la misma que la del modelo :class:`LinearSVC`.

source: **Kernel cache size**: For :class:`SVC`, :class:`SVR`, :class:`NuSVC` and :class:`NuSVR`, the size of the kernel cache has a strong impact on run times for larger problems. If you have enough RAM available, it is recommended to set ``cache_size`` to a higher value than the default of 200(MB), such as 500(MB) or 1000(MB).
es_es: **Tamaño de la caché del kernel**: Para :class:`SVC`, :class:`SVR`, :class:`NuSVC` y :class:`NuSVR`, el tamaño de la caché del kernel tiene un fuerte impacto en los tiempos de ejecución para problemas mayores. Si tienes suficiente RAM disponible, se recomienda establecer ``cache_size`` a un valor mayor que el predeterminado de 200(MB), como 500(MB) o 1000(MB).

source: **Setting C**: ``C`` is ``1`` by default and it's a reasonable default choice. If you have a lot of noisy observations you should decrease it: decreasing C corresponds to more regularization.
es_es: **Establecer C**: ``C`` es ``1`` por defecto y es una opción por defecto razonable. Si tienes muchas observaciones ruidosas, debes disminuirla: la disminución de C corresponde a una mayor regularización.

source: :class:`LinearSVC` and :class:`LinearSVR` are less sensitive to ``C`` when it becomes large, and prediction results stop improving after a certain threshold. Meanwhile, larger ``C`` values will take more time to train, sometimes up to 10 times longer, as shown in [#3]_.
es_es: :class:`LinearSVC` y :class:`LinearSVR` son menos sensibles a ``C`` cuando se hace grande, y los resultados de la predicción dejan de mejorar a partir de cierto umbral. Mientras que los valores más grandes de ``C`` tardarán más tiempo en entrenarse, a veces hasta 10 veces más, como se muestra en [#3]_.

source: Support Vector Machine algorithms are not scale invariant, so **it is highly recommended to scale your data**. For example, scale each attribute on the input vector X to [0,1] or [-1,+1], or standardize it to have mean 0 and variance 1. Note that the *same* scaling must be applied to the test vector to obtain meaningful results. This can be done easily by using a :class:`~sklearn.pipeline.Pipeline`::
es_es: Los algoritmos de Máquinas de Vectores de Soporte no son invariantes a la escala, por lo que **es altamente recomendable escalar los datos**. Por ejemplo, escala cada atributo del vector de entrada X a [0,1] o [-1,+1], o estandarízalo para que tenga media 0 y varianza 1. Ten en cuenta que el *mismo* escalamiento debe aplicarse al vector de prueba para obtener resultados significativos. Esto puede hacerse fácilmente utilizando :class:`~sklearn.pipeline.Pipeline`::

source: See section :ref:`preprocessing` for more details on scaling and normalization.
es_es: Ver la sección :ref:`preprocessing` para más detalles sobre escalamiento y normalización.

source: Regarding the `shrinking` parameter, quoting [#4]_: *We found that if the number of iterations is large, then shrinking can shorten the training time. However, if we loosely solve the optimization problem (e.g., by using a large stopping tolerance), the code without using shrinking may be much faster*
es_es: En cuanto al parámetro `shrinking`, citando [#4]_: *Descubrimos que si el número de iteraciones es grande, entonces la reducción (shrinking) puede acortar el tiempo de entrenamiento. Sin embargo, si resolvemos el problema de optimización de forma holgada (por ejemplo, utilizando una gran tolerancia de parada), el código sin utilizar la reducción puede ser mucho más rápido*

source: Parameter ``nu`` in :class:`NuSVC`/:class:`OneClassSVM`/:class:`NuSVR` approximates the fraction of training errors and support vectors.
es_es: El parámetro ``nu`` en :class:`NuSVC`/:class:`OneClassSVM`/:class:`NuSVR` aproxima la fracción de errores de entrenamiento y vectores de soporte.

source: In :class:`SVC`, if the data is unbalanced (e.g. many positive and few negative), set ``class_weight='balanced'`` and/or try different penalty parameters ``C``.
es_es: En :class:`SVC`, si los datos están desbalanceados (por ejemplo, muchos positivos y pocos negativos), establezca ``class_weight='balanced'`` y/o pruebe diferentes parámetros de penalización ``C``.

source: **Randomness of the underlying implementations**: The underlying implementations of :class:`SVC` and :class:`NuSVC` use a random number generator only to shuffle the data for probability estimation (when ``probability`` is set to ``True``). This randomness can be controlled with the ``random_state`` parameter. If ``probability`` is set to ``False`` these estimators are not random and ``random_state`` has no effect on the results. The underlying :class:`OneClassSVM` implementation is similar to the ones of :class:`SVC` and :class:`NuSVC`. As no probability estimation is provided for :class:`OneClassSVM`, it is not random.
es_es: **Aleatoriedad de las implementaciones subyacentes**: Las implementaciones subyacentes de :class:`SVC` y :class:`NuSVC` utilizan un generador de números aleatorios sólo para revolver los datos para la estimación de la probabilidad (cuando ``probability`` se establece en ``True``). Esta aleatoriedad se puede controlar con el parámetro ``random_state``. Si ``probability`` se establece en ``False`` estos estimadores no son aleatorios y ``random_state`` no tiene efecto en los resultados. La implementación subyacente de :class:`OneClassSVM` es similar a las de :class:`SVC` y :class:`NuSVC`. Como no se proporciona ninguna estimación de probabilidad para :class:`OneClassSVM`, no es aleatorio.

source: The underlying :class:`LinearSVC` implementation uses a random number generator to select features when fitting the model with a dual coordinate descent (i.e when ``dual`` is set to ``True``). It is thus not uncommon to have slightly different results for the same input data. If that happens, try with a smaller `tol` parameter. This randomness can also be controlled with the ``random_state`` parameter. When ``dual`` is set to ``False`` the underlying implementation of :class:`LinearSVC` is not random and ``random_state`` has no effect on the results.
es_es: La implementación subyacente de :class:`LinearSVC` utiliza un generador de números aleatorios para seleccionar las características cuando se ajusta el modelo con un descenso coordinado dual (es decir, cuando ``dual`` se establece en ``True``). Por lo tanto, no es raro tener resultados ligeramente diferentes para los mismos datos de entrada. Si esto ocurre, prueba con un parámetro `tol` más pequeño. Esta aleatoriedad también se puede controlar con el parámetro ``random_state``. Cuando ``dual`` se establece en ``False`` la implementación subyacente de :class:`LinearSVC` no es aleatoria y ``random_state`` no tiene efecto en los resultados.

source: Using L1 penalization as provided by ``LinearSVC(penalty='l1', dual=False)`` yields a sparse solution, i.e. only a subset of feature weights is different from zero and contribute to the decision function. Increasing ``C`` yields a more complex model (more features are selected). The ``C`` value that yields a "null" model (all weights equal to zero) can be calculated using :func:`l1_min_c`.
es_es: El uso de la penalización L1, tal y como proporciona ``LinearSVC(penalty='l1', dual=False)`` produce una solución dispersa, es decir, sólo un subconjunto de ponderaciones de características es diferente de cero y contribuye a la función de decisión. Si se aumenta ``C`` se obtiene un modelo más complejo (se seleccionan más características). El valor de ``C`` que produce un modelo "nulo" (todas las ponderaciones son iguales a cero) puede calcularse utilizando :func:`l1_min_c`.

source: Kernel functions
es_es: Funciones del Kernel

source: The *kernel function* can be any of the following:
es_es: La *función del kernel* puede ser cualquiera de las siguientes:

source: linear: :math:`\langle x, x'\rangle`.
es_es: lineal: :math:`\langle x, x'\rangle`.

source: polynomial: :math:`(\gamma \langle x, x'\rangle + r)^d`, where :math:`d` is specified by parameter ``degree``, :math:`r` by ``coef0``.
es_es: polinomial: :math:`(\gamma \langle x, x'\rangle + r)^d`, donde :math:`d` se especifica mediante el parámetro ``degree``, :math:`r` mediante ``coef0``.

source: rbf: :math:`\exp(-\gamma \|x-x'\|^2)`, where :math:`\gamma` is specified by parameter ``gamma``, must be greater than 0.
es_es: rbf: :math:`\exp(-\gamma \|x-x'\|^2)`, donde :math:`\gamma` se especifica mediante el parámetro ``gamma``, debe ser mayor que 0.

source: sigmoid :math:`\tanh(\gamma \langle x,x'\rangle + r)`, where :math:`r` is specified by ``coef0``.
es_es: sigmoide: :math:`\tanh(\gamma \langle x,x'\rangle + r)`, donde :math:`r` está especificado por ``coef0``.

source: Different kernels are specified by the `kernel` parameter::
es_es: Los diferentes kernels se especifican con el parámetro `kernel`::

source: Parameters of the RBF Kernel
es_es: Parámetros del Kernel RBF

source: When training an SVM with the *Radial Basis Function* (RBF) kernel, two parameters must be considered: ``C`` and ``gamma``. The parameter ``C``, common to all SVM kernels, trades off misclassification of training examples against simplicity of the decision surface. A low ``C`` makes the decision surface smooth, while a high ``C`` aims at classifying all training examples correctly. ``gamma`` defines how much influence a single training example has. The larger ``gamma`` is, the closer other examples must be to be affected.
es_es: Cuando se entrena una SVM con el kernel de *Función de Base Radial* (Radial Basis Function, RBF), se deben considerar dos parámetros: ``C`` y ``gamma``. El parámetro ``C``, común a todos los kernels SVM, compensa la clasificación incorrecta de los ejemplos de entrenamiento con la simplicidad de la superficie de decisión. Un valor bajo de ``C`` hace que la superficie de decisión sea suave, mientras que un valor alto de ``C`` tiene como objetivo clasificar correctamente todos los ejemplos de entrenamiento. ``gamma`` define cuánta influencia tiene un solo ejemplo de entrenamiento. Cuanto mayor sea ``gamma``, más cerca deben estar otros ejemplos para verse afectados.

source: Proper choice of ``C`` and ``gamma`` is critical to the SVM's performance. One is advised to use :class:`~sklearn.model_selection.GridSearchCV` with ``C`` and ``gamma`` spaced exponentially far apart to choose good values.
es_es: La elección adecuada de ``C`` y ``gamma`` es crítica para el rendimiento de la SVM. Se aconseja utilizar :class:`~sklearn.model_selection.GridSearchCV` con ``C`` y ``gamma`` espaciados exponencialmente para elegir buenos valores.

source: Custom Kernels
es_es: Kernels personalizados

source: You can define your own kernels by either giving the kernel as a python function or by precomputing the Gram matrix.
es_es: Puedes definir tus propios kernels proporcionando el kernel como una función python o precalculando la matriz de Gram.

source: Classifiers with custom kernels behave the same way as any other classifiers, except that:
es_es: Los clasificadores con kernels personalizados se comportan de la misma manera que cualquier otro clasificador, excepto que:

source: Field ``support_vectors_`` is now empty, only indices of support vectors are stored in ``support_``
es_es: El campo ``support_vectors_`` ahora está vacío, sólo los índices de los vectores de soporte se almacenan en ``support_``

source: A reference (and not a copy) of the first argument in the ``fit()`` method is stored for future reference. If that array changes between the use of ``fit()`` and ``predict()`` you will have unexpected results.
es_es: Se almacena una referencia (y no una copia) del primer argumento del método ``fit()`` para futuras referencias. Si ese arreglo cambia entre el uso de ``fit()`` y ``predict()`` tendrás resultados inesperados.

source: Using Python functions as kernels
es_es: Utilizando funciones de Python como kernels

source: You can use your own defined kernels by passing a function to the ``kernel`` parameter.
es_es: Puedes utilizar tus propios kernels definidos pasando una función al parámetro ``kernel``.

source: Your kernel must take as arguments two matrices of shape ``(n_samples_1, n_features)``, ``(n_samples_2, n_features)`` and return a kernel matrix of shape ``(n_samples_1, n_samples_2)``.
es_es: Tu kernel debe tomar como argumentos dos matrices de forma ``(n_samples_1, n_features)``, ``(n_samples_2, n_features)`` y devolver una matriz del kernel de forma ``(n_samples_1, n_samples_2)``.

source: The following code defines a linear kernel and creates a classifier instance that will use that kernel::
es_es: El siguiente código define un kernel lineal y crea una instancia del clasificador que utilizará ese kernel::

source: Using the Gram matrix
es_es: Utilizando la matriz de Gram

source: You can pass pre-computed kernels by using the ``kernel='precomputed'`` option. You should then pass Gram matrix instead of X to the `fit` and `predict` methods. The kernel values between *all* training vectors and the test vectors must be provided:
es_es: Puedes pasar kernels precalculados utilizando la opción ``kernel='precomputed'``. Entonces debes pasar la matriz de Gram en lugar de X a los métodos `fit` y `predict`. Los valores del kernel entre *todos* los vectores de entrenamiento y los vectores de prueba deben ser proporcionados:

source: Mathematical formulation
es_es: Formulación matemática

source: A support vector machine constructs a hyper-plane or set of hyper-planes in a high or infinite dimensional space, which can be used for classification, regression or other tasks. Intuitively, a good separation is achieved by the hyper-plane that has the largest distance to the nearest training data points of any class (so-called functional margin), since in general the larger the margin the lower the generalization error of the classifier. The figure below shows the decision function for a linearly separable problem, with three samples on the margin boundaries, called "support vectors":
es_es: Una máquina de vectores de soporte construye un hiperplano o un conjunto de hiperplanos en un espacio de dimensión alta o infinita, que puede utilizarse para la clasificación, la regresión u otras tareas. Intuitivamente, una buena separación se consigue con el hiperplano que tiene la mayor distancia a los puntos de datos de entrenamiento más cercanos de cualquier clase (el llamado margen funcional), ya que en general cuanto mayor sea el margen menor será el error de generalización del clasificador. La figura siguiente muestra la función de decisión para un problema linealmente separable, con tres muestras en las fronteras del margen, llamadas "vectores de soporte":

source: In general, when the problem isn't linearly separable, the support vectors are the samples *within* the margin boundaries.
es_es: En general, cuando el problema no es linealmente separable, los vectores de soporte son las muestras *dentro* de las fronteras del margen.

source: We recommend [#5]_ and [#6]_ as good references for the theory and practicalities of SVMs.
es_es: Recomendamos [#5]_ y [#6]_ como buenas referencias para la teoría y los aspectos prácticos de las SVMs.

source: Given training vectors :math:`x_i \in \mathbb{R}^p`, i=1,..., n, in two classes, and a vector :math:`y \in \{1, -1\}^n`, our goal is to find :math:`w \in \mathbb{R}^p` and :math:`b \in \mathbb{R}` such that the prediction given by :math:`\text{sign} (w^T\phi(x) + b)` is correct for most samples.
es_es: Dados los vectores de entrenamiento :math:`x_i \in \mathbb{R}^p`, i=1,... , n, en dos clases, y un vector :math:`y \in \{1, -1\}^n`, nuestro objetivo es encontrar :math:`w \in \mathbb{R}^p` y :math:`b \in \mathbb{R}` tal que la predicción dada por :math:`text{sign} (w^T\phi(x) + b)` sea correcta para la mayoría de las muestras.

source: SVC solves the following primal problem:
es_es: SVC resuelve el siguiente problema primal:

source: Intuitively, we're trying to maximize the margin (by minimizing :math:`||w||^2 = w^Tw`), while incurring a penalty when a sample is misclassified or within the margin boundary. Ideally, the value :math:`y_i (w^T \phi (x_i) + b)` would be :math:`\geq 1` for all samples, which indicates a perfect prediction. But problems are usually not always perfectly separable with a hyperplane, so we allow some samples to be at a distance :math:`\zeta_i` from their correct margin boundary. The penalty term `C` controls the strengh of this penalty, and as a result, acts as an inverse regularization parameter (see note below).
es_es: Intuitivamente, estamos tratando de maximizar el margen (minimizando :math:`|w||^2 = w^Tw`), mientras que se incurre en una penalización cuando una muestra está mal clasificada o dentro de la frontera del margen. Idealmente, el valor :math:`y_i (w^T \phi (x_i) + b)` sería :math:`\geq 1` para todas las muestras, lo que indica una predicción perfecta. Pero los problemas no suelen ser siempre perfectamente separables con un hiperplano, por lo que permitimos que algunas muestras estén a una distancia :math:`\zeta_i` de su frontera de margen correcta. El término de penalización `C` controla la fuerza de esta penalización, y como resultado, actúa como un parámetro de regularización inversa (ver la nota más abajo).

source: The dual problem to the primal is
es_es: El problema dual al primal es

source: where :math:`e` is the vector of all ones, and :math:`Q` is an :math:`n` by :math:`n` positive semidefinite matrix, :math:`Q_{ij} \equiv y_i y_j K(x_i, x_j)`, where :math:`K(x_i, x_j) = \phi (x_i)^T \phi (x_j)` is the kernel. The terms :math:`\alpha_i` are called the dual coefficients, and they are upper-bounded by :math:`C`. This dual representation highlights the fact that training vectors are implicitly mapped into a higher (maybe infinite) dimensional space by the function :math:`\phi`: see `kernel trick <https://en.wikipedia.org/wiki/Kernel_method>`_.
es_es: donde :math:`e` es el vector de unos, y :math:`Q` es una matriz semidefinida positiva :math:`n` por :math:`n`, :math:`Q_{ij} \equiv y_i y_j K(x_i, x_j)`, donde :math:`K(x_i, x_j) = \phi (x_i)^T \phi (x_j)` es el kernel. Los términos :math:`alpha_i` se denominan coeficientes duales y están limitados superiormente por :math:`C`. Esta representación dual resalta el hecho de que los vectores de entrenamiento son implícitamente mapeados en un espacio dimensional superior (tal vez infinito) por la función :math:`\phi`: ver `truco del kernel <https://en.wikipedia.org/wiki/Kernel_method>`_.

source: Once the optimization problem is solved, the output of :term:`decision_function` for a given sample :math:`x` becomes:
es_es: Una vez resuelto el problema de optimización, la salida de :term:`decision_function` para una muestra dada :math:`x` se convierte en:

source: and the predicted class correspond to its sign. We only need to sum over the support vectors (i.e. the samples that lie within the margin) because the dual coefficients :math:`\alpha_i` are zero for the other samples.
es_es: y la clase predicha corresponde a su signo. Sólo necesitamos sumar sobre los vectores de soporte (es decir, las muestras que se encuentran dentro del margen) porque los coeficientes duales :math:`\alpha_i` son cero para las demás muestras.

source: These parameters can be accessed through the attributes ``dual_coef_`` which holds the product :math:`y_i \alpha_i`, ``support_vectors_`` which holds the support vectors, and ``intercept_`` which holds the independent term :math:`b`
es_es: Se puede acceder a estos parámetros a través de los atributos ``dual_coef_`` que contiene el producto :math:`y_i \alpha_i`, ``support_vectors_`` que contiene los vectores de soporte, e ``intercept_`` que contiene el término independiente :math:`b`
