Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/svm.po
Languages: es_es

source: While SVM models derived from `libsvm`_ and `liblinear`_ use ``C`` as regularization parameter, most other estimators use ``alpha``. The exact equivalence between the amount of regularization of two models depends on the exact objective function optimized by the model. For example, when the estimator used is :class:`~sklearn.linear_model.Ridge` regression, the relation between them is given as :math:`C = \frac{1}{alpha}`.
es_es: Mientras que los modelos SVM derivados de `libsvm`_ y `liblinear`_ utilizan ``C`` como parámetro de regularización, la mayoría de los demás estimadores utilizan ``alpha``. La equivalencia exacta entre la cantidad de regularización de dos modelos depende de la función objetivo exacta optimizada por el modelo. Por ejemplo, cuando el estimador utilizado es la regresión :class:`~sklearn.linear_model.Ridge`, la relación entre ellos viene dada como :math:`C = \frac{1}{alpha}`.

source: The primal problem can be equivalently formulated as
es_es: El problema primal puede formularse de forma equivalente como

source: where we make use of the `hinge loss <https://en.wikipedia.org/wiki/Hinge_loss>`_. This is the form that is directly optimized by :class:`LinearSVC`, but unlike the dual form, this one does not involve inner products between samples, so the famous kernel trick cannot be applied. This is why only the linear kernel is supported by :class:`LinearSVC` (:math:`\phi` is the identity function).
es_es: donde hacemos uso de la `pérdida de bisagra <https://en.wikipedia.org/wiki/Hinge_loss>`_. Esta es la forma que se optimiza directamente con :class:`LinearSVC`, pero a diferencia de la forma dual, ésta no implica productos internos entre muestras, por lo que no se puede aplicar el famoso truco del kernel. Por ello, sólo el kernel lineal es soportado por :class:`LinearSVC` (:math:`\phi` es la función de identidad).

source: The :math:`\nu`-SVC formulation [#7]_ is a reparameterization of the :math:`C`-SVC and therefore mathematically equivalent.
es_es: La formulación :math:`\nu`-SVC [#7]_ es una reparametrización de la :math:`C`-SVC y, por lo tanto, es matemáticamente equivalente.

source: We introduce a new parameter :math:`\nu` (instead of :math:`C`) which controls the number of support vectors and *margin errors*: :math:`\nu \in (0, 1]` is an upper bound on the fraction of margin errors and a lower bound of the fraction of support vectors. A margin error corresponds to a sample that lies on the wrong side of its margin boundary: it is either misclassified, or it is correctly classified but does not lie beyond the margin.
es_es: Introducimos un nuevo parámetro :math:`\nu` (en lugar de :math:`C`) que controla el número de vectores de soporte y los *errores de margen*: :math:`\nu \in (0, 1]` es un límite superior de la fracción de errores de margen y un límite inferior de la fracción de vectores de soporte. Un error de margen corresponde a una muestra que se encuentra en el lado incorrecto de su frontera de margen: o bien está mal clasificada, o bien está correctamente clasificada pero no se encuentra más allá del margen.

source: Given training vectors :math:`x_i \in \mathbb{R}^p`, i=1,..., n, and a vector :math:`y \in \mathbb{R}^n` :math:`\varepsilon`-SVR solves the following primal problem:
es_es: Dados los vectores de entrenamiento :math:`x_i \in \mathbb{R}^p`, i=1,..., n, y un vector :math:`y \in \mathbb{R}^n` :math:`varepsilon`-SVR resuelve el siguiente problema primal:

source: Here, we are penalizing samples whose prediction is at least :math:`\varepsilon` away from their true target. These samples penalize the objective by :math:`\zeta_i` or :math:`\zeta_i^*`, depending on whether their predictions lie above or below the :math:`\varepsilon` tube.
es_es: Aquí, estamos penalizando las muestras cuya predicción está al menos :math:`\varepsilon` lejos de su verdadero objetivo. Estas muestras penalizan al objetivo por :math:`\zeta_i` o :math:`\zeta_i^*`, dependiendo de si sus predicciones se encuentran por encima o por debajo del tubo de :math:`\varepsilon`.

source: The dual problem is
es_es: El problema dual es

source: where :math:`e` is the vector of all ones, :math:`Q` is an :math:`n` by :math:`n` positive semidefinite matrix, :math:`Q_{ij} \equiv K(x_i, x_j) = \phi (x_i)^T \phi (x_j)` is the kernel. Here training vectors are implicitly mapped into a higher (maybe infinite) dimensional space by the function :math:`\phi`.
es_es: donde :math:`e` es el vector de unos, :math:`Q` es una matriz semidefinida positiva :math:`n` por :math:`n`, :math:`Q_{ij} \equiv K(x_i, x_j) = \phi (x_i)^T \phi (x_j)` es el kernel. Aquí los vectores de entrenamiento son implícitamente mapeados en un espacio dimensional superior (quizás infinito) por la función :math:`\phi`.

source: The prediction is:
es_es: La predicción es:

source: These parameters can be accessed through the attributes ``dual_coef_`` which holds the difference :math:`\alpha_i - \alpha_i^*`, ``support_vectors_`` which holds the support vectors, and ``intercept_`` which holds the independent term :math:`b`
es_es: Se puede acceder a estos parámetros a través de los atributos ``dual_coef_`` que contiene la diferencia :math:`\alpha_i - \alpha_i^*`, ``support_vectors_`` que contiene los vectores de soporte, e ``intercept_`` que contiene el término independiente :math:`b`

source: where we make use of the epsilon-insensitive loss, i.e. errors of less than :math:`\varepsilon` are ignored. This is the form that is directly optimized by :class:`LinearSVR`.
es_es: donde hacemos uso de la pérdida insensible a épsilon, es decir, los errores menores que :math:`\varepsilon` se ignoran. Esta es la forma que se optimiza directamente con :class:`LinearSVR`.

source: Implementation details
es_es: Detalles de implementación

source: Internally, we use `libsvm`_ [#4]_ and `liblinear`_ [#3]_ to handle all computations. These libraries are wrapped using C and Cython. For a description of the implementation and details of the algorithms used, please refer to their respective papers.
es_es: Internamente, usamos `libsvm`_ [#4]_ y `liblinear`_ [#3]_ para manejar todos los cálculos. Estas bibliotecas están wrapped usando C y Cython. Para una descripción de la implementación y los detalles de los algoritmos utilizados, por favor, consulta sus respectivos documentos.

source: Wu, Lin and Weng, `"Probability estimates for multi-class classification by pairwise coupling" <https://www.csie.ntu.edu.tw/~cjlin/papers/svmprob/svmprob.pdf>`_, JMLR 5:975-1005, 2004.
es_es: Wu, Lin y Weng, `"Probability estimates for multi-class classification by pairwise coupling" <https://www.csie.ntu.edu.tw/~cjlin/papers/svmprob/svmprob.pdf>`_, JMLR 5:975-1005, 2004.

source: Fan, Rong-En, et al., `"LIBLINEAR: A library for large linear classification." <https://www.csie.ntu.edu.tw/~cjlin/papers/liblinear.pdf>`_, Journal of machine learning research 9.Aug (2008): 1871-1874.
es_es: Fan, Rong-En, et al., `"LIBLINEAR: A library for large linear classification." <https://www.csie.ntu.edu.tw/~cjlin/papers/liblinear.pdf>`_, Journal of machine learning research 9. Ago. (2008): 1871-1874.

source: Chang and Lin, `LIBSVM: A Library for Support Vector Machines <https://www.csie.ntu.edu.tw/~cjlin/papers/libsvm.pdf>`_.
es_es: Chang y Lin, `LIBSVM: A Library for Support Vector Machines <https://www.csie.ntu.edu.tw/~cjlin/papers/libsvm.pdf>`_.

source: Bishop, `Pattern recognition and machine learning <https://www.microsoft.com/en-us/research/uploads/prod/2006/01/Bishop-Pattern-Recognition-and-Machine-Learning-2006.pdf>`_, chapter 7 Sparse Kernel Machines
es_es: Bishop, `Pattern recognition and machine learning <https://www.microsoft.com/en-us/research/uploads/prod/2006/01/Bishop-Pattern-Recognition-and-Machine-Learning-2006.pdf>`_, capítulo 7 Sparse Kernel Machines

source: `"A Tutorial on Support Vector Regression" <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.114.4288>`_, Alex J. Smola, Bernhard Schölkopf - Statistics and Computing archive Volume 14 Issue 3, August 2004, p. 199-222.
es_es: `"A Tutorial on Support Vector Regression" <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.114.4288>`_, Alex J. Smola, Bernhard Schölkopf - Archivo de Statistics and Computing Volumen 14 Número 3, Agosto 2004, págs. 199-222.

source: Crammer and Singer `On the Algorithmic Implementation ofMulticlass Kernel-based Vector Machines <http://jmlr.csail.mit.edu/papers/volume2/crammer01a/crammer01a.pdf>`_, JMLR 2001.
es_es: Crammer y Singer `On the Algorithmic Implementation of Multiclass Kernel-based Vector Machines <http://jmlr.csail.mit.edu/papers/volume2/crammer01a/crammer01a.pdf>`_, JMLR 2001.
