Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/tree.po
Languages: es_es

source: Balance your dataset before training to prevent the tree from being biased toward the classes that are dominant. Class balancing can be done by sampling an equal number of samples from each class, or preferably by normalizing the sum of the sample weights (``sample_weight``) for each class to the same value. Also note that weight-based pre-pruning criteria, such as ``min_weight_fraction_leaf``, will then be less biased toward dominant classes than criteria that are not aware of the sample weights, like ``min_samples_leaf``.
es_es: Equilibra tu conjunto de datos antes del entrenamiento para evitar que el árbol esté sesgado hacia las clases que son dominantes. El equilibrio de las clases puede hacerse muestreando un número igual de muestras de cada clase, o preferiblemente normalizando la suma de las ponderaciones de las muestras (``sample_weight``) para cada clase al mismo valor. También ten en cuenta que los criterios de pre-poda basados en ponderaciones, tales como ``min_weight_fraction_leaf``, entonces estarán menos sesgados hacia las clases dominantes que los criterios que no tienen en cuenta las ponderaciones de las muestras, como ``min_samples_leaf``.

source: If the samples are weighted, it will be easier to optimize the tree structure using weight-based pre-pruning criterion such as ``min_weight_fraction_leaf``, which ensure that leaf nodes contain at least a fraction of the overall sum of the sample weights.
es_es: Si las muestras están ponderadas, será más fácil optimizar la estructura del árbol usando un criterio de pre-poda basado en ponderaciones como ``min_weight_fraction_leaf``, que asegura que los nodos hoja contengan al menos una fracción de la suma total de las ponderaciones de las muestras.

source: All decision trees use ``np.float32`` arrays internally. If training data is not in this format, a copy of the dataset will be made.
es_es: Todos los árboles de decisión usan internamente arreglos ``np.float32``. Si los datos de entrenamiento no están en este formato, se hará una copia del conjunto de datos.

source: If the input matrix X is very sparse, it is recommended to convert to sparse ``csc_matrix`` before calling fit and sparse ``csr_matrix`` before calling predict. Training time can be orders of magnitude faster for a sparse matrix input compared to a dense matrix when features have zero values in most of the samples.
es_es: Si la matriz de entrada X es muy dispersa, se recomienda convertirla a dispersa ``csc_matrix`` antes de llamar a fit y dispersa ``csr_matrix`` antes de llamar a predict. El tiempo de entrenamiento pueden ser órdenes de magnitud más rápido para una matriz de entrada dispersa en comparación con una matriz densa cuando las características tienen valores cero en la mayoría de las muestras.

source: Tree algorithms: ID3, C4.5, C5.0 and CART
es_es: Algoritmos de árbol: ID3, C4.5, C5.0 y CART

source: What are all the various decision tree algorithms and how do they differ from each other? Which one is implemented in scikit-learn?
es_es: ¿Cuáles son los diferentes algoritmos de árboles de decisión y cómo se diferencian unos de otros? ¿Cuál está implementado en scikit-learn?

source: ID3_ (Iterative Dichotomiser 3) was developed in 1986 by Ross Quinlan. The algorithm creates a multiway tree, finding for each node (i.e. in a greedy manner) the categorical feature that will yield the largest information gain for categorical targets. Trees are grown to their maximum size and then a pruning step is usually applied to improve the ability of the tree to generalise to unseen data.
es_es: ID3_ (Iterative Dichotomiser 3, Dicotomizador iterativo 3) fue desarrollado en 1986 por Ross Quinlan. El algoritmo crea un árbol multidireccional, encontrando para cada nodo (es decir, de forma codiciosa) la característica categórica que producirá la mayor ganancia de información para los objetivos categóricos. Los árboles crecen hasta su tamaño máximo y luego, se suele aplicar un paso de poda para mejorar la capacidad del árbol de generalizar a los datos no vistos.

source: C4.5 is the successor to ID3 and removed the restriction that features must be categorical by dynamically defining a discrete attribute (based on numerical variables) that partitions the continuous attribute value into a discrete set of intervals. C4.5 converts the trained trees (i.e. the output of the ID3 algorithm) into sets of if-then rules. These accuracy of each rule is then evaluated to determine the order in which they should be applied. Pruning is done by removing a rule's precondition if the accuracy of the rule improves without it.
es_es: C4.5 es el sucesor de ID3 y elimina la restricción de que las características sean categóricas definiendo dinámicamente un atributo discreto (basado en variables numéricas) que particiona el valor del atributo continuo en un conjunto discreto de intervalos. C4.5 convierte los árboles entrenados (es decir, la salida del algoritmo ID3) en conjuntos de reglas if-then (si-entonces). Esa precisión de cada regla se evalúa para determinar el orden en que deben aplicarse. La poda se realiza eliminando la condición previa de una regla si la precisión de ésta mejora sin ella.

source: C5.0 is Quinlan's latest version release under a proprietary license. It uses less memory and builds smaller rulesets than C4.5 while being more accurate.
es_es: C5.0 es la última versión publicada por Quinlan bajo una licencia propietaria. Utiliza menos memoria y construye conjuntos de reglas más pequeños que C4.5, a la vez que es más preciso.

source: CART_ (Classification and Regression Trees) is very similar to C4.5, but it differs in that it supports numerical target variables (regression) and does not compute rule sets. CART constructs binary trees using the feature and threshold that yield the largest information gain at each node.
es_es: CART_ (Classification and Regression Trees, Árboles de Clasificación y Regresión) es muy similar a C4.5, pero difiere en que soporta variables objetivo numéricas (regresión) y no calcula conjuntos de reglas. CART construye árboles binarios usando la característica y el umbral que producen la mayor ganancia de información en cada nodo.

source: scikit-learn uses an optimised version of the CART algorithm; however, scikit-learn implementation does not support categorical variables for now.
es_es: scikit-learn utiliza una versión optimizada del algoritmo CART; sin embargo, la implementación de scikit-learn no soporta variables categóricas por ahora.

source: Mathematical formulation
es_es: Formulación matemática

source: Given training vectors :math:`x_i \in R^n`, i=1,..., l and a label vector :math:`y \in R^l`, a decision tree recursively partitions the feature space such that the samples with the same labels or similar target values are grouped together.
es_es: Dados los vectores de entrenamiento :math:`x_i \in R^n`, i=1,..., l y un vector de etiquetas :math:`y \in R^l`, un árbol de decisión particiona recursivamente el espacio de características de tal manera que las muestras con las mismas etiquetas o valores objetivo similares se agrupan.

source: Let the data at node :math:`m` be represented by :math:`Q_m` with :math:`N_m` samples. For each candidate split :math:`\theta = (j, t_m)` consisting of a feature :math:`j` and threshold :math:`t_m`, partition the data into :math:`Q_m^{left}(\theta)` and :math:`Q_m^{right}(\theta)` subsets
es_es: Deja que los datos en el nodo :math:`m` sean representados por :math:`Q_m` con :math:`N_m` muestras. Para cada división candidata :math:`\theta = (j, t_m)` que consiste en una característica :math:`j` y un umbral :math:`t_m`, particiona los datos en subconjuntos :math:`Q_m^{left}(\theta)` y :math:`Q_m^{right}(\theta)`

source: The quality of a candidate split of node :math:`m` is then computed using an impurity function or loss function :math:`H()`, the choice of which depends on the task being solved (classification or regression)
es_es: La calidad de una división candidata del nodo :math:`m` se calcula entonces utilizando una función de impureza o función de pérdida :math:`H()`, cuya elección depende de la tarea que se esté resolviendo (clasificación o regresión)

source: Select the parameters that minimises the impurity
es_es: Selecciona los parámetros que minimizan la impureza

source: Recurse for subsets :math:`Q_m^{left}(\theta^*)` and :math:`Q_m^{right}(\theta^*)` until the maximum allowable depth is reached, :math:`N_m < \min_{samples}` or :math:`N_m = 1`.
es_es: Recurre a los subconjuntos :math:`Q_m^{left}(\theta^*)` y :math:`Q_m^{right}(\theta^*)` hasta alcanzar la profundidad máxima permitida, :math:`N_m < \min_{samples}` o :math:`N_m = 1`.

source: Classification criteria
es_es: Criterios de clasificación

source: If a target is a classification outcome taking on values 0,1,...,K-1, for node :math:`m`, let
es_es: Si un objetivo es un resultado de clasificación que toma valores 0,1,...,K-1, para el nodo :math:`m`, sea

source: be the proportion of class k observations in node :math:`m`. If :math:`m` is a terminal node, `predict_proba` for this region is set to :math:`p_{mk}`. Common measures of impurity are the following.
es_es: la proporción de observaciones de la clase k en el nodo :math:`m`. Si :math:`m` es un nodo terminal, `predict_proba` para esta región se establece en :math:`p_{mk}`. Las medidas comunes de impureza son las siguientes.

source: Entropy:
es_es: Entropía:

source: Misclassification:
es_es: Clasificación errónea:

source: Regression criteria
es_es: Criterios de Regresión

source: If the target is a continuous value, then for node :math:`m`, common criteria to minimize as for determining locations for future splits are Mean Squared Error (MSE or L2 error), Poisson deviance as well as Mean Absolute Error (MAE or L1 error). MSE and Poisson deviance both set the predicted value of terminal nodes to the learned mean value :math:`\bar{y}_m` of the node whereas the MAE sets the predicted value of terminal nodes to the median :math:`median(y)_m`.
es_es: Si el objetivo es un valor continuo, entonces para el nodo :math:`m`, los criterios comunes a minimizar para determinar las ubicaciones de las futuras divisiones son el Error cuadrático medio (MSE o error L2), la desviación de Poisson así como el Error medio absoluto (MAE o error L1). El MSE y la desviación de Poisson establecen el valor predicho de los nodos terminales al valor medio aprendido :math:`\bar{y}_m` del nodo mientras que el MAE establece el valor predicho de los nodos terminales a la mediana :math:`median(y)_m`.

source: Mean Squared Error:
es_es: Error medio cuadrático:

source: Half Poisson deviance:
es_es: Desviación media de Poisson:

source: Setting `criterion="poisson"` might be a good choice if your target is a count or a frequency (count per some unit). In any case, :math:`y >= 0` is a necessary condition to use this criterion. Note that it fits much slower than the MSE criterion.
es_es: Establecer `criterion="poisson"` puede ser una buena opción si tu objetivo es un conteo o una frecuencia (conteo por alguna unidad). En cualquier caso, :math:`y >= 0` es una condición necesaria para utilizar este criterio. Ten en cuenta que se ajusta mucho más lento que el criterio MSE.

source: Mean Absolute Error:
es_es: Error medio absoluto:

source: Note that it fits much slower than the MSE criterion.
es_es: Ten en cuenta que se ajusta mucho más lento que el criterio del MSE.

source: Minimal Cost-Complexity Pruning
es_es: Poda de costo-complejidad mínima

source: Minimal cost-complexity pruning is an algorithm used to prune a tree to avoid over-fitting, described in Chapter 3 of [BRE]_. This algorithm is parameterized by :math:`\alpha\ge0` known as the complexity parameter. The complexity parameter is used to define the cost-complexity measure, :math:`R_\alpha(T)` of a given tree :math:`T`:
es_es: La poda de costo-complejidad mínima es un algoritmo utilizado para podar un árbol para evitar el sobreajuste, descrito en el capítulo 3 de [BRE]_. Este algoritmo está parametrizado por :math:`\alpha\ge0` conocido como el parámetro de complejidad. El parámetro de complejidad se utiliza para definir la medida de costo-complejidad, :math:`R_\alpha(T)` de un árbol :math:`T` dado:

source: where :math:`|\widetilde{T}|` is the number of terminal nodes in :math:`T` and :math:`R(T)` is traditionally defined as the total misclassification rate of the terminal nodes. Alternatively, scikit-learn uses the total sample weighted impurity of the terminal nodes for :math:`R(T)`. As shown above, the impurity of a node depends on the criterion. Minimal cost-complexity pruning finds the subtree of :math:`T` that minimizes :math:`R_\alpha(T)`.
es_es: donde :math:`|\widetilde{T}|` es el número de nodos terminales en :math:`T` y :math:`R(T)` se define tradicionalmente como la tasa total de clasificación errónea de los nodos terminales. Alternativamente, scikit-learn utiliza la impureza total ponderada de la muestra de los nodos terminales para :math:`R(T)`. Como se muestra arriba, la impureza de un nodo depende del criterio. La poda de costo-complejidad mínima encuentra el subárbol de :math:`T` que minimiza :math:`R_alpha(T)`.

source: The cost complexity measure of a single node is :math:`R_\alpha(t)=R(t)+\alpha`. The branch, :math:`T_t`, is defined to be a tree where node :math:`t` is its root. In general, the impurity of a node is greater than the sum of impurities of its terminal nodes, :math:`R(T_t)<R(t)`. However, the cost complexity measure of a node, :math:`t`, and its branch, :math:`T_t`, can be equal depending on :math:`\alpha`. We define the effective :math:`\alpha` of a node to be the value where they are equal, :math:`R_\alpha(T_t)=R_\alpha(t)` or :math:`\alpha_{eff}(t)=\frac{R(t)-R(T_t)}{|T|-1}`. A non-terminal node with the smallest value of :math:`\alpha_{eff}` is the weakest link and will be pruned. This process stops when the pruned tree's minimal :math:`\alpha_{eff}` is greater than the ``ccp_alpha`` parameter.
es_es: La medida de costo-complejidad de un único nodo es :math:`R_\alpha(t)=R(t)+\alpha`. La rama, :math:`T_t`, se define como un árbol donde el nodo :math:`t` es su raíz. En general, la impureza de un nodo es mayor que la suma de impurezas de sus nodos terminales, :math:`R(T_t)<R(t)`. Sin embargo, la medida de costo-complejidad de un nodo, :math:`t`, y su rama, :math:`T_t`, pueden ser iguales dependiendo de :math:`alpha`. Definimos el :math:`alpha` efectivo de un nodo como el valor donde son iguales, :math:`R_\\alpha(T_t)=R_\\alpha(t)` o :math:`\\alpha_{eff}(t)=\\frac{R(t)-R(T_t)}{|T|-1}`. Un nodo no terminal con el valor más pequeño de :math:`\alpha_{eff}` es el enlace más débil y será podado. Este proceso se detiene cuando el valor mínimo de :math:`\alpha_{eff}` del árbol podado es mayor que el parámetro ``ccp_alpha``.
