Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/tree.po
Languages: es_es

source: Decision Trees
es_es: Árboles de decisión

source: **Decision Trees (DTs)** are a non-parametric supervised learning method used for :ref:`classification <tree_classification>` and :ref:`regression <tree_regression>`. The goal is to create a model that predicts the value of a target variable by learning simple decision rules inferred from the data features. A tree can be seen as a piecewise constant approximation.
es_es: **Los árboles de decisión (DTs por sus siglas en inglés)** son un método de aprendizaje supervisado no paramétrico utilizado para :ref:`clasificación <tree_classification>` y :ref:`regresión <tree_regression>`. El objetivo es crear un modelo que prediga el valor de una variable objetivo mediante el aprendizaje de reglas de decisión simples inferidas a partir de las características de los datos. Un árbol puede ser visto como una aproximación constante a trozos.

source: For instance, in the example below, decision trees learn from data to approximate a sine curve with a set of if-then-else decision rules. The deeper the tree, the more complex the decision rules and the fitter the model.
es_es: En el siguiente ejemplo, los árboles de decisión aprenden de los datos para aproximar una curva sinusoidal con un conjunto de reglas de decisión si-entonces-en otro caso (if-then-else). Cuanto más profundo sea el árbol, más complejas serán las reglas de decisión y más ajustado será el modelo.

source: Some advantages of decision trees are:
es_es: Algunas ventajas de los árboles de decisión son:

source: Simple to understand and to interpret. Trees can be visualised.
es_es: Sencillo de entender e interpretar. Los árboles pueden ser visualizados.

source: Requires little data preparation. Other techniques often require data normalisation, dummy variables need to be created and blank values to be removed. Note however that this module does not support missing values.
es_es: Requiere poca preparación de los datos. Otras técnicas a menudo requieren la normalización de datos, la creación de variables dummy y la eliminación de valores en blanco. Sin embargo, ten en cuenta que este módulo no admite valores faltantes.

source: The cost of using the tree (i.e., predicting data) is logarithmic in the number of data points used to train the tree.
es_es: El costo de usar el árbol (es decir, de predecir datos) es logarítmico en el número de puntos de datos utilizados para entrenar el árbol.

source: Able to handle both numerical and categorical data. However scikit-learn implementation does not support categorical variables for now. Other techniques are usually specialised in analysing datasets that have only one type of variable. See :ref:`algorithms <tree_algorithms>` for more information.
es_es: Capaz de manejar datos tanto numéricos como categóricos. Sin embargo, la implementación de scikit-learn no admite variables categóricas por ahora. Otras técnicas suelen estar especializadas en el análisis de conjuntos de datos que sólo tienen un tipo de variable. Véase :ref:`algoritmos <tree_algorithms>` para más información.

source: Able to handle multi-output problems.
es_es: Capaz de manejar problemas de salida múltiple.

source: Uses a white box model. If a given situation is observable in a model, the explanation for the condition is easily explained by boolean logic. By contrast, in a black box model (e.g., in an artificial neural network), results may be more difficult to interpret.
es_es: Utiliza un modelo de caja blanca (white box model). Si una situación dada es observable en un modelo, la explicación de la condición se explica fácilmente por lógica booleana. Por el contrario, en un modelo de caja negra (black box model) (por ejemplo, en una red neuronal artificial), los resultados pueden ser más difíciles de interpretar.

source: Possible to validate a model using statistical tests. That makes it possible to account for the reliability of the model.
es_es: Es posible validar un modelo utilizando pruebas estadísticas. Eso permite tener en cuenta la fiabilidad del modelo.

source: Performs well even if its assumptions are somewhat violated by the true model from which the data were generated.
es_es: Funciona bien incluso si sus supuestos son violados de alguna manera por el verdadero modelo a partir del cual se generaron los datos.

source: The disadvantages of decision trees include:
es_es: Las desventajas de los árboles de decisión incluyen:

source: Decision-tree learners can create over-complex trees that do not generalise the data well. This is called overfitting. Mechanisms such as pruning, setting the minimum number of samples required at a leaf node or setting the maximum depth of the tree are necessary to avoid this problem.
es_es: Los algoritmos de aprendizaje de árboles de decisión pueden crear árboles demasiado complejos que no generalicen bien los datos. Esto se denomina sobreajuste. Para evitar este problema son necesarios mecanismos como la poda, establecer el número mínimo de muestras necesarias en un nodo de la hoja o establecer la profundidad máxima del árbol.

source: Decision trees can be unstable because small variations in the data might result in a completely different tree being generated. This problem is mitigated by using decision trees within an ensemble.
es_es: Los árboles de decisión pueden ser inestables porque pequeñas variaciones en los datos pueden resultar en la generación de un árbol completamente diferente. Este problema es mitigado mediante el uso de árboles de decisión dentro de un conjunto.

source: Predictions of decision trees are neither smooth nor continuous, but piecewise constant approximations as seen in the above figure. Therefore, they are not good at extrapolation.
es_es: Las predicciones de los árboles de decisión no son suaves ni continuas, sino aproximaciones constantes a trozos, como se ve en la figura anterior. Por lo tanto, no son buenos para la extrapolación.

source: The problem of learning an optimal decision tree is known to be NP-complete under several aspects of optimality and even for simple concepts. Consequently, practical decision-tree learning algorithms are based on heuristic algorithms such as the greedy algorithm where locally optimal decisions are made at each node. Such algorithms cannot guarantee to return the globally optimal decision tree. This can be mitigated by training multiple trees in an ensemble learner, where the features and samples are randomly sampled with replacement.
es_es: Se sabe que el problema del aprendizaje de un árbol de decisión óptimo es NP-completo bajo varios aspectos de optimalidad e incluso para conceptos simples. En consecuencia, los algoritmos prácticos de aprendizaje de árboles de decisión se basan en algoritmos heurísticos como el algoritmo codicioso, donde se toman decisiones localmente óptimas en cada nodo. Tales algoritmos no pueden garantizar que devuelvan el árbol de decisión globalmente óptimo. Esto puede mitigarse entrenando múltiples árboles en un algoritmo de aprendizaje de conjunto, donde las características y las muestras se muestrean aleatoriamente con reemplazo.

source: There are concepts that are hard to learn because decision trees do not express them easily, such as XOR, parity or multiplexer problems.
es_es: Hay conceptos difíciles de aprender porque los árboles de decisión no los expresan fácilmente, como los problemas de XOR, paridad o multiplexores.

source: Decision tree learners create biased trees if some classes dominate. It is therefore recommended to balance the dataset prior to fitting with the decision tree.
es_es: Los algoritmos de aprendizaje de árboles de decisión crean árboles sesgados si algunas clases dominan. Por lo tanto, se recomienda equilibrar el conjunto de datos antes de ajustarlo con el árbol de decisión.

source: Classification
es_es: Clasificación

source: :class:`DecisionTreeClassifier` is a class capable of performing multi-class classification on a dataset.
es_es: :class:`DecisionTreeClassifier` es una clase capaz de realizar una clasificación multiclase en un conjunto de datos.

source: As with other classifiers, :class:`DecisionTreeClassifier` takes as input two arrays: an array X, sparse or dense, of shape ``(n_samples, n_features)`` holding the training samples, and an array Y of integer values, shape ``(n_samples,)``, holding the class labels for the training samples::
es_es: Al igual que otros clasificadores, :class:`DecisionTreeClassifier` toma como entrada dos arreglos: un arreglo X, disperso o denso, de forma ``(n_samples, n_features)`` que contiene las muestras de entrenamiento, y un arreglo Y de valores enteros, de forma ``(n_samples,)``, que contiene las etiquetas de clase para las muestras de entrenamiento::

source: After being fitted, the model can then be used to predict the class of samples::
es_es: Después de ser ajustado, el modelo puede ser utilizado para predecir la clase de muestras::

source: In case that there are multiple classes with the same and highest probability, the classifier will predict the class with the lowest index amongst those classes.
es_es: En caso de que haya múltiples clases con la misma y más alta probabilidad, el clasificador predecirá la clase con el índice más bajo entre esas clases.

source: As an alternative to outputting a specific class, the probability of each class can be predicted, which is the fraction of training samples of the class in a leaf::
es_es: Como alternativa a la salida de una clase específica, se puede predecir la probabilidad de cada clase, que es la fracción de las muestras de entrenamiento de la clase en una hoja::

source: :class:`DecisionTreeClassifier` is capable of both binary (where the labels are [-1, 1]) classification and multiclass (where the labels are [0, ..., K-1]) classification.
es_es: :class:`DecisionTreeClassifier` es capaz de realizar tanto una clasificación binaria (donde las etiquetas son [-1, 1]) como una clasificación multiclase (donde las etiquetas son [0, ..., K-1]).

source: Using the Iris dataset, we can construct a tree as follows::
es_es: Usando el conjunto de datos Iris, podemos construir un árbol como sigue::

source: Once trained, you can plot the tree with the :func:`plot_tree` function::
es_es: Una vez entrenado, puedes graficar el árbol con la función :func:`plot_tree`::

source: We can also export the tree in `Graphviz <https://www.graphviz.org/>`_ format using the :func:`export_graphviz` exporter. If you use the `conda <https://conda.io>`_ package manager, the graphviz binaries and the python package can be installed with `conda install python-graphviz`.
es_es: También podemos exportar el árbol en formato `Graphviz <https://www.graphviz.org/>`_ usando el exportador :func:`export_graphviz`. Si utilizas el gestor de paquetes `conda <https://conda.io>`_, los binarios de graphviz y el paquete python pueden instalarse con `conda install python-graphviz`.

source: Alternatively binaries for graphviz can be downloaded from the graphviz project homepage, and the Python wrapper installed from pypi with `pip install graphviz`.
es_es: Alternativamente, los binarios para graphviz pueden ser descargados desde la página web del proyecto graphviz, y la capa de Python instalada desde pypi con `pip install graphviz`.

source: Below is an example graphviz export of the above tree trained on the entire iris dataset; the results are saved in an output file `iris.pdf`::
es_es: A continuación se muestra un ejemplo de exportación en graphviz del árbol anterior entrenado en todo el conjunto de datos iris; los resultados se guardan en un archivo de salida `iris.pdf`::

source: The :func:`export_graphviz` exporter also supports a variety of aesthetic options, including coloring nodes by their class (or value for regression) and using explicit variable and class names if desired. Jupyter notebooks also render these plots inline automatically::
es_es: El exportador :func:`export_graphviz` también soporta una variedad de opciones estéticas, como colorear los nodos por su clase (o valor para la regresión) y usar nombres explícitos de variables y clases si así lo deseas. Los cuadernos de Jupyter también representan estos gráficos dentro de la línea automáticamente::

source: Alternatively, the tree can also be exported in textual format with the function :func:`export_text`. This method doesn't require the installation of external libraries and is more compact:
es_es: Alternativamente, el árbol también puede exportarse en formato de texto con la función :func:`export_text`. Este método no requiere la instalación de bibliotecas externas y es más compacto:

source: Regression
es_es: Regresión

source: Decision trees can also be applied to regression problems, using the :class:`DecisionTreeRegressor` class.
es_es: Los árboles de decisión también pueden ser aplicados en problemas de regresión, utilizando la clase :class:`DecisionTreeRegressor`.

source: As in the classification setting, the fit method will take as argument arrays X and y, only that in this case y is expected to have floating point values instead of integer values::
es_es: Como en la configuración de la clasificación, el método de ajuste tomará como argumento los arreglos X e y, sólo que en este caso se espera que y tenga valores de punto flotante en lugar de valores enteros::

source: Multi-output problems
es_es: Problemas de salida múltiple

source: A multi-output problem is a supervised learning problem with several outputs to predict, that is when Y is a 2d array of shape ``(n_samples, n_outputs)``.
es_es: Un problema de salida múltiple es un problema de aprendizaje supervisado con varias salidas a predecir, que es cuando Y es un arreglo 2d de la forma ``(n_samples, n_outputs)``.

source: When there is no correlation between the outputs, a very simple way to solve this kind of problem is to build n independent models, i.e. one for each output, and then to use those models to independently predict each one of the n outputs. However, because it is likely that the output values related to the same input are themselves correlated, an often better way is to build a single model capable of predicting simultaneously all n outputs. First, it requires lower training time since only a single estimator is built. Second, the generalization accuracy of the resulting estimator may often be increased.
es_es: Cuando no hay correlación entre las salidas, una forma muy sencilla de resolver este tipo de problema es construir n modelos independientes, es decir, uno para cada salida, y luego utilizar esos modelos para predecir independientemente cada una de las n salidas. Sin embargo, dado que es probable que los valores de salida relacionados con la misma entrada estén correlacionados, una forma a menudo mejor es construir un único modelo capaz de predecir simultáneamente todas las n salidas. En primer lugar, requiere menos tiempo de entrenamiento, ya que sólo se construye un único estimador. En segundo lugar, la precisión de la generalización del estimador resultante a menudo puede aumentar.

source: With regard to decision trees, this strategy can readily be used to support multi-output problems. This requires the following changes:
es_es: Con respecto a los árboles de decisión, esta estrategia puede utilizarse fácilmente para soportar los problemas de salida múltiple. Esto requiere los siguientes cambios:

source: Store n output values in leaves, instead of 1;
es_es: Almacena n valores de salida en hojas, en lugar de 1;

source: Use splitting criteria that compute the average reduction across all n outputs.
es_es: Utiliza criterios de separación que calculen la reducción promedio en todas las n salidas.

source: This module offers support for multi-output problems by implementing this strategy in both :class:`DecisionTreeClassifier` and :class:`DecisionTreeRegressor`. If a decision tree is fit on an output array Y of shape ``(n_samples, n_outputs)`` then the resulting estimator will:
es_es: Este módulo ofrece soporte para problemas de salida múltiple implementando esta estrategia tanto en :class:`DecisionTreeClassifier` como en :class:`DecisionTreeRegressor`. Si un árbol de decisión se ajusta a un arreglo de salida Y de la forma ``(n_samples, n_outputs)`` entonces el estimador resultante será:

source: Output n_output values upon ``predict``;
es_es: Valores de salida n_output en ``predict``;

source: Output a list of n_output arrays of class probabilities upon ``predict_proba``.
es_es: Da salida a una lista de arreglos n_output de probabilidades de clase sobre ``predict_proba``.

source: The use of multi-output trees for regression is demonstrated in :ref:`sphx_glr_auto_examples_tree_plot_tree_regression_multioutput.py`. In this example, the input X is a single real value and the outputs Y are the sine and cosine of X.
es_es: El uso de árboles de salida múltiple para regresión se demuestra en :ref:`sphx_glr_auto_examples_tree_plot_tree_regression_multioutput.py`. En este ejemplo, la entrada X es un único valor real y las salidas Y son el seno y el coseno de X.

source: The use of multi-output trees for classification is demonstrated in :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`. In this example, the inputs X are the pixels of the upper half of faces and the outputs Y are the pixels of the lower half of those faces.
es_es: El uso de árboles de salida múltiple para la clasificación se demuestra en :ref:`sphx_glr_auto_examples_miscellaneous_plot_multioutput_face_completion.py`. En este ejemplo, las entradas X son los píxeles de la mitad superior de las caras y las salidas Y son los píxeles de la mitad inferior de esas caras.

source: Complexity
es_es: Complejidad

source: In general, the run time cost to construct a balanced binary tree is :math:`O(n_{samples}n_{features}\log(n_{samples}))` and query time :math:`O(\log(n_{samples}))`. Although the tree construction algorithm attempts to generate balanced trees, they will not always be balanced. Assuming that the subtrees remain approximately balanced, the cost at each node consists of searching through :math:`O(n_{features})` to find the feature that offers the largest reduction in entropy. This has a cost of :math:`O(n_{features}n_{samples}\log(n_{samples}))` at each node, leading to a total cost over the entire trees (by summing the cost at each node) of :math:`O(n_{features}n_{samples}^{2}\log(n_{samples}))`.
es_es: En general el costo de tiempo de ejecución para construir un árbol binario balanceado es :math:`O(n_{samples}n_{features}\log(n_{samples}))` y el tiempo de consulta :math:`O(\log(n_{samples}))`. Aunque el algoritmo de construcción de árboles intenta generar árboles equilibrados, no siempre lo estarán. Asumiendo que los subárboles permanecen aproximadamente equilibrados, el costo en cada nodo consiste en buscar a través de :math:`O(n_{features})` para encontrar la característica que ofrece la mayor reducción de entropía. Esto tiene un costo de :math:`O(n_{features}n_{samples}\log(n_{samples}))` en cada nodo, lo que lleva a un costo total sobre todos los árboles (sumando el costo en cada nodo) de :math:`O(n_{features}n_{samples}^{2}\log(n_{samples}))`.

source: Tips on practical use
es_es: Consejos sobre uso práctico

source: Decision trees tend to overfit on data with a large number of features. Getting the right ratio of samples to number of features is important, since a tree with few samples in high dimensional space is very likely to overfit.
es_es: Los árboles de decisión tienden a sobreajustarse en datos con un gran número de características. Es importante obtener la proporción adecuada de muestras con respecto al número de características, ya que un árbol con pocas muestras en un espacio de alta dimensión es muy probable que se sobreajuste.

source: Consider performing dimensionality reduction (:ref:`PCA <PCA>`, :ref:`ICA <ICA>`, or :ref:`feature_selection`) beforehand to give your tree a better chance of finding features that are discriminative.
es_es: Considera la posibilidad de realizar una reducción de la dimensionalidad (:ref:`PCA <PCA>`, :ref:`ICA <ICA>`, o :ref:`feature_selection`) de antemano para dar a tu árbol una mejor oportunidad de encontrar características que sean discriminatorias.

source: :ref:`sphx_glr_auto_examples_tree_plot_unveil_tree_structure.py` will help in gaining more insights about how the decision tree makes predictions, which is important for understanding the important features in the data.
es_es: :ref:`sphx_glr_auto_examples_tree_plot_unveil_tree_structure.py` ayudará a obtener más información sobre cómo el árbol de decisión hace las predicciones, lo cual es importante para comprender las características importantes de los datos.

source: Visualise your tree as you are training by using the ``export`` function. Use ``max_depth=3`` as an initial tree depth to get a feel for how the tree is fitting to your data, and then increase the depth.
es_es: Visualiza tu árbol mientras estás entrenando usando la función ``export``. Usa ``max_depth=3`` como profundidad inicial del árbol para tener una idea de cómo se ajusta a tus datos, y luego aumenta la profundidad.

source: Remember that the number of samples required to populate the tree doubles for each additional level the tree grows to. Use ``max_depth`` to control the size of the tree to prevent overfitting.
es_es: Recuerda que el número de muestras requeridas para poblar el árbol se duplica por cada nivel adicional al que crece el árbol. Usa ``max_depth`` para controlar el tamaño del árbol para prevenir el sobreajuste.

source: Use ``min_samples_split`` or ``min_samples_leaf`` to ensure that multiple samples inform every decision in the tree, by controlling which splits will be considered. A very small number will usually mean the tree will overfit, whereas a large number will prevent the tree from learning the data. Try ``min_samples_leaf=5`` as an initial value. If the sample size varies greatly, a float number can be used as percentage in these two parameters. While ``min_samples_split`` can create arbitrarily small leaves, ``min_samples_leaf`` guarantees that each leaf has a minimum size, avoiding low-variance, over-fit leaf nodes in regression problems. For classification with few classes, ``min_samples_leaf=1`` is often the best choice.
es_es: Utiliza ``min_samples_split`` o ``min_samples_leaf`` para asegurarte de que las muestras múltiples informan cada decisión en el árbol, controlando qué divisiones serán consideradas. Un número muy pequeño normalmente significa que el árbol se sobreajustará, mientras que un número grande impedirá que el árbol aprenda de los datos. Prueba ``min_samples_leaf=5`` como un valor inicial. Si el tamaño de la muestra varía considerablemente, se puede utilizar un número de punto flotante como porcentaje en estos dos parámetros. Mientras que ``min_samples_split`` puede crear hojas arbitrariamente pequeñas, ``min_samples_leaf`` garantiza que cada hoja tiene un tamaño mínimo, evitando nodos hoja de baja varianza y sobreajuste en problemas de regresión. Para la clasificación con pocas clases, ``min_samples_leaf=1`` es a menudo la mejor opción.

source: Note that ``min_samples_split`` considers samples directly and independent of ``sample_weight``, if provided (e.g. a node with m weighted samples is still treated as having exactly m samples). Consider ``min_weight_fraction_leaf`` or ``min_impurity_decrease`` if accounting for sample weights is required at splits.
es_es: Ten en cuenta que ``min_samples_split`` considera las muestras directamente e independientemente de ``sample_weight``, si se proporciona (por ejemplo, un nodo con m muestras ponderadas se sigue tratando como si tuviera exactamente m muestras). Considera ``min_weight_fraction_leaf`` o ``min_impurity_decrease`` si se deben tener en cuenta los pesos de las muestras en las divisiones.
