Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/modules/unsupervised_reduction.po
Languages: es_es

source: Unsupervised dimensionality reduction
es_es: Reducción de dimensionalidad no supervisada

source: If your number of features is high, it may be useful to reduce it with an unsupervised step prior to supervised steps. Many of the :ref:`unsupervised-learning` methods implement a ``transform`` method that can be used to reduce the dimensionality. Below we discuss two specific example of this pattern that are heavily used.
es_es: Si tu número de características es alto, puede ser útil reducirlo con un paso no supervisado antes de los pasos supervisados. Muchos de los métodos de :ref:`unsupervised-learning` implementan un método ``transform`` que puede ser usado para reducir la dimensionalidad. A continuación, discutimos dos ejemplos específicos de este patrón que son muy utilizados.

source: The unsupervised data reduction and the supervised estimator can be chained in one step. See :ref:`pipeline`.
es_es: La reducción de datos no supervisada y el estimador supervisado pueden ser encadenados en un paso. Ver :ref:`pipeline`.

source: PCA: principal component analysis
es_es: Análisis de Componentes Principales (Principal Component Analysis, PCA)

source: :class:`decomposition.PCA` looks for a combination of features that capture well the variance of the original features. See :ref:`decompositions`.
es_es: :class:`decomposition.PCA` busca una combinación de características que capturen bien la varianza de las características originales. Ver :ref:`decompositions`.

source: Random projections
es_es: Proyecciones aleatorias

source: The module: :mod:`random_projection` provides several tools for data reduction by random projections. See the relevant section of the documentation: :ref:`random_projection`.
es_es: El módulo: :mod:`random_projection` proporciona varias herramientas para la reducción de datos por proyecciones aleatorias. Véase la sección correspondiente de la documentación: :ref:`random_projection`.

source: Feature agglomeration
es_es: Aglomeración de características

source: :class:`cluster.FeatureAgglomeration` applies :ref:`hierarchical_clustering` to group together features that behave similarly.
es_es: :class:`cluster.FeatureAgglomeration` aplica :ref:`hierarchical_clustering` para agrupar características que se comportan de forma similar.

source: **Feature scaling**
es_es: **Escalamiento de características**

source: Note that if features have very different scaling or statistical properties, :class:`cluster.FeatureAgglomeration` may not be able to capture the links between related features. Using a :class:`preprocessing.StandardScaler` can be useful in these settings.
es_es: Ten en cuenta que si las características tienen propiedades estadísticas o de escala muy diferentes, :class:`cluster.FeatureAgglomeration` puede no ser capaz de capturar los vínculos entre las características relacionadas. El uso de :class:`preprocessing.StandardScaler` puede ser útil en estas configuraciones.
