Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/calibration/plot_calibration_multiclass.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_calibration_plot_calibration_multiclass.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_calibration_plot_calibration_multiclass.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en su navegador a través de Binder

source: Probability Calibration for 3-class classification
es_es: Calibración de probabilidades para la clasificación de 3 clases

source: This example illustrates how sigmoid :ref:`calibration <calibration>` changes predicted probabilities for a 3-class classification problem. Illustrated is the standard 2-simplex, where the three corners correspond to the three classes. Arrows point from the probability vectors predicted by an uncalibrated classifier to the probability vectors predicted by the same classifier after sigmoid calibration on a hold-out validation set. Colors indicate the true class of an instance (red: class 1, green: class 2, blue: class 3).
es_es: Este ejemplo ilustra cómo el sigmoide :ref:`calibración <calibración>` cambia las probabilidades predichas para un problema de clasificación de 3 clases. Se ilustra el complejo estándar de 2 clases, donde las tres esquinas corresponden a las tres clases. Las flechas apuntan desde los vectores de probabilidad predichos por un clasificador sin calibrar a los vectores de probabilidad predichos por el mismo clasificador después de la calibración sigmoide en un conjunto de validación de retención. Los colores indican la clase verdadera de una instancia (rojo: clase 1, verde: clase 2, azul: clase 3).

source: Data
es_es: Datos

source: Below, we generate a classification dataset with 2000 samples, 2 features and 3 target classes. We then split the data as follows:
es_es: A continuación, generamos un conjunto de datos de clasificación con 2000 muestras, 2 características y 3 clases objetivo. A continuación, dividimos los datos de la siguiente manera:

source: train: 600 samples (for training the classifier)
es_es: train: 600 muestras (para entrenar el clasificador)

source: valid: 400 samples (for calibrating predicted probabilities)
es_es: válidos: 400 muestras (para calibrar las probabilidades predichas)

source: test: 1000 samples
es_es: prueba: 1000 muestras

source: Note that we also create `X_train_valid` and `y_train_valid`, which consists of both the train and valid subsets. This is used when we only want to train the classifier but not calibrate the predicted probabilities.
es_es: Observa que también creamos `X_train_valid` y `y_train_valid`, que consisten en los subconjuntos de entrenamiento y de validación. Esto se utiliza cuando sólo queremos entrenar el clasificador pero no calibrar las probabilidades predichas.

source: Fitting and calibration
es_es: Ajuste y Calibración

source: First, we will train a :class:`~sklearn.ensemble.RandomForestClassifier` with 25 base estimators (trees) on the concatenated train and validation data (1000 samples). This is the uncalibrated classifier.
es_es: En primer lugar, entrenaremos un :class:`~sklearn.ensemble.RandomForestClassifier` con 25 estimadores base (árboles) en los datos concatenados de entrenamiento y validación (1000 muestras). Este es el clasificador no calibrado.

source: To train the calibrated classifier, we start with the same :class:`~sklearn.ensemble.RandomForestClassifier` but train it using only the train data subset (600 samples) then calibrate, with `method='sigmoid'`, using the valid data subset (400 samples) in a 2-stage process.
es_es: Para entrenar el clasificador calibrado, empezamos con la misma :clase:`~sklearn.ensemble.RandomForestClassifier` pero lo entrenamos usando sólo el subconjunto de datos de entrenamiento (600 muestras) y luego lo calibramos, con `method='sigmoid'`, usando el subconjunto de datos válidos (400 muestras) en un proceso de 2 etapas.

source: Compare probabilities
es_es: Comparar probabilidades

source: Below we plot a 2-simplex with arrows showing the change in predicted probabilities of the test samples.
es_es: A continuación, trazamos un 2-simplex con flechas que muestran el cambio en las probabilidades predichas de las muestras de prueba.

source: In the figure above, each vertex of the simplex represents a perfectly predicted class (e.g., 1, 0, 0). The mid point inside the simplex represents predicting the three classes with equal probability (i.e., 1/3, 1/3, 1/3). Each arrow starts at the uncalibrated probabilities and end with the arrow head at the calibrated probability. The color of the arrow represents the true class of that test sample.
es_es: En la figura anterior, cada vértice del simplex representa una clase perfectamente predicha (por ejemplo, 1, 0, 0). El punto medio dentro del simplex representa la predicción de las tres clases con igual probabilidad (es decir, 1/3, 1/3, 1/3). Cada flecha comienza en las probabilidades no calibradas y termina con la punta de la flecha en la probabilidad calibrada. El color de la flecha representa la clase verdadera de esa muestra de prueba.

source: The uncalibrated classifier is overly confident in its predictions and incurs a large :ref:`log loss <log_loss>`. The calibrated classifier incurs a lower :ref:`log loss <log_loss>` due to two factors. First, notice in the figure above that the arrows generally point away from the edges of the simplex, where the probability of one class is 0. Second, a large proportion of the arrows point towards the true class, e.g., green arrows (samples where the true class is 'green') generally point towards the green vertex. This results in fewer over-confident, 0 predicted probabilities and at the same time an increase in the the predicted probabilities of the correct class. Thus, the calibrated classifier produces more accurate predicted probablities that incur a lower :ref:`log loss <log_loss>`
es_es: El clasificador no calibrado es demasiado confiado en sus predicciones e incurre en una gran pérdida :ref:`log <log_loss>`. El clasificador calibrado incurre en una pérdida :ref:`log <log_loss>` menor debido a dos factores. En primer lugar, observe en la figura anterior que las flechas generalmente apuntan lejos de los bordes del simplex, donde la probabilidad de una clase es 0. En segundo lugar, una gran proporción de las flechas apuntan hacia la clase verdadera, por ejemplo, las flechas verdes (muestras en las que la clase verdadera es "verde") generalmente apuntan hacia el vértice verde. Esto da lugar a un menor número de probabilidades predichas de 0 y, al mismo tiempo, a un aumento de las probabilidades predichas de la clase correcta. Así, el clasificador calibrado produce probabilidades predichas más precisas que incurren en una menor :ref:`pérdida lógica <log_loss>`.

source: We can show this objectively by comparing the :ref:`log loss <log_loss>` of the uncalibrated and calibrated classifiers on the predictions of the 1000 test samples. Note that an alternative would have been to increase the number of base estimators (trees) of the :class:`~sklearn.ensemble.RandomForestClassifier` which would have resulted in a similar decrease in :ref:`log loss <log_loss>`.
es_es: Podemos demostrarlo objetivamente comparando la pérdida :ref:`log <log_loss>` de los clasificadores no calibrados y calibrados en las predicciones de las 1000 muestras de prueba. Obsérvese que una alternativa habría sido aumentar el número de estimadores base (árboles) del :class:`~sklearn.ensemble.RandomForestClassifier` lo que habría dado lugar a una disminución similar de :ref:`log loss <log_loss>`.

source: Finally we generate a grid of possibile uncalibrated probabilities over the 2-simplex, compute the corresponding calibrated probabilities and plot arrows for each. The arrows are colored according the highest uncalibrated probability. This illustrates the learned calibration map:
es_es: Por último, generamos una cuadrícula de posibles probabilidades no calibradas sobre el complejo de 2, calculamos las correspondientes probabilidades calibradas y trazamos flechas para cada una de ellas. Las flechas están coloreadas según la probabilidad no calibrada más alta. Esto ilustra el mapa de calibración aprendido:

source: **Total running time of the script:** ( 0 minutes 2.063 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 2.063 segundos)

source: :download:`Download Python source code: plot_calibration_multiclass.py <plot_calibration_multiclass.py>`
es_es: :download:`Descarga el código fuente de Python: plot_calibration_multiclass.py <plot_calibration_multiclass.py>`

source: :download:`Download Jupyter notebook: plot_calibration_multiclass.ipynb <plot_calibration_multiclass.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_calibration_multiclass.ipynb <plot_calibration_multiclass.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
