Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/decomposition/plot_image_denoising.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_decomposition_plot_image_denoising.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_decomposition_plot_image_denoising.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Image denoising using dictionary learning
es_es: Desnaturalización de imágenes mediante el aprendizaje de diccionarios

source: An example comparing the effect of reconstructing noisy fragments of a raccoon face image using firstly online :ref:`DictionaryLearning` and various transform methods.
es_es: Un ejemplo en el que se compara el efecto de reconstruir fragmentos ruidosos de una imagen de la cara de un mapache utilizando primero :ref:`DictionaryLearning` en línea y varios métodos de transformación.

source: The dictionary is fitted on the distorted left half of the image, and subsequently used to reconstruct the right half. Note that even better performance could be achieved by fitting to an undistorted (i.e. noiseless) image, but here we start from the assumption that it is not available.
es_es: El diccionario se ajusta a la mitad izquierda de la imagen distorsionada, y posteriormente se utiliza para reconstruir la mitad derecha. Hay que tener en cuenta que se podría conseguir un rendimiento aún mayor ajustando una imagen no distorsionada (es decir, sin ruido), pero aquí partimos de la base de que no está disponible.

source: A common practice for evaluating the results of image denoising is by looking at the difference between the reconstruction and the original image. If the reconstruction is perfect this will look like Gaussian noise.
es_es: Una práctica habitual para evaluar los resultados de la eliminación de ruido de las imágenes es observar la diferencia entre la reconstrucción y la imagen original. Si la reconstrucción es perfecta, se verá como un ruido gaussiano.

source: It can be seen from the plots that the results of :ref:`omp` with two non-zero coefficients is a bit less biased than when keeping only one (the edges look less prominent). It is in addition closer from the ground truth in Frobenius norm.
es_es: Se puede ver en los gráficos que los resultados de :ref:`omp` con dos coeficientes distintos de cero están un poco menos sesgados que cuando se mantiene sólo uno (las aristas parecen menos prominentes). Además, está más cerca de la verdad fundamental en la norma de Frobenius.

source: The result of :ref:`least_angle_regression` is much more strongly biased: the difference is reminiscent of the local intensity value of the original image.
es_es: El resultado de :ref:`least_angle_regression` está mucho más sesgado: la diferencia recuerda al valor de intensidad local de la imagen original.

source: Thresholding is clearly not useful for denoising, but it is here to show that it can produce a suggestive output with very high speed, and thus be useful for other tasks such as object classification, where performance is not necessarily related to visualisation.
es_es: Está claro que fijar umbrales no es útil para la eliminación de ruido, pero aquí se muestra que puede producir una salida sugerente con una velocidad muy alta, y por lo tanto ser útil para otras tareas como la clasificación de objetos, donde el rendimiento no está necesariamente relacionado con la visualización.

source: **Total running time of the script:** ( 0 minutes 48.461 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 48.461 segundos)

source: :download:`Download Python source code: plot_image_denoising.py <plot_image_denoising.py>`
es_es: :download:`Descargar el código fuente de Python: plot_image_denoising.py <plot_image_denoising.py>`

source: :download:`Download Jupyter notebook: plot_image_denoising.ipynb <plot_image_denoising.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_image_denoising.ipynb <plot_image_denoising.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
