Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/decomposition/plot_ica_vs_pca.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_decomposition_plot_ica_vs_pca.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_decomposition_plot_ica_vs_pca.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: FastICA on 2D point clouds
es_es: FastICA en nubes de puntos 2D

source: This example illustrates visually in the feature space a comparison by results using two different component analysis techniques.
es_es: Este ejemplo ilustra visualmente en el espacio de características una comparación por resultados utilizando dos técnicas diferentes de análisis de componentes.

source: Representing ICA in the feature space gives the view of 'geometric ICA': ICA is an algorithm that finds directions in the feature space corresponding to projections with high non-Gaussianity. These directions need not be orthogonal in the original feature space, but they are orthogonal in the whitened feature space, in which all directions correspond to the same variance.
es_es: La representación de ICA en el espacio de características da la visión de 'ICA geométrico': El ICA es un algoritmo que encuentra direcciones en el espacio de características correspondientes a proyecciones con alta no gaussianidad. Estas direcciones no tienen por qué ser ortogonales en el espacio de características original, pero son ortogonales en el espacio de características blanqueado, en el que todas las direcciones corresponden a la misma varianza.

source: PCA, on the other hand, finds orthogonal directions in the raw feature space that correspond to directions accounting for maximum variance.
es_es: El PCA, por su parte, encuentra direcciones ortogonales en el espacio de características en bruto que corresponden a direcciones que representan la máxima varianza.

source: Here we simulate independent sources using a highly non-Gaussian process, 2 student T with a low number of degrees of freedom (top left figure). We mix them to create observations (top right figure). In this raw observation space, directions identified by PCA are represented by orange vectors. We represent the signal in the PCA space, after whitening by the variance corresponding to the PCA vectors (lower left). Running ICA corresponds to finding a rotation in this space to identify the directions of largest non-Gaussianity (lower right).
es_es: Aquí simulamos fuentes independientes utilizando un proceso altamente no gaussiano, 2 estudiantes T con un bajo número de grados de libertad (figura superior izquierda). Las mezclamos para crear observaciones (figura superior derecha). En este espacio de observación en bruto, las direcciones identificadas por el PCA se representan con vectores de color naranja. Representamos la señal en el espacio PCA, después de blanquearla por la varianza correspondiente a los vectores PCA (parte inferior izquierda). Ejecutar el ICA corresponde a encontrar una rotación en este espacio para identificar las direcciones de mayor no gaussianidad (abajo a la derecha).

source: **Total running time of the script:** ( 0 minutes 0.593 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 0.593 segundos)

source: :download:`Download Python source code: plot_ica_vs_pca.py <plot_ica_vs_pca.py>`
es_es: :download:`Descargar el código fuente de Python: plot_ica_vs_pca.py <plot_ica_vs_pca.py>`

source: :download:`Download Jupyter notebook: plot_ica_vs_pca.ipynb <plot_ica_vs_pca.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_ica_vs_pca.ipynb <plot_ica_vs_pca.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
