Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/decomposition/plot_varimax_*.po
Languages: fa

source: Click :ref:`here <sphx_glr_download_auto_examples_decomposition_plot_varimax_fa.py>` to download the full example code or to run this example in your browser via Binder
fa: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_decomposition_plot_varimax_fa.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Factor Analysis (with rotation) to visualize patterns
fa: Análisis factorial (con rotación) para visualizar patrones

source: Investigating the Iris dataset, we see that sepal length, petal length and petal width are highly correlated. Sepal width is less redundant. Matrix decomposition techniques can uncover these latent patterns. Applying rotations to the resulting components does not inherently improve the predictve value of the derived latent space, but can help visualise their structure; here, for example, the varimax rotation, which is found by maximizing the squared variances of the weights, finds a structure where the second component only loads positively on sepal width.
fa: Al investigar el conjunto de datos de Iris, vemos que la longitud de los sépalos, la longitud de los pétalos y la anchura de los pétalos están muy correlacionados. La anchura de los sépalos es menos redundante. Las técnicas de descomposición de matrices pueden descubrir estos patrones latentes. La aplicación de rotaciones a los componentes resultantes no mejora intrínsecamente el valor predictivo del espacio latente derivado, pero puede ayudar a visualizar su estructura; aquí, por ejemplo, la rotación varimax, que se encuentra maximizando las varianzas al cuadrado de los pesos, encuentra una estructura en la que el segundo componente sólo se carga positivamente en la anchura del sépalo.

source: Load Iris data
fa: Carga datos de Iris

source: Plot covariance of Iris features
fa: Grafica la covarianza de las características del Iris

source: Run factor analysis with Varimax rotation
fa: Realiza un análisis factorial con rotación Varimax

source: **Total running time of the script:** ( 0 minutes 1.073 seconds)
fa: **Tiempo total de ejecución del script:** ( 0 minutos 1.073 segundos)

source: :download:`Download Python source code: plot_varimax_fa.py <plot_varimax_fa.py>`
fa: :download:`Descargar el código fuente de Python: plot_varimax_fa.py <plot_varimax_fa.py>`

source: :download:`Download Jupyter notebook: plot_varimax_fa.ipynb <plot_varimax_fa.ipynb>`
fa: :download:`Descarga el cuaderno de Jupyter: plot_varimax_fa.ipynb <plot_varimax_fa.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
fa: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
