Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/feature_selection/plot_f_test_vs_*.po
Languages: mi

source: Click :ref:`here <sphx_glr_download_auto_examples_feature_selection_plot_f_test_vs_mi.py>` to download the full example code or to run this example in your browser via Binder
mi: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_feature_selection_plot_f_test_vs_mi.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Comparison of F-test and mutual information
mi: Comparación de pruebas F e información mutua

source: This example illustrates the differences between univariate F-test statistics and mutual information.
mi: Este ejemplo ilustra las diferencias entre estadísticas univariadas de pruebas F e información mutua.

source: We consider 3 features x_1, x_2, x_3 distributed uniformly over [0, 1], the target depends on them as follows:
mi: Consideramos 3 características x_1, x_2, x_3 distribuidas uniformemente sobre [0, 1], el objetivo depende de ellas de la siguiente manera:

source: y = x_1 + sin(6 * pi * x_2) + 0.1 * N(0, 1), that is the third features is completely irrelevant.
mi: y = x_1 + sin(6 * pi * x_2) + 0.1 * N(0, 1), que es la tercera característica es completamente irrelevante.

source: The code below plots the dependency of y against individual x_i and normalized values of univariate F-tests statistics and mutual information.
mi: El código siguiente traza la dependencia de y frente a x_i individual y los valores normalizados de estadísticas univariadas de F-tests e información mutua.

source: As F-test captures only linear dependency, it rates x_1 as the most discriminative feature. On the other hand, mutual information can capture any kind of dependency between variables and it rates x_2 as the most discriminative feature, which probably agrees better with our intuitive perception for this example. Both methods correctly marks x_3 as irrelevant.
mi: Como la prueba F sólo capta la dependencia lineal, califica a x_1 como la característica más discriminativa. Por otro lado, la información mutua puede capturar cualquier tipo de dependencia entre las variables y califica a x_2 como la característica más discriminatoria, lo que probablemente concuerda mejor con nuestra percepción intuitiva para este ejemplo. Ambos métodos marcan correctamente x_3 como irrelevante.

source: **Total running time of the script:** ( 0 minutes 0.602 seconds)
mi: **Tiempo total de ejecución del script:** (0 minutos 0.602 segundos)

source: :download:`Download Python source code: plot_f_test_vs_mi.py <plot_f_test_vs_mi.py>`
mi: :download:`Descargar el código fuente de Python: plot_f_test_vs_mi.py <plot_f_test_vs_mi.py>`

source: :download:`Download Jupyter notebook: plot_f_test_vs_mi.ipynb <plot_f_test_vs_mi.ipynb>`
mi: :download:`Descargar cuaderno de Jupyter: plot_f_test_vs_mi.ipynb <plot_f_test_vs_mi.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
mi: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
