Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/feature_selection/plot_permutation_test_for_classification.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_feature_selection_plot_permutation_test_for_classification.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_feature_selection_plot_permutation_test_for_classification.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Test with permutations the significance of a classification score
es_es: Evalúa con permutaciones la importancia de una puntuación de clasificación

source: This example demonstrates the use of :func:`~sklearn.model_selection.permutation_test_score` to evaluate the significance of a cross-valdiated score using permutations.
es_es: Este ejemplo demuestra el uso de :func:`~sklearn.model_selection.permutation_test_score` para evaluar la importancia de una puntuación cruzada utilizando permutaciones.

source: We will also generate some random feature data (i.e., 2200 features), uncorrelated with the class labels in the iris dataset.
es_es: También generaremos algunos datos de características aleatorias (es decir, 2200 características), no correlacionadas con las etiquetas de clase en el conjunto de datos del iris.

source: Permutation test score
es_es: Puntuación de la prueba de permutación

source: Next, we calculate the :func:`~sklearn.model_selection.permutation_test_score` using the original iris dataset, which strongly predict the labels and the randomly generated features and iris labels, which should have no dependency between features and labels. We use the :class:`~sklearn.svm.SVC` classifier and :ref:`accuracy_score` to evaluate the model at each round.
es_es: A continuación, calculamos el :func:`~sklearn.model_selection. ermutation_test_score` usando el conjunto de datos de iris original, que predice fuertemente las etiquetas y las características generadas al azar y las etiquetas de iris, que no deberían tener dependencia entre características y etiquetas. Utilizamos el clasificación :class:`~sklearn.svm.SVC` y :ref:`accuracy_score` para evaluar el modelo en cada ronda.

source: :func:`~sklearn.model_selection.permutation_test_score` generates a null distribution by calculating the accuracy of the classifier on 1000 different permutations of the dataset, where features remain the same but labels undergo different permutations. This is the distribution for the null hypothesis which states there is no dependency between the features and labels. An empirical p-value is then calculated as the percentage of permutations for which the score obtained is greater that the score obtained using the original data.
es_es: :func:`~sklearn.model_selection.permutation_test_score` genera una distribución nula calculando la exactitud del clasificador en 1000 permutaciones diferentes del conjunto de datos, donde las características siguen siendo las mismas pero las etiquetas sufren diferentes permutaciones. Esta es la distribución para la hipótesis nula que afirma que no hay dependencia entre las características y las etiquetas. A continuación, se calcula un valor p empírico como el porcentaje de permutaciones en las que la puntuación obtenida es mayor que la obtenida con los datos originales.

source: Original data
es_es: Datos originales

source: Below we plot a histogram of the permutation scores (the null distribution). The red line indicates the score obtained by the classifier on the original data. The score is much better than those obtained by using permuted data and the p-value is thus very low. This indicates that there is a low likelihood that this good score would be obtained by chance alone. It provides evidence that the iris dataset contains real dependency between features and labels and the classifier was able to utilize this to obtain good results.
es_es: A continuación, trazamos un histograma de las puntuaciones de permutación (la distribución nula). La línea roja indica la puntuación obtenida por el clasificador en los datos originales. La puntuación es mucho mejor que la obtenida con los datos permutados y, por tanto, el valor p es muy bajo. Esto indica que hay una baja verosimilitud de que esta buena puntuación se obtenga sólo por azar. Esto demuestra que el conjunto de datos del iris contiene una dependencia real entre las características y las etiquetas, y que el clasificador fue capaz de utilizarla para obtener buenos resultados.

source: Random data
es_es: Datos aleatorios

source: Below we plot the null distribution for the randomized data. The permutation scores are similar to those obtained using the original iris dataset because the permutation always destroys any feature label dependency present. The score obtained on the original randomized data in this case though, is very poor. This results in a large p-value, confirming that there was no feature label dependency in the original data.
es_es: A continuación, trazamos la distribución nula para los datos aleatorios. Las puntuaciones de la permutación son similares a las obtenidas con el conjunto de datos original del iris, ya que la permutación siempre destruye cualquier dependencia de la etiqueta de características presente. Sin embargo, la puntuación obtenida con los datos aleatorios originales es muy baja. El resultado es un gran valor p, lo que confirma que no había dependencia de etiquetas de características en los datos originales.

source: Another possible reason for obtaining a high p-value is that the classifier was not able to use the structure in the data. In this case, the p-value would only be low for classifiers that are able to utilize the dependency present. In our case above, where the data is random, all classifiers would have a high p-value as there is no structure present in the data.
es_es: Otra posible razón para obtener un valor p alto es que el clasificador no pudo usar la estructura en los datos. En este caso, el valor p sólo sería bajo para los clasificadores que son capaces de utilizar la dependencia presente. En nuestro caso anterior, donde los datos son aleatorios, todos los clasificadores tendrían un alto valor p, ya que no hay estructura presente en los datos.

source: Finally, note that this test has been shown to produce low p-values even if there is only weak structure in the data [1]_.
es_es: Por último, ten en cuenta que esta prueba ha sido mostrada para producir valores de p bajos, incluso si solo hay una estructura débil en los datos [1]_.

source: **Total running time of the script:** ( 0 minutes 32.800 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 32.800 segundos)

source: :download:`Download Python source code: plot_permutation_test_for_classification.py <plot_permutation_test_for_classification.py>`
es_es: :download:`Descargar el código fuente de Python: plot_permutation_test_for_classification.py <plot_permutation_test_for_classification.py>`

source: :download:`Download Jupyter notebook: plot_permutation_test_for_classification.ipynb <plot_permutation_test_for_classification.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_permutation_test_for_classification.ipynb <plot_permutation_test_for_classification.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
