Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/feature_selection/plot_select_from_model_diabetes.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_feature_selection_plot_select_from_model_diabetes.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_feature_selection_plot_select_from_model_diabetes.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Model-based and sequential feature selection
es_es: Selección de características basadas en modelos y secuenciales

source: This example illustrates and compares two approaches for feature selection: :class:`~sklearn.feature_selection.SelectFromModel` which is based on feature importance, and :class:`~sklearn.feature_selection.SequentialFeatureSelection` which relies on a greedy approach.
es_es: Este ejemplo ilustra y compara dos enfoques para la selección de características: :class:`~sklearn.feature_selection.SelectFromModel` que se basa en la importancia de las características, y :class:`~sklearn.feature_selection.SequentialFeatureSelection` que se basa en un enfoque codicioso.

source: We use the Diabetes dataset, which consists of 10 features collected from 442 diabetes patients.
es_es: Utilizamos el conjunto de datos de Diabetes, que consiste en 10 características recolectadas de 442 pacientes de diabetes.

source: Authors: `Manoj Kumar <mks542@nyu.edu>`_, `Maria Telenczuk <https://github.com/maikia>`_, Nicolas Hug.
es_es: Autores: `Manoj Kumar <mks542@nyu.edu>`_, `Maria Telenczuk <https://github.com/maikia>`_, Nicolas Hug.

source: License: BSD 3 clause
es_es: Licencia: cláusula BSD 3

source: Loading the data
es_es: Cargando datos

source: We first load the diabetes dataset which is available from within scikit-learn, and print its description:
es_es: Primero cargamos el conjunto de datos de diabetes que está disponible dentro de scikit-learn, e imprimimos su descripción:

source: Out:
es_es: Salida:

source: Feature importance from coefficients
es_es: Importancia de la función de los coeficientes

source: To get an idea of the importance of the features, we are going to use the :class:`~sklearn.linear_model.LassoCV` estimator. The features with the highest absolute `coef_` value are considered the most important. We can observe the coefficients directly without needing to scale them (or scale the data) because from the description above, we know that the features were already standardized. For a more complete example on the interpretations of the coefficients of linear models, you may refer to :ref:`sphx_glr_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py`.
es_es: Para tener una idea de la importancia de las características, vamos a utilizar el estimador :class:`~sklearn.linear_model.LassoCV`. Las características con el mayor valor absoluto de `coef_` se consideran las más importantes. Podemos observar los coeficientes directamente sin necesidad de escalarlos (o de escalar los datos) porque, por la descripción anterior, sabemos que las características ya estaban estandarizadas. Para un ejemplo más completo sobre las interpretaciones de los coeficientes de los modelos lineales, puede consultar :ref:`sphx_glr_auto_examples_inspection_plot_linear_model_coefficient_interpretation.py`.

source: Selecting features based on importance
es_es: Seleccionar características basadas en la importancia

source: Now we want to select the two features which are the most important according to the coefficients. The :class:`~sklearn.feature_selection.SelectFromModel` is meant just for that. :class:`~sklearn.feature_selection.SelectFromModel` accepts a `threshold` parameter and will select the features whose importance (defined by the coefficients) are above this threshold.
es_es: Ahora queremos seleccionar las dos características más importantes según los coeficientes. La :class:`~sklearn.feature_selection.SelectFromModel` está pensada precisamente para eso. :class:`~sklearn.feature_selection.SelectFromModel` acepta un parámetro `threshold` y seleccionará las características cuya importancia (definida por los coeficientes) esté por encima de este umbral.

source: Since we want to select only 2 features, we will set this threshold slightly above the coefficient of third most important feature.
es_es: Puesto que sólo queremos seleccionar 2 características, estableceremos este umbral ligeramente por encima del coeficiente de la tercera característica más importante.

source: Selecting features with Sequential Feature Selection
es_es: Seleccionar características con Selección de Características Secuenciales

source: Another way of selecting features is to use :class:`~sklearn.feature_selection.SequentialFeatureSelector` (SFS). SFS is a greedy procedure where, at each iteration, we choose the best new feature to add to our selected features based a cross-validation score. That is, we start with 0 features and choose the best single feature with the highest score. The procedure is repeated until we reach the desired number of selected features.
es_es: Otra forma de seleccionar características es utilizar :class:`~sklearn.feature_selection.SequentialFeatureSelector` (SFS). El SFS es un procedimiento codicioso en el que, en cada iteración, elegimos la mejor característica nueva para añadirla a nuestras características seleccionadas basándonos en una puntuación de validación cruzada. Es decir, empezamos con 0 características y elegimos la mejor característica individual con la mayor puntuación. El procedimiento se repite hasta alcanzar el número deseado de características seleccionadas.

source: We can also go in the reverse direction (backward SFS), *i.e.* start with all the features and greedily choose features to remove one by one. We illustrate both approaches here.
es_es: También podemos ir en la dirección inversa (SFS hacia atrás), *p. ej. empieza con todas las características y escoge con codicia características para eliminar una por una. Ilustramos ambos enfoques aquí.

source: Discussion
es_es: Discusión

source: Interestingly, forward and backward selection have selected the same set of features. In general, this isn't the case and the two methods would lead to different results.
es_es: Curiosamente, la selección hacia adelante y hacia atrás han seleccionado el mismo conjunto de características. En general, este no es el caso y los dos métodos llevarían a resultados diferentes.

source: We also note that the features selected by SFS differ from those selected by feature importance: SFS selects `bmi` instead of `s1`. This does sound reasonable though, since `bmi` corresponds to the third most important feature according to the coefficients. It is quite remarkable considering that SFS makes no use of the coefficients at all.
es_es: También observamos que las características seleccionadas por SFS difieren de las seleccionadas por la importancia de las características: SFS selecciona `bmi` en lugar de `s1`. Sin embargo, esto suena razonable, ya que `bmi` corresponde a la tercera característica más importante de acuerdo con los coeficientes. Es bastante curioso si tenemos en cuenta que el SFS no hace uso de los coeficientes en absoluto.

source: To finish with, we should note that :class:`~sklearn.feature_selection.SelectFromModel` is significantly faster than SFS. Indeed, :class:`~sklearn.feature_selection.SelectFromModel` only needs to fit a model once, while SFS needs to cross-validate many different models for each of the iterations. SFS however works with any model, while :class:`~sklearn.feature_selection.SelectFromModel` requires the underlying estimator to expose a `coef_` attribute or a `feature_importances_` attribute. The forward SFS is faster than the backward SFS because it only needs to perform `n_features_to_select = 2` iterations, while the backward SFS needs to perform `n_features - n_features_to_select = 8` iterations.
es_es: Para terminar, debemos señalar que :class:`~sklearn.feature_selection.SelectFromModel` es significativamente más rápido que SFS. De hecho, :class:`~sklearn.feature_selection.SelectFromModel` sólo necesita ajustar un modelo una vez, mientras que SFS necesita validar de forma cruzada muchos modelos diferentes para cada una de las iteraciones. Sin embargo, SFS funciona con cualquier modelo, mientras que :class:`~sklearn.feature_selection.SelectFromModel` requiere que el estimador subyacente exponga un atributo `coef_` o un atributo `feature_importances_`. El SFS hacia adelante es más rápido que el SFS hacia atrás porque sólo necesita realizar `n_features_to_select = 2` iteraciones, mientras que el SFS hacia atrás necesita realizar `n_features - n_features = 8` iteraciones.

source: **Total running time of the script:** ( 0 minutes 19.257 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 19.257 segundos)

source: :download:`Download Python source code: plot_select_from_model_diabetes.py <plot_select_from_model_diabetes.py>`
es_es: :download:`Descargar el código fuente de Python: plot_select_from_model_diabetes.py <plot_select_from_model_diabetes.py>`

source: :download:`Download Jupyter notebook: plot_select_from_model_diabetes.ipynb <plot_select_from_model_diabetes.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_select_from_model_diabetes.ipynb <plot_select_from_model_diabetes.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
