Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_poisson_regression_non_normal_loss.po
Languages: es_es

source: The least squares loss (along with the implicit use of the identity link function) of the Ridge regression model seems to cause this model to be badly calibrated. In particular, it tends to underestimate the risk and can even predict invalid negative frequencies.
es_es: La pérdida por mínimos cuadrados (junto con el uso implícito de la función de enlace de identidad) del modelo de regresión Ridge parece hacer que este modelo esté mal calibrado. En particular, tiende a subestimar el riesgo y puede incluso predecir frecuencias negativas no válidas.

source: Using the Poisson loss with a log-link can correct these problems and lead to a well-calibrated linear model.
es_es: El uso de la pérdida de Poisson con un enlace logarítmico puede corregir estos problemas y conducir a un modelo lineal bien calibrado.

source: The Gini index reflects the ability of a model to rank predictions irrespective of their absolute values, and therefore only assess their ranking power.
es_es: El índice de Gini refleja la capacidad de un modelo para clasificar las predicciones con independencia de sus valores absolutos, por lo que sólo evalúa su poder de clasificación.

source: Despite the improvement in calibration, the ranking power of both linear models are comparable and well below the ranking power of the Gradient Boosting Regression Trees.
es_es: A pesar de la mejora en la calibración, el poder de clasificación de ambos modelos lineales es comparable y está muy por debajo del poder de clasificación de los árboles de regresión de potenciación de gradiente.

source: The Poisson deviance computed as an evaluation metric reflects both the calibration and the ranking power of the model. It also makes a linear assumption on the ideal relationship between the expected value and the variance of the response variable. For the sake of conciseness we did not check whether this assumption holds.
es_es: La desviación de Poisson calculada como métrica de evaluación refleja tanto la calibración como el poder de clasificación del modelo. También hace una suposición lineal sobre la relación ideal entre el valor esperado y la varianza de la variable de respuesta. En aras de la concisión, no comprobamos si este supuesto se cumple.

source: Traditional regression metrics such as Mean Squared Error and Mean Absolute Error are hard to meaningfully interpret on count values with many zeros.
es_es: Las métricas de regresión tradicionales, como el error cuadrático medio y el error absoluto medio, son difíciles de interpretar de forma significativa en valores de recuento con muchos ceros.

source: **Total running time of the script:** ( 1 minutes 35.081 seconds)
es_es: **Tiempo total de ejecución del script:** (1 minutos 35.081 segundos)

source: :download:`Download Python source code: plot_poisson_regression_non_normal_loss.py <plot_poisson_regression_non_normal_loss.py>`
es_es: :download:`Descargar el código fuente de Python: plot_poisson_regression_non_normal_loss.py <plot_poisson_regression_non_normal_loss.py>`

source: :download:`Download Jupyter notebook: plot_poisson_regression_non_normal_loss.ipynb <plot_poisson_regression_non_normal_loss.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_poisson_regression_non_normal_loss.ipynb <plot_poisson_regression_non_normal_loss.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
