Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_ridge_path.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_ridge_path.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_ridge_path.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot Ridge coefficients as a function of the regularization
es_es: Graficar los coeficientes de Ridge en función de la regularización

source: Shows the effect of collinearity in the coefficients of an estimator.
es_es: Muestra el efecto de la colinealidad en los coeficientes de un estimador.

source: :class:`Ridge` Regression is the estimator used in this example. Each color represents a different feature of the coefficient vector, and this is displayed as a function of the regularization parameter.
es_es: :class:`Ridge` Regresión es el estimador utilizado en este ejemplo. Cada color representa una característica diferente del vector de coeficientes, y esto se muestra en función del parámetro de regularización.

source: This example also shows the usefulness of applying Ridge regression to highly ill-conditioned matrices. For such matrices, a slight change in the target variable can cause huge variances in the calculated weights. In such cases, it is useful to set a certain regularization (alpha) to reduce this variation (noise).
es_es: Este ejemplo también muestra la utilidad de aplicar la regresión Ridge a matrices muy mal condicionadas. En este tipo de matrices, un ligero cambio en la variable objetivo puede provocar enormes variaciones en los pesos calculados. En estos casos, es útil establecer una determinada regularización (alfa) para reducir esta variación (ruido).

source: When alpha is very large, the regularization effect dominates the squared loss function and the coefficients tend to zero. At the end of the path, as alpha tends toward zero and the solution tends towards the ordinary least squares, coefficients exhibit big oscillations. In practise it is necessary to tune alpha in such a way that a balance is maintained between both.
es_es: Cuando alfa es muy grande, el efecto de regularización domina la función de pérdida al cuadrado y los coeficientes tienden a cero. Al final del camino, cuando alfa tiende a cero y la solución tiende a los mínimos cuadrados ordinarios, los coeficientes presentan grandes oscilaciones. En la práctica, es necesario afinar alfa de forma que se mantenga un equilibrio entre ambos.

source: **Total running time of the script:** ( 0 minutes 0.286 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.286 segundos)

source: :download:`Download Python source code: plot_ridge_path.py <plot_ridge_path.py>`
es_es: :download:`Descargar el código fuente de Python: plot_ridge_path.py <plot_ridge_path.py>`

source: :download:`Download Jupyter notebook: plot_ridge_path.ipynb <plot_ridge_path.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_ridge_path.ipynb <plot_ridge_path.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
