Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_logistic_path.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_logistic_path.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_logistic_path.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Regularization path of L1- Logistic Regression
es_es: Ruta de regularización de la regresión logística L1

source: Train l1-penalized logistic regression models on a binary classification problem derived from the Iris dataset.
es_es: Entrenar modelos de regresión logística con penalización l1 en un problema de clasificación binaria derivado del conjunto de datos Iris.

source: The models are ordered from strongest regularized to least regularized. The 4 coefficients of the models are collected and plotted as a "regularization path": on the left-hand side of the figure (strong regularizers), all the coefficients are exactly 0. When regularization gets progressively looser, coefficients can get non-zero values one after the other.
es_es: Los modelos están ordenados de mayor a menor regularización. Los 4 coeficientes de los modelos se recogen y se grafican como una "ruta de regularización": en el lado izquierdo de la figura (regularizadores fuertes), todos los coeficientes son exactamente 0. Cuando la regularización se hace progresivamente más floja, los coeficientes pueden obtener valores distintos de cero uno tras otro.

source: Here we choose the liblinear solver because it can efficiently optimize for the Logistic Regression loss with a non-smooth, sparsity inducing l1 penalty.
es_es: Aquí elegimos el solucionador liblinear porque puede optimizar eficientemente la pérdida de Regresión Logística con una penalización l1 no suave y que induce a la dispersión.

source: Also note that we set a low value for the tolerance to make sure that the model has converged before collecting the coefficients.
es_es: También hay que tener en cuenta que establecemos un valor bajo de tolerancia para asegurarnos de que el modelo ha convergido antes de recoger los coeficientes.

source: We also use warm_start=True which means that the coefficients of the models are reused to initialize the next model fit to speed-up the computation of the full-path.
es_es: También utilizamos warm_start=True, lo que significa que los coeficientes de los modelos se reutilizan para inicializar el siguiente ajuste del modelo para acelerar el cálculo de la ruta completa.

source: **Total running time of the script:** ( 0 minutes 0.149 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 0.149 segundos)

source: :download:`Download Python source code: plot_logistic_path.py <plot_logistic_path.py>`
es_es: :download:`Descargar el código fuente de Python: plot_logistic_path.py <plot_logistic_path.py>`

source: :download:`Download Jupyter notebook: plot_logistic_path.ipynb <plot_logistic_path.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_logistic_path.ipynb <plot_logistic_path.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
