Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_sgd_early_stopping.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_sgd_early_stopping.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_sgd_early_stopping.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Early stopping of Stochastic Gradient Descent
es_es: Parada anticipada del descenso de gradiente estocástico

source: Stochastic Gradient Descent is an optimization technique which minimizes a loss function in a stochastic fashion, performing a gradient descent step sample by sample. In particular, it is a very efficient method to fit linear models.
es_es: El descenso de gradiente estocástico es una técnica de optimización que minimiza una función de pérdida de forma estocástica, realizando un paso de descenso de gradiente muestra a muestra. En particular, es un método muy eficaz para ajustar modelos lineales.

source: As a stochastic method, the loss function is not necessarily decreasing at each iteration, and convergence is only guaranteed in expectation. For this reason, monitoring the convergence on the loss function can be difficult.
es_es: Al ser un método estocástico, la función de pérdida no es necesariamente decreciente en cada iteración, y la convergencia sólo se garantiza en la expectativa. Por esta razón, el seguimiento de la convergencia en la función de pérdida puede ser difícil.

source: Another approach is to monitor convergence on a validation score. In this case, the input data is split into a training set and a validation set. The model is then fitted on the training set and the stopping criterion is based on the prediction score computed on the validation set. This enables us to find the least number of iterations which is sufficient to build a model that generalizes well to unseen data and reduces the chance of over-fitting the training data.
es_es: Otro enfoque consiste en controlar la convergencia en una puntuación de validación. En este caso, los datos de entrada se dividen en un conjunto de entrenamiento y un conjunto de validación. El modelo se ajusta al conjunto de entrenamiento y el criterio de parada se basa en la puntuación de predicción calculada en el conjunto de validación. Esto nos permite encontrar el menor número de iteraciones que es suficiente para construir un modelo que generaliza bien a los datos no vistos y reduce la posibilidad de sobreajuste de los datos de entrenamiento.

source: This early stopping strategy is activated if ``early_stopping=True``; otherwise the stopping criterion only uses the training loss on the entire input data. To better control the early stopping strategy, we can specify a parameter ``validation_fraction`` which set the fraction of the input dataset that we keep aside to compute the validation score. The optimization will continue until the validation score did not improve by at least ``tol`` during the last ``n_iter_no_change`` iterations. The actual number of iterations is available at the attribute ``n_iter_``.
es_es: Esta estrategia de parada anticipada se activa si ``early_stopping=True``; en caso contrario, el criterio de parada sólo utiliza la pérdida asociada al entrenamiento en todos los datos de entrada. Para controlar mejor la estrategia de parada anticipada, podemos especificar un parámetro ``validation_fraction`` que establece la fracción del conjunto de datos de entrada que se reserva para calcular la puntuación de validación. La optimización continuará hasta que la puntuación de validación no mejore en al menos ``tol`` durante las últimas iteraciones de ``n_iter_no_change``. El número real de iteraciones está disponible en el atributo ``n_iter_``.

source: This example illustrates how the early stopping can used in the :class:`~sklearn.linear_model.SGDClassifier` model to achieve almost the same accuracy as compared to a model built without early stopping. This can significantly reduce training time. Note that scores differ between the stopping criteria even from early iterations because some of the training data is held out with the validation stopping criterion.
es_es: Este ejemplo ilustra cómo la parada anticipada puede utilizarse en el modelo :class:`~sklearn.linear_model.SGDClassifier` para conseguir casi la misma precisión que un modelo construido sin parada anticipada. Esto puede reducir significativamente el tiempo de entrenamiento. Tenga en cuenta que las puntuaciones difieren entre los criterios de parada incluso desde las primeras iteraciones porque algunos de los datos de entrenamiento se mantienen con el criterio de parada de validación.

source: **Total running time of the script:** ( 1 minutes 2.986 seconds)
es_es: **Tiempo total de ejecución del script:** (1 minutos 2.986 segundos)

source: :download:`Download Python source code: plot_sgd_early_stopping.py <plot_sgd_early_stopping.py>`
es_es: :download:`Descargar código fuente de Python: plot_sgd_early_stopping.py <plot_sgd_early_stopping.py>`

source: :download:`Download Jupyter notebook: plot_sgd_early_stopping.ipynb <plot_sgd_early_stopping.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_sgd_early_stopping.ipynb <plot_sgd_early_stopping.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
