Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_tweedie_regression_insurance_claims.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_tweedie_regression_insurance_claims.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_tweedie_regression_insurance_claims.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Tweedie regression on insurance claims
es_es: Regresión de Tweedie en los reclamos de seguros

source: This example illustrates the use of Poisson, Gamma and Tweedie regression on the `French Motor Third-Party Liability Claims dataset <https://www.openml.org/d/41214>`_, and is inspired by an R tutorial [1]_.
es_es: Este ejemplo ilustra el uso de la regresión de Poisson, Gamma y Tweedie en el conjunto de datos `French Motor Third-Party Liability Claims <https://www.openml.org/d/41214>`_, y está inspirado en un tutorial de R [1]_.

source: In this dataset, each sample corresponds to an insurance policy, i.e. a contract within an insurance company and an individual (policyholder). Available features include driver age, vehicle age, vehicle power, etc.
es_es: En este conjunto de datos, cada muestra corresponde a una póliza de seguro, es decir, a un contrato entre una compañía de seguros y un individuo (asegurado). Las características disponibles incluyen la edad del conductor, la edad del vehículo, la potencia del vehículo, etc.

source: A few definitions: a *claim* is the request made by a policyholder to the insurer to compensate for a loss covered by the insurance. The *claim amount* is the amount of money that the insurer must pay. The *exposure* is the duration of the insurance coverage of a given policy, in years.
es_es: Algunas definiciones: una *reclamo* es la petición que hace el asegurado a la aseguradora para que le compense un siniestro cubierto por el seguro. La *cantidad de los reclamos* es la cantidad de dinero que la aseguradora debe pagar. La *exposición* es la duración de la cobertura del seguro de una determinada póliza, en años.

source: Here our goal is to predict the expected value, i.e. the mean, of the total claim amount per exposure unit also referred to as the pure premium.
es_es: En este caso, nuestro objetivo es predecir el valor esperado, es decir, la media, del importe total de los siniestros por unidad de exposición, también denominado prima pura.

source: There are several possibilities to do that, two of which are:
es_es: Hay varias posibilidades para hacerlo, dos de las cuales son:

source: Model the number of claims with a Poisson distribution, and the average claim amount per claim, also known as severity, as a Gamma distribution and multiply the predictions of both in order to get the total claim amount.
es_es: Modela el número de siniestros con una distribución de Poisson, y el importe medio de los siniestros, también conocido como gravedad, como una distribución Gamma y multiplica las predicciones de ambos para obtener el importe total de los siniestros.

source: Model the total claim amount per exposure directly, typically with a Tweedie distribution of Tweedie power :math:`p \in (1, 2)`.
es_es: Modela el importe total de los siniestros por exposición directamente, normalmente con una distribución de Tweedie de potencia :math:`p \Nen (1, 2)`.

source: In this example we will illustrate both approaches. We start by defining a few helper functions for loading the data and visualizing results.
es_es: En este ejemplo ilustraremos ambos enfoques. Comenzamos definiendo algunas funciones de ayuda para cargar los datos y visualizar los resultados.

source: Loading datasets, basic feature extraction and target definitions
es_es: Carga de conjuntos de datos, extracción de características básicas y definiciones de objetivos

source: We construct the freMTPL2 dataset by joining the freMTPL2freq table, containing the number of claims (``ClaimNb``), with the freMTPL2sev table, containing the claim amount (``ClaimAmount``) for the same policy ids (``IDpol``).
es_es: Construimos el conjunto de datos freMTPL2 uniendo la tabla freMTPL2freq, que contiene el número de siniestros (``ClaimNb``), con la tabla freMTPL2sev, que contiene el importe de los siniestros (``ClaimAmount``) para los mismos identificadores de póliza (``IDpol``).

source: Frequency model -- Poisson distribution
es_es: Modelo de frecuencia -- Distribución de Poisson

source: The number of claims (``ClaimNb``) is a positive integer (0 included). Thus, this target can be modelled by a Poisson distribution. It is then assumed to be the number of discrete events occuring with a constant rate in a given time interval (``Exposure``, in units of years). Here we model the frequency ``y = ClaimNb / Exposure``, which is still a (scaled) Poisson distribution, and use ``Exposure`` as `sample_weight`.
es_es: El número de siniestros (``ClaimNb``) es un número entero positivo (incluido el 0). Por tanto, este objetivo puede modelizarse mediante una distribución de Poisson. Se supone entonces que es el número de eventos discretos que ocurren con una tasa constante en un intervalo de tiempo determinado (``Exposición``, en unidades de años). Aquí modelamos la frecuencia ``y = ClaimNb / Exposure``, que sigue siendo una distribución de Poisson (a escala), y utilizamos ``Exposure`` como `sample_weight`.

source: We can visually compare observed and predicted values, aggregated by the drivers age (``DrivAge``), vehicle age (``VehAge``) and the insurance bonus/malus (``BonusMalus``).
es_es: Podemos comparar visualmente los valores observados y los previstos, agregados por la edad del conductor (``DrivAge``), la edad del vehículo (``VehAge``) y el bonus/malus del seguro (``BonusMalus``).

source: According to the observed data, the frequency of accidents is higher for drivers younger than 30 years old, and is positively correlated with the `BonusMalus` variable. Our model is able to mostly correctly model this behaviour.
es_es: Según los datos observados, la frecuencia de los accidentes es mayor para los conductores menores de 30 años, y está positivamente correlacionada con la variable `BonusMalus`. Nuestro modelo es capaz de modelar correctamente este comportamiento.

source: Severity Model - Gamma distribution
es_es: Modelo de gravedad - Distribución gamma

source: The mean claim amount or severity (`AvgClaimAmount`) can be empirically shown to follow approximately a Gamma distribution. We fit a GLM model for the severity with the same features as the frequency model.
es_es: Se puede demostrar empíricamente que el importe medio de los siniestros o la gravedad (`AvgClaimAmount`) sigue aproximadamente una distribución Gamma. Ajustamos un modelo GLM para la gravedad con las mismas características que el modelo de frecuencia.

source: Note:
es_es: Nota:

source: We filter out ``ClaimAmount == 0`` as the Gamma distribution has support on :math:`(0, \infty)`, not :math:`[0, \infty)`.
es_es: Filtramos ``ClaimAmount == 0`` ya que la distribución Gamma tiene soporte en :math:`(0, \infty)`, no en :math:`[0, \infty)`.

source: We use ``ClaimNb`` as `sample_weight` to account for policies that contain more than one claim.
es_es: Utilizamos "ClaimNb" como `sample_weight` para tener en cuenta las pólizas que contienen más de un siniestro.

source: Here, the scores for the test data call for caution as they are significantly worse than for the training data indicating an overfit despite the strong regularization.
es_es: En este caso, las puntuaciones de los datos de prueba exigen precaución, ya que son significativamente peores que las de los datos de entrenamiento, lo que indica un sobreajuste a pesar de la fuerte regularización.

source: Note that the resulting model is the average claim amount per claim. As such, it is conditional on having at least one claim, and cannot be used to predict the average claim amount per policy in general.
es_es: Hay que tener en cuenta que el modelo resultante es el importe medio de los siniestros por póliza. Como tal, está condicionado a tener al menos un siniestro, y no puede utilizarse para predecir el importe medio de los siniestros por póliza en general.

source: We can visually compare observed and predicted values, aggregated for the drivers age (``DrivAge``).
es_es: Podemos comparar visualmente los valores observados y previstos, agregados para la edad del conductor (``DrivAge``).

source: Overall, the drivers age (``DrivAge``) has a weak impact on the claim severity, both in observed and predicted data.
es_es: En general, la edad del conductor (``DrivAge``) tiene un impacto débil en la gravedad de los siniestros, tanto en los datos observados como en los previstos.

source: Pure Premium Modeling via a Product Model vs single TweedieRegressor
es_es: Modelización de la prima pura mediante un modelo de producto frente a un único TweedieRegressor

source: As mentioned in the introduction, the total claim amount per unit of exposure can be modeled as the product of the prediction of the frequency model by the prediction of the severity model.
es_es: Como se ha mencionado en la introducción, el importe total de los siniestros por unidad de exposición puede modelarse como el producto de la predicción del modelo de frecuencia por la predicción del modelo de gravedad.

source: Alternatively, one can directly model the total loss with a unique Compound Poisson Gamma generalized linear model (with a log link function). This model is a special case of the Tweedie GLM with a "power" parameter :math:`p \in (1, 2)`. Here, we fix apriori the `power` parameter of the Tweedie model to some arbitrary value (1.9) in the valid range. Ideally one would select this value via grid-search by minimizing the negative log-likelihood of the Tweedie model, but unfortunately the current implementation does not allow for this (yet).
es_es: Como alternativa, se puede modelar directamente la pérdida total con un único modelo lineal generalizado de Poisson Gamma Compuesto (con una función de enlace logarítmica). Este modelo es un caso especial del MLG de Tweedie con un parámetro de "power" :math:`p \in (1, 2)`. En este caso, fijamos apriori el parámetro de `power` del modelo de Tweedie en un valor arbitrario (1.9) dentro del rango válido. Lo ideal sería seleccionar este valor a través de la búsqueda en la red minimizando la logaritmo de verosimilitud negativa del modelo de Tweedie, pero desafortunadamente la implementación actual no permite esto (todavía).

source: We will compare the performance of both approaches. To quantify the performance of both models, one can compute the mean deviance of the train and test data assuming a Compound Poisson-Gamma distribution of the total claim amount. This is equivalent to a Tweedie distribution with a `power` parameter between 1 and 2.
es_es: Compararemos el rendimiento de ambos enfoques. Para cuantificar el rendimiento de ambos modelos, se puede calcular la desviación media de los datos de entrenamiento y de prueba suponiendo una distribución Poisson-Gamma compuesta del importe total de la reclamación. Esto equivale a una distribución de Tweedie con un parámetro de `power` entre 1 y 2.

source: The :func:`sklearn.metrics.mean_tweedie_deviance` depends on a `power` parameter. As we do not know the true value of the `power` parameter, we here compute the mean deviances for a grid of possible values, and compare the models side by side, i.e. we compare them at identical values of `power`. Ideally, we hope that one model will be consistently better than the other, regardless of `power`.
es_es: La :func:`sklearn.metrics.mean_tweedie_deviance` depende de un parámetro `power`. Como no conocemos el valor real del parámetro `power`, aquí calculamos las desviaciones medias para una parrilla de valores posibles, y comparamos los modelos uno al lado del otro, es decir, los comparamos con valores idénticos de `power`. Idealmente, esperamos que un modelo sea sistemáticamente mejor que el otro, independientemente de la `power`.

source: In this example, both modeling approaches yield comparable performance metrics. For implementation reasons, the percentage of explained variance :math:`D^2` is not available for the product model.
es_es: En este ejemplo, ambos enfoques de modelización ofrecen métricas de rendimiento comparables. Por razones de implementación, el porcentaje de varianza explicada :math:`D^2` no está disponible para el modelo de producto.

source: We can additionally validate these models by comparing observed and predicted total claim amount over the test and train subsets. We see that, on average, both model tend to underestimate the total claim (but this behavior depends on the amount of regularization).
es_es: Además, podemos validar estos modelos comparando el importe total de siniestros observado y predicho en los subconjuntos de prueba y de entrenamiento. Vemos que, en promedio, ambos modelos tienden a subestimar la siniestralidad total (pero este comportamiento depende de la cantidad de regularización).

source: Finally, we can compare the two models using a plot of cumulated claims: for each model, the policyholders are ranked from safest to riskiest and the fraction of observed total cumulated claims is plotted on the y axis. This plot is often called the ordered Lorenz curve of the model.
es_es: Por último, podemos comparar los dos modelos utilizando un gráfico de los siniestros acumulados: para cada modelo, los asegurados se clasifican de más seguros a más arriesgados y la fracción de los siniestros totales acumulados observados se representa en el eje Y. Este Gráfico suele denominarse curva de Lorenz ordenada del modelo.

source: The Gini coefficient (based on the area under the curve) can be used as a model selection metric to quantify the ability of the model to rank policyholders. Note that this metric does not reflect the ability of the models to make accurate predictions in terms of absolute value of total claim amounts but only in terms of relative amounts as a ranking metric.
es_es: El coeficiente de Gini (basado en el área bajo la curva) puede utilizarse como métrica de selección de modelos para cuantificar la capacidad del modelo de clasificar a los asegurados. Hay que tener en cuenta que esta métrica no refleja la capacidad de los modelos para hacer predicciones precisas en términos de valor absoluto de los importes totales de los siniestros, sino sólo en términos de importes relativos como métrica de clasificación.

source: Both models are able to rank policyholders by risky-ness significantly better than chance although they are also both far from perfect due to the natural difficulty of the prediction problem from few features.
es_es: Ambos modelos son capaces de clasificar a los asegurados por su nivel de riesgo significativamente mejor que el azar, aunque también están lejos de ser perfectos debido a la dificultad natural del problema de predicción a partir de pocas características.

source: Note that the Gini index only characterize the ranking performance of the model but not its calibration: any monotonic transformation of the predictions leaves the Gini index of the model unchanged.
es_es: Observa que el índice de Gini sólo caracteriza el rendimiento de la clasificación del modelo, pero no su calibración: cualquier transformación monótona de las predicciones deja inalterado el índice de Gini del modelo.

source: Finally one should highlight that the Compound Poisson Gamma model that is directly fit on the pure premium is operationally simpler to develop and maintain as it consists in a single scikit-learn estimator instead of a pair of models, each with its own set of hyperparameters.
es_es: Por último, cabe destacar que el modelo Gamma de Poisson compuesto que se ajusta directamente a la prima pura es operativamente más sencillo de desarrollar y mantener, ya que consiste en un único estimador de scikit-learn en lugar de un par de modelos, cada uno con su propio conjunto de hiperparámetros.

source: **Total running time of the script:** ( 0 minutes 33.168 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 33.168 segundos)

source: :download:`Download Python source code: plot_tweedie_regression_insurance_claims.py <plot_tweedie_regression_insurance_claims.py>`
es_es: :download:`Descargar código fuente de Python: plot_tweedie_regression_insurance_claims.py <plot_tweedie_regression_insurance_claims.py>`

source: :download:`Download Jupyter notebook: plot_tweedie_regression_insurance_claims.ipynb <plot_tweedie_regression_insurance_claims.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_tweedie_regression_insurance_claims.ipynb <plot_tweedie_regression_insurance_claims.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
