Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_poisson_regression_non_normal_loss.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_poisson_regression_non_normal_loss.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_poisson_regression_non_normal_loss.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Poisson regression and non-normal loss
es_es: Regresión de Poisson y pérdida no normal

source: This example illustrates the use of log-linear Poisson regression on the `French Motor Third-Party Liability Claims dataset <https://www.openml.org/d/41214>`_ from [1]_ and compares it with a linear model fitted with the usual least squared error and a non-linear GBRT model fitted with the Poisson loss (and a log-link).
es_es: Este ejemplo ilustra el uso de la regresión logarítmica lineal de Poisson en el conjunto de datos de reclamaciones de responsabilidad civil de automóviles de Francia <https://www.openml.org/d/41214>`_ de [1]_ y lo compara con un modelo lineal ajustado con el error mínimo cuadrático habitual y un modelo no lineal GBRT ajustado con la pérdida de Poisson (y un enlace logarítmico).

source: A few definitions:
es_es: Unas cuantas definiciones:

source: A **policy** is a contract between an insurance company and an individual: the **policyholder**, that is, the vehicle driver in this case.
es_es: Una **póliza** es un contrato entre una compañía de seguros y un individuo: el **tomador del seguro**, es decir, el conductor del vehículo en este caso.

source: A **claim** is the request made by a policyholder to the insurer to compensate for a loss covered by the insurance.
es_es: Un **reclamo** es la petición que hace el asegurado a la aseguradora para que le indemnice por un siniestro cubierto por el seguro.

source: The **exposure** is the duration of the insurance coverage of a given policy, in years.
es_es: La **exposición** es la duración de la cobertura del seguro de una determinada póliza, en años.

source: The claim **frequency** is the number of claims divided by the exposure, typically measured in number of claims per year.
es_es: La **frecuencia de los siniestros** es el número de siniestros dividido por la exposición, que suele medirse en número de siniestros por año.

source: In this dataset, each sample corresponds to an insurance policy. Available features include driver age, vehicle age, vehicle power, etc.
es_es: En este conjunto de datos, cada muestra corresponde a una póliza de seguro. Las características disponibles incluyen la edad del conductor, la edad del vehículo, la potencia del vehículo, etc.

source: Our goal is to predict the expected frequency of claims following car accidents for a new policyholder given the historical data over a population of policyholders.
es_es: Nuestro objetivo es predecir la frecuencia esperada de siniestros tras un accidente de coche para un nuevo asegurado, dados los datos históricos sobre una población de asegurados.

source: A. Noll, R. Salzmann and M.V. Wuthrich, Case Study: French Motor Third-Party Liability Claims (November 8, 2018). `doi:10.2139/ssrn.3164764 <http://dx.doi.org/10.2139/ssrn.3164764>`_
es_es: A. Noll, R. Salzmann y M.V. Wuthrich, Estudio de caso: French Motor Third-Party Liability Claims (8 de noviembre de 2018). `doi:10.2139/ssrn.3164764 <http://dx.doi.org/10.2139/ssrn.3164764>`_

source: The French Motor Third-Party Liability Claims dataset
es_es: El conjunto de datos de siniestros de responsabilidad civil del automóvil en Francia

source: Let's load the motor claim dataset from OpenML: https://www.openml.org/d/41214
es_es: Carguemos el conjunto de datos de siniestros de automóviles desde OpenML: https://www.openml.org/d/41214

source: The number of claims (``ClaimNb``) is a positive integer that can be modeled as a Poisson distribution. It is then assumed to be the number of discrete events occurring with a constant rate in a given time interval (``Exposure``, in units of years).
es_es: El número de siniestros (``ClaimNb``) es un número entero positivo que puede modelarse como una distribución de Poisson. Se supone entonces que es el número de eventos discretos que ocurren con una tasa constante en un intervalo de tiempo determinado (``Exposure``, en unidades de años).

source: Here we want to model the frequency ``y = ClaimNb / Exposure`` conditionally on ``X`` via a (scaled) Poisson distribution, and use ``Exposure`` as ``sample_weight``.
es_es: Aquí queremos modelar la frecuencia ``y = ClaimNb / Exposure`` condicionada a ``X`` mediante una distribución de Poisson (escalada), y utilizar ``Exposure`` como ``sample_weight``.

source: The remaining columns can be used to predict the frequency of claim events. Those columns are very heterogeneous with a mix of categorical and numeric variables with different scales, possibly very unevenly distributed.
es_es: Las columnas restantes pueden utilizarse para predecir la frecuencia de los siniestros. Esas columnas son muy heterogéneas con una mezcla de variables categóricas y numéricas con diferentes escalas, posiblemente muy desigualmente distribuidas.

source: In order to fit linear models with those predictors it is therefore necessary to perform standard feature transformations as follows:
es_es: Por lo tanto, para ajustar los modelos lineales con esos predictores es necesario realizar las transformaciones estándar de las características, como se indica a continuación:

source: A constant prediction baseline
es_es: Una línea de base de predicción constante

source: It is worth noting that more than 93% of policyholders have zero claims. If we were to convert this problem into a binary classification task, it would be significantly imbalanced, and even a simplistic model that would only predict mean can achieve an accuracy of 93%.
es_es: Cabe destacar que más del 93% de los asegurados tienen cero siniestros. Si convirtiéramos este problema en una tarea de clasificación binaria, estaría significativamente desequilibrado, e incluso un modelo simplista que sólo predijera la media puede alcanzar una precisión del 93%.

source: To evaluate the pertinence of the used metrics, we will consider as a baseline a "dummy" estimator that constantly predicts the mean frequency of the training sample.
es_es: Para evaluar la pertinencia de las métricas utilizadas, consideraremos como línea de base un estimador "ficticio" que predice constantemente la frecuencia media de la muestra de entrenamiento.

source: Let's compute the performance of this constant prediction baseline with 3 different regression metrics:
es_es: Calculemos el rendimiento de esta línea de base de predicción constante con 3 métricas de regresión diferentes:

source: (Generalized) linear models
es_es: Modelos lineales (generalizados)

source: We start by modeling the target variable with the (l2 penalized) least squares linear regression model, more comonly known as Ridge regression. We use a low penalization `alpha`, as we expect such a linear model to under-fit on such a large dataset.
es_es: Comenzamos modelando la variable objetivo con el modelo de regresión lineal por mínimos cuadrados (l2 penalizado), más conocido como regresión Ridge. Utilizamos una penalización `alpha` baja, ya que esperamos que un modelo lineal de este tipo no se ajuste a un conjunto de datos tan grande.

source: The Poisson deviance cannot be computed on non-positive values predicted by the model. For models that do return a few non-positive predictions (e.g. :class:`~sklearn.linear_model.Ridge`) we ignore the corresponding samples, meaning that the obtained Poisson deviance is approximate. An alternative approach could be to use :class:`~sklearn.compose.TransformedTargetRegressor` meta-estimator to map ``y_pred`` to a strictly positive domain.
es_es: La desviación de Poisson no puede calcularse sobre los valores no positivos predichos por el modelo. Para los modelos que devuelven algunas predicciones no positivas (por ejemplo, :class:`~sklearn.linear_model.Ridge`) ignoramos las muestras correspondientes, lo que significa que la desviación de Poisson obtenida es aproximada. Un enfoque alternativo podría ser utilizar el metaestimador :class:`~sklearn.compose.TransformedTargetRegressor` para asignar ``y_pred`` a un dominio estrictamente positivo.

source: Next we fit the Poisson regressor on the target variable. We set the regularization strength ``alpha`` to approximately 1e-6 over number of samples (i.e. `1e-12`) in order to mimic the Ridge regressor whose L2 penalty term scales differently with the number of samples.
es_es: A continuación, ajustamos el regresor de Poisson a la variable objetivo. Fijamos la fuerza de regularización ``alpha`` a aproximadamente 1e-6 sobre el número de muestras (es decir, `1e-12`) para imitar el regresor Ridge cuyo término de penalización L2 escala de forma diferente con el número de muestras.

source: Since the Poisson regressor internally models the log of the expected target value instead of the expected value directly (log vs identity link function), the relationship between X and y is not exactly linear anymore. Therefore the Poisson regressor is called a Generalized Linear Model (GLM) rather than a vanilla linear model as is the case for Ridge regression.
es_es: Dado que el regresor de Poisson modela internamente el logaritmo del valor objetivo esperado en lugar del valor esperado directamente (función de enlace logarítmica frente a identidad), la relación entre X e y ya no es exactamente lineal. Por lo tanto, el regresor de Poisson se denomina modelo lineal generalizado (GLM) en lugar de un modelo lineal simple como es el caso de la regresión Ridge.

source: Gradient Boosting Regression Trees for Poisson regression
es_es: Árboles de regresión con potenciación de gradiente para la regresión de Poisson

source: Finally, we will consider a non-linear model, namely Gradient Boosting Regression Trees. Tree-based models do not require the categorical data to be one-hot encoded: instead, we can encode each category label with an arbitrary integer using :class:`~sklearn.preprocessing.OrdinalEncoder`. With this encoding, the trees will treat the categorical features as ordered features, which might not be always a desired behavior. However this effect is limited for deep enough trees which are able to recover the categorical nature of the features. The main advantage of the :class:`~sklearn.preprocessing.OrdinalEncoder` over the :class:`~sklearn.preprocessing.OneHotEncoder` is that it will make training faster.
es_es: Por último, consideraremos un modelo no lineal, a saber, los árboles de regresión con potenciación de gradiente. Los modelos basados en árboles no requieren que los datos categóricos estén codificados en un solo punto: en su lugar, podemos codificar cada etiqueta de categoría con un número entero arbitrario utilizando :class:`~sklearn.preprocessing.OrdinalEncoder`. Con esta codificación, los árboles tratarán las características categóricas como características ordenadas, lo que podría no ser siempre un comportamiento deseado. Sin embargo, este efecto es limitado para los árboles suficientemente profundos que son capaces de recuperar la naturaleza categórica de las características. La principal ventaja del :class:`~sklearn.preprocessing.OrdinalEncoder` sobre el :class:`~sklearn.preprocessing.OneHotEncoder` es que el entrenamiento será más rápido.

source: Gradient Boosting also gives the possibility to fit the trees with a Poisson loss (with an implicit log-link function) instead of the default least-squares loss. Here we only fit trees with the Poisson loss to keep this example concise.
es_es: La potenciación de gradiente también ofrece la posibilidad de ajustar los árboles con una pérdida de Poisson (con una función implícita de enlace logarítmico) en lugar de la pérdida por defecto por mínimos cuadrados. Aquí sólo ajustamos los árboles con la pérdida de Poisson para mantener este ejemplo conciso.

source: Like the Poisson GLM above, the gradient boosted trees model minimizes the Poisson deviance. However, because of a higher predictive power, it reaches lower values of Poisson deviance.
es_es: Al igual que el MLG de Poisson anterior, el modelo de árboles con refuerzo de gradiente minimiza la desviación de Poisson. Sin embargo, debido a un mayor poder de predicción, alcanza valores más bajos de desviación de Poisson.

source: Evaluating models with a single train / test split is prone to random fluctuations. If computing resources allow, it should be verified that cross-validated performance metrics would lead to similar conclusions.
es_es: La evaluación de modelos con una única división de entrenamiento/prueba es propensa a fluctuaciones aleatorias. Si los recursos informáticos lo permiten, habría que comprobar que las métricas de rendimiento con validación cruzada llevarían a conclusiones similares.

source: The qualitative difference between these models can also be visualized by comparing the histogram of observed target values with that of predicted values:
es_es: La diferencia cualitativa entre estos modelos también puede visualizarse comparando el histograma de los valores objetivo observados con el de los valores predichos:

source: The experimental data presents a long tail distribution for ``y``. In all models, we predict the expected frequency of a random variable, so we will have necessarily fewer extreme values than for the observed realizations of that random variable. This explains that the mode of the histograms of model predictions doesn't necessarily correspond to the smallest value. Additionally, the normal distribution used in ``Ridge`` has a constant variance, while for the Poisson distribution used in ``PoissonRegressor`` and ``HistGradientBoostingRegressor``, the variance is proportional to the predicted expected value.
es_es: Los datos experimentales presentan una distribución de cola larga para ``y``. En todos los modelos, predecimos la frecuencia esperada de una variable aleatoria, por lo que tendremos necesariamente menos valores extremos que para las realizaciones observadas de esa variable aleatoria. Esto explica que la moda de los histogramas de las predicciones del modelo no corresponda necesariamente al valor más pequeño. Además, la distribución normal utilizada en ``Ridge`` tiene una varianza constante, mientras que para la distribución Poisson utilizada en ``PoissonRegressor`` y ``HistGradientBoostingRegressor``, la varianza es proporcional al valor esperado predicho.

source: Thus, among the considered estimators, ``PoissonRegressor`` and ``HistGradientBoostingRegressor`` are a-priori better suited for modeling the long tail distribution of the non-negative data as compared to the ``Ridge`` model which makes a wrong assumption on the distribution of the target variable.
es_es: Por lo tanto, entre los estimadores considerados, ``PoissonRegressor`` y ``HistGradientBoostingRegressor`` son a priori más adecuadas para modelar la distribución de la cola larga de los datos no negativos en comparación con el modelo ``Ridge`` que hace una suposición errónea sobre la distribución de la variable objetivo.

source: The ``HistGradientBoostingRegressor`` estimator has the most flexibility and is able to predict higher expected values.
es_es: El estimador ``HistGradientBoostingRegressor`` es el más flexible y puede predecir valores esperados más altos.

source: Note that we could have used the least squares loss for the ``HistGradientBoostingRegressor`` model. This would wrongly assume a normal distributed response variable as does the `Ridge` model, and possibly also lead to slightly negative predictions. However the gradient boosted trees would still perform relatively well and in particular better than ``PoissonRegressor`` thanks to the flexibility of the trees combined with the large number of training samples.
es_es: Ten en cuenta que podríamos haber utilizado la pérdida de mínimos cuadrados para el modelo ``HistGradientBoostingRegressor``. Esto supondría erróneamente una variable de respuesta de distribución normal, como hace el modelo `Ridge`, y posiblemente también llevaría a predicciones ligeramente negativas. Sin embargo, los árboles con potenciación de gradiente seguirían funcionando relativamente bien y, en particular, mejor que ``PoissonRegressor`` gracias a la flexibilidad de los árboles combinada con el gran número de muestras de entrenamiento.

source: Evaluation of the calibration of predictions
es_es: Evaluación de la calibración de las predicciones

source: To ensure that estimators yield reasonable predictions for different policyholder types, we can bin test samples according to ``y_pred`` returned by each model. Then for each bin, we compare the mean predicted ``y_pred``, with the mean observed target:
es_es: Para garantizar que los estimadores ofrezcan predicciones razonables para los distintos tipos de asegurados, podemos clasificar las muestras de prueba en función de ``y_pred`` devuelta por cada modelo. Luego, para cada intervalo, comparamos la media de las predicciones de ``y_pred`` con la media del objetivo observado:

source: The dummy regression model predicts a constant frequency. This model does not attribute the same tied rank to all samples but is none-the-less globally well calibrated (to estimate the mean frequency of the entire population).
es_es: El modelo de regresión dummy predice una frecuencia constante. Este modelo no atribuye el mismo rango ligado a todas las muestras, pero está sin embargo globalmente bien calibrado (para estimar la frecuencia media de toda la población).

source: The ``Ridge`` regression model can predict very low expected frequencies that do not match the data. It can therefore severly under-estimate the risk for some policyholders.
es_es: El modelo de regresión "Ridge" puede predecir frecuencias esperadas muy bajas que no se correspondan a los datos. Por tanto, puede subestimar gravemente el riesgo de algunos asegurados.

source: ``PoissonRegressor`` and ``HistGradientBoostingRegressor`` show better consistency between predicted and observed targets, especially for low predicted target values.
es_es: El ``PoissonRegressor`` y el ``HistGradientBoostingRegressor`` muestran una mejor consistencia entre los objetivos predichos y los observados, especialmente para los valores bajos de los objetivos predichos.

source: The sum of all predictions also confirms the calibration issue of the ``Ridge`` model: it under-estimates by more than 3% the total number of claims in the test set while the other three models can approximately recover the total number of claims of the test portfolio.
es_es: La suma de todas las predicciones también confirma el problema de calibración del modelo ``Ridge``: subestima en más de un 3% el número total de siniestros del conjunto de pruebas, mientras que los otros tres modelos pueden recuperar aproximadamente el número total de siniestros de la cartera de pruebas.

source: Evaluation of the ranking power
es_es: Evaluación del poder de clasificación

source: For some business applications, we are interested in the ability of the model to rank the riskiest from the safest policyholders, irrespective of the absolute value of the prediction. In this case, the model evaluation would cast the problem as a ranking problem rather than a regression problem.
es_es: Para algunas aplicaciones empresariales, nos interesa la capacidad del modelo para clasificar a los asegurados más arriesgados de los más seguros, independientemente del valor absoluto de la predicción. En este caso, la evaluación del modelo convertiría el problema en un problema de clasificación en lugar de un problema de regresión.

source: To compare the 3 models from this perspective, one can plot the cumulative proportion of claims vs the cumulative proportion of exposure for the test samples order by the model predictions, from safest to riskiest according to each model.
es_es: Para comparar los 3 modelos desde esta perspectiva, se puede trazar la proporción acumulativa de siniestros frente a la proporción acumulativa de exposición para las muestras de prueba ordenadas por las predicciones del modelo, de la más segura a la más arriesgada según cada modelo.

source: This plot is called a Lorenz curve and can be summarized by the Gini index:
es_es: Este gráfico se denomina curva de Lorenz y puede resumirse con el índice de Gini:

source: As expected, the dummy regressor is unable to correctly rank the samples and therefore performs the worst on this plot.
es_es: Como era de esperar, el regresor ficticio es incapaz de clasificar correctamente las muestras y, por tanto, es el que peor funciona en este gráfico.

source: The tree-based model is significantly better at ranking policyholders by risk while the two linear models perform similarly.
es_es: El modelo basado en el árbol es significativamente mejor a la hora de clasificar a los asegurados por riesgo, mientras que los dos modelos lineales tienen un rendimiento similar.

source: All three models are significantly better than chance but also very far from making perfect predictions.
es_es: Los tres modelos son significativamente mejores que el azar, pero también están muy lejos de hacer predicciones perfectas.

source: This last point is expected due to the nature of the problem: the occurrence of accidents is mostly dominated by circumstantial causes that are not captured in the columns of the dataset and can indeed be considered as purely random.
es_es: Este último punto es esperable debido a la naturaleza del problema: la ocurrencia de accidentes está dominada en su mayoría por causas circunstanciales que no se recogen en las columnas del conjunto de datos y que, de hecho, pueden considerarse puramente aleatorias.

source: The linear models assume no interactions between the input variables which likely causes under-fitting. Inserting a polynomial feature extractor (:func:`~sklearn.preprocessing.PolynomialFeatures`) indeed increases their discrimative power by 2 points of Gini index. In particular it improves the ability of the models to identify the top 5% riskiest profiles.
es_es: Los modelos lineales asumen que no hay interacciones entre las variables de entrada, lo que probablemente provoca un ajuste insuficiente. La inserción de un extractor de características polinómicas (:func:`~sklearn.preprocessing.PolynomialFeatures`) aumenta efectivamente su poder de discriminación en 2 puntos del índice de Gini. En particular, mejora la capacidad de los modelos para identificar el 5% de los perfiles.

source: Main takeaways
es_es: Principales conclusiones

source: The performance of the models can be evaluated by their ability to yield well-calibrated predictions and a good ranking.
es_es: El rendimiento de los modelos puede evaluarse por su capacidad de producir predicciones bien calibradas y una buena clasificación.

source: The calibration of the model can be assessed by plotting the mean observed value vs the mean predicted value on groups of test samples binned by predicted risk.
es_es: La calibración del modelo puede evaluarse graficando el valor medio observado frente al valor medio previsto en grupos de muestras de prueba clasificados por riesgo previsto.
