Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_nnls.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_nnls.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_nnls.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Non-negative least squares
es_es: Mínimos cuadrados no negativos

source: In this example, we fit a linear model with positive constraints on the regression coefficients and compare the estimated coefficients to a classic linear regression.
es_es: En este ejemplo, ajustamos un modelo lineal con restricciones positivas en los coeficientes de regresión y comparamos los coeficientes estimados con una regresión lineal clásica.

source: Generate some random data
es_es: Generar algunos datos aleatorios

source: Split the data in train set and test set
es_es: Dividir los datos en conjunto de entrenamiento y conjunto de prueba

source: Fit the Non-Negative least squares.
es_es: Ajustar los mínimos cuadrados no negativos.

source: Fit an OLS.
es_es: Ajustar un OLS.

source: Comparing the regression coefficients between OLS and NNLS, we can observe they are highly correlated (the dashed line is the identity relation), but the non-negative constraint shrinks some to 0. The Non-Negative Least squares inherently yield sparse results.
es_es: Comparando los coeficientes de regresión entre OLS y NNLS, podemos observar que están muy correlacionados (la línea discontinua es la relación de identidad), pero la restricción no negativa reduce algunos a 0. Los mínimos cuadrados no negativos producen intrínsecamente resultados dispersos.

source: **Total running time of the script:** ( 0 minutes 0.153 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 0.153 segundos)

source: :download:`Download Python source code: plot_nnls.py <plot_nnls.py>`
es_es: :download:`Descargar el código fuente de Python: plot_nnls.py <plot_nnls.py>`

source: :download:`Download Jupyter notebook: plot_nnls.ipynb <plot_nnls.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_nnls.ipynb <plot_nnls.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
