Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_ard.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_ard.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_ard.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Automatic Relevance Determination Regression (ARD)
es_es: Regresión automática de determinación de la relevancia (ARD)

source: Fit regression model with Bayesian Ridge Regression.
es_es: Ajustar el modelo de regresión con la Regresión Bayesiana Ridge.

source: See :ref:`bayesian_ridge_regression` for more information on the regressor.
es_es: Consulta :ref:`bayesian_ridge_regression` para más información sobre el regresor.

source: Compared to the OLS (ordinary least squares) estimator, the coefficient weights are slightly shifted toward zeros, which stabilises them.
es_es: En comparación con el estimador OLS (mínimos cuadrados ordinarios), las ponderaciones de los coeficientes están ligeramente desplazadas hacia los ceros, lo que las estabiliza.

source: The histogram of the estimated weights is very peaked, as a sparsity-inducing prior is implied on the weights.
es_es: El histograma de las ponderaciones estimadas es muy puntiagudo, ya que está implícito un a priori que induce a la dispersión en las ponderaciones.

source: The estimation of the model is done by iteratively maximizing the marginal log-likelihood of the observations.
es_es: La estimación del modelo se realiza maximizando iterativamente el logaritmo de la verosimilitud marginal de las observaciones.

source: We also plot predictions and uncertainties for ARD for one dimensional regression using polynomial feature expansion. Note the uncertainty starts going up on the right side of the plot. This is because these test samples are outside of the range of the training samples.
es_es: También trazamos las predicciones e incertidumbres de ARD para la regresión unidimensional utilizando la expansión de características polinómicas. Obsérvese que la incertidumbre empieza a subir en el lado derecho del gráfico. Esto se debe a que estas muestras de prueba están fuera del rango de las muestras de entrenamiento.

source: **Total running time of the script:** ( 0 minutes 1.669 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.669 segundos)

source: :download:`Download Python source code: plot_ard.py <plot_ard.py>`
es_es: :download:`Descargar el código fuente de Python: plot_ard.py <plot_ard.py>`

source: :download:`Download Jupyter notebook: plot_ard.ipynb <plot_ard.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_ard.ipynb <plot_ard.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
