Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_bayesian_ridge.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_bayesian_ridge.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_bayesian_ridge.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Bayesian Ridge Regression
es_es: Regresión Bayesiana de Cresta

source: Computes a Bayesian Ridge Regression on a synthetic dataset.
es_es: Calcula una Regresión Bayesiana en un conjunto de datos sintéticos.

source: See :ref:`bayesian_ridge_regression` for more information on the regressor.
es_es: Consulta :ref:`bayesian_ridge_regression` para más información sobre el regresor.

source: Compared to the OLS (ordinary least squares) estimator, the coefficient weights are slightly shifted toward zeros, which stabilises them.
es_es: En comparación con el estimador OLS (mínimos cuadrados ordinarios), las ponderaciones de los coeficientes están ligeramente desplazadas hacia los ceros, lo que las estabiliza.

source: As the prior on the weights is a Gaussian prior, the histogram of the estimated weights is Gaussian.
es_es: Como la distribución a priori sobre las ponderaciones es una a priori gaussiana, el histograma de las ponderaciones estimadas es gaussiano.

source: The estimation of the model is done by iteratively maximizing the marginal log-likelihood of the observations.
es_es: La estimación del modelo se realiza maximizando iterativamente el logaritmo de verosimilitud marginal de las observaciones.

source: We also plot predictions and uncertainties for Bayesian Ridge Regression for one dimensional regression using polynomial feature expansion. Note the uncertainty starts going up on the right side of the plot. This is because these test samples are outside of the range of the training samples.
es_es: También graficamos las predicciones e incertidumbres para la Regresión Bayesiana Ridge para una regresión unidimensional usando la expansión de características polinomiales. Obsérvese que la incertidumbre empieza a subir en el lado derecho del gráfico. Esto se debe a que estas muestras de prueba están fuera del rango de las muestras de entrenamiento.

source: **Total running time of the script:** ( 0 minutes 1.307 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 1.307 segundos)

source: :download:`Download Python source code: plot_bayesian_ridge.py <plot_bayesian_ridge.py>`
es_es: :download:`Descargar el código fuente de Python: plot_bayesian_ridge.py <plot_bayesian_ridge.py>`

source: :download:`Download Jupyter notebook: plot_bayesian_ridge.ipynb <plot_bayesian_ridge.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_bayesian_ridge.ipynb <plot_bayesian_ridge.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
