Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_ridge_coeffs.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_ridge_coeffs.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_ridge_coeffs.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot Ridge coefficients as a function of the L2 regularization
es_es: Graficar los coeficientes Ridge en función de la regularización L2

source: :class:`Ridge` Regression is the estimator used in this example. Each color in the left plot represents one different dimension of the coefficient vector, and this is displayed as a function of the regularization parameter. The right plot shows how exact the solution is. This example illustrates how a well defined solution is found by Ridge regression and how regularization affects the coefficients and their values. The plot on the right shows how the difference of the coefficients from the estimator changes as a function of regularization.
es_es: :class:`Ridge` Regresión es el estimador utilizado en este ejemplo. Cada color en el gráfico de la izquierda representa una dimensión diferente del vector de coeficientes, y esto se muestra como una función del parámetro de regularización. El gráfico de la derecha muestra la exactitud de la solución. Este ejemplo ilustra cómo se encuentra una solución bien definida mediante la regresión Ridge y cómo la regularización afecta a los coeficientes y sus valores. El gráfico de la derecha muestra cómo cambia la diferencia de los coeficientes del estimador en función de la regularización.

source: In this example the dependent variable Y is set as a function of the input features: y = X*w + c. The coefficient vector w is randomly sampled from a normal distribution, whereas the bias term c is set to a constant.
es_es: En este ejemplo, la variable dependiente Y se establece como una función de las características de entrada: y = X*w + c. El vector de coeficientes w se extrae aleatoriamente de una distribución normal, mientras que el término de sesgo c se establece como una constante.

source: As alpha tends toward zero the coefficients found by Ridge regression stabilize towards the randomly sampled vector w. For big alpha (strong regularisation) the coefficients are smaller (eventually converging at 0) leading to a simpler and biased solution. These dependencies can be observed on the left plot.
es_es: A medida que alfa tiende a cero, los coeficientes encontrados por la regresión de Ridge se estabilizan hacia el vector w muestreado aleatoriamente. Para alfa grande (regularización fuerte) los coeficientes son más pequeños (eventualmente convergen a 0) lo que lleva a una solución más simple y sesgada. Estas dependencias pueden observarse en el gráfico de la izquierda.

source: The right plot shows the mean squared error between the coefficients found by the model and the chosen vector w. Less regularised models retrieve the exact coefficients (error is equal to 0), stronger regularised models increase the error.
es_es: El gráfico de la derecha muestra el error cuadrático medio entre los coeficientes encontrados por el modelo y el vector w elegido. Los modelos menos regularizados recuperan los coeficientes exactos (el error es igual a 0), los modelos más regularizados aumentan el error.

source: Please note that in this example the data is non-noisy, hence it is possible to extract the exact coefficients.
es_es: Tenga en cuenta que en este ejemplo los datos no tienen ruido, por lo que es posible extraer los coeficientes exactos.

source: **Total running time of the script:** ( 0 minutes 0.431 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.431 segundos)

source: :download:`Download Python source code: plot_ridge_coeffs.py <plot_ridge_coeffs.py>`
es_es: :download:`Descargar el código fuente de Python: plot_ridge_coeffs.py <plot_ridge_coeffs.py>`

source: :download:`Download Jupyter notebook: plot_ridge_coeffs.ipynb <plot_ridge_coeffs.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_ridge_coeffs.ipynb <plot_ridge_coeffs.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
