Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_theilsen.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_theilsen.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haga clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_theilsen.py>` para descargar el código completo del ejemplo o para ejecutar este ejemplo en su navegador a través de Binder

source: Theil-Sen Regression
es_es: Regresión de Theil-Sen

source: Computes a Theil-Sen Regression on a synthetic dataset.
es_es: Calcula una regresión de Theil-Sen en un conjunto de datos sintéticos.

source: See :ref:`theil_sen_regression` for more information on the regressor.
es_es: Ver :ref:`theil_sen_regression` para más información sobre el regresor.

source: Compared to the OLS (ordinary least squares) estimator, the Theil-Sen estimator is robust against outliers. It has a breakdown point of about 29.3% in case of a simple linear regression which means that it can tolerate arbitrary corrupted data (outliers) of up to 29.3% in the two-dimensional case.
es_es: En comparación con el estimador OLS (mínimos cuadrados ordinarios), el estimador Theil-Sen es robusto frente a los valores atípicos. Tiene un punto de ruptura de aproximadamente el 29,3% en el caso de una regresión lineal simple, lo que significa que puede tolerar datos corruptos arbitrarios (valores atípicos) de hasta el 29,3% en el caso bidimensional.

source: The estimation of the model is done by calculating the slopes and intercepts of a subpopulation of all possible combinations of p subsample points. If an intercept is fitted, p must be greater than or equal to n_features + 1. The final slope and intercept is then defined as the spatial median of these slopes and intercepts.
es_es: La estimación del modelo se realiza calculando las pendientes y los interceptos de una subpoblación de todas las combinaciones posibles de p puntos de submuestra. Si se ajusta un intercepto, p debe ser mayor o igual que n_features + 1. La pendiente y el intercepto finales se definen entonces como la mediana espacial de estas pendientes e interceptos.

source: In certain cases Theil-Sen performs better than :ref:`RANSAC <ransac_regression>` which is also a robust method. This is illustrated in the second example below where outliers with respect to the x-axis perturb RANSAC. Tuning the ``residual_threshold`` parameter of RANSAC remedies this but in general a priori knowledge about the data and the nature of the outliers is needed. Due to the computational complexity of Theil-Sen it is recommended to use it only for small problems in terms of number of samples and features. For larger problems the ``max_subpopulation`` parameter restricts the magnitude of all possible combinations of p subsample points to a randomly chosen subset and therefore also limits the runtime. Therefore, Theil-Sen is applicable to larger problems with the drawback of losing some of its mathematical properties since it then works on a random subset.
es_es: En algunos casos, Theil-Sen funciona mejor que :ref:`RANSAC <ransac_regression>`, que también es un método robusto. Esto se ilustra en el segundo ejemplo siguiente, en el que los valores atípicos con respecto al eje x perturban a RANSAC. El ajuste del parámetro ``residual_threshold`` de RANSAC lo remedia, pero en general se necesita un conocimiento a priori sobre los datos y la naturaleza de los valores atípicos. Debido a la complejidad computacional de Theil-Sen, se recomienda utilizarlo sólo para problemas pequeños en términos de número de muestras y características. Para problemas más grandes, el parámetro ``max_subpopulation`` restringe la magnitud de todas las combinaciones posibles de p puntos de submuestra a un subconjunto elegido al azar y, por tanto, también limita el tiempo de ejecución. Por lo tanto, Theil-Sen es aplicable a problemas más grandes con el inconveniente de perder algunas de sus propiedades matemáticas, ya que entonces trabaja sobre un subconjunto aleatorio.

source: **Total running time of the script:** ( 0 minutes 0.760 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.760 segundos)

source: :download:`Download Python source code: plot_theilsen.py <plot_theilsen.py>`
es_es: :download:`Descargar código fuente de Python: plot_theilsen.py <plot_theilsen.py>`

source: :download:`Download Jupyter notebook: plot_theilsen.ipynb <plot_theilsen.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_theilsen.ipynb <plot_theilsen.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
