Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_bayesian_ridge_curvefit.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_bayesian_ridge_curvefit.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_bayesian_ridge_curvefit.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Curve Fitting with Bayesian Ridge Regression
es_es: Ajuste de curvas con regresión Bayesiana Ridge

source: Computes a Bayesian Ridge Regression of Sinusoids.
es_es: Calcula una regresión Bayesiana Ridge de Sinusoides.

source: See :ref:`bayesian_ridge_regression` for more information on the regressor.
es_es: Consulta :ref:`bayesian_ridge_regression` para más información sobre el regresor.

source: In general, when fitting a curve with a polynomial by Bayesian ridge regression, the selection of initial values of the regularization parameters (alpha, lambda) may be important. This is because the regularization parameters are determined by an iterative procedure that depends on initial values.
es_es: En general, cuando se ajusta una curva con un polinomio mediante la regresión de cresta bayesiana, la selección de los valores iniciales de los parámetros de regularización (alfa, lambda) puede ser importante. Esto se debe a que los parámetros de regularización se determinan mediante un procedimiento iterativo que depende de los valores iniciales.

source: In this example, the sinusoid is approximated by a polynomial using different pairs of initial values.
es_es: En este ejemplo, la sinusoide se aproxima mediante un polinomio utilizando diferentes pares de valores iniciales.

source: When starting from the default values (alpha_init = 1.90, lambda_init = 1.), the bias of the resulting curve is large, and the variance is small. So, lambda_init should be relatively small (1.e-3) so as to reduce the bias.
es_es: Cuando se parte de los valores por defecto (alpha_init = 1.90, lambda_init = 1.), el sesgo de la curva resultante es grande, y la varianza es pequeña. Por lo tanto, lambda_init debe ser relativamente pequeña (1.e-3) para reducir el sesgo.

source: Also, by evaluating log marginal likelihood (L) of these models, we can determine which one is better. It can be concluded that the model with larger L is more likely.
es_es: Además, evaluando la verosimilitud marginal logarítmica (L) de estos modelos, podemos determinar cuál es mejor. Se puede concluir que el modelo con mayor L es más probable.

source: **Total running time of the script:** ( 0 minutes 0.429 seconds)
es_es: **Tiempo total de ejecución del script:** ( 0 minutos 0.429 segundos)

source: :download:`Download Python source code: plot_bayesian_ridge_curvefit.py <plot_bayesian_ridge_curvefit.py>`
es_es: :download:`Descargar el código fuente de Python: plot_bayesian_ridge_curvefit.py <plot_bayesian_ridge_curvefit.py>`

source: :download:`Download Jupyter notebook: plot_bayesian_ridge_curvefit.ipynb <plot_bayesian_ridge_curvefit.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_bayesian_ridge_curvefit.ipynb <plot_bayesian_ridge_curvefit.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
