Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/linear_model/plot_robust_fit.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_linear_model_plot_robust_fit.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic en :ref:`aquí <sphx_glr_download_auto_examples_linear_model_plot_robust_fit.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Robust linear estimator fitting
es_es: Ajuste del estimador lineal robusto

source: Here a sine function is fit with a polynomial of order 3, for values close to zero.
es_es: Aquí se ajusta una función seno con un polinomio de orden 3, para valores cercanos a cero.

source: Robust fitting is demoed in different situations:
es_es: El ajuste robusto se demuestra en diferentes situaciones:

source: No measurement errors, only modelling errors (fitting a sine with a polynomial)
es_es: No hay errores de medición, sólo de modelización (ajuste de un seno con un polinomio)

source: Measurement errors in X
es_es: Errores de medición en X

source: Measurement errors in y
es_es: Errores de medición en y

source: The median absolute deviation to non corrupt new data is used to judge the quality of the prediction.
es_es: La desviación absoluta media respecto a los nuevos datos no corruptos se utiliza para juzgar la calidad de la predicción.

source: What we can see that:
es_es: Lo que podemos ver que:

source: RANSAC is good for strong outliers in the y direction
es_es: RANSAC es bueno para los valores atípicos fuertes en la dirección y

source: TheilSen is good for small outliers, both in direction X and y, but has a break point above which it performs worse than OLS.
es_es: TheilSen es bueno para los valores atípicos pequeños, tanto en la dirección X como en la y, pero tiene un punto de ruptura por encima del cual funciona peor que OLS.

source: The scores of HuberRegressor may not be compared directly to both TheilSen and RANSAC because it does not attempt to completely filter the outliers but lessen their effect.
es_es: Las puntuaciones de HuberRegressor no pueden compararse directamente con las de TheilSen y RANSAC porque no intenta filtrar completamente los valores atípicos, sino disminuir su efecto.

source: **Total running time of the script:** ( 0 minutes 3.470 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 3.470 segundos)

source: :download:`Download Python source code: plot_robust_fit.py <plot_robust_fit.py>`
es_es: :download:`Descargar el código fuente de Python: plot_robust_fit.py <plot_robust_fit.py>`

source: :download:`Download Jupyter notebook: plot_robust_fit.ipynb <plot_robust_fit.ipynb>`
es_es: :download:`Descarga el cuaderno de Jupyter: plot_robust_fit.ipynb <plot_robust_fit.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
