Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/tree/plot_unveil_tree_structure.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_tree_plot_unveil_tree_structure.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_tree_plot_unveil_tree_structure.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Understanding the decision tree structure
es_es: Comprensión de la estructura del árbol de decisiones

source: The decision tree structure can be analysed to gain further insight on the relation between the features and the target to predict. In this example, we show how to retrieve:
es_es: La estructura del árbol de decisiones se puede analizar para obtener más información sobre la relación entre las características y el objetivo a predecir. En este ejemplo, mostramos cómo recuperar:

source: the binary tree structure;
es_es: la estructura del árbol binario;

source: the depth of each node and whether or not it's a leaf;
es_es: la profundidad de cada nodo y si es o no una hoja;

source: the nodes that were reached by a sample using the ``decision_path`` method;
es_es: los nodos que fueron alcanzados por una muestra utilizando el método ``decision_path``;

source: the leaf that was reached by a sample using the apply method;
es_es: la hoja que fue alcanzada por una muestra utilizando el método aplicar;

source: the rules that were used to predict a sample;
es_es: las reglas que se utilizaron para predecir una muestra;

source: the decision path shared by a group of samples.
es_es: la ruta de decisión compartida por un grupo de muestras.

source: Train tree classifier
es_es: Entrenamiento el clasificador de árbol

source: First, we fit a :class:`~sklearn.tree.DecisionTreeClassifier` using the :func:`~sklearn.datasets.load_iris` dataset.
es_es: Primero, nos ajustamos a un :class:`~sklearn.tree.DecisionTreeClassifier` usando el conjunto de datos de :func:`~sklearn.datasets.load_iris`.

source: Tree structure
es_es: Estructura de árbol

source: The decision classifier has an attribute called ``tree_`` which allows access to low level attributes such as ``node_count``, the total number of nodes, and ``max_depth``, the maximal depth of the tree. It also stores the entire binary tree structure, represented as a number of parallel arrays. The i-th element of each array holds information about the node ``i``. Node 0 is the tree's root. Some of the arrays only apply to either leaves or split nodes. In this case the values of the nodes of the other type is arbitrary. For example, the arrays ``feature`` and ``threshold`` only apply to split nodes. The values for leaf nodes in these arrays are therefore arbitrary.
es_es: El clasificador de decisiones tiene un atributo llamado ``tree_`` que permite acceder a atributos de bajo nivel como ``node_count``, el número total de nodos, y ``max_depth``, la profundidad máxima del árbol. También almacena toda la estructura binaria del árbol, representada como un número de matrices paralelas. El elemento i-ésimo de cada matriz contiene información sobre el nodo ``i``. El nodo 0 es la raíz del árbol. Algunas de los arreglos sólo se aplican a las hojas o a los nodos divididos. En este caso, los valores de los nodos del otro tipo son arbitrarios. Por ejemplo, los arreglos ``feature`` y ``threshold`` sólo se aplican a los nodos divididos. Por lo tanto, los valores de los nodos hoja en estos arreglos son arbitrarios.

source: Among these arrays, we have:
es_es: Entre estos arreglos tenemos:

source: ``children_left[i]``: id of the left child of node ``i`` or -1 if leaf node
es_es: ``children_left[i]``: id del hijo izquierdo del nodo ``i`` o -1 si hoja de nodo

source: ``children_right[i]``: id of the right child of node ``i`` or -1 if leaf node
es_es: ``children_right[i]``: id del hijo derecho del nodo ``i`` o -1 si hoja de nodo

source: ``feature[i]``: feature used for splitting node ``i``
es_es: ``feature[i]``: característica usada para dividir el nodo ``i``

source: ``threshold[i]``: threshold value at node ``i``
es_es: ``threshold[i]``: valor de umbral en el nodo ``i``

source: ``n_node_samples[i]``: the number of of training samples reaching node ``i``
es_es: ``n_node_samples[i]``: el número de muestras de entrenamiento llegando al nodo ``i``

source: ``impurity[i]``: the impurity at node ``i``
es_es: ``impurity[i]``: la impureza en el nodo ``i``

source: Using the arrays, we can traverse the tree structure to compute various properties. Below, we will compute the depth of each node and whether or not it is a leaf.
es_es: Usando los arreglos, podemos atravesar la estructura del árbol para calcular varias propiedades. A continuación, calcularemos la profundidad de cada nodo y si es o no una hoja.

source: We can compare the above output to the plot of the decision tree.
es_es: Podemos comparar la salida anterior con la trama del árbol de decisiones.

source: Decision path
es_es: Ruta de decisión

source: We can also retrieve the decision path of samples of interest. The ``decision_path`` method outputs an indicator matrix that allows us to retrieve the nodes the samples of interest traverse through. A non zero element in the indicator matrix at position ``(i, j)`` indicates that the sample ``i`` goes through the node ``j``. Or, for one sample ``i``, the positions of the non zero elements in row ``i`` of the indicator matrix designate the ids of the nodes that sample goes through.
es_es: También podemos recuperar la vía de decisión de las muestras de interés. El método ``decision_path`` produce una matriz de indicador que nos permite recuperar las muestras de interés a través de los nodos. Un elemento no cero en la matriz del indicador en la posición ``(i, j)`` indica que la muestra ``i`` pasa por el nodo ``j``. O, para una muestra ``i``, las posiciones de los elementos no cero en la fila ``i`` de la matriz indicadora designan los ids de los nodos a través de los cuales se pasa la muestra.

source: The leaf ids reached by samples of interest can be obtained with the ``apply`` method. This returns an array of the node ids of the leaves reached by each sample of interest. Using the leaf ids and the ``decision_path`` we can obtain the splitting conditions that were used to predict a sample or a group of samples. First, let's do it for one sample. Note that ``node_index`` is a sparse matrix.
es_es: Las hojas alcanzadas por muestras de interés pueden obtenerse con el método ``apply``. Esto devuelve un arreglo de los identificadores de nodos de las hojas alcanzadas por cada muestra de interés. Usando los ids de la hoja y el ``decision_path`` podemos obtener las condiciones de división que se usaron para predecir una muestra o un grupo de muestras. Primero, hagámoslo por una muestra. Ten en cuenta que ``node_index`` es una matriz dispersa.

source: For a group of samples, we can determine the common nodes the samples go through.
es_es: Para un grupo de muestras, podemos determinar los nodos comunes por los que las muestras van a través.

source: **Total running time of the script:** ( 0 minutes 0.135 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.135 segundos)

source: :download:`Download Python source code: plot_unveil_tree_structure.py <plot_unveil_tree_structure.py>`
es_es: :download:`Descargar el código fuente de Python: plot_unveil_tree_structure.py <plot_unveil_tree_structure.py>`

source: :download:`Download Jupyter notebook: plot_unveil_tree_structure.ipynb <plot_unveil_tree_structure.ipynb>`
es_es: :download:`Descargar cuaderno de Jupyter: plot_unveil_tree_structure.ipynb <plot_unveil_tree_structure.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
