Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/tree/plot_iris_dtc.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_tree_plot_iris_dtc.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_tree_plot_iris_dtc.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot the decision surface of a decision tree on the iris dataset
es_es: Trazar la superficie de decisión de un árbol de decisiones en el conjunto de datos iris

source: Plot the decision surface of a decision tree trained on pairs of features of the iris dataset.
es_es: Trazar la superficie de decisión de un árbol de decisión entrenado en pares de características del conjunto de datos del iris.

source: See :ref:`decision tree <tree>` for more information on the estimator.
es_es: Ver :ref:`árbol de decisiones <tree>` para más información sobre el estimador.

source: For each pair of iris features, the decision tree learns decision boundaries made of combinations of simple thresholding rules inferred from the training samples.
es_es: Para cada par de características de iris, el árbol de decisión aprende límites de decisión hechos de combinaciones de reglas de retención simples inferiores de las muestras de entrenamiento.

source: We also show the tree structure of a model built on all of the features.
es_es: También mostramos la estructura del árbol de un modelo construido sobre todas las características.

source: **Total running time of the script:** ( 0 minutes 1.569 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 1.569 segundos)

source: :download:`Download Python source code: plot_iris_dtc.py <plot_iris_dtc.py>`
es_es: :download:`Descarga el código fuente de Python: plot_iris_dtc.py <plot_iris_dtc.py>`

source: :download:`Download Jupyter notebook: plot_iris_dtc.ipynb <plot_iris_dtc.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_iris_dtc.ipynb <plot_iris_dtc.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
