Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/computing/computational_performance.po
Languages: es_es

source: More information can be found on the `Scipy install page <https://docs.scipy.org/doc/numpy/user/install.html>`_ and in this `blog post <http://danielnouri.org/notes/2012/12/19/libblas-and-liblapack-issues-and-speed,-with-scipy-and-ubuntu/>`_ from Daniel Nouri which has some nice step by step install instructions for Debian / Ubuntu.
es_es: Se puede encontrar más información en la página de instalación de `Scipy <https://docs.scipy.org/doc/numpy/user/install.html>`_ y en este `blog post <http://danielnouri.org/notes/2012/12/19/libblas-and-liblapack-issues-and-speed,-with-scipy-and-ubuntu/>`_ de Daniel Nouri que tiene algunas buenas instrucciones de instalación paso a paso para Debian / Ubuntu.

source: Limiting Working Memory
es_es: Limitación de la memoria de trabajo

source: Some calculations when implemented using standard numpy vectorized operations involve using a large amount of temporary memory. This may potentially exhaust system memory. Where computations can be performed in fixed-memory chunks, we attempt to do so, and allow the user to hint at the maximum size of this working memory (defaulting to 1GB) using :func:`set_config` or :func:`config_context`. The following suggests to limit temporary working memory to 128 MiB::
es_es: Algunos cálculos cuando se implementan utilizando operaciones vectoriales estándar de numpy implican el uso de una gran cantidad de memoria temporal. Esto puede potencialmente agotar la memoria del sistema. Cuando los cálculos pueden realizarse en trozos de memoria fija, intentamos hacerlo, y permitimos al usuario indicar el tamaño máximo de esta memoria de trabajo (por defecto 1GB) usando :func:`set_config` o :func:`config_context`. Lo siguiente sugiere limitar la memoria de trabajo temporal a 128 MiB::

source: An example of a chunked operation adhering to this setting is :func:`~metrics.pairwise_distances_chunked`, which facilitates computing row-wise reductions of a pairwise distance matrix.
es_es: Un ejemplo de operación fragmentada que se adhiere a esta configuración es :func:`~metrics.pairwise_distances_chunked`, que facilita el cálculo de las reducciones por filas de una matriz de distancia por pares.

source: Model Compression
es_es: Modelo de compresión

source: Model compression in scikit-learn only concerns linear models for the moment. In this context it means that we want to control the model sparsity (i.e. the number of non-zero coordinates in the model vectors). It is generally a good idea to combine model sparsity with sparse input data representation.
es_es: La compresión de modelos en scikit-learn sólo se refiere a los modelos lineales por el momento. En este contexto, significa que queremos controlar la dispersión del modelo (es decir, el número de coordenadas no nulas en los vectores del modelo). Por lo general, es una buena idea combinar la dispersión del modelo con la representación de datos de entrada dispersos.

source: Here is sample code that illustrates the use of the ``sparsify()`` method::
es_es: Este es un ejemplo de código que ilustra el uso del método ``sparsify()``::

source: In this example we prefer the ``elasticnet`` penalty as it is often a good compromise between model compactness and prediction power. One can also further tune the ``l1_ratio`` parameter (in combination with the regularization strength ``alpha``) to control this tradeoff.
es_es: En este ejemplo preferimos la penalización ``elasticnet`` ya que suele ser un buen compromiso entre la compacidad del modelo y la potencia de predicción. También se puede ajustar el parámetro ``l1_ratio`` (en combinación con la fuerza de regularización ``alpha``) para controlar este compromiso.

source: A typical `benchmark <https://github.com/scikit-learn/scikit-learn/blob/main/benchmarks/bench_sparsify.py>`_ on synthetic data yields a >30% decrease in latency when both the model and input are sparse (with 0.000024 and 0.027400 non-zero coefficients ratio respectively). Your mileage may vary depending on the sparsity and size of your data and model. Furthermore, sparsifying can be very useful to reduce the memory usage of predictive models deployed on production servers.
es_es: Un típico `benchmark <https://github.com/scikit-learn/scikit-learn/blob/main/benchmarks/bench_sparsify.py>`_ sobre datos sintéticos arroja una disminución de la latencia superior al 30% cuando tanto el modelo como la entrada son dispersos (con una proporción de coeficientes no nulos de 0.000024 y 0.027400 respectivamente). El kilometraje puede variar en función de la dispersión y el tamaño de los datos y el modelo. Además, la sparsificación puede ser muy útil para reducir el uso de memoria de los modelos predictivos desplegados en los servidores de producción.

source: Model Reshaping
es_es: Reestructuración de modelos

source: Model reshaping consists in selecting only a portion of the available features to fit a model. In other words, if a model discards features during the learning phase we can then strip those from the input. This has several benefits. Firstly it reduces memory (and therefore time) overhead of the model itself. It also allows to discard explicit feature selection components in a pipeline once we know which features to keep from a previous run. Finally, it can help reduce processing time and I/O usage upstream in the data access and feature extraction layers by not collecting and building features that are discarded by the model. For instance if the raw data come from a database, it can make it possible to write simpler and faster queries or reduce I/O usage by making the queries return lighter records. At the moment, reshaping needs to be performed manually in scikit-learn. In the case of sparse input (particularly in ``CSR`` format), it is generally sufficient to not generate the relevant features, leaving their columns empty.
es_es: La reestructuración del modelo consiste en seleccionar sólo una parte de las características disponibles para ajustar un modelo. En otras palabras, si un modelo descarta características durante la fase de aprendizaje, podemos eliminarlas de la entrada. Esto tiene varias ventajas. En primer lugar, reduce la sobrecarga de memoria (y, por tanto, de tiempo) del propio modelo. También permite descartar componentes de selección de características explícitas en una cadena de producción una vez que sabemos qué características conservar de una ejecución anterior. Por último, puede ayudar a reducir el tiempo de procesamiento y el uso de E/S en las capas de acceso a los datos y de extracción de características al no recoger y construir características que son descartadas por el modelo. Por ejemplo, si los datos brutos proceden de una base de datos, puede permitir escribir consultas más sencillas y rápidas o reducir el uso de E/S haciendo que las consultas devuelvan registros más ligeros. Por el momento, la remodelación debe realizarse manualmente en scikit-learn. En el caso de entradas dispersas (particularmente en formato ``CSR``), generalmente es suficiente con no generar las características relevantes, dejando sus columnas vacías.

source: Links
es_es: Enlaces

source: :ref:`scikit-learn developer performance documentation <performance-howto>`
es_es: :ref:`documentación sobre el rendimiento de los desarrolladores de scikit-learn <performance-howto>`
