Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/svm/plot_rbf_parameters.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_svm_plot_rbf_parameters.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_svm_plot_rbf_parameters.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: RBF SVM parameters
es_es: Parámetros RBF SVM

source: This example illustrates the effect of the parameters ``gamma`` and ``C`` of the Radial Basis Function (RBF) kernel SVM.
es_es: Este ejemplo ilustra el efecto de los parámetros ``gamma`` y ``C`` de la función de base radial (RBF) del núcleo SVM.

source: Intuitively, the ``gamma`` parameter defines how far the influence of a single training example reaches, with low values meaning 'far' and high values meaning 'close'. The ``gamma`` parameters can be seen as the inverse of the radius of influence of samples selected by the model as support vectors.
es_es: Intuitivamente, el parámetro ``gamma`` define hasta dónde llega la influencia de un solo ejemplo de entrenamiento, con valores bajos que significan 'lejos' y valores altos que significan 'cerca'. Los parámetros ``gamma`` pueden verse como la inversa del radio de influencia de las muestras seleccionadas por el modelo como vectores de soporte.

source: The ``C`` parameter trades off correct classification of training examples against maximization of the decision function's margin. For larger values of ``C``, a smaller margin will be accepted if the decision function is better at classifying all training points correctly. A lower ``C`` will encourage a larger margin, therefore a simpler decision function, at the cost of training accuracy. In other words ``C`` behaves as a regularization parameter in the SVM.
es_es: El parámetro "C" compensa la clasificación correcta de los ejemplos de entrenamiento con la maximización del margen de la función de decisión. Para valores mayores de ``C``, se aceptará un margen menor si la función de decisión es mejor para clasificar correctamente todos los puntos de entrenamiento. Un valor más bajo de ``C`` fomentará un margen mayor y, por tanto, una función de decisión más sencilla, a costa de la precisión del entrenamiento. En otras palabras, ``C`` se comporta como un parámetro de regularización en la SVM.

source: The first plot is a visualization of the decision function for a variety of parameter values on a simplified classification problem involving only 2 input features and 2 possible target classes (binary classification). Note that this kind of plot is not possible to do for problems with more features or target classes.
es_es: El primer gráfico es una visualización de la función de decisión para una variedad de valores de parámetros en un problema de clasificación simplificado que implica sólo 2 características de entrada y 2 posibles clases de destino (clasificación binaria). Tenga en cuenta que este tipo de gráfico no es posible para problemas con más características o clases de destino.

source: The second plot is a heatmap of the classifier's cross-validation accuracy as a function of ``C`` and ``gamma``. For this example we explore a relatively large grid for illustration purposes. In practice, a logarithmic grid from :math:`10^{-3}` to :math:`10^3` is usually sufficient. If the best parameters lie on the boundaries of the grid, it can be extended in that direction in a subsequent search.
es_es: El segundo gráfico es un mapa de calor de la exactitud del clasificador de validación cruzada en función de ``C`` y ``gamma``. Para este ejemplo, exploramos una cuadrícula relativamente grande con fines ilustrativos. En la práctica, una cuadrícula logarítmica de :math:`10^{-3}` a :math:`10^3` suele ser suficiente. Si los mejores parámetros se encuentran en los límites de la cuadrícula, se puede ampliar en esa dirección en una búsqueda posterior.

source: Note that the heat map plot has a special colorbar with a midpoint value close to the score values of the best performing models so as to make it easy to tell them apart in the blink of an eye.
es_es: Ten en cuenta que la gráfica del mapa de calor tiene una barra de colores especial con un valor medio cercano a los valores de puntuación de los modelos de mejor rendimiento para que sea fácil distinguirlos en el parpadeo de un ojo.

source: The behavior of the model is very sensitive to the ``gamma`` parameter. If ``gamma`` is too large, the radius of the area of influence of the support vectors only includes the support vector itself and no amount of regularization with ``C`` will be able to prevent overfitting.
es_es: El comportamiento del modelo es muy sensible al parámetro ``gamma``. Si ``gamma`` es demasiado grande, el radio del área de influencia de los vectores de soporte sólo incluye el vector de soporte en sí mismo y ninguna cantidad de regularización con ``C`` será capaz de prevenir el sobrecalentamiento.

source: When ``gamma`` is very small, the model is too constrained and cannot capture the complexity or "shape" of the data. The region of influence of any selected support vector would include the whole training set. The resulting model will behave similarly to a linear model with a set of hyperplanes that separate the centers of high density of any pair of two classes.
es_es: Cuando ``gamma`` es muy pequeño, el modelo es demasiado limitado y no puede capturar la complejidad o la "forma" de los datos. La región de influencia de cualquier vector de apoyo seleccionado incluiría todo el conjunto de capacitación. El modelo resultante se comportará de forma similar a un modelo lineal con un conjunto de hiperplanos que separan los centros de alta densidad de cualquier par de dos clases.

source: For intermediate values, we can see on the second plot that good models can be found on a diagonal of ``C`` and ``gamma``. Smooth models (lower ``gamma`` values) can be made more complex by increasing the importance of classifying each point correctly (larger ``C`` values) hence the diagonal of good performing models.
es_es: Para valores intermedios podemos ver en la segunda trama que los buenos modelos se pueden encontrar en un diagnóstico de ``C`` y ``gamma``. Los modelos suavizados (valores inferiores de ``gamma``) se pueden hacer más complejos aumentando la importancia de clasificar correctamente cada punto (valores más grandes ``C``) de ahí el diagnóstico de modelos de buen rendimiento.

source: Finally, one can also observe that for some intermediate values of ``gamma`` we get equally performing models when ``C`` becomes very large. This suggests that the set of support vectors does not change anymore. The radius of the RBF kernel alone acts as a good structural regularizer. Increasing ``C`` further doesn't help, likely because there are no more training points in violation (inside the margin or wrongly classified), or at least no better solution can be found. Scores being equal, it may make sense to use the smaller ``C`` values, since very high ``C`` values typically increase fitting time.
es_es: Por último, también se puede observar que para algunos valores intermedios de ``gamma`` se obtienen modelos de igual rendimiento cuando ``C`` se hace muy grande. Esto sugiere que el conjunto de vectores de soporte ya no cambia. El radio del núcleo RBF actúa por sí solo como un buen regularizador estructural. Aumentar ``C`` más no ayuda, probablemente porque no hay más puntos de entrenamiento en violación (dentro del margen o mal clasificados), o al menos no se puede encontrar una solución mejor. En igualdad de condiciones, puede tener sentido utilizar los valores más pequeños de ``C``, ya que los valores muy altos de ``C`` suelen aumentar el tiempo de ajuste.

source: On the other hand, lower ``C`` values generally lead to more support vectors, which may increase prediction time. Therefore, lowering the value of ``C`` involves a trade-off between fitting time and prediction time.
es_es: Por otro lado, los valores más bajos de ``C`` generalmente llevan a más vectores de soporte, lo que puede aumentar el tiempo de predicción. Por lo tanto, reducir el valor de ``C`` implica una compensación entre el tiempo de ajuste y el tiempo de predicción.

source: We should also note that small differences in scores results from the random splits of the cross-validation procedure. Those spurious variations can be smoothed out by increasing the number of CV iterations ``n_splits`` at the expense of compute time. Increasing the value number of ``C_range`` and ``gamma_range`` steps will increase the resolution of the hyper-parameter heat map.
es_es: También debemos tener en cuenta que las pequeñas diferencias en las puntuaciones se deben a las divisiones aleatorias del procedimiento de validación cruzada. Esas variaciones espurias pueden suavizarse aumentando el número de iteraciones de CV ``n_splits`` a expensas del tiempo de cálculo. Aumentar el número de valores de los pasos ``C_range`` y ``gamma_range`` aumentará la resolución del mapa de calor de los hiperparámetros.

source: **Total running time of the script:** ( 0 minutes 6.189 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 6.189 segundos)

source: :download:`Download Python source code: plot_rbf_parameters.py <plot_rbf_parameters.py>`
es_es: :download:`Descargar el código fuente de Python: plot_rbf_parameters.py <plot_rbf_parameters.py>`

source: :download:`Download Jupyter notebook: plot_rbf_parameters.ipynb <plot_rbf_parameters.ipynb>`
es_es: :download:`Descargar el cuaderno Jupyter: plot_rbf_parameters.ipynb <plot_rbf_parameters.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
