Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/svm/plot_svm_scale_c.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_svm_plot_svm_scale_c.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_svm_plot_svm_scale_c.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Scaling the regularization parameter for SVCs
es_es: Escala del parámetro de regularización para las SVC

source: The following example illustrates the effect of scaling the regularization parameter when using :ref:`svm` for :ref:`classification <svm_classification>`. For SVC classification, we are interested in a risk minimization for the equation:
es_es: El siguiente ejemplo ilustra el efecto de escalar el parámetro de regularización cuando se utiliza :ref:`svm` para :ref:`clasificación <svm_classification>`. Para la clasificación SVC, estamos interesados en una minimización del riesgo para la ecuación:

source: where
es_es: donde

source: :math:`C` is used to set the amount of regularization
es_es: :math:`C` se utiliza para establecer la cantidad de regularización

source: :math:`\mathcal{L}` is a `loss` function of our samples and our model parameters.
es_es: :math:`\mathcal{L}` es una función `loss` de nuestras muestras y nuestros parámetros del modelo.

source: :math:`\Omega` is a `penalty` function of our model parameters
es_es: :math:`\Omega` es una función `penalty` de nuestros parámetros del modelo

source: If we consider the loss function to be the individual error per sample, then the data-fit term, or the sum of the error for each sample, will increase as we add more samples. The penalization term, however, will not increase.
es_es: Si consideramos que la función de pérdida es el error individual por muestra, entonces el término de ajuste de datos, o la suma del error de cada muestra, aumentará a medida que añadamos más muestras. El término de penalización, sin embargo, no aumentará.

source: When using, for example, :ref:`cross validation <cross_validation>`, to set the amount of regularization with `C`, there will be a different amount of samples between the main problem and the smaller problems within the folds of the cross validation.
es_es: Cuando se utiliza, por ejemplo, :ref:`validación cruzada <cross_validation>`, para establecer la cantidad de regularización con `C`, habrá una cantidad diferente de muestras entre el problema principal y los problemas más pequeños dentro de los pliegues de la validación cruzada.

source: Since our loss function is dependent on the amount of samples, the latter will influence the selected value of `C`. The question that arises is `How do we optimally adjust C to account for the different amount of training samples?`
es_es: Dado que nuestra función de pérdida depende de la cantidad de muestras, ésta influirá en el valor seleccionado de `C`. La pregunta que surge es `¿Cómo ajustamos C de forma óptima para tener en cuenta la diferente cantidad de muestras de entrenamiento?`

source: The figures below are used to illustrate the effect of scaling our `C` to compensate for the change in the number of samples, in the case of using an `l1` penalty, as well as the `l2` penalty.
es_es: Las figuras siguientes sirven para ilustrar el efecto de escalar nuestro `C` para compensar el cambio en el número de muestras, en el caso de utilizar una penalización `l1`, así como la penalización `l2`.

source: l1-penalty case
es_es: l1-caso de penalización

source: In the `l1` case, theory says that prediction consistency (i.e. that under given hypothesis, the estimator learned predicts as well as a model knowing the true distribution) is not possible because of the bias of the `l1`. It does say, however, that model consistency, in terms of finding the right set of non-zero parameters as well as their signs, can be achieved by scaling `C1`.
es_es: En el caso de `l1`, la teoría dice que la consistencia de la predicción (es decir, que bajo una hipótesis dada, el estimador aprendido predice tan bien como un modelo que conoce la verdadera distribución) no es posible debido al sesgo de `l1`. Sin embargo, sí dice que la consistencia del modelo, en términos de encontrar el conjunto correcto de parámetros no nulos, así como sus signos, puede lograrse escalando `C1`.

source: l2-penalty case
es_es: l2-caso de penalización

source: The theory says that in order to achieve prediction consistency, the penalty parameter should be kept constant as the number of samples grow.
es_es: La teoría dice que para alcanzar la consistencia de las predicciones, el parámetro de penalización debe mantenerse constante a medida que el número de muestras crece.

source: Simulations
es_es: Simulaciones

source: The two figures below plot the values of `C` on the `x-axis` and the corresponding cross-validation scores on the `y-axis`, for several different fractions of a generated data-set.
es_es: Las dos figuras a continuación grafican los valores de `C` en el `eje x` y las correspondientes notas de validación cruzada en el `eje y`, para varias fracciones diferentes de un conjunto de datos generados.

source: In the `l1` penalty case, the cross-validation-error correlates best with the test-error, when scaling our `C` with the number of samples, `n`, which can be seen in the first figure.
es_es: En el caso de la penalización `l1`, el error de validación cruzada se correlaciona mejor con el error de prueba, al escalar nuestro `C` con el número de muestras, `n`, lo que puede verse en la primera figura.

source: For the `l2` penalty case, the best result comes from the case where `C` is not scaled.
es_es: Para el caso de penalización `l2`, el mejor resultado viene del caso donde `C` no es escalado.

source: Note:
es_es: Nota:

source: Two separate datasets are used for the two different plots. The reason behind this is the `l1` case works better on sparse data, while `l2` is better suited to the non-sparse case.
es_es: Se utilizan dos conjuntos de datos separados para las dos gráficas diferentes. La razón detrás de esto es el caso `l1` funciona mejor en datos dispersos, mientras que `l2` es más adecuado para el caso no disperso.

source: **Total running time of the script:** ( 0 minutes 25.012 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 25.012 segundos)

source: :download:`Download Python source code: plot_svm_scale_c.py <plot_svm_scale_c.py>`
es_es: :download:`Descarga el código fuente de Python: plot_svm_scale_c.py <plot_svm_scale_c.py>`

source: :download:`Download Jupyter notebook: plot_svm_scale_c.ipynb <plot_svm_scale_c.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_svm_scale_c.ipynb <plot_svm_scale_c.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
