Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/svm/plot_iris_svc.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_svm_plot_iris_svc.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_svm_plot_iris_svc.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: Plot different SVM classifiers in the iris dataset
es_es: Traza diferentes clasificadores SVM en el conjunto de datos iris

source: Comparison of different linear SVM classifiers on a 2D projection of the iris dataset. We only consider the first 2 features of this dataset:
es_es: Comparación de diferentes clasificadores SVM lineales en una proyección 2D del conjunto de datos iris. Sólo tenemos en cuenta las dos primeras características de este conjunto de datos:

source: Sepal length
es_es: Longitud del sepal

source: Sepal width
es_es: Ancho del sepal

source: This example shows how to plot the decision surface for four SVM classifiers with different kernels.
es_es: Este ejemplo muestra cómo trazar la superficie de decisión para cuatro clasificadores SVM con diferentes núcleos.

source: The linear models ``LinearSVC()`` and ``SVC(kernel='linear')`` yield slightly different decision boundaries. This can be a consequence of the following differences:
es_es: Los modelos lineales ``LinearSVC()`` y ``SVC(kernel='linear')`` producen límites de decisión ligeramente diferentes. Esto puede ser una consecuencia de las siguientes diferencias:

source: ``LinearSVC`` minimizes the squared hinge loss while ``SVC`` minimizes the regular hinge loss.
es_es: ``LinearSVC`` minimiza la pérdida de bisagra al cuadrado mientras que ``SVC`` minimiza la pérdida de bisagra regular.

source: ``LinearSVC`` uses the One-vs-All (also known as One-vs-Rest) multiclass reduction while ``SVC`` uses the One-vs-One multiclass reduction.
es_es: ``LinearSVC`` utiliza la reducción multiclase Uno-vs-Todos (también conocida como Uno-vs-Resto) mientras que ``SVC`` utiliza la reducción multiclase Uno-vs-Uno.

source: Both linear models have linear decision boundaries (intersecting hyperplanes) while the non-linear kernel models (polynomial or Gaussian RBF) have more flexible non-linear decision boundaries with shapes that depend on the kind of kernel and its parameters.
es_es: Ambos modelos lineales tienen límites de decisión lineales (hiperplano intersectorial) mientras que los modelos no lineales del núcleo (polinomio o Gaussian RBF) tienen límites de decisión no lineales más flexibles con formas que dependen del tipo de núcleo y sus parámetros.

source: while plotting the decision function of classifiers for toy 2D datasets can help get an intuitive understanding of their respective expressive power, be aware that those intuitions don't always generalize to more realistic high-dimensional problems.
es_es: si bien el trazado de la función de decisión de los clasificadores para conjuntos de datos 2D de juguete puede ayudar a obtener una comprensión intuitiva de su respectivo poder expresivo, ten en cuenta que esas intuiciones no siempre se generalizan a problemas más realistas de alta dimensión.

source: **Total running time of the script:** ( 0 minutes 0.821 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.821 segundos)

source: :download:`Download Python source code: plot_iris_svc.py <plot_iris_svc.py>`
es_es: :download:`Descarga el código fuente de Python: plot_iris_svc.py <plot_iris_svc.py>`

source: :download:`Download Jupyter notebook: plot_iris_svc.ipynb <plot_iris_svc.ipynb>`
es_es: :download:`Descarga el cuaderno Jupyter: plot_iris_svc.ipynb <plot_iris_svc.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
