Repository: qu4nt/sklearn-doc-es
Catalog: doc/*/auto_examples/svm/plot_separating_hyperplane_unbalanced.po
Languages: es_es

source: Click :ref:`here <sphx_glr_download_auto_examples_svm_plot_separating_hyperplane_unbalanced.py>` to download the full example code or to run this example in your browser via Binder
es_es: Haz clic :ref:`aquí <sphx_glr_download_auto_examples_svm_plot_separating_hyperplane_unbalanced.py>` para descargar el código de ejemplo completo o para ejecutar este ejemplo en tu navegador a través de Binder

source: SVM: Separating hyperplane for unbalanced classes
es_es: SVM: Hiperplano de separación para clases desequilibradas

source: Find the optimal separating hyperplane using an SVC for classes that are unbalanced.
es_es: Encuentre el hiperplano de separación óptimo utilizando un SVC para las clases que están desequilibradas.

source: We first find the separating plane with a plain SVC and then plot (dashed) the separating hyperplane with automatically correction for unbalanced classes.
es_es: Primero encontramos el plano de separación con un SVC simple y luego trazamos (en guiones) el hiperplano de separación con corrección automática para las clases desequilibradas.

source: This example will also work by replacing ``SVC(kernel="linear")`` with ``SGDClassifier(loss="hinge")``. Setting the ``loss`` parameter of the :class:`SGDClassifier` equal to ``hinge`` will yield behaviour such as that of a SVC with a linear kernel.
es_es: Este ejemplo también funcionará reemplazando ``SVC(kernel="linear")`` con ``SGDClassifier(loss="hinge")``. Establecer el parámetro ``loss`` del :class:`SGDClassifier` igual a ``hinge`` producirá un comportamiento como el de un SVC con un núcleo lineal.

source: For example try instead of the ``SVC``::
es_es: Por ejemplo, intenta en lugar del ``SVC``::

source: **Total running time of the script:** ( 0 minutes 0.134 seconds)
es_es: **Tiempo total de ejecución del script:** (0 minutos 0.134 segundos)

source: :download:`Download Python source code: plot_separating_hyperplane_unbalanced.py <plot_separating_hyperplane_unbalanced.py>`
es_es: :download:`Descargar el código fuente de Python: plot_separating_hyperplane_unbalanced.py <plot_separating_hyperplane_unbalanced.py>`

source: :download:`Download Jupyter notebook: plot_separating_hyperplane_unbalanced.ipynb <plot_separating_hyperplane_unbalanced.ipynb>`
es_es: :download:`Descargar el cuaderno de Jupyter: plot_separating_hyperplane_unbalanced.ipynb <plot_separating_hyperplane_unbalanced.ipynb>`

source: `Gallery generated by Sphinx-Gallery <https://sphinx-gallery.github.io>`_
es_es: `Galería generada por Sphinx-Gallery <https://sphinx-gallery.github.io>`_
